TexasInstruments/am26x-hsp/src/am263px_init.c
#include <stdint.h>
#include <stdio.h>

#include "am263px_main.h"

#include "MW_target_hardware_resources.h"
#include <drivers/uart/v0/lld/dma/edma/uart_dma_edma.h>
#include <drivers/uart/v0/lld/uart_lld.h>
#include <drivers/soc.h>
#include <drivers/edma.h>
#include <drivers/pinmux.h>
#include <drivers/mcan.h>
#include "kernel/dpl/DebugP.h"
#include <kernel/dpl/ClockP.h>
#include <kernel/dpl/AddrTranslateP.h>
#include <board/ioexp/ioexp_tca6424.h>
#include <board/ioexp/ioexp_tca6416.h>
#include <board/eeprom.h>
#include <board/eeprom/eeprom_cat24m.h>
#include <drivers/i2c.h>
#include <board/pmic.h>
#include <board/pmic/pmic_tps653860xx.h>
#include <drivers/mcspi.h>
#include <drivers/edma.h>
#include <drivers/mcspi/v0/lld/dma/mcspi_dma.h>
#include <drivers/mcspi/v0/lld/dma/edma/mcspi_dma_edma.h>
#include <drivers/edma.h>
#include <drivers/uart.h>
#include <string.h>

#include<math.h>

#define STR_EXPAND(tok) #tok
#define STR(tok) STR_EXPAND(tok)



/* ----------- HwiP ----------- */
HwiP_Config gHwiConfig = {
    .intcBaseAddr = 0x50F00000u,
};

/* ----------- DebugP ----------- */
void putchar_(char character)
{
    /* Output to CCS console */
    putchar(character);
    /* Output to UART console */
    DebugP_uartLogWriterPutChar(character);
}

void Drivers_EPWMSyncOutputXBAR();
#define RODATA_CFG_SECTION __attribute__((section(".rodata.cfg")))
/* ----------- CacheP ----------- */
const CacheP_Config gCacheConfig RODATA_CFG_SECTION = {
    .enable = 1,
    .enableForceWrThru = 0,
};

/* ----------- MpuP_armv7 ----------- */
#define CONFIG_MPU_NUM_REGIONS  (4u)

const MpuP_Config gMpuConfig RODATA_CFG_SECTION = {
    .numRegions = CONFIG_MPU_NUM_REGIONS,
    .enableBackgroundRegion = 0,
    .enableMpu = 1,
};

const MpuP_RegionConfig gMpuRegionConfig[CONFIG_MPU_NUM_REGIONS] RODATA_CFG_SECTION =
{
    {
        .baseAddr = 0x0u,
        .size = MpuP_RegionSize_2G,
        .attrs = {
            .isEnable = 1,
            .isCacheable = 0,
            .isBufferable = 0,
            .isSharable = 1,
            .isExecuteNever = 1,
            .tex = 0,
            .accessPerm = MpuP_AP_S_RW_U_R,
            .subregionDisableMask = 0x0u
        },
    },
    {
        .baseAddr = 0x0u,
        .size = MpuP_RegionSize_32K,
        .attrs = {
            .isEnable = 1,
            .isCacheable = 1,
            .isBufferable = 1,
            .isSharable = 0,
            .isExecuteNever = 0,
            .tex = 1,
            .accessPerm = MpuP_AP_S_RW_U_R,
            .subregionDisableMask = 0x0u
        },
    },
    {
        .baseAddr = 0x80000u,
        .size = MpuP_RegionSize_32K,
        .attrs = {
            .isEnable = 1,
            .isCacheable = 1,
            .isBufferable = 1,
            .isSharable = 0,
            .isExecuteNever = 0,
            .tex = 1,
            .accessPerm = MpuP_AP_S_RW_U_R,
            .subregionDisableMask = 0x0u
        },
    },
    {
        .baseAddr = 0x70000000u,
        .size = MpuP_RegionSize_2M,
        .attrs = {
            .isEnable = 1,
            .isCacheable = 1,
            .isBufferable = 1,
            .isSharable = 0,
            .isExecuteNever = 0,
            .tex = 1,
            .accessPerm = MpuP_AP_S_RW_U_R,
            .subregionDisableMask = 0x0u
        },
    },
    {
        .baseAddr = 0x50000000u,
        .size = MpuP_RegionSize_1M,
        .attrs = {
            .isEnable = 1,
            .isCacheable = 0,
            .isBufferable = 0,
            .isSharable = 0,
            .isExecuteNever = 1,
            .tex = 1,
            .accessPerm = MpuP_AP_ALL_RW,
            .subregionDisableMask = 0x0u
        },
    },
};

/* ----------- ClockP ----------- */
#define RTI0_CLOCK_SRC_MUX_ADDR (0x53208114u)
#define RTI0_CLOCK_SRC_WUCPUCLK (0x0u)
#define RTI0_BASE_ADDR     (0x52180000u)

ClockP_Config gClockConfig = {
    .timerBaseAddr = RTI0_BASE_ADDR, 
    .timerHwiIntNum = 84,
    .timerInputClkHz = 25000000,
    .timerInputPreScaler = 1,
    .usecPerTick = 1000,
    .intrPriority = 15,
};


#define BOOT_SECTION __attribute__((section(".text.boot")))

/* This function is called by _c_int00 */
void BOOT_SECTION __mpu_init() 
{
    MpuP_init();
    
    CacheP_init();
}



/*
 * UART
 */


// /* UART objects - initialized by the driver */
#define CONFIG_UART_NUM_LLD_INSTANCES 6
UARTLLD_Object gUartObject[CONFIG_UART_NUM_LLD_INSTANCES];
UARTLLD_Handle gUartHandleLld[CONFIG_UART_NUM_LLD_INSTANCES];
UARTLLD_InitObject gUartInitObject[CONFIG_UART_NUM_LLD_INSTANCES];
UART_Config gUartConfig[CONFIG_UART_NUM_INSTANCES];
uint32_t gUartConfigNum = 0;


void Drivers_uartClose(void)
{
  
}



static Pinmux_PerCfg_t gPinMuxMainDomainCfg[] = {

    {PIN_OSPI0_CSN0, ( PIN_MODE(MW_PIN_OSPI0_CSN0_IOMUX) | PIN_PULL_DISABLE | PIN_SLEW_RATE_LOW ) },
    {PIN_OSPI0_CSN1, ( PIN_MODE(MW_PIN_OSPI0_CSN1_IOMUX) | PIN_PULL_DISABLE | PIN_SLEW_RATE_LOW ) },
    {PIN_OSPI0_CLK, ( PIN_MODE(MW_PIN_OSPI0_CLK_IOMUX) | PIN_PULL_DISABLE | PIN_SLEW_RATE_LOW ) },
    {PIN_OSPI0_D0, ( PIN_MODE(MW_PIN_OSPI0_D0_IOMUX) | PIN_PULL_DISABLE | PIN_SLEW_RATE_LOW ) },
    {PIN_OSPI0_D1, ( PIN_MODE(MW_PIN_OSPI0_D1_IOMUX) | PIN_PULL_DISABLE | PIN_SLEW_RATE_LOW ) },
    {PIN_OSPI0_D2, ( PIN_MODE(MW_PIN_OSPI0_D2_IOMUX) | PIN_PULL_DISABLE | PIN_SLEW_RATE_LOW ) },
    {PIN_OSPI0_D3, ( PIN_MODE(MW_PIN_OSPI0_D3_IOMUX) | PIN_PULL_DISABLE | PIN_SLEW_RATE_LOW ) },
    {PIN_MCAN0_RX, ( PIN_MODE(MW_PIN_MCAN0_RX_IOMUX) | PIN_PULL_DISABLE | PIN_SLEW_RATE_LOW ) },
    {PIN_MCAN0_TX, ( PIN_MODE(MW_PIN_MCAN0_TX_IOMUX) | PIN_PULL_DISABLE | PIN_SLEW_RATE_LOW ) },
    {PIN_MCAN1_RX, ( PIN_MODE(MW_PIN_MCAN1_RX_IOMUX) | PIN_PULL_DISABLE | PIN_SLEW_RATE_LOW ) },
    {PIN_MCAN1_TX, ( PIN_MODE(MW_PIN_MCAN1_TX_IOMUX) | PIN_PULL_DISABLE | PIN_SLEW_RATE_LOW ) },
    {PIN_SPI0_CS0, ( PIN_MODE(MW_PIN_SPI0_CS0_IOMUX) | PIN_PULL_DISABLE | PIN_SLEW_RATE_LOW ) },
    {PIN_SPI0_CLK, ( PIN_MODE(MW_PIN_SPI0_CLK_IOMUX) | PIN_PULL_DISABLE | PIN_SLEW_RATE_LOW ) },
    {PIN_SPI0_D0, ( PIN_MODE(MW_PIN_SPI0_D0_IOMUX) | PIN_PULL_DISABLE | PIN_SLEW_RATE_LOW ) },
    {PIN_SPI0_D1, ( PIN_MODE(MW_PIN_SPI0_D1_IOMUX) | PIN_PULL_DISABLE | PIN_SLEW_RATE_LOW ) },
    {PIN_SPI1_CS0, ( PIN_MODE(MW_PIN_SPI1_CS0_IOMUX) | PIN_PULL_DISABLE | PIN_SLEW_RATE_LOW ) },
    {PIN_SPI1_CLK, ( PIN_MODE(MW_PIN_SPI1_CLK_IOMUX) | PIN_PULL_DISABLE | PIN_SLEW_RATE_LOW ) },
    {PIN_SPI1_D0, ( PIN_MODE(MW_PIN_SPI1_D0_IOMUX) | PIN_PULL_DISABLE | PIN_SLEW_RATE_LOW ) },
    {PIN_SPI1_D1, ( PIN_MODE(MW_PIN_SPI1_D1_IOMUX) | PIN_PULL_DISABLE | PIN_SLEW_RATE_LOW ) },
    {PIN_LIN1_RXD, ( PIN_MODE(MW_PIN_LIN1_RXD_IOMUX) | PIN_PULL_DISABLE | PIN_SLEW_RATE_LOW ) },
    {PIN_LIN1_TXD, ( PIN_MODE(MW_PIN_LIN1_TXD_IOMUX) | PIN_PULL_DISABLE | PIN_SLEW_RATE_LOW ) },
    {PIN_LIN2_RXD, ( PIN_MODE(MW_PIN_LIN2_RXD_IOMUX) | PIN_PULL_DISABLE | PIN_SLEW_RATE_LOW ) },
    {PIN_LIN2_TXD, ( PIN_MODE(MW_PIN_LIN2_TXD_IOMUX) | PIN_PULL_DISABLE | PIN_SLEW_RATE_LOW ) },
    {PIN_I2C1_SCL, ( PIN_MODE(MW_PIN_I2C1_SCL_IOMUX) | PIN_PULL_DISABLE | PIN_SLEW_RATE_LOW ) },
    {PIN_I2C1_SDA, ( PIN_MODE(MW_PIN_I2C1_SDA_IOMUX) | PIN_PULL_DISABLE | PIN_SLEW_RATE_LOW ) },
    {PIN_UART0_RTSN, ( PIN_MODE(MW_PIN_UART0_RTSN_IOMUX) | PIN_PULL_DISABLE | PIN_SLEW_RATE_LOW ) },
    {PIN_UART0_CTSN, ( PIN_MODE(MW_PIN_UART0_CTSN_IOMUX) | PIN_PULL_DISABLE | PIN_SLEW_RATE_LOW ) },
    {PIN_UART0_RXD, ( PIN_MODE(MW_PIN_UART0_RXD_IOMUX) | PIN_PULL_DISABLE | PIN_SLEW_RATE_LOW ) },
    {PIN_UART0_TXD, ( PIN_MODE(MW_PIN_UART0_TXD_IOMUX) | PIN_PULL_DISABLE | PIN_SLEW_RATE_LOW ) },
    {PIN_RGMII1_RXC, ( PIN_MODE(MW_PIN_RGMII1_RXC_IOMUX) | PIN_PULL_DISABLE | PIN_SLEW_RATE_LOW ) },
    {PIN_RGMII1_RX_CTL, ( PIN_MODE(MW_PIN_RGMII1_RX_CTL_IOMUX) | PIN_PULL_DISABLE | PIN_SLEW_RATE_LOW ) },
    {PIN_RGMII1_RD0, ( PIN_MODE(MW_PIN_RGMII1_RD0_IOMUX) | PIN_PULL_DISABLE | PIN_SLEW_RATE_LOW ) },
    {PIN_RGMII1_RD1, ( PIN_MODE(MW_PIN_RGMII1_RD1_IOMUX) | PIN_PULL_DISABLE | PIN_SLEW_RATE_LOW ) },
    {PIN_RGMII1_RD2, ( PIN_MODE(MW_PIN_RGMII1_RD2_IOMUX) | PIN_PULL_DISABLE | PIN_SLEW_RATE_LOW ) },
    {PIN_RGMII1_RD3, ( PIN_MODE(MW_PIN_RGMII1_RD3_IOMUX) | PIN_PULL_DISABLE | PIN_SLEW_RATE_LOW ) },
    {PIN_RGMII1_TXC, ( PIN_MODE(MW_PIN_RGMII1_TXC_IOMUX) | PIN_PULL_DISABLE | PIN_SLEW_RATE_LOW ) },
    {PIN_RGMII1_TX_CTL, ( PIN_MODE(MW_PIN_RGMII1_TX_CTL_IOMUX) | PIN_PULL_DISABLE | PIN_SLEW_RATE_LOW ) },
    {PIN_RGMII1_TD0, ( PIN_MODE(MW_PIN_RGMII1_TD0_IOMUX) | PIN_PULL_DISABLE | PIN_SLEW_RATE_LOW ) },
    {PIN_RGMII1_TD1, ( PIN_MODE(MW_PIN_RGMII1_TD1_IOMUX) | PIN_PULL_DISABLE | PIN_SLEW_RATE_LOW ) },
    {PIN_RGMII1_TD2, ( PIN_MODE(MW_PIN_RGMII1_TD2_IOMUX) | PIN_PULL_DISABLE | PIN_SLEW_RATE_LOW ) },
    {PIN_RGMII1_TD3, ( PIN_MODE(MW_PIN_RGMII1_TD3_IOMUX) | PIN_PULL_DISABLE | PIN_SLEW_RATE_LOW ) },
    {PIN_MDIO_MDIO, ( PIN_MODE(MW_PIN_MDIO_MDIO_IOMUX) | PIN_PULL_DISABLE | PIN_SLEW_RATE_LOW ) },
    {PIN_MDIO_MDC, ( PIN_MODE(MW_PIN_MDIO_MDC_IOMUX) | PIN_PULL_DISABLE | PIN_SLEW_RATE_LOW ) },
    {PIN_EPWM0_A, ( PIN_MODE(MW_PIN_EPWM0_A_IOMUX) | PIN_PULL_DISABLE | PIN_SLEW_RATE_LOW ) },
    {PIN_EPWM0_B, ( PIN_MODE(MW_PIN_EPWM0_B_IOMUX) | PIN_PULL_DISABLE | PIN_SLEW_RATE_LOW ) },
    {PIN_EPWM1_A, ( PIN_MODE(MW_PIN_EPWM1_A_IOMUX) | PIN_PULL_DISABLE | PIN_SLEW_RATE_LOW ) },
    {PIN_EPWM1_B, ( PIN_MODE(MW_PIN_EPWM1_B_IOMUX) | PIN_PULL_DISABLE | PIN_SLEW_RATE_LOW ) },
    {PIN_EPWM2_A, ( PIN_MODE(MW_PIN_EPWM2_A_IOMUX) | PIN_PULL_DISABLE | PIN_SLEW_RATE_LOW ) },
    {PIN_EPWM2_B, ( PIN_MODE(MW_PIN_EPWM2_B_IOMUX) | PIN_PULL_DISABLE | PIN_SLEW_RATE_LOW ) },
    {PIN_EPWM3_A, ( PIN_MODE(MW_PIN_EPWM3_A_IOMUX) | PIN_PULL_DISABLE | PIN_SLEW_RATE_LOW ) },
    {PIN_EPWM3_B, ( PIN_MODE(MW_PIN_EPWM3_B_IOMUX) | PIN_PULL_DISABLE | PIN_SLEW_RATE_LOW ) },
    {PIN_EPWM4_A, ( PIN_MODE(MW_PIN_EPWM4_A_IOMUX) | PIN_PULL_DISABLE | PIN_SLEW_RATE_LOW ) },
    {PIN_EPWM4_B, ( PIN_MODE(MW_PIN_EPWM4_B_IOMUX) | PIN_PULL_DISABLE | PIN_SLEW_RATE_LOW ) },
    {PIN_EPWM5_A, ( PIN_MODE(MW_PIN_EPWM5_A_IOMUX) | PIN_PULL_DISABLE | PIN_SLEW_RATE_LOW ) },
    {PIN_EPWM5_B, ( PIN_MODE(MW_PIN_EPWM5_B_IOMUX) | PIN_PULL_DISABLE | PIN_SLEW_RATE_LOW ) },
    {PIN_EPWM6_A, ( PIN_MODE(MW_PIN_EPWM6_A_IOMUX) | PIN_PULL_DISABLE | PIN_SLEW_RATE_LOW ) },
    {PIN_EPWM6_B, ( PIN_MODE(MW_PIN_EPWM6_B_IOMUX) | PIN_PULL_DISABLE | PIN_SLEW_RATE_LOW ) },
    {PIN_EPWM7_A, ( PIN_MODE(MW_PIN_EPWM7_A_IOMUX) | PIN_PULL_DISABLE | PIN_SLEW_RATE_LOW ) },
    {PIN_EPWM7_B, ( PIN_MODE(MW_PIN_EPWM7_B_IOMUX) | PIN_PULL_DISABLE | PIN_SLEW_RATE_LOW ) },
    {PIN_EPWM8_A, ( PIN_MODE(MW_PIN_EPWM8_A_IOMUX) | PIN_PULL_DISABLE | PIN_SLEW_RATE_LOW ) },
    {PIN_EPWM8_B, ( PIN_MODE(MW_PIN_EPWM8_B_IOMUX) | PIN_PULL_DISABLE | PIN_SLEW_RATE_LOW ) },
    {PIN_EPWM9_A, ( PIN_MODE(MW_PIN_EPWM9_A_IOMUX) | PIN_PULL_DISABLE | PIN_SLEW_RATE_LOW ) },
    {PIN_EPWM9_B, ( PIN_MODE(MW_PIN_EPWM9_B_IOMUX) | PIN_PULL_DISABLE | PIN_SLEW_RATE_LOW ) },
    {PIN_EPWM10_A, ( PIN_MODE(MW_PIN_EPWM10_A_IOMUX) | PIN_PULL_DISABLE | PIN_SLEW_RATE_LOW ) },
    {PIN_EPWM10_B, ( PIN_MODE(MW_PIN_EPWM10_B_IOMUX) | PIN_PULL_DISABLE | PIN_SLEW_RATE_LOW ) },
    {PIN_EPWM11_A, ( PIN_MODE(MW_PIN_EPWM11_A_IOMUX) | PIN_PULL_DISABLE | PIN_SLEW_RATE_LOW ) },
    {PIN_EPWM11_B, ( PIN_MODE(MW_PIN_EPWM11_B_IOMUX) | PIN_PULL_DISABLE | PIN_SLEW_RATE_LOW ) },
    {PIN_EPWM12_A, ( PIN_MODE(MW_PIN_EPWM12_A_IOMUX) | PIN_PULL_DISABLE | PIN_SLEW_RATE_LOW ) },
    {PIN_EPWM12_B, ( PIN_MODE(MW_PIN_EPWM12_B_IOMUX) | PIN_PULL_DISABLE | PIN_SLEW_RATE_LOW ) },
    {PIN_EPWM13_A, ( PIN_MODE(MW_PIN_EPWM13_A_IOMUX) | PIN_PULL_DISABLE | PIN_SLEW_RATE_LOW ) },
    {PIN_EPWM13_B, ( PIN_MODE(MW_PIN_EPWM13_B_IOMUX) | PIN_PULL_DISABLE | PIN_SLEW_RATE_LOW ) },
    {PIN_EPWM14_A, ( PIN_MODE(MW_PIN_EPWM14_A_IOMUX) | PIN_PULL_DISABLE | PIN_SLEW_RATE_LOW ) },
    {PIN_EPWM14_B, ( PIN_MODE(MW_PIN_EPWM14_B_IOMUX) | PIN_PULL_DISABLE | PIN_SLEW_RATE_LOW ) },
    {PIN_EPWM15_A, ( PIN_MODE(MW_PIN_EPWM15_A_IOMUX) | PIN_PULL_DISABLE | PIN_SLEW_RATE_LOW ) },
    {PIN_EPWM15_B, ( PIN_MODE(MW_PIN_EPWM15_B_IOMUX) | PIN_PULL_DISABLE | PIN_SLEW_RATE_LOW ) },
    {PIN_UART1_RXD, ( PIN_MODE(MW_PIN_UART1_RXD_IOMUX) | PIN_PULL_DISABLE | PIN_SLEW_RATE_LOW ) },
    {PIN_UART1_TXD, ( PIN_MODE(MW_PIN_UART1_TXD_IOMUX) | PIN_PULL_DISABLE | PIN_SLEW_RATE_LOW ) },
    {PIN_MMC_CLK, ( PIN_MODE(MW_PIN_MMC_CLK_IOMUX) | PIN_PULL_DISABLE | PIN_SLEW_RATE_LOW ) },
    {PIN_MMC_CMD, ( PIN_MODE(MW_PIN_MMC_CMD_IOMUX) | PIN_PULL_DISABLE | PIN_SLEW_RATE_LOW ) },
    {PIN_MMC_DAT0, ( PIN_MODE(MW_PIN_MMC_DAT0_IOMUX) | PIN_PULL_DISABLE | PIN_SLEW_RATE_LOW ) },
    {PIN_MMC_DAT1, ( PIN_MODE(MW_PIN_MMC_DAT1_IOMUX) | PIN_PULL_DISABLE | PIN_SLEW_RATE_LOW ) },
    {PIN_MMC_DAT2, ( PIN_MODE(MW_PIN_MMC_DAT2_IOMUX) | PIN_PULL_DISABLE | PIN_SLEW_RATE_LOW ) },
    {PIN_MMC_DAT3, ( PIN_MODE(MW_PIN_MMC_DAT3_IOMUX) | PIN_PULL_DISABLE | PIN_SLEW_RATE_LOW ) },
    {PIN_MMC_SDWP, ( PIN_MODE(MW_PIN_MMC_SDWP_IOMUX) | PIN_PULL_DISABLE | PIN_SLEW_RATE_LOW ) },
    {PIN_MMC_SDCD, ( PIN_MODE(MW_PIN_MMC_SDCD_IOMUX) | PIN_PULL_DISABLE | PIN_SLEW_RATE_LOW ) },
    {PIN_PR0_MDIO_MDIO, ( PIN_MODE(MW_PIN_PR0_MDIO_MDIO_IOMUX) | PIN_PULL_DISABLE | PIN_SLEW_RATE_LOW ) },
    {PIN_PR0_MDIO_MDC, ( PIN_MODE(MW_PIN_PR0_MDIO_MDC_IOMUX) | PIN_PULL_DISABLE | PIN_SLEW_RATE_LOW ) },
    {PIN_PR0_PRU0_GPIO5, ( PIN_MODE(MW_PIN_PR0_PRU0_GPIO5_IOMUX) | PIN_PULL_DISABLE | PIN_SLEW_RATE_LOW ) },
    {PIN_PR0_PRU0_GPIO9, ( PIN_MODE(MW_PIN_PR0_PRU0_GPIO9_IOMUX) | PIN_PULL_DISABLE | PIN_SLEW_RATE_LOW ) },
    {PIN_PR0_PRU0_GPIO10, ( PIN_MODE(MW_PIN_PR0_PRU0_GPIO10_IOMUX) | PIN_PULL_DISABLE | PIN_SLEW_RATE_LOW ) },
    {PIN_PR0_PRU0_GPIO8, ( PIN_MODE(MW_PIN_PR0_PRU0_GPIO8_IOMUX) | PIN_PULL_DISABLE | PIN_SLEW_RATE_LOW ) },
    {PIN_PR0_PRU0_GPIO6, ( PIN_MODE(MW_PIN_PR0_PRU0_GPIO6_IOMUX) | PIN_PULL_DISABLE | PIN_SLEW_RATE_LOW ) },
    {PIN_PR0_PRU0_GPIO4, ( PIN_MODE(MW_PIN_PR0_PRU0_GPIO4_IOMUX) | PIN_PULL_DISABLE | PIN_SLEW_RATE_LOW ) },
    {PIN_PR0_PRU0_GPIO0, ( PIN_MODE(MW_PIN_PR0_PRU0_GPIO0_IOMUX) | PIN_PULL_DISABLE | PIN_SLEW_RATE_LOW ) },
    {PIN_PR0_PRU0_GPIO1, ( PIN_MODE(MW_PIN_PR0_PRU0_GPIO1_IOMUX) | PIN_PULL_DISABLE | PIN_SLEW_RATE_LOW ) },
    {PIN_PR0_PRU0_GPIO2, ( PIN_MODE(MW_PIN_PR0_PRU0_GPIO2_IOMUX) | PIN_PULL_DISABLE | PIN_SLEW_RATE_LOW ) },
    {PIN_PR0_PRU0_GPIO3, ( PIN_MODE(MW_PIN_PR0_PRU0_GPIO3_IOMUX) | PIN_PULL_DISABLE | PIN_SLEW_RATE_LOW ) },
    {PIN_PR0_PRU0_GPIO16, ( PIN_MODE(MW_PIN_PR0_PRU0_GPIO16_IOMUX) | PIN_PULL_DISABLE | PIN_SLEW_RATE_LOW ) },
    {PIN_PR0_PRU0_GPIO15, ( PIN_MODE(MW_PIN_PR0_PRU0_GPIO15_IOMUX) | PIN_PULL_DISABLE | PIN_SLEW_RATE_LOW ) },
    {PIN_PR0_PRU0_GPIO11, ( PIN_MODE(MW_PIN_PR0_PRU0_GPIO11_IOMUX) | PIN_PULL_DISABLE | PIN_SLEW_RATE_LOW ) },
    {PIN_PR0_PRU0_GPIO12, ( PIN_MODE(MW_PIN_PR0_PRU0_GPIO12_IOMUX) | PIN_PULL_DISABLE | PIN_SLEW_RATE_LOW ) },
    {PIN_PR0_PRU0_GPIO13, ( PIN_MODE(MW_PIN_PR0_PRU0_GPIO13_IOMUX) | PIN_PULL_DISABLE | PIN_SLEW_RATE_LOW ) },
    {PIN_PR0_PRU0_GPIO14, ( PIN_MODE(MW_PIN_PR0_PRU0_GPIO14_IOMUX) | PIN_PULL_DISABLE | PIN_SLEW_RATE_LOW ) },
    {PIN_PR0_PRU1_GPIO5, ( PIN_MODE(MW_PIN_PR0_PRU1_GPIO5_IOMUX) | PIN_PULL_DISABLE | PIN_SLEW_RATE_LOW ) },
    {PIN_PR0_PRU1_GPIO9, ( PIN_MODE(MW_PIN_PR0_PRU1_GPIO9_IOMUX) | PIN_PULL_DISABLE | PIN_SLEW_RATE_LOW ) },
    {PIN_PR0_PRU1_GPIO10, ( PIN_MODE(MW_PIN_PR0_PRU1_GPIO10_IOMUX) | PIN_PULL_DISABLE | PIN_SLEW_RATE_LOW ) },
    {PIN_PR0_PRU1_GPIO8, ( PIN_MODE(MW_PIN_PR0_PRU1_GPIO8_IOMUX) | PIN_PULL_DISABLE | PIN_SLEW_RATE_LOW ) },
    {PIN_PR0_PRU1_GPIO6, ( PIN_MODE(MW_PIN_PR0_PRU1_GPIO6_IOMUX) | PIN_PULL_DISABLE | PIN_SLEW_RATE_LOW ) },
    {PIN_PR0_PRU1_GPIO4, ( PIN_MODE(MW_PIN_PR0_PRU1_GPIO4_IOMUX) | PIN_PULL_DISABLE | PIN_SLEW_RATE_LOW ) },
    {PIN_PR0_PRU1_GPIO0, ( PIN_MODE(MW_PIN_PR0_PRU1_GPIO0_IOMUX) | PIN_PULL_DISABLE | PIN_SLEW_RATE_LOW ) },
    {PIN_PR0_PRU1_GPIO1, ( PIN_MODE(MW_PIN_PR0_PRU1_GPIO1_IOMUX) | PIN_PULL_DISABLE | PIN_SLEW_RATE_LOW ) },
    {PIN_PR0_PRU1_GPIO2, ( PIN_MODE(MW_PIN_PR0_PRU1_GPIO2_IOMUX) | PIN_PULL_DISABLE | PIN_SLEW_RATE_LOW ) },
    {PIN_PR0_PRU1_GPIO3, ( PIN_MODE(MW_PIN_PR0_PRU1_GPIO3_IOMUX) | PIN_PULL_DISABLE | PIN_SLEW_RATE_LOW ) },
    {PIN_PR0_PRU1_GPIO16, ( PIN_MODE(MW_PIN_PR0_PRU1_GPIO16_IOMUX) | PIN_PULL_DISABLE | PIN_SLEW_RATE_LOW ) },
    {PIN_PR0_PRU1_GPIO15, ( PIN_MODE(MW_PIN_PR0_PRU1_GPIO15_IOMUX) | PIN_PULL_DISABLE | PIN_SLEW_RATE_LOW ) },
    {PIN_PR0_PRU1_GPIO11, ( PIN_MODE(MW_PIN_PR0_PRU1_GPIO11_IOMUX) | PIN_PULL_DISABLE | PIN_SLEW_RATE_LOW ) },
    {PIN_PR0_PRU1_GPIO12, ( PIN_MODE(MW_PIN_PR0_PRU1_GPIO12_IOMUX) | PIN_PULL_DISABLE | PIN_SLEW_RATE_LOW ) },
    {PIN_PR0_PRU1_GPIO13, ( PIN_MODE(MW_PIN_PR0_PRU1_GPIO13_IOMUX) | PIN_PULL_DISABLE | PIN_SLEW_RATE_LOW ) },
    {PIN_PR0_PRU1_GPIO14, ( PIN_MODE(MW_PIN_PR0_PRU1_GPIO14_IOMUX) | PIN_PULL_DISABLE | PIN_SLEW_RATE_LOW ) },
    {PIN_PR0_PRU1_GPIO19, ( PIN_MODE(MW_PIN_PR0_PRU1_GPIO19_IOMUX) | PIN_PULL_DISABLE | PIN_SLEW_RATE_LOW ) },
    {PIN_PR0_PRU1_GPIO18, ( PIN_MODE(MW_PIN_PR0_PRU1_GPIO18_IOMUX) | PIN_PULL_DISABLE | PIN_SLEW_RATE_LOW ) },
    {PIN_EXT_REFCLK0, ( PIN_MODE(MW_PIN_EXT_REFCLK0_IOMUX) | PIN_PULL_DISABLE | PIN_SLEW_RATE_LOW ) },
    {PIN_SDFM0_CLK0, ( PIN_MODE(MW_PIN_SDFM0_CLK0_IOMUX) | PIN_PULL_DISABLE | PIN_SLEW_RATE_LOW ) },
    {PIN_SDFM0_D0, ( PIN_MODE(MW_PIN_SDFM0_D0_IOMUX) | PIN_PULL_DISABLE | PIN_SLEW_RATE_LOW ) },
    {PIN_SDFM0_CLK1, ( PIN_MODE(MW_PIN_SDFM0_CLK1_IOMUX) | PIN_PULL_DISABLE | PIN_SLEW_RATE_LOW ) },
    {PIN_SDFM0_D1, ( PIN_MODE(MW_PIN_SDFM0_D1_IOMUX) | PIN_PULL_DISABLE | PIN_SLEW_RATE_LOW ) },
    {PIN_SDFM0_CLK2, ( PIN_MODE(MW_PIN_SDFM0_CLK2_IOMUX) | PIN_PULL_DISABLE | PIN_SLEW_RATE_LOW ) },
    {PIN_SDFM0_D2, ( PIN_MODE(MW_PIN_SDFM0_D2_IOMUX) | PIN_PULL_DISABLE | PIN_SLEW_RATE_LOW ) },
    {PIN_SDFM0_CLK3, ( PIN_MODE(MW_PIN_SDFM0_CLK3_IOMUX) | PIN_PULL_DISABLE | PIN_SLEW_RATE_LOW ) },
    {PIN_SDFM0_D3, ( PIN_MODE(MW_PIN_SDFM0_D3_IOMUX) | PIN_PULL_DISABLE | PIN_SLEW_RATE_LOW ) },
    {PIN_EQEP0_A, ( PIN_MODE(MW_PIN_EQEP0_A_IOMUX) | PIN_PULL_DISABLE | PIN_SLEW_RATE_LOW ) },
    {PIN_EQEP0_B, ( PIN_MODE(MW_PIN_EQEP0_B_IOMUX) | PIN_PULL_DISABLE | PIN_SLEW_RATE_LOW ) },
    {PIN_EQEP0_STROBE, ( PIN_MODE(MW_PIN_EQEP0_STROBE_IOMUX) | PIN_PULL_DISABLE | PIN_SLEW_RATE_LOW ) },
    {PIN_EQEP0_INDEX, ( PIN_MODE(MW_PIN_EQEP0_INDEX_IOMUX) | PIN_PULL_DISABLE | PIN_SLEW_RATE_LOW ) },
    {PIN_I2C0_SDA, ( PIN_MODE(MW_PIN_I2C0_SDA_IOMUX) | PIN_PULL_DISABLE | PIN_SLEW_RATE_LOW ) },
    {PIN_I2C0_SCL, ( PIN_MODE(MW_PIN_I2C0_SCL_IOMUX) | PIN_PULL_DISABLE | PIN_SLEW_RATE_LOW ) },
    {PIN_MCAN2_TX, ( PIN_MODE(MW_PIN_MCAN2_TX_IOMUX) | PIN_PULL_DISABLE | PIN_SLEW_RATE_LOW ) },
    {PIN_MCAN2_RX, ( PIN_MODE(MW_PIN_MCAN2_RX_IOMUX) | PIN_PULL_DISABLE | PIN_SLEW_RATE_LOW ) },
    {PIN_CLKOUT0, ( PIN_MODE(MW_PIN_CLKOUT0_IOMUX) | PIN_PULL_DISABLE | PIN_SLEW_RATE_LOW ) },
    
    {PINMUX_END, PINMUX_END}
};






