TexasInstruments/am26x-hsp/src/am263px_init.c
#define SOC_MODULES_END     (0xFFFFFFFFu)
#define SOCModulesMaxConfig 24U

typedef struct {

    uint32_t moduleId;
    uint32_t clkId;
    uint32_t clkRate;

} SOC_ModuleClockFrequency;


uint32_t gSocModules[ SOCModulesMaxConfig];
SOC_ModuleClockFrequency gSocModulesClockFrequency[SOCModulesMaxConfig];

void SOCModulesInit(void)
{
    uint8_t indx = 0;
    #ifdef MW_EXTMODE_RUNNING
    String board = STR(MW_TARGETHARDWARE);
    String XCPInterface = STR(MW_EXTMODE_CONFIGURATION);
    String ExtRunning = STR(MW_EXTMODE_RUNNING);
    #endif

    #ifdef MW_EXTMODE_RUNNING
    if((strcmp(XCPInterface, "XCP on Serial AM263P")))
        gSocModules[indx] = SOC_RcmPeripheralId_LIN0_UART0; 
        gSocModulesClockFrequency[indx].moduleId = SOC_RcmPeripheralId_LIN0_UART0;
        gSocModulesClockFrequency[indx].clkId = SOC_RcmPeripheralClockSource_DPLL_PER_HSDIV0_CLKOUT1;
        gSocModulesClockFrequency[indx].clkRate = 48000000;
        indx++;
    #endif

    
        gSocModules[indx] = SOC_RcmPeripheralId_LIN0_UART0; 
        gSocModulesClockFrequency[indx].moduleId = SOC_RcmPeripheralId_LIN0_UART0;
        gSocModulesClockFrequency[indx].clkId = SOC_RcmPeripheralClockSource_DPLL_PER_HSDIV0_CLKOUT1;
        gSocModulesClockFrequency[indx].clkRate = 48000000;
        indx++;
    
    

    if(MW_UART1_ENABLE_SEL == 1)
    {
        gSocModules[indx] = SOC_RcmPeripheralId_LIN1_UART1; 
        gSocModulesClockFrequency[indx].moduleId = SOC_RcmPeripheralId_LIN1_UART1;
        gSocModulesClockFrequency[indx].clkId = SOC_RcmPeripheralClockSource_DPLL_PER_HSDIV0_CLKOUT1;
        gSocModulesClockFrequency[indx].clkRate = 48000000;
        indx++;
    }

    if(MW_UART2_ENABLE_SEL == 1)
    {
        gSocModules[indx] = SOC_RcmPeripheralId_LIN2_UART2; 
        gSocModulesClockFrequency[indx].moduleId = SOC_RcmPeripheralId_LIN2_UART2;
        gSocModulesClockFrequency[indx].clkId = SOC_RcmPeripheralClockSource_DPLL_PER_HSDIV0_CLKOUT1;
        gSocModulesClockFrequency[indx].clkRate = 48000000;
        indx++;
    }

    if(MW_UART3_ENABLE_SEL == 1)
    {
        gSocModules[indx] = SOC_RcmPeripheralId_LIN3_UART3; 
        gSocModulesClockFrequency[indx].moduleId = SOC_RcmPeripheralId_LIN3_UART3;
        gSocModulesClockFrequency[indx].clkId = SOC_RcmPeripheralClockSource_DPLL_PER_HSDIV0_CLKOUT1;
        gSocModulesClockFrequency[indx].clkRate = 48000000;
        indx++;
    }

    if(MW_UART4_ENABLE_SEL == 1)
    {
        gSocModules[indx] = SOC_RcmPeripheralId_LIN4_UART4; 
        gSocModulesClockFrequency[indx].moduleId = SOC_RcmPeripheralId_LIN4_UART4;
        gSocModulesClockFrequency[indx].clkId = SOC_RcmPeripheralClockSource_DPLL_PER_HSDIV0_CLKOUT1;
        gSocModulesClockFrequency[indx].clkRate = 48000000;
        indx++;
    }

    if(MW_UART5_ENABLE_SEL == 1)
    {
        gSocModules[indx] = SOC_RcmPeripheralId_LIN5_UART5; 
        gSocModulesClockFrequency[indx].moduleId = SOC_RcmPeripheralId_LIN5_UART5;
        gSocModulesClockFrequency[indx].clkId = SOC_RcmPeripheralClockSource_DPLL_PER_HSDIV0_CLKOUT1;
        gSocModulesClockFrequency[indx].clkRate = 48000000;
        indx++;
    }

    if(MW_ENABLE_MCSPI0_SEL == 1)
    {
        gSocModules[indx] = SOC_RcmPeripheralId_MCSPI0; 
        gSocModulesClockFrequency[indx].moduleId = SOC_RcmPeripheralId_MCSPI0;
        gSocModulesClockFrequency[indx].clkId = SOC_RcmPeripheralClockSource_DPLL_CORE_HSDIV0_CLKOUT0;
        gSocModulesClockFrequency[indx].clkRate = 50000000;
        indx++;
    }

    if(MW_ENABLE_MCSPI1_SEL == 1)
    {
        gSocModules[indx] = SOC_RcmPeripheralId_MCSPI1; 
        gSocModulesClockFrequency[indx].moduleId = SOC_RcmPeripheralId_MCSPI1;
        gSocModulesClockFrequency[indx].clkId = SOC_RcmPeripheralClockSource_DPLL_CORE_HSDIV0_CLKOUT0;
        gSocModulesClockFrequency[indx].clkRate = 50000000;
        indx++;
    }

    if(MW_ENABLE_MCSPI2_SEL == 1)
    {
        gSocModules[indx] = SOC_RcmPeripheralId_MCSPI2; 
        gSocModulesClockFrequency[indx].moduleId = SOC_RcmPeripheralId_MCSPI2;
        gSocModulesClockFrequency[indx].clkId = SOC_RcmPeripheralClockSource_DPLL_CORE_HSDIV0_CLKOUT0;
        gSocModulesClockFrequency[indx].clkRate = 50000000;
        indx++;
    }

    if(MW_ENABLE_MCSPI3_SEL == 1)
    {
        gSocModules[indx] = SOC_RcmPeripheralId_MCSPI3; 
        gSocModulesClockFrequency[indx].moduleId = SOC_RcmPeripheralId_MCSPI3;
        gSocModulesClockFrequency[indx].clkId = SOC_RcmPeripheralClockSource_DPLL_CORE_HSDIV0_CLKOUT0;
        gSocModulesClockFrequency[indx].clkRate = 50000000;
        indx++;
    }

    if(MW_ENABLE_MCSPI4_SEL == 1)
    {
        gSocModules[indx] = SOC_RcmPeripheralId_MCSPI4; 
        gSocModulesClockFrequency[indx].moduleId = SOC_RcmPeripheralId_MCSPI4;
        gSocModulesClockFrequency[indx].clkId = SOC_RcmPeripheralClockSource_DPLL_CORE_HSDIV0_CLKOUT0;
        gSocModulesClockFrequency[indx].clkRate = 50000000;
        indx++;
    }

    if(MW_ENABLE_MCSPI5_SEL == 1)
    {
        gSocModules[indx] = SOC_RcmPeripheralId_MCSPI5; 
        gSocModulesClockFrequency[indx].moduleId = SOC_RcmPeripheralId_MCSPI5;
        gSocModulesClockFrequency[indx].clkId = SOC_RcmPeripheralClockSource_DPLL_CORE_HSDIV0_CLKOUT0;
        gSocModulesClockFrequency[indx].clkRate = 50000000;
        indx++;
    }

    if(MW_ENABLE_MCSPI6_SEL == 1)
    {
        gSocModules[indx] = SOC_RcmPeripheralId_MCSPI6; 
        gSocModulesClockFrequency[indx].moduleId = SOC_RcmPeripheralId_MCSPI6;
        gSocModulesClockFrequency[indx].clkId = SOC_RcmPeripheralClockSource_DPLL_CORE_HSDIV0_CLKOUT0;
        gSocModulesClockFrequency[indx].clkRate = 50000000;
        indx++;
    }


    if(MW_ENABLE_MCAN0_SEL == 1)
    {
        gSocModules[indx] = SOC_RcmPeripheralId_MCAN0; 
        gSocModulesClockFrequency[indx].moduleId = SOC_RcmPeripheralId_MCAN0;
        gSocModulesClockFrequency[indx].clkId = SOC_RcmPeripheralClockSource_DPLL_CORE_HSDIV0_CLKOUT0;
        gSocModulesClockFrequency[indx].clkRate = 80000000;
        indx++;
    }

