TexasInstruments/am26x-hsp/src/am263px_init.c
}
}




void Pinmux_init(void)
{
    Pinmux_config(gPinMuxMainDomainCfg, PINMUX_DOMAIN_ID_MAIN);
    
}

void PowerClock_init(void)
{
    SOCModulesInit();   
    Module_clockEnable();
    Module_clockSetFrequency();
}


void Dpl_init(void)
{
    /* initialize Hwi but keep interrupts disabled */
    HwiP_init();

    /* init debug log zones early */
    /* Debug log init */
    DebugP_logZoneEnable(DebugP_LOG_ZONE_ERROR);
    DebugP_logZoneEnable(DebugP_LOG_ZONE_WARN);
    /* UART console to use for reading input */
    DebugP_uartSetDrvIndex(CONFIG_UART0);


    /* set timer clock source */
    SOC_controlModuleUnlockMMR(SOC_DOMAIN_ID_MAIN, MSS_RCM_PARTITION0);
    *(volatile uint32_t*)(RTI0_CLOCK_SRC_MUX_ADDR) = RTI0_CLOCK_SRC_WUCPUCLK;
    SOC_controlModuleLockMMR(SOC_DOMAIN_ID_MAIN, MSS_RCM_PARTITION0);
    /* initialize Clock */
    ClockP_init();



    /* Enable interrupt handling */
    HwiP_enable();
}


void Drivers_intXbarOpen(void)
{
    /* Interrupt XBAR*/
    
    uint32_t group0_mask[32];
    uint32_t group1_mask[32];
    uint32_t group2_mask[32];
    uint32_t group3_mask[32];
    uint32_t group4_mask[32];
    uint32_t group5_mask[32];
    uint32_t group6_mask[32];
    group0_mask[0] = (MW_INTXBAR0_EPWM0_INT_SEL<<0) | (MW_INTXBAR0_EPWM1_INT_SEL<<1) | (MW_INTXBAR0_EPWM2_INT_SEL<<2) | (MW_INTXBAR0_EPWM3_INT_SEL<<3) | (MW_INTXBAR0_EPWM4_INT_SEL<<4) | (MW_INTXBAR0_EPWM5_INT_SEL<<5) | (MW_INTXBAR0_EPWM6_INT_SEL<<6) | (MW_INTXBAR0_EPWM7_INT_SEL<<7) | (MW_INTXBAR0_EPWM8_INT_SEL<<8) | (MW_INTXBAR0_EPWM9_INT_SEL<<9) | (MW_INTXBAR0_EPWM10_INT_SEL<<10) | (MW_INTXBAR0_EPWM11_INT_SEL<<11) | (MW_INTXBAR0_EPWM12_INT_SEL<<12) | (MW_INTXBAR0_EPWM13_INT_SEL<<13) | (MW_INTXBAR0_EPWM14_INT_SEL<<14) | (MW_INTXBAR0_EPWM15_INT_SEL<<15) | (MW_INTXBAR0_EPWM16_INT_SEL<<16) | (MW_INTXBAR0_EPWM17_INT_SEL<<17) | (MW_INTXBAR0_EPWM18_INT_SEL<<18) | (MW_INTXBAR0_EPWM19_INT_SEL<<19) | (MW_INTXBAR0_EPWM20_INT_SEL<<20) | (MW_INTXBAR0_EPWM21_INT_SEL<<21) | (MW_INTXBAR0_EPWM22_INT_SEL<<22) | (MW_INTXBAR0_EPWM23_INT_SEL<<23) | (MW_INTXBAR0_EPWM24_INT_SEL<<24) | (MW_INTXBAR0_EPWM25_INT_SEL<<25) | (MW_INTXBAR0_EPWM26_INT_SEL<<26) | (MW_INTXBAR0_EPWM27_INT_SEL<<27) | (MW_INTXBAR0_EPWM28_INT_SEL<<28) | (MW_INTXBAR0_EPWM29_INT_SEL<<29) | (MW_INTXBAR0_EPWM30_INT_SEL<<30) | (MW_INTXBAR0_EPWM31_INT_SEL<<31);
    group1_mask[0] = (MW_INTXBAR0_EPWM0_TZINT_SEL<<0) | (MW_INTXBAR0_EPWM1_TZINT_SEL<<1) | (MW_INTXBAR0_EPWM2_TZINT_SEL<<2) | (MW_INTXBAR0_EPWM3_TZINT_SEL<<3) | (MW_INTXBAR0_EPWM4_TZINT_SEL<<4) | (MW_INTXBAR0_EPWM5_TZINT_SEL<<5) | (MW_INTXBAR0_EPWM6_TZINT_SEL<<6) | (MW_INTXBAR0_EPWM7_TZINT_SEL<<7) | (MW_INTXBAR0_EPWM8_TZINT_SEL<<8) | (MW_INTXBAR0_EPWM9_TZINT_SEL<<9) | (MW_INTXBAR0_EPWM10_TZINT_SEL<<10) | (MW_INTXBAR0_EPWM11_TZINT_SEL<<11) | (MW_INTXBAR0_EPWM12_TZINT_SEL<<12) | (MW_INTXBAR0_EPWM13_TZINT_SEL<<13) | (MW_INTXBAR0_EPWM14_TZINT_SEL<<14) | (MW_INTXBAR0_EPWM15_TZINT_SEL<<15) | (MW_INTXBAR0_EPWM16_TZINT_SEL<<16) | (MW_INTXBAR0_EPWM17_TZINT_SEL<<17) | (MW_INTXBAR0_EPWM18_TZINT_SEL<<18) | (MW_INTXBAR0_EPWM19_TZINT_SEL<<19) | (MW_INTXBAR0_EPWM20_TZINT_SEL<<20) | (MW_INTXBAR0_EPWM21_TZINT_SEL<<21) | (MW_INTXBAR0_EPWM22_TZINT_SEL<<22) | (MW_INTXBAR0_EPWM23_TZINT_SEL<<23) | (MW_INTXBAR0_EPWM24_TZINT_SEL<<24) | (MW_INTXBAR0_EPWM25_TZINT_SEL<<25) | (MW_INTXBAR0_EPWM26_TZINT_SEL<<26) | (MW_INTXBAR0_EPWM27_TZINT_SEL<<27) | (MW_INTXBAR0_EPWM28_TZINT_SEL<<28) | (MW_INTXBAR0_EPWM29_TZINT_SEL<<29) | (MW_INTXBAR0_EPWM30_TZINT_SEL<<30) | (MW_INTXBAR0_EPWM31_TZINT_SEL<<31);
    group2_mask[0] = (MW_INTXBAR0_ADC0_INT1_SEL<<0) | (MW_INTXBAR0_ADC0_INT2_SEL<<1) | (MW_INTXBAR0_ADC0_INT3_SEL<<2) | (MW_INTXBAR0_ADC0_INT4_SEL<<3) | (MW_INTXBAR0_ADC0_EVTINT_SEL<<4) | (MW_INTXBAR0_ADC1_INT1_SEL<<5) | (MW_INTXBAR0_ADC1_INT2_SEL<<6) | (MW_INTXBAR0_ADC1_INT3_SEL<<7) | (MW_INTXBAR0_ADC1_INT4_SEL<<8) | (MW_INTXBAR0_ADC1_EVTINT_SEL<<9) | (MW_INTXBAR0_ADC2_INT1_SEL<<10) | (MW_INTXBAR0_ADC2_INT2_SEL<<11) | (MW_INTXBAR0_ADC2_INT3_SEL<<12) | (MW_INTXBAR0_ADC2_INT4_SEL<<13) | (MW_INTXBAR0_ADC2_EVTINT_SEL<<14) | (MW_INTXBAR0_ADC3_INT1_SEL<<15) | (MW_INTXBAR0_ADC3_INT2_SEL<<16) | (MW_INTXBAR0_ADC3_INT3_SEL<<17) | (MW_INTXBAR0_ADC3_INT4_SEL<<18) | (MW_INTXBAR0_ADC3_EVTINT_SEL<<19) | (MW_INTXBAR0_ADC4_INT1_SEL<<20) | (MW_INTXBAR0_ADC4_INT2_SEL<<21) | (MW_INTXBAR0_ADC4_INT3_SEL<<22) | (MW_INTXBAR0_ADC4_INT4_SEL<<23) | (MW_INTXBAR0_ADC4_EVTINT_SEL<<24);
    group3_mask[0] = (MW_INTXBAR0_FSIRX0_INT1N_SEL<<0) | (MW_INTXBAR0_FSIRX0_INT2N_SEL<<1) | (MW_INTXBAR0_FSITX0_INT1N_SEL<<2) | (MW_INTXBAR0_FSITX0_INT2N_SEL<<3) | (MW_INTXBAR0_FSIRX1_INT1N_SEL<<4) | (MW_INTXBAR0_FSIRX1_INT2N_SEL<<5) | (MW_INTXBAR0_FSITX1_INT1N_SEL<<6) | (MW_INTXBAR0_FSITX1_INT2N_SEL<<7) | (MW_INTXBAR0_FSIRX2_INT1N_SEL<<8) | (MW_INTXBAR0_FSIRX2_INT2N_SEL<<9) | (MW_INTXBAR0_FSITX2_INT1N_SEL<<10) | (MW_INTXBAR0_FSITX2_INT2N_SEL<<11) | (MW_INTXBAR0_FSIRX3_INT1N_SEL<<12) | (MW_INTXBAR0_FSIRX3_INT2N_SEL<<13) | (MW_INTXBAR0_FSITX3_INT1N_SEL<<14) | (MW_INTXBAR0_FSITX3_INT2N_SEL<<15);
    group4_mask[0] = (MW_INTXBAR0_SD0_ERR_SEL<<0) | (MW_INTXBAR0_SD0_FILT0_DRINT_SEL<<1) | (MW_INTXBAR0_SD0_FILT1_DRINT_SEL<<2) | (MW_INTXBAR0_SD0_FILT2_DRINT_SEL<<3) | (MW_INTXBAR0_SD0_FILT3_DRINT_SEL<<4) | (MW_INTXBAR0_SD1_ERR_SEL<<5) | (MW_INTXBAR0_SD1_FILT0_DRINT_SEL<<6) | (MW_INTXBAR0_SD1_FILT1_DRINT_SEL<<7) | (MW_INTXBAR0_SD1_FILT2_DRINT_SEL<<8) | (MW_INTXBAR0_SD1_FILT3_DRINT_SEL<<9);
    group5_mask[0] = (MW_INTXBAR0_ECAP0_INT_SEL<<0) | (MW_INTXBAR0_ECAP1_INT_SEL<<1) | (MW_INTXBAR0_ECAP2_INT_SEL<<2) | (MW_INTXBAR0_ECAP3_INT_SEL<<3) | (MW_INTXBAR0_ECAP4_INT_SEL<<4) | (MW_INTXBAR0_ECAP5_INT_SEL<<5) | (MW_INTXBAR0_ECAP6_INT_SEL<<6) | (MW_INTXBAR0_ECAP7_INT_SEL<<7) | (MW_INTXBAR0_ECAP8_INT_SEL<<8) | (MW_INTXBAR0_ECAP9_INT_SEL<<9);
    group6_mask[0] = (MW_INTXBAR0_EQEP0_INT_SEL<<0) | (MW_INTXBAR0_EQEP1_INT_SEL<<1) | (MW_INTXBAR0_EQEP2_INT_SEL<<2);
    group0_mask[1] = (MW_INTXBAR1_EPWM0_INT_SEL<<0) | (MW_INTXBAR1_EPWM1_INT_SEL<<1) | (MW_INTXBAR1_EPWM2_INT_SEL<<2) | (MW_INTXBAR1_EPWM3_INT_SEL<<3) | (MW_INTXBAR1_EPWM4_INT_SEL<<4) | (MW_INTXBAR1_EPWM5_INT_SEL<<5) | (MW_INTXBAR1_EPWM6_INT_SEL<<6) | (MW_INTXBAR1_EPWM7_INT_SEL<<7) | (MW_INTXBAR1_EPWM8_INT_SEL<<8) | (MW_INTXBAR1_EPWM9_INT_SEL<<9) | (MW_INTXBAR1_EPWM10_INT_SEL<<10) | (MW_INTXBAR1_EPWM11_INT_SEL<<11) | (MW_INTXBAR1_EPWM12_INT_SEL<<12) | (MW_INTXBAR1_EPWM13_INT_SEL<<13) | (MW_INTXBAR1_EPWM14_INT_SEL<<14) | (MW_INTXBAR1_EPWM15_INT_SEL<<15) | (MW_INTXBAR1_EPWM16_INT_SEL<<16) | (MW_INTXBAR1_EPWM17_INT_SEL<<17) | (MW_INTXBAR1_EPWM18_INT_SEL<<18) | (MW_INTXBAR1_EPWM19_INT_SEL<<19) | (MW_INTXBAR1_EPWM20_INT_SEL<<20) | (MW_INTXBAR1_EPWM21_INT_SEL<<21) | (MW_INTXBAR1_EPWM22_INT_SEL<<22) | (MW_INTXBAR1_EPWM23_INT_SEL<<23) | (MW_INTXBAR1_EPWM24_INT_SEL<<24) | (MW_INTXBAR1_EPWM25_INT_SEL<<25) | (MW_INTXBAR1_EPWM26_INT_SEL<<26) | (MW_INTXBAR1_EPWM27_INT_SEL<<27) | (MW_INTXBAR1_EPWM28_INT_SEL<<28) | (MW_INTXBAR1_EPWM29_INT_SEL<<29) | (MW_INTXBAR1_EPWM30_INT_SEL<<30) | (MW_INTXBAR1_EPWM31_INT_SEL<<31);
    group1_mask[1] = (MW_INTXBAR1_EPWM0_TZINT_SEL<<0) | (MW_INTXBAR1_EPWM1_TZINT_SEL<<1) | (MW_INTXBAR1_EPWM2_TZINT_SEL<<2) | (MW_INTXBAR1_EPWM3_TZINT_SEL<<3) | (MW_INTXBAR1_EPWM4_TZINT_SEL<<4) | (MW_INTXBAR1_EPWM5_TZINT_SEL<<5) | (MW_INTXBAR1_EPWM6_TZINT_SEL<<6) | (MW_INTXBAR1_EPWM7_TZINT_SEL<<7) | (MW_INTXBAR1_EPWM8_TZINT_SEL<<8) | (MW_INTXBAR1_EPWM9_TZINT_SEL<<9) | (MW_INTXBAR1_EPWM10_TZINT_SEL<<10) | (MW_INTXBAR1_EPWM11_TZINT_SEL<<11) | (MW_INTXBAR1_EPWM12_TZINT_SEL<<12) | (MW_INTXBAR1_EPWM13_TZINT_SEL<<13) | (MW_INTXBAR1_EPWM14_TZINT_SEL<<14) | (MW_INTXBAR1_EPWM15_TZINT_SEL<<15) | (MW_INTXBAR1_EPWM16_TZINT_SEL<<16) | (MW_INTXBAR1_EPWM17_TZINT_SEL<<17) | (MW_INTXBAR1_EPWM18_TZINT_SEL<<18) | (MW_INTXBAR1_EPWM19_TZINT_SEL<<19) | (MW_INTXBAR1_EPWM20_TZINT_SEL<<20) | (MW_INTXBAR1_EPWM21_TZINT_SEL<<21) | (MW_INTXBAR1_EPWM22_TZINT_SEL<<22) | (MW_INTXBAR1_EPWM23_TZINT_SEL<<23) | (MW_INTXBAR1_EPWM24_TZINT_SEL<<24) | (MW_INTXBAR1_EPWM25_TZINT_SEL<<25) | (MW_INTXBAR1_EPWM26_TZINT_SEL<<26) | (MW_INTXBAR1_EPWM27_TZINT_SEL<<27) | (MW_INTXBAR1_EPWM28_TZINT_SEL<<28) | (MW_INTXBAR1_EPWM29_TZINT_SEL<<29) | (MW_INTXBAR1_EPWM30_TZINT_SEL<<30) | (MW_INTXBAR1_EPWM31_TZINT_SEL<<31);
    group2_mask[1] = (MW_INTXBAR1_ADC0_INT1_SEL<<0) | (MW_INTXBAR1_ADC0_INT2_SEL<<1) | (MW_INTXBAR1_ADC0_INT3_SEL<<2) | (MW_INTXBAR1_ADC0_INT4_SEL<<3) | (MW_INTXBAR1_ADC0_EVTINT_SEL<<4) | (MW_INTXBAR1_ADC1_INT1_SEL<<5) | (MW_INTXBAR1_ADC1_INT2_SEL<<6) | (MW_INTXBAR1_ADC1_INT3_SEL<<7) | (MW_INTXBAR1_ADC1_INT4_SEL<<8) | (MW_INTXBAR1_ADC1_EVTINT_SEL<<9) | (MW_INTXBAR1_ADC2_INT1_SEL<<10) | (MW_INTXBAR1_ADC2_INT2_SEL<<11) | (MW_INTXBAR1_ADC2_INT3_SEL<<12) | (MW_INTXBAR1_ADC2_INT4_SEL<<13) | (MW_INTXBAR1_ADC2_EVTINT_SEL<<14) | (MW_INTXBAR1_ADC3_INT1_SEL<<15) | (MW_INTXBAR1_ADC3_INT2_SEL<<16) | (MW_INTXBAR1_ADC3_INT3_SEL<<17) | (MW_INTXBAR1_ADC3_INT4_SEL<<18) | (MW_INTXBAR1_ADC3_EVTINT_SEL<<19) | (MW_INTXBAR1_ADC4_INT1_SEL<<20) | (MW_INTXBAR1_ADC4_INT2_SEL<<21) | (MW_INTXBAR1_ADC4_INT3_SEL<<22) | (MW_INTXBAR1_ADC4_INT4_SEL<<23) | (MW_INTXBAR1_ADC4_EVTINT_SEL<<24);
    group3_mask[1] = (MW_INTXBAR1_FSIRX0_INT1N_SEL<<0) | (MW_INTXBAR1_FSIRX0_INT2N_SEL<<1) | (MW_INTXBAR1_FSITX0_INT1N_SEL<<2) | (MW_INTXBAR1_FSITX0_INT2N_SEL<<3) | (MW_INTXBAR1_FSIRX1_INT1N_SEL<<4) | (MW_INTXBAR1_FSIRX1_INT2N_SEL<<5) | (MW_INTXBAR1_FSITX1_INT1N_SEL<<6) | (MW_INTXBAR1_FSITX1_INT2N_SEL<<7) | (MW_INTXBAR1_FSIRX2_INT1N_SEL<<8) | (MW_INTXBAR1_FSIRX2_INT2N_SEL<<9) | (MW_INTXBAR1_FSITX2_INT1N_SEL<<10) | (MW_INTXBAR1_FSITX2_INT2N_SEL<<11) | (MW_INTXBAR1_FSIRX3_INT1N_SEL<<12) | (MW_INTXBAR1_FSIRX3_INT2N_SEL<<13) | (MW_INTXBAR1_FSITX3_INT1N_SEL<<14) | (MW_INTXBAR1_FSITX3_INT2N_SEL<<15);
    group4_mask[1] = (MW_INTXBAR1_SD0_ERR_SEL<<0) | (MW_INTXBAR1_SD0_FILT0_DRINT_SEL<<1) | (MW_INTXBAR1_SD0_FILT1_DRINT_SEL<<2) | (MW_INTXBAR1_SD0_FILT2_DRINT_SEL<<3) | (MW_INTXBAR1_SD0_FILT3_DRINT_SEL<<4) | (MW_INTXBAR1_SD1_ERR_SEL<<5) | (MW_INTXBAR1_SD1_FILT0_DRINT_SEL<<6) | (MW_INTXBAR1_SD1_FILT1_DRINT_SEL<<7) | (MW_INTXBAR1_SD1_FILT2_DRINT_SEL<<8) | (MW_INTXBAR1_SD1_FILT3_DRINT_SEL<<9);
    group5_mask[1] = (MW_INTXBAR1_ECAP0_INT_SEL<<0) | (MW_INTXBAR1_ECAP1_INT_SEL<<1) | (MW_INTXBAR1_ECAP2_INT_SEL<<2) | (MW_INTXBAR1_ECAP3_INT_SEL<<3) | (MW_INTXBAR1_ECAP4_INT_SEL<<4) | (MW_INTXBAR1_ECAP5_INT_SEL<<5) | (MW_INTXBAR1_ECAP6_INT_SEL<<6) | (MW_INTXBAR1_ECAP7_INT_SEL<<7) | (MW_INTXBAR1_ECAP8_INT_SEL<<8) | (MW_INTXBAR1_ECAP9_INT_SEL<<9);
    group6_mask[1] = (MW_INTXBAR1_EQEP0_INT_SEL<<0) | (MW_INTXBAR1_EQEP1_INT_SEL<<1) | (MW_INTXBAR1_EQEP2_INT_SEL<<2);
    group0_mask[2] = (MW_INTXBAR2_EPWM0_INT_SEL<<0) | (MW_INTXBAR2_EPWM1_INT_SEL<<1) | (MW_INTXBAR2_EPWM2_INT_SEL<<2) | (MW_INTXBAR2_EPWM3_INT_SEL<<3) | (MW_INTXBAR2_EPWM4_INT_SEL<<4) | (MW_INTXBAR2_EPWM5_INT_SEL<<5) | (MW_INTXBAR2_EPWM6_INT_SEL<<6) | (MW_INTXBAR2_EPWM7_INT_SEL<<7) | (MW_INTXBAR2_EPWM8_INT_SEL<<8) | (MW_INTXBAR2_EPWM9_INT_SEL<<9) | (MW_INTXBAR2_EPWM10_INT_SEL<<10) | (MW_INTXBAR2_EPWM11_INT_SEL<<11) | (MW_INTXBAR2_EPWM12_INT_SEL<<12) | (MW_INTXBAR2_EPWM13_INT_SEL<<13) | (MW_INTXBAR2_EPWM14_INT_SEL<<14) | (MW_INTXBAR2_EPWM15_INT_SEL<<15) | (MW_INTXBAR2_EPWM16_INT_SEL<<16) | (MW_INTXBAR2_EPWM17_INT_SEL<<17) | (MW_INTXBAR2_EPWM18_INT_SEL<<18) | (MW_INTXBAR2_EPWM19_INT_SEL<<19) | (MW_INTXBAR2_EPWM20_INT_SEL<<20) | (MW_INTXBAR2_EPWM21_INT_SEL<<21) | (MW_INTXBAR2_EPWM22_INT_SEL<<22) | (MW_INTXBAR2_EPWM23_INT_SEL<<23) | (MW_INTXBAR2_EPWM24_INT_SEL<<24) | (MW_INTXBAR2_EPWM25_INT_SEL<<25) | (MW_INTXBAR2_EPWM26_INT_SEL<<26) | (MW_INTXBAR2_EPWM27_INT_SEL<<27) | (MW_INTXBAR2_EPWM28_INT_SEL<<28) | (MW_INTXBAR2_EPWM29_INT_SEL<<29) | (MW_INTXBAR2_EPWM30_INT_SEL<<30) | (MW_INTXBAR2_EPWM31_INT_SEL<<31);
    group1_mask[2] = (MW_INTXBAR2_EPWM0_TZINT_SEL<<0) | (MW_INTXBAR2_EPWM1_TZINT_SEL<<1) | (MW_INTXBAR2_EPWM2_TZINT_SEL<<2) | (MW_INTXBAR2_EPWM3_TZINT_SEL<<3) | (MW_INTXBAR2_EPWM4_TZINT_SEL<<4) | (MW_INTXBAR2_EPWM5_TZINT_SEL<<5) | (MW_INTXBAR2_EPWM6_TZINT_SEL<<6) | (MW_INTXBAR2_EPWM7_TZINT_SEL<<7) | (MW_INTXBAR2_EPWM8_TZINT_SEL<<8) | (MW_INTXBAR2_EPWM9_TZINT_SEL<<9) | (MW_INTXBAR2_EPWM10_TZINT_SEL<<10) | (MW_INTXBAR2_EPWM11_TZINT_SEL<<11) | (MW_INTXBAR2_EPWM12_TZINT_SEL<<12) | (MW_INTXBAR2_EPWM13_TZINT_SEL<<13) | (MW_INTXBAR2_EPWM14_TZINT_SEL<<14) | (MW_INTXBAR2_EPWM15_TZINT_SEL<<15) | (MW_INTXBAR2_EPWM16_TZINT_SEL<<16) | (MW_INTXBAR2_EPWM17_TZINT_SEL<<17) | (MW_INTXBAR2_EPWM18_TZINT_SEL<<18) | (MW_INTXBAR2_EPWM19_TZINT_SEL<<19) | (MW_INTXBAR2_EPWM20_TZINT_SEL<<20) | (MW_INTXBAR2_EPWM21_TZINT_SEL<<21) | (MW_INTXBAR2_EPWM22_TZINT_SEL<<22) | (MW_INTXBAR2_EPWM23_TZINT_SEL<<23) | (MW_INTXBAR2_EPWM24_TZINT_SEL<<24) | (MW_INTXBAR2_EPWM25_TZINT_SEL<<25) | (MW_INTXBAR2_EPWM26_TZINT_SEL<<26) | (MW_INTXBAR2_EPWM27_TZINT_SEL<<27) | (MW_INTXBAR2_EPWM28_TZINT_SEL<<28) | (MW_INTXBAR2_EPWM29_TZINT_SEL<<29) | (MW_INTXBAR2_EPWM30_TZINT_SEL<<30) | (MW_INTXBAR2_EPWM31_TZINT_SEL<<31);
    group2_mask[2] = (MW_INTXBAR2_ADC0_INT1_SEL<<0) | (MW_INTXBAR2_ADC0_INT2_SEL<<1) | (MW_INTXBAR2_ADC0_INT3_SEL<<2) | (MW_INTXBAR2_ADC0_INT4_SEL<<3) | (MW_INTXBAR2_ADC0_EVTINT_SEL<<4) | (MW_INTXBAR2_ADC1_INT1_SEL<<5) | (MW_INTXBAR2_ADC1_INT2_SEL<<6) | (MW_INTXBAR2_ADC1_INT3_SEL<<7) | (MW_INTXBAR2_ADC1_INT4_SEL<<8) | (MW_INTXBAR2_ADC1_EVTINT_SEL<<9) | (MW_INTXBAR2_ADC2_INT1_SEL<<10) | (MW_INTXBAR2_ADC2_INT2_SEL<<11) | (MW_INTXBAR2_ADC2_INT3_SEL<<12) | (MW_INTXBAR2_ADC2_INT4_SEL<<13) | (MW_INTXBAR2_ADC2_EVTINT_SEL<<14) | (MW_INTXBAR2_ADC3_INT1_SEL<<15) | (MW_INTXBAR2_ADC3_INT2_SEL<<16) | (MW_INTXBAR2_ADC3_INT3_SEL<<17) | (MW_INTXBAR2_ADC3_INT4_SEL<<18) | (MW_INTXBAR2_ADC3_EVTINT_SEL<<19) | (MW_INTXBAR2_ADC4_INT1_SEL<<20) | (MW_INTXBAR2_ADC4_INT2_SEL<<21) | (MW_INTXBAR2_ADC4_INT3_SEL<<22) | (MW_INTXBAR2_ADC4_INT4_SEL<<23) | (MW_INTXBAR2_ADC4_EVTINT_SEL<<24);
    group3_mask[2] = (MW_INTXBAR2_FSIRX0_INT1N_SEL<<0) | (MW_INTXBAR2_FSIRX0_INT2N_SEL<<1) | (MW_INTXBAR2_FSITX0_INT1N_SEL<<2) | (MW_INTXBAR2_FSITX0_INT2N_SEL<<3) | (MW_INTXBAR2_FSIRX1_INT1N_SEL<<4) | (MW_INTXBAR2_FSIRX1_INT2N_SEL<<5) | (MW_INTXBAR2_FSITX1_INT1N_SEL<<6) | (MW_INTXBAR2_FSITX1_INT2N_SEL<<7) | (MW_INTXBAR2_FSIRX2_INT1N_SEL<<8) | (MW_INTXBAR2_FSIRX2_INT2N_SEL<<9) | (MW_INTXBAR2_FSITX2_INT1N_SEL<<10) | (MW_INTXBAR2_FSITX2_INT2N_SEL<<11) | (MW_INTXBAR2_FSIRX3_INT1N_SEL<<12) | (MW_INTXBAR2_FSIRX3_INT2N_SEL<<13) | (MW_INTXBAR2_FSITX3_INT1N_SEL<<14) | (MW_INTXBAR2_FSITX3_INT2N_SEL<<15);
    group4_mask[2] = (MW_INTXBAR2_SD0_ERR_SEL<<0) | (MW_INTXBAR2_SD0_FILT0_DRINT_SEL<<1) | (MW_INTXBAR2_SD0_FILT1_DRINT_SEL<<2) | (MW_INTXBAR2_SD0_FILT2_DRINT_SEL<<3) | (MW_INTXBAR2_SD0_FILT3_DRINT_SEL<<4) | (MW_INTXBAR2_SD1_ERR_SEL<<5) | (MW_INTXBAR2_SD1_FILT0_DRINT_SEL<<6) | (MW_INTXBAR2_SD1_FILT1_DRINT_SEL<<7) | (MW_INTXBAR2_SD1_FILT2_DRINT_SEL<<8) | (MW_INTXBAR2_SD1_FILT3_DRINT_SEL<<9);
    group5_mask[2] = (MW_INTXBAR2_ECAP0_INT_SEL<<0) | (MW_INTXBAR2_ECAP1_INT_SEL<<1) | (MW_INTXBAR2_ECAP2_INT_SEL<<2) | (MW_INTXBAR2_ECAP3_INT_SEL<<3) | (MW_INTXBAR2_ECAP4_INT_SEL<<4) | (MW_INTXBAR2_ECAP5_INT_SEL<<5) | (MW_INTXBAR2_ECAP6_INT_SEL<<6) | (MW_INTXBAR2_ECAP7_INT_SEL<<7) | (MW_INTXBAR2_ECAP8_INT_SEL<<8) | (MW_INTXBAR2_ECAP9_INT_SEL<<9);
    group6_mask[2] = (MW_INTXBAR2_EQEP0_INT_SEL<<0) | (MW_INTXBAR2_EQEP1_INT_SEL<<1) | (MW_INTXBAR2_EQEP2_INT_SEL<<2);
    group0_mask[3] = (MW_INTXBAR3_EPWM0_INT_SEL<<0) | (MW_INTXBAR3_EPWM1_INT_SEL<<1) | (MW_INTXBAR3_EPWM2_INT_SEL<<2) | (MW_INTXBAR3_EPWM3_INT_SEL<<3) | (MW_INTXBAR3_EPWM4_INT_SEL<<4) | (MW_INTXBAR3_EPWM5_INT_SEL<<5) | (MW_INTXBAR3_EPWM6_INT_SEL<<6) | (MW_INTXBAR3_EPWM7_INT_SEL<<7) | (MW_INTXBAR3_EPWM8_INT_SEL<<8) | (MW_INTXBAR3_EPWM9_INT_SEL<<9) | (MW_INTXBAR3_EPWM10_INT_SEL<<10) | (MW_INTXBAR3_EPWM11_INT_SEL<<11) | (MW_INTXBAR3_EPWM12_INT_SEL<<12) | (MW_INTXBAR3_EPWM13_INT_SEL<<13) | (MW_INTXBAR3_EPWM14_INT_SEL<<14) | (MW_INTXBAR3_EPWM15_INT_SEL<<15) | (MW_INTXBAR3_EPWM16_INT_SEL<<16) | (MW_INTXBAR3_EPWM17_INT_SEL<<17) | (MW_INTXBAR3_EPWM18_INT_SEL<<18) | (MW_INTXBAR3_EPWM19_INT_SEL<<19) | (MW_INTXBAR3_EPWM20_INT_SEL<<20) | (MW_INTXBAR3_EPWM21_INT_SEL<<21) | (MW_INTXBAR3_EPWM22_INT_SEL<<22) | (MW_INTXBAR3_EPWM23_INT_SEL<<23) | (MW_INTXBAR3_EPWM24_INT_SEL<<24) | (MW_INTXBAR3_EPWM25_INT_SEL<<25) | (MW_INTXBAR3_EPWM26_INT_SEL<<26) | (MW_INTXBAR3_EPWM27_INT_SEL<<27) | (MW_INTXBAR3_EPWM28_INT_SEL<<28) | (MW_INTXBAR3_EPWM29_INT_SEL<<29) | (MW_INTXBAR3_EPWM30_INT_SEL<<30) | (MW_INTXBAR3_EPWM31_INT_SEL<<31);
    group1_mask[3] = (MW_INTXBAR3_EPWM0_TZINT_SEL<<0) | (MW_INTXBAR3_EPWM1_TZINT_SEL<<1) | (MW_INTXBAR3_EPWM2_TZINT_SEL<<2) | (MW_INTXBAR3_EPWM3_TZINT_SEL<<3) | (MW_INTXBAR3_EPWM4_TZINT_SEL<<4) | (MW_INTXBAR3_EPWM5_TZINT_SEL<<5) | (MW_INTXBAR3_EPWM6_TZINT_SEL<<6) | (MW_INTXBAR3_EPWM7_TZINT_SEL<<7) | (MW_INTXBAR3_EPWM8_TZINT_SEL<<8) | (MW_INTXBAR3_EPWM9_TZINT_SEL<<9) | (MW_INTXBAR3_EPWM10_TZINT_SEL<<10) | (MW_INTXBAR3_EPWM11_TZINT_SEL<<11) | (MW_INTXBAR3_EPWM12_TZINT_SEL<<12) | (MW_INTXBAR3_EPWM13_TZINT_SEL<<13) | (MW_INTXBAR3_EPWM14_TZINT_SEL<<14) | (MW_INTXBAR3_EPWM15_TZINT_SEL<<15) | (MW_INTXBAR3_EPWM16_TZINT_SEL<<16) | (MW_INTXBAR3_EPWM17_TZINT_SEL<<17) | (MW_INTXBAR3_EPWM18_TZINT_SEL<<18) | (MW_INTXBAR3_EPWM19_TZINT_SEL<<19) | (MW_INTXBAR3_EPWM20_TZINT_SEL<<20) | (MW_INTXBAR3_EPWM21_TZINT_SEL<<21) | (MW_INTXBAR3_EPWM22_TZINT_SEL<<22) | (MW_INTXBAR3_EPWM23_TZINT_SEL<<23) | (MW_INTXBAR3_EPWM24_TZINT_SEL<<24) | (MW_INTXBAR3_EPWM25_TZINT_SEL<<25) | (MW_INTXBAR3_EPWM26_TZINT_SEL<<26) | (MW_INTXBAR3_EPWM27_TZINT_SEL<<27) | (MW_INTXBAR3_EPWM28_TZINT_SEL<<28) | (MW_INTXBAR3_EPWM29_TZINT_SEL<<29) | (MW_INTXBAR3_EPWM30_TZINT_SEL<<30) | (MW_INTXBAR3_EPWM31_TZINT_SEL<<31);
    group2_mask[3] = (MW_INTXBAR3_ADC0_INT1_SEL<<0) | (MW_INTXBAR3_ADC0_INT2_SEL<<1) | (MW_INTXBAR3_ADC0_INT3_SEL<<2) | (MW_INTXBAR3_ADC0_INT4_SEL<<3) | (MW_INTXBAR3_ADC0_EVTINT_SEL<<4) | (MW_INTXBAR3_ADC1_INT1_SEL<<5) | (MW_INTXBAR3_ADC1_INT2_SEL<<6) | (MW_INTXBAR3_ADC1_INT3_SEL<<7) | (MW_INTXBAR3_ADC1_INT4_SEL<<8) | (MW_INTXBAR3_ADC1_EVTINT_SEL<<9) | (MW_INTXBAR3_ADC2_INT1_SEL<<10) | (MW_INTXBAR3_ADC2_INT2_SEL<<11) | (MW_INTXBAR3_ADC2_INT3_SEL<<12) | (MW_INTXBAR3_ADC2_INT4_SEL<<13) | (MW_INTXBAR3_ADC2_EVTINT_SEL<<14) | (MW_INTXBAR3_ADC3_INT1_SEL<<15) | (MW_INTXBAR3_ADC3_INT2_SEL<<16) | (MW_INTXBAR3_ADC3_INT3_SEL<<17) | (MW_INTXBAR3_ADC3_INT4_SEL<<18) | (MW_INTXBAR3_ADC3_EVTINT_SEL<<19) | (MW_INTXBAR3_ADC4_INT1_SEL<<20) | (MW_INTXBAR3_ADC4_INT2_SEL<<21) | (MW_INTXBAR3_ADC4_INT3_SEL<<22) | (MW_INTXBAR3_ADC4_INT4_SEL<<23) | (MW_INTXBAR3_ADC4_EVTINT_SEL<<24);
    group3_mask[3] = (MW_INTXBAR3_FSIRX0_INT1N_SEL<<0) | (MW_INTXBAR3_FSIRX0_INT2N_SEL<<1) | (MW_INTXBAR3_FSITX0_INT1N_SEL<<2) | (MW_INTXBAR3_FSITX0_INT2N_SEL<<3) | (MW_INTXBAR3_FSIRX1_INT1N_SEL<<4) | (MW_INTXBAR3_FSIRX1_INT2N_SEL<<5) | (MW_INTXBAR3_FSITX1_INT1N_SEL<<6) | (MW_INTXBAR3_FSITX1_INT2N_SEL<<7) | (MW_INTXBAR3_FSIRX2_INT1N_SEL<<8) | (MW_INTXBAR3_FSIRX2_INT2N_SEL<<9) | (MW_INTXBAR3_FSITX2_INT1N_SEL<<10) | (MW_INTXBAR3_FSITX2_INT2N_SEL<<11) | (MW_INTXBAR3_FSIRX3_INT1N_SEL<<12) | (MW_INTXBAR3_FSIRX3_INT2N_SEL<<13) | (MW_INTXBAR3_FSITX3_INT1N_SEL<<14) | (MW_INTXBAR3_FSITX3_INT2N_SEL<<15);
    group4_mask[3] = (MW_INTXBAR3_SD0_ERR_SEL<<0) | (MW_INTXBAR3_SD0_FILT0_DRINT_SEL<<1) | (MW_INTXBAR3_SD0_FILT1_DRINT_SEL<<2) | (MW_INTXBAR3_SD0_FILT2_DRINT_SEL<<3) | (MW_INTXBAR3_SD0_FILT3_DRINT_SEL<<4) | (MW_INTXBAR3_SD1_ERR_SEL<<5) | (MW_INTXBAR3_SD1_FILT0_DRINT_SEL<<6) | (MW_INTXBAR3_SD1_FILT1_DRINT_SEL<<7) | (MW_INTXBAR3_SD1_FILT2_DRINT_SEL<<8) | (MW_INTXBAR3_SD1_FILT3_DRINT_SEL<<9);
    group5_mask[3] = (MW_INTXBAR3_ECAP0_INT_SEL<<0) | (MW_INTXBAR3_ECAP1_INT_SEL<<1) | (MW_INTXBAR3_ECAP2_INT_SEL<<2) | (MW_INTXBAR3_ECAP3_INT_SEL<<3) | (MW_INTXBAR3_ECAP4_INT_SEL<<4) | (MW_INTXBAR3_ECAP5_INT_SEL<<5) | (MW_INTXBAR3_ECAP6_INT_SEL<<6) | (MW_INTXBAR3_ECAP7_INT_SEL<<7) | (MW_INTXBAR3_ECAP8_INT_SEL<<8) | (MW_INTXBAR3_ECAP9_INT_SEL<<9);
    group6_mask[3] = (MW_INTXBAR3_EQEP0_INT_SEL<<0) | (MW_INTXBAR3_EQEP1_INT_SEL<<1) | (MW_INTXBAR3_EQEP2_INT_SEL<<2);
    group0_mask[4] = (MW_INTXBAR4_EPWM0_INT_SEL<<0) | (MW_INTXBAR4_EPWM1_INT_SEL<<1) | (MW_INTXBAR4_EPWM2_INT_SEL<<2) | (MW_INTXBAR4_EPWM3_INT_SEL<<3) | (MW_INTXBAR4_EPWM4_INT_SEL<<4) | (MW_INTXBAR4_EPWM5_INT_SEL<<5) | (MW_INTXBAR4_EPWM6_INT_SEL<<6) | (MW_INTXBAR4_EPWM7_INT_SEL<<7) | (MW_INTXBAR4_EPWM8_INT_SEL<<8) | (MW_INTXBAR4_EPWM9_INT_SEL<<9) | (MW_INTXBAR4_EPWM10_INT_SEL<<10) | (MW_INTXBAR4_EPWM11_INT_SEL<<11) | (MW_INTXBAR4_EPWM12_INT_SEL<<12) | (MW_INTXBAR4_EPWM13_INT_SEL<<13) | (MW_INTXBAR4_EPWM14_INT_SEL<<14) | (MW_INTXBAR4_EPWM15_INT_SEL<<15) | (MW_INTXBAR4_EPWM16_INT_SEL<<16) | (MW_INTXBAR4_EPWM17_INT_SEL<<17) | (MW_INTXBAR4_EPWM18_INT_SEL<<18) | (MW_INTXBAR4_EPWM19_INT_SEL<<19) | (MW_INTXBAR4_EPWM20_INT_SEL<<20) | (MW_INTXBAR4_EPWM21_INT_SEL<<21) | (MW_INTXBAR4_EPWM22_INT_SEL<<22) | (MW_INTXBAR4_EPWM23_INT_SEL<<23) | (MW_INTXBAR4_EPWM24_INT_SEL<<24) | (MW_INTXBAR4_EPWM25_INT_SEL<<25) | (MW_INTXBAR4_EPWM26_INT_SEL<<26) | (MW_INTXBAR4_EPWM27_INT_SEL<<27) | (MW_INTXBAR4_EPWM28_INT_SEL<<28) | (MW_INTXBAR4_EPWM29_INT_SEL<<29) | (MW_INTXBAR4_EPWM30_INT_SEL<<30) | (MW_INTXBAR4_EPWM31_INT_SEL<<31);
    group1_mask[4] = (MW_INTXBAR4_EPWM0_TZINT_SEL<<0) | (MW_INTXBAR4_EPWM1_TZINT_SEL<<1) | (MW_INTXBAR4_EPWM2_TZINT_SEL<<2) | (MW_INTXBAR4_EPWM3_TZINT_SEL<<3) | (MW_INTXBAR4_EPWM4_TZINT_SEL<<4) | (MW_INTXBAR4_EPWM5_TZINT_SEL<<5) | (MW_INTXBAR4_EPWM6_TZINT_SEL<<6) | (MW_INTXBAR4_EPWM7_TZINT_SEL<<7) | (MW_INTXBAR4_EPWM8_TZINT_SEL<<8) | (MW_INTXBAR4_EPWM9_TZINT_SEL<<9) | (MW_INTXBAR4_EPWM10_TZINT_SEL<<10) | (MW_INTXBAR4_EPWM11_TZINT_SEL<<11) | (MW_INTXBAR4_EPWM12_TZINT_SEL<<12) | (MW_INTXBAR4_EPWM13_TZINT_SEL<<13) | (MW_INTXBAR4_EPWM14_TZINT_SEL<<14) | (MW_INTXBAR4_EPWM15_TZINT_SEL<<15) | (MW_INTXBAR4_EPWM16_TZINT_SEL<<16) | (MW_INTXBAR4_EPWM17_TZINT_SEL<<17) | (MW_INTXBAR4_EPWM18_TZINT_SEL<<18) | (MW_INTXBAR4_EPWM19_TZINT_SEL<<19) | (MW_INTXBAR4_EPWM20_TZINT_SEL<<20) | (MW_INTXBAR4_EPWM21_TZINT_SEL<<21) | (MW_INTXBAR4_EPWM22_TZINT_SEL<<22) | (MW_INTXBAR4_EPWM23_TZINT_SEL<<23) | (MW_INTXBAR4_EPWM24_TZINT_SEL<<24) | (MW_INTXBAR4_EPWM25_TZINT_SEL<<25) | (MW_INTXBAR4_EPWM26_TZINT_SEL<<26) | (MW_INTXBAR4_EPWM27_TZINT_SEL<<27) | (MW_INTXBAR4_EPWM28_TZINT_SEL<<28) | (MW_INTXBAR4_EPWM29_TZINT_SEL<<29) | (MW_INTXBAR4_EPWM30_TZINT_SEL<<30) | (MW_INTXBAR4_EPWM31_TZINT_SEL<<31);
    group2_mask[4] = (MW_INTXBAR4_ADC0_INT1_SEL<<0) | (MW_INTXBAR4_ADC0_INT2_SEL<<1) | (MW_INTXBAR4_ADC0_INT3_SEL<<2) | (MW_INTXBAR4_ADC0_INT4_SEL<<3) | (MW_INTXBAR4_ADC0_EVTINT_SEL<<4) | (MW_INTXBAR4_ADC1_INT1_SEL<<5) | (MW_INTXBAR4_ADC1_INT2_SEL<<6) | (MW_INTXBAR4_ADC1_INT3_SEL<<7) | (MW_INTXBAR4_ADC1_INT4_SEL<<8) | (MW_INTXBAR4_ADC1_EVTINT_SEL<<9) | (MW_INTXBAR4_ADC2_INT1_SEL<<10) | (MW_INTXBAR4_ADC2_INT2_SEL<<11) | (MW_INTXBAR4_ADC2_INT3_SEL<<12) | (MW_INTXBAR4_ADC2_INT4_SEL<<13) | (MW_INTXBAR4_ADC2_EVTINT_SEL<<14) | (MW_INTXBAR4_ADC3_INT1_SEL<<15) | (MW_INTXBAR4_ADC3_INT2_SEL<<16) | (MW_INTXBAR4_ADC3_INT3_SEL<<17) | (MW_INTXBAR4_ADC3_INT4_SEL<<18) | (MW_INTXBAR4_ADC3_EVTINT_SEL<<19) | (MW_INTXBAR4_ADC4_INT1_SEL<<20) | (MW_INTXBAR4_ADC4_INT2_SEL<<21) | (MW_INTXBAR4_ADC4_INT3_SEL<<22) | (MW_INTXBAR4_ADC4_INT4_SEL<<23) | (MW_INTXBAR4_ADC4_EVTINT_SEL<<24);
    group3_mask[4] = (MW_INTXBAR4_FSIRX0_INT1N_SEL<<0) | (MW_INTXBAR4_FSIRX0_INT2N_SEL<<1) | (MW_INTXBAR4_FSITX0_INT1N_SEL<<2) | (MW_INTXBAR4_FSITX0_INT2N_SEL<<3) | (MW_INTXBAR4_FSIRX1_INT1N_SEL<<4) | (MW_INTXBAR4_FSIRX1_INT2N_SEL<<5) | (MW_INTXBAR4_FSITX1_INT1N_SEL<<6) | (MW_INTXBAR4_FSITX1_INT2N_SEL<<7) | (MW_INTXBAR4_FSIRX2_INT1N_SEL<<8) | (MW_INTXBAR4_FSIRX2_INT2N_SEL<<9) | (MW_INTXBAR4_FSITX2_INT1N_SEL<<10) | (MW_INTXBAR4_FSITX2_INT2N_SEL<<11) | (MW_INTXBAR4_FSIRX3_INT1N_SEL<<12) | (MW_INTXBAR4_FSIRX3_INT2N_SEL<<13) | (MW_INTXBAR4_FSITX3_INT1N_SEL<<14) | (MW_INTXBAR4_FSITX3_INT2N_SEL<<15);
