TexasInstruments/am26x-hsp/src/am263px_init.c
    group4_mask[4] = (MW_INTXBAR4_SD0_ERR_SEL<<0) | (MW_INTXBAR4_SD0_FILT0_DRINT_SEL<<1) | (MW_INTXBAR4_SD0_FILT1_DRINT_SEL<<2) | (MW_INTXBAR4_SD0_FILT2_DRINT_SEL<<3) | (MW_INTXBAR4_SD0_FILT3_DRINT_SEL<<4) | (MW_INTXBAR4_SD1_ERR_SEL<<5) | (MW_INTXBAR4_SD1_FILT0_DRINT_SEL<<6) | (MW_INTXBAR4_SD1_FILT1_DRINT_SEL<<7) | (MW_INTXBAR4_SD1_FILT2_DRINT_SEL<<8) | (MW_INTXBAR4_SD1_FILT3_DRINT_SEL<<9);
    group5_mask[4] = (MW_INTXBAR4_ECAP0_INT_SEL<<0) | (MW_INTXBAR4_ECAP1_INT_SEL<<1) | (MW_INTXBAR4_ECAP2_INT_SEL<<2) | (MW_INTXBAR4_ECAP3_INT_SEL<<3) | (MW_INTXBAR4_ECAP4_INT_SEL<<4) | (MW_INTXBAR4_ECAP5_INT_SEL<<5) | (MW_INTXBAR4_ECAP6_INT_SEL<<6) | (MW_INTXBAR4_ECAP7_INT_SEL<<7) | (MW_INTXBAR4_ECAP8_INT_SEL<<8) | (MW_INTXBAR4_ECAP9_INT_SEL<<9);
    group6_mask[4] = (MW_INTXBAR4_EQEP0_INT_SEL<<0) | (MW_INTXBAR4_EQEP1_INT_SEL<<1) | (MW_INTXBAR4_EQEP2_INT_SEL<<2);
    group0_mask[5] = (MW_INTXBAR5_EPWM0_INT_SEL<<0) | (MW_INTXBAR5_EPWM1_INT_SEL<<1) | (MW_INTXBAR5_EPWM2_INT_SEL<<2) | (MW_INTXBAR5_EPWM3_INT_SEL<<3) | (MW_INTXBAR5_EPWM4_INT_SEL<<4) | (MW_INTXBAR5_EPWM5_INT_SEL<<5) | (MW_INTXBAR5_EPWM6_INT_SEL<<6) | (MW_INTXBAR5_EPWM7_INT_SEL<<7) | (MW_INTXBAR5_EPWM8_INT_SEL<<8) | (MW_INTXBAR5_EPWM9_INT_SEL<<9) | (MW_INTXBAR5_EPWM10_INT_SEL<<10) | (MW_INTXBAR5_EPWM11_INT_SEL<<11) | (MW_INTXBAR5_EPWM12_INT_SEL<<12) | (MW_INTXBAR5_EPWM13_INT_SEL<<13) | (MW_INTXBAR5_EPWM14_INT_SEL<<14) | (MW_INTXBAR5_EPWM15_INT_SEL<<15) | (MW_INTXBAR5_EPWM16_INT_SEL<<16) | (MW_INTXBAR5_EPWM17_INT_SEL<<17) | (MW_INTXBAR5_EPWM18_INT_SEL<<18) | (MW_INTXBAR5_EPWM19_INT_SEL<<19) | (MW_INTXBAR5_EPWM20_INT_SEL<<20) | (MW_INTXBAR5_EPWM21_INT_SEL<<21) | (MW_INTXBAR5_EPWM22_INT_SEL<<22) | (MW_INTXBAR5_EPWM23_INT_SEL<<23) | (MW_INTXBAR5_EPWM24_INT_SEL<<24) | (MW_INTXBAR5_EPWM25_INT_SEL<<25) | (MW_INTXBAR5_EPWM26_INT_SEL<<26) | (MW_INTXBAR5_EPWM27_INT_SEL<<27) | (MW_INTXBAR5_EPWM28_INT_SEL<<28) | (MW_INTXBAR5_EPWM29_INT_SEL<<29) | (MW_INTXBAR5_EPWM30_INT_SEL<<30) | (MW_INTXBAR5_EPWM31_INT_SEL<<31);
    group1_mask[5] = (MW_INTXBAR5_EPWM0_TZINT_SEL<<0) | (MW_INTXBAR5_EPWM1_TZINT_SEL<<1) | (MW_INTXBAR5_EPWM2_TZINT_SEL<<2) | (MW_INTXBAR5_EPWM3_TZINT_SEL<<3) | (MW_INTXBAR5_EPWM4_TZINT_SEL<<4) | (MW_INTXBAR5_EPWM5_TZINT_SEL<<5) | (MW_INTXBAR5_EPWM6_TZINT_SEL<<6) | (MW_INTXBAR5_EPWM7_TZINT_SEL<<7) | (MW_INTXBAR5_EPWM8_TZINT_SEL<<8) | (MW_INTXBAR5_EPWM9_TZINT_SEL<<9) | (MW_INTXBAR5_EPWM10_TZINT_SEL<<10) | (MW_INTXBAR5_EPWM11_TZINT_SEL<<11) | (MW_INTXBAR5_EPWM12_TZINT_SEL<<12) | (MW_INTXBAR5_EPWM13_TZINT_SEL<<13) | (MW_INTXBAR5_EPWM14_TZINT_SEL<<14) | (MW_INTXBAR5_EPWM15_TZINT_SEL<<15) | (MW_INTXBAR5_EPWM16_TZINT_SEL<<16) | (MW_INTXBAR5_EPWM17_TZINT_SEL<<17) | (MW_INTXBAR5_EPWM18_TZINT_SEL<<18) | (MW_INTXBAR5_EPWM19_TZINT_SEL<<19) | (MW_INTXBAR5_EPWM20_TZINT_SEL<<20) | (MW_INTXBAR5_EPWM21_TZINT_SEL<<21) | (MW_INTXBAR5_EPWM22_TZINT_SEL<<22) | (MW_INTXBAR5_EPWM23_TZINT_SEL<<23) | (MW_INTXBAR5_EPWM24_TZINT_SEL<<24) | (MW_INTXBAR5_EPWM25_TZINT_SEL<<25) | (MW_INTXBAR5_EPWM26_TZINT_SEL<<26) | (MW_INTXBAR5_EPWM27_TZINT_SEL<<27) | (MW_INTXBAR5_EPWM28_TZINT_SEL<<28) | (MW_INTXBAR5_EPWM29_TZINT_SEL<<29) | (MW_INTXBAR5_EPWM30_TZINT_SEL<<30) | (MW_INTXBAR5_EPWM31_TZINT_SEL<<31);
    group2_mask[5] = (MW_INTXBAR5_ADC0_INT1_SEL<<0) | (MW_INTXBAR5_ADC0_INT2_SEL<<1) | (MW_INTXBAR5_ADC0_INT3_SEL<<2) | (MW_INTXBAR5_ADC0_INT4_SEL<<3) | (MW_INTXBAR5_ADC0_EVTINT_SEL<<4) | (MW_INTXBAR5_ADC1_INT1_SEL<<5) | (MW_INTXBAR5_ADC1_INT2_SEL<<6) | (MW_INTXBAR5_ADC1_INT3_SEL<<7) | (MW_INTXBAR5_ADC1_INT4_SEL<<8) | (MW_INTXBAR5_ADC1_EVTINT_SEL<<9) | (MW_INTXBAR5_ADC2_INT1_SEL<<10) | (MW_INTXBAR5_ADC2_INT2_SEL<<11) | (MW_INTXBAR5_ADC2_INT3_SEL<<12) | (MW_INTXBAR5_ADC2_INT4_SEL<<13) | (MW_INTXBAR5_ADC2_EVTINT_SEL<<14) | (MW_INTXBAR5_ADC3_INT1_SEL<<15) | (MW_INTXBAR5_ADC3_INT2_SEL<<16) | (MW_INTXBAR5_ADC3_INT3_SEL<<17) | (MW_INTXBAR5_ADC3_INT4_SEL<<18) | (MW_INTXBAR5_ADC3_EVTINT_SEL<<19) | (MW_INTXBAR5_ADC4_INT1_SEL<<20) | (MW_INTXBAR5_ADC4_INT2_SEL<<21) | (MW_INTXBAR5_ADC4_INT3_SEL<<22) | (MW_INTXBAR5_ADC4_INT4_SEL<<23) | (MW_INTXBAR5_ADC4_EVTINT_SEL<<24);
    group3_mask[5] = (MW_INTXBAR5_FSIRX0_INT1N_SEL<<0) | (MW_INTXBAR5_FSIRX0_INT2N_SEL<<1) | (MW_INTXBAR5_FSITX0_INT1N_SEL<<2) | (MW_INTXBAR5_FSITX0_INT2N_SEL<<3) | (MW_INTXBAR5_FSIRX1_INT1N_SEL<<4) | (MW_INTXBAR5_FSIRX1_INT2N_SEL<<5) | (MW_INTXBAR5_FSITX1_INT1N_SEL<<6) | (MW_INTXBAR5_FSITX1_INT2N_SEL<<7) | (MW_INTXBAR5_FSIRX2_INT1N_SEL<<8) | (MW_INTXBAR5_FSIRX2_INT2N_SEL<<9) | (MW_INTXBAR5_FSITX2_INT1N_SEL<<10) | (MW_INTXBAR5_FSITX2_INT2N_SEL<<11) | (MW_INTXBAR5_FSIRX3_INT1N_SEL<<12) | (MW_INTXBAR5_FSIRX3_INT2N_SEL<<13) | (MW_INTXBAR5_FSITX3_INT1N_SEL<<14) | (MW_INTXBAR5_FSITX3_INT2N_SEL<<15);
    group4_mask[5] = (MW_INTXBAR5_SD0_ERR_SEL<<0) | (MW_INTXBAR5_SD0_FILT0_DRINT_SEL<<1) | (MW_INTXBAR5_SD0_FILT1_DRINT_SEL<<2) | (MW_INTXBAR5_SD0_FILT2_DRINT_SEL<<3) | (MW_INTXBAR5_SD0_FILT3_DRINT_SEL<<4) | (MW_INTXBAR5_SD1_ERR_SEL<<5) | (MW_INTXBAR5_SD1_FILT0_DRINT_SEL<<6) | (MW_INTXBAR5_SD1_FILT1_DRINT_SEL<<7) | (MW_INTXBAR5_SD1_FILT2_DRINT_SEL<<8) | (MW_INTXBAR5_SD1_FILT3_DRINT_SEL<<9);
    group5_mask[5] = (MW_INTXBAR5_ECAP0_INT_SEL<<0) | (MW_INTXBAR5_ECAP1_INT_SEL<<1) | (MW_INTXBAR5_ECAP2_INT_SEL<<2) | (MW_INTXBAR5_ECAP3_INT_SEL<<3) | (MW_INTXBAR5_ECAP4_INT_SEL<<4) | (MW_INTXBAR5_ECAP5_INT_SEL<<5) | (MW_INTXBAR5_ECAP6_INT_SEL<<6) | (MW_INTXBAR5_ECAP7_INT_SEL<<7) | (MW_INTXBAR5_ECAP8_INT_SEL<<8) | (MW_INTXBAR5_ECAP9_INT_SEL<<9);
    group6_mask[5] = (MW_INTXBAR5_EQEP0_INT_SEL<<0) | (MW_INTXBAR5_EQEP1_INT_SEL<<1) | (MW_INTXBAR5_EQEP2_INT_SEL<<2);
    group0_mask[6] = (MW_INTXBAR6_EPWM0_INT_SEL<<0) | (MW_INTXBAR6_EPWM1_INT_SEL<<1) | (MW_INTXBAR6_EPWM2_INT_SEL<<2) | (MW_INTXBAR6_EPWM3_INT_SEL<<3) | (MW_INTXBAR6_EPWM4_INT_SEL<<4) | (MW_INTXBAR6_EPWM5_INT_SEL<<5) | (MW_INTXBAR6_EPWM6_INT_SEL<<6) | (MW_INTXBAR6_EPWM7_INT_SEL<<7) | (MW_INTXBAR6_EPWM8_INT_SEL<<8) | (MW_INTXBAR6_EPWM9_INT_SEL<<9) | (MW_INTXBAR6_EPWM10_INT_SEL<<10) | (MW_INTXBAR6_EPWM11_INT_SEL<<11) | (MW_INTXBAR6_EPWM12_INT_SEL<<12) | (MW_INTXBAR6_EPWM13_INT_SEL<<13) | (MW_INTXBAR6_EPWM14_INT_SEL<<14) | (MW_INTXBAR6_EPWM15_INT_SEL<<15) | (MW_INTXBAR6_EPWM16_INT_SEL<<16) | (MW_INTXBAR6_EPWM17_INT_SEL<<17) | (MW_INTXBAR6_EPWM18_INT_SEL<<18) | (MW_INTXBAR6_EPWM19_INT_SEL<<19) | (MW_INTXBAR6_EPWM20_INT_SEL<<20) | (MW_INTXBAR6_EPWM21_INT_SEL<<21) | (MW_INTXBAR6_EPWM22_INT_SEL<<22) | (MW_INTXBAR6_EPWM23_INT_SEL<<23) | (MW_INTXBAR6_EPWM24_INT_SEL<<24) | (MW_INTXBAR6_EPWM25_INT_SEL<<25) | (MW_INTXBAR6_EPWM26_INT_SEL<<26) | (MW_INTXBAR6_EPWM27_INT_SEL<<27) | (MW_INTXBAR6_EPWM28_INT_SEL<<28) | (MW_INTXBAR6_EPWM29_INT_SEL<<29) | (MW_INTXBAR6_EPWM30_INT_SEL<<30) | (MW_INTXBAR6_EPWM31_INT_SEL<<31);
    group1_mask[6] = (MW_INTXBAR6_EPWM0_TZINT_SEL<<0) | (MW_INTXBAR6_EPWM1_TZINT_SEL<<1) | (MW_INTXBAR6_EPWM2_TZINT_SEL<<2) | (MW_INTXBAR6_EPWM3_TZINT_SEL<<3) | (MW_INTXBAR6_EPWM4_TZINT_SEL<<4) | (MW_INTXBAR6_EPWM5_TZINT_SEL<<5) | (MW_INTXBAR6_EPWM6_TZINT_SEL<<6) | (MW_INTXBAR6_EPWM7_TZINT_SEL<<7) | (MW_INTXBAR6_EPWM8_TZINT_SEL<<8) | (MW_INTXBAR6_EPWM9_TZINT_SEL<<9) | (MW_INTXBAR6_EPWM10_TZINT_SEL<<10) | (MW_INTXBAR6_EPWM11_TZINT_SEL<<11) | (MW_INTXBAR6_EPWM12_TZINT_SEL<<12) | (MW_INTXBAR6_EPWM13_TZINT_SEL<<13) | (MW_INTXBAR6_EPWM14_TZINT_SEL<<14) | (MW_INTXBAR6_EPWM15_TZINT_SEL<<15) | (MW_INTXBAR6_EPWM16_TZINT_SEL<<16) | (MW_INTXBAR6_EPWM17_TZINT_SEL<<17) | (MW_INTXBAR6_EPWM18_TZINT_SEL<<18) | (MW_INTXBAR6_EPWM19_TZINT_SEL<<19) | (MW_INTXBAR6_EPWM20_TZINT_SEL<<20) | (MW_INTXBAR6_EPWM21_TZINT_SEL<<21) | (MW_INTXBAR6_EPWM22_TZINT_SEL<<22) | (MW_INTXBAR6_EPWM23_TZINT_SEL<<23) | (MW_INTXBAR6_EPWM24_TZINT_SEL<<24) | (MW_INTXBAR6_EPWM25_TZINT_SEL<<25) | (MW_INTXBAR6_EPWM26_TZINT_SEL<<26) | (MW_INTXBAR6_EPWM27_TZINT_SEL<<27) | (MW_INTXBAR6_EPWM28_TZINT_SEL<<28) | (MW_INTXBAR6_EPWM29_TZINT_SEL<<29) | (MW_INTXBAR6_EPWM30_TZINT_SEL<<30) | (MW_INTXBAR6_EPWM31_TZINT_SEL<<31);
    group2_mask[6] = (MW_INTXBAR6_ADC0_INT1_SEL<<0) | (MW_INTXBAR6_ADC0_INT2_SEL<<1) | (MW_INTXBAR6_ADC0_INT3_SEL<<2) | (MW_INTXBAR6_ADC0_INT4_SEL<<3) | (MW_INTXBAR6_ADC0_EVTINT_SEL<<4) | (MW_INTXBAR6_ADC1_INT1_SEL<<5) | (MW_INTXBAR6_ADC1_INT2_SEL<<6) | (MW_INTXBAR6_ADC1_INT3_SEL<<7) | (MW_INTXBAR6_ADC1_INT4_SEL<<8) | (MW_INTXBAR6_ADC1_EVTINT_SEL<<9) | (MW_INTXBAR6_ADC2_INT1_SEL<<10) | (MW_INTXBAR6_ADC2_INT2_SEL<<11) | (MW_INTXBAR6_ADC2_INT3_SEL<<12) | (MW_INTXBAR6_ADC2_INT4_SEL<<13) | (MW_INTXBAR6_ADC2_EVTINT_SEL<<14) | (MW_INTXBAR6_ADC3_INT1_SEL<<15) | (MW_INTXBAR6_ADC3_INT2_SEL<<16) | (MW_INTXBAR6_ADC3_INT3_SEL<<17) | (MW_INTXBAR6_ADC3_INT4_SEL<<18) | (MW_INTXBAR6_ADC3_EVTINT_SEL<<19) | (MW_INTXBAR6_ADC4_INT1_SEL<<20) | (MW_INTXBAR6_ADC4_INT2_SEL<<21) | (MW_INTXBAR6_ADC4_INT3_SEL<<22) | (MW_INTXBAR6_ADC4_INT4_SEL<<23) | (MW_INTXBAR6_ADC4_EVTINT_SEL<<24);
    group3_mask[6] = (MW_INTXBAR6_FSIRX0_INT1N_SEL<<0) | (MW_INTXBAR6_FSIRX0_INT2N_SEL<<1) | (MW_INTXBAR6_FSITX0_INT1N_SEL<<2) | (MW_INTXBAR6_FSITX0_INT2N_SEL<<3) | (MW_INTXBAR6_FSIRX1_INT1N_SEL<<4) | (MW_INTXBAR6_FSIRX1_INT2N_SEL<<5) | (MW_INTXBAR6_FSITX1_INT1N_SEL<<6) | (MW_INTXBAR6_FSITX1_INT2N_SEL<<7) | (MW_INTXBAR6_FSIRX2_INT1N_SEL<<8) | (MW_INTXBAR6_FSIRX2_INT2N_SEL<<9) | (MW_INTXBAR6_FSITX2_INT1N_SEL<<10) | (MW_INTXBAR6_FSITX2_INT2N_SEL<<11) | (MW_INTXBAR6_FSIRX3_INT1N_SEL<<12) | (MW_INTXBAR6_FSIRX3_INT2N_SEL<<13) | (MW_INTXBAR6_FSITX3_INT1N_SEL<<14) | (MW_INTXBAR6_FSITX3_INT2N_SEL<<15);
    group4_mask[6] = (MW_INTXBAR6_SD0_ERR_SEL<<0) | (MW_INTXBAR6_SD0_FILT0_DRINT_SEL<<1) | (MW_INTXBAR6_SD0_FILT1_DRINT_SEL<<2) | (MW_INTXBAR6_SD0_FILT2_DRINT_SEL<<3) | (MW_INTXBAR6_SD0_FILT3_DRINT_SEL<<4) | (MW_INTXBAR6_SD1_ERR_SEL<<5) | (MW_INTXBAR6_SD1_FILT0_DRINT_SEL<<6) | (MW_INTXBAR6_SD1_FILT1_DRINT_SEL<<7) | (MW_INTXBAR6_SD1_FILT2_DRINT_SEL<<8) | (MW_INTXBAR6_SD1_FILT3_DRINT_SEL<<9);
    group5_mask[6] = (MW_INTXBAR6_ECAP0_INT_SEL<<0) | (MW_INTXBAR6_ECAP1_INT_SEL<<1) | (MW_INTXBAR6_ECAP2_INT_SEL<<2) | (MW_INTXBAR6_ECAP3_INT_SEL<<3) | (MW_INTXBAR6_ECAP4_INT_SEL<<4) | (MW_INTXBAR6_ECAP5_INT_SEL<<5) | (MW_INTXBAR6_ECAP6_INT_SEL<<6) | (MW_INTXBAR6_ECAP7_INT_SEL<<7) | (MW_INTXBAR6_ECAP8_INT_SEL<<8) | (MW_INTXBAR6_ECAP9_INT_SEL<<9);
    group6_mask[6] = (MW_INTXBAR6_EQEP0_INT_SEL<<0) | (MW_INTXBAR6_EQEP1_INT_SEL<<1) | (MW_INTXBAR6_EQEP2_INT_SEL<<2);
    group0_mask[7] = (MW_INTXBAR7_EPWM0_INT_SEL<<0) | (MW_INTXBAR7_EPWM1_INT_SEL<<1) | (MW_INTXBAR7_EPWM2_INT_SEL<<2) | (MW_INTXBAR7_EPWM3_INT_SEL<<3) | (MW_INTXBAR7_EPWM4_INT_SEL<<4) | (MW_INTXBAR7_EPWM5_INT_SEL<<5) | (MW_INTXBAR7_EPWM6_INT_SEL<<6) | (MW_INTXBAR7_EPWM7_INT_SEL<<7) | (MW_INTXBAR7_EPWM8_INT_SEL<<8) | (MW_INTXBAR7_EPWM9_INT_SEL<<9) | (MW_INTXBAR7_EPWM10_INT_SEL<<10) | (MW_INTXBAR7_EPWM11_INT_SEL<<11) | (MW_INTXBAR7_EPWM12_INT_SEL<<12) | (MW_INTXBAR7_EPWM13_INT_SEL<<13) | (MW_INTXBAR7_EPWM14_INT_SEL<<14) | (MW_INTXBAR7_EPWM15_INT_SEL<<15) | (MW_INTXBAR7_EPWM16_INT_SEL<<16) | (MW_INTXBAR7_EPWM17_INT_SEL<<17) | (MW_INTXBAR7_EPWM18_INT_SEL<<18) | (MW_INTXBAR7_EPWM19_INT_SEL<<19) | (MW_INTXBAR7_EPWM20_INT_SEL<<20) | (MW_INTXBAR7_EPWM21_INT_SEL<<21) | (MW_INTXBAR7_EPWM22_INT_SEL<<22) | (MW_INTXBAR7_EPWM23_INT_SEL<<23) | (MW_INTXBAR7_EPWM24_INT_SEL<<24) | (MW_INTXBAR7_EPWM25_INT_SEL<<25) | (MW_INTXBAR7_EPWM26_INT_SEL<<26) | (MW_INTXBAR7_EPWM27_INT_SEL<<27) | (MW_INTXBAR7_EPWM28_INT_SEL<<28) | (MW_INTXBAR7_EPWM29_INT_SEL<<29) | (MW_INTXBAR7_EPWM30_INT_SEL<<30) | (MW_INTXBAR7_EPWM31_INT_SEL<<31);
    group1_mask[7] = (MW_INTXBAR7_EPWM0_TZINT_SEL<<0) | (MW_INTXBAR7_EPWM1_TZINT_SEL<<1) | (MW_INTXBAR7_EPWM2_TZINT_SEL<<2) | (MW_INTXBAR7_EPWM3_TZINT_SEL<<3) | (MW_INTXBAR7_EPWM4_TZINT_SEL<<4) | (MW_INTXBAR7_EPWM5_TZINT_SEL<<5) | (MW_INTXBAR7_EPWM6_TZINT_SEL<<6) | (MW_INTXBAR7_EPWM7_TZINT_SEL<<7) | (MW_INTXBAR7_EPWM8_TZINT_SEL<<8) | (MW_INTXBAR7_EPWM9_TZINT_SEL<<9) | (MW_INTXBAR7_EPWM10_TZINT_SEL<<10) | (MW_INTXBAR7_EPWM11_TZINT_SEL<<11) | (MW_INTXBAR7_EPWM12_TZINT_SEL<<12) | (MW_INTXBAR7_EPWM13_TZINT_SEL<<13) | (MW_INTXBAR7_EPWM14_TZINT_SEL<<14) | (MW_INTXBAR7_EPWM15_TZINT_SEL<<15) | (MW_INTXBAR7_EPWM16_TZINT_SEL<<16) | (MW_INTXBAR7_EPWM17_TZINT_SEL<<17) | (MW_INTXBAR7_EPWM18_TZINT_SEL<<18) | (MW_INTXBAR7_EPWM19_TZINT_SEL<<19) | (MW_INTXBAR7_EPWM20_TZINT_SEL<<20) | (MW_INTXBAR7_EPWM21_TZINT_SEL<<21) | (MW_INTXBAR7_EPWM22_TZINT_SEL<<22) | (MW_INTXBAR7_EPWM23_TZINT_SEL<<23) | (MW_INTXBAR7_EPWM24_TZINT_SEL<<24) | (MW_INTXBAR7_EPWM25_TZINT_SEL<<25) | (MW_INTXBAR7_EPWM26_TZINT_SEL<<26) | (MW_INTXBAR7_EPWM27_TZINT_SEL<<27) | (MW_INTXBAR7_EPWM28_TZINT_SEL<<28) | (MW_INTXBAR7_EPWM29_TZINT_SEL<<29) | (MW_INTXBAR7_EPWM30_TZINT_SEL<<30) | (MW_INTXBAR7_EPWM31_TZINT_SEL<<31);
    group2_mask[7] = (MW_INTXBAR7_ADC0_INT1_SEL<<0) | (MW_INTXBAR7_ADC0_INT2_SEL<<1) | (MW_INTXBAR7_ADC0_INT3_SEL<<2) | (MW_INTXBAR7_ADC0_INT4_SEL<<3) | (MW_INTXBAR7_ADC0_EVTINT_SEL<<4) | (MW_INTXBAR7_ADC1_INT1_SEL<<5) | (MW_INTXBAR7_ADC1_INT2_SEL<<6) | (MW_INTXBAR7_ADC1_INT3_SEL<<7) | (MW_INTXBAR7_ADC1_INT4_SEL<<8) | (MW_INTXBAR7_ADC1_EVTINT_SEL<<9) | (MW_INTXBAR7_ADC2_INT1_SEL<<10) | (MW_INTXBAR7_ADC2_INT2_SEL<<11) | (MW_INTXBAR7_ADC2_INT3_SEL<<12) | (MW_INTXBAR7_ADC2_INT4_SEL<<13) | (MW_INTXBAR7_ADC2_EVTINT_SEL<<14) | (MW_INTXBAR7_ADC3_INT1_SEL<<15) | (MW_INTXBAR7_ADC3_INT2_SEL<<16) | (MW_INTXBAR7_ADC3_INT3_SEL<<17) | (MW_INTXBAR7_ADC3_INT4_SEL<<18) | (MW_INTXBAR7_ADC3_EVTINT_SEL<<19) | (MW_INTXBAR7_ADC4_INT1_SEL<<20) | (MW_INTXBAR7_ADC4_INT2_SEL<<21) | (MW_INTXBAR7_ADC4_INT3_SEL<<22) | (MW_INTXBAR7_ADC4_INT4_SEL<<23) | (MW_INTXBAR7_ADC4_EVTINT_SEL<<24);
    group3_mask[7] = (MW_INTXBAR7_FSIRX0_INT1N_SEL<<0) | (MW_INTXBAR7_FSIRX0_INT2N_SEL<<1) | (MW_INTXBAR7_FSITX0_INT1N_SEL<<2) | (MW_INTXBAR7_FSITX0_INT2N_SEL<<3) | (MW_INTXBAR7_FSIRX1_INT1N_SEL<<4) | (MW_INTXBAR7_FSIRX1_INT2N_SEL<<5) | (MW_INTXBAR7_FSITX1_INT1N_SEL<<6) | (MW_INTXBAR7_FSITX1_INT2N_SEL<<7) | (MW_INTXBAR7_FSIRX2_INT1N_SEL<<8) | (MW_INTXBAR7_FSIRX2_INT2N_SEL<<9) | (MW_INTXBAR7_FSITX2_INT1N_SEL<<10) | (MW_INTXBAR7_FSITX2_INT2N_SEL<<11) | (MW_INTXBAR7_FSIRX3_INT1N_SEL<<12) | (MW_INTXBAR7_FSIRX3_INT2N_SEL<<13) | (MW_INTXBAR7_FSITX3_INT1N_SEL<<14) | (MW_INTXBAR7_FSITX3_INT2N_SEL<<15);
    group4_mask[7] = (MW_INTXBAR7_SD0_ERR_SEL<<0) | (MW_INTXBAR7_SD0_FILT0_DRINT_SEL<<1) | (MW_INTXBAR7_SD0_FILT1_DRINT_SEL<<2) | (MW_INTXBAR7_SD0_FILT2_DRINT_SEL<<3) | (MW_INTXBAR7_SD0_FILT3_DRINT_SEL<<4) | (MW_INTXBAR7_SD1_ERR_SEL<<5) | (MW_INTXBAR7_SD1_FILT0_DRINT_SEL<<6) | (MW_INTXBAR7_SD1_FILT1_DRINT_SEL<<7) | (MW_INTXBAR7_SD1_FILT2_DRINT_SEL<<8) | (MW_INTXBAR7_SD1_FILT3_DRINT_SEL<<9);
    group5_mask[7] = (MW_INTXBAR7_ECAP0_INT_SEL<<0) | (MW_INTXBAR7_ECAP1_INT_SEL<<1) | (MW_INTXBAR7_ECAP2_INT_SEL<<2) | (MW_INTXBAR7_ECAP3_INT_SEL<<3) | (MW_INTXBAR7_ECAP4_INT_SEL<<4) | (MW_INTXBAR7_ECAP5_INT_SEL<<5) | (MW_INTXBAR7_ECAP6_INT_SEL<<6) | (MW_INTXBAR7_ECAP7_INT_SEL<<7) | (MW_INTXBAR7_ECAP8_INT_SEL<<8) | (MW_INTXBAR7_ECAP9_INT_SEL<<9);
    group6_mask[7] = (MW_INTXBAR7_EQEP0_INT_SEL<<0) | (MW_INTXBAR7_EQEP1_INT_SEL<<1) | (MW_INTXBAR7_EQEP2_INT_SEL<<2);
    group0_mask[8] = (MW_INTXBAR8_EPWM0_INT_SEL<<0) | (MW_INTXBAR8_EPWM1_INT_SEL<<1) | (MW_INTXBAR8_EPWM2_INT_SEL<<2) | (MW_INTXBAR8_EPWM3_INT_SEL<<3) | (MW_INTXBAR8_EPWM4_INT_SEL<<4) | (MW_INTXBAR8_EPWM5_INT_SEL<<5) | (MW_INTXBAR8_EPWM6_INT_SEL<<6) | (MW_INTXBAR8_EPWM7_INT_SEL<<7) | (MW_INTXBAR8_EPWM8_INT_SEL<<8) | (MW_INTXBAR8_EPWM9_INT_SEL<<9) | (MW_INTXBAR8_EPWM10_INT_SEL<<10) | (MW_INTXBAR8_EPWM11_INT_SEL<<11) | (MW_INTXBAR8_EPWM12_INT_SEL<<12) | (MW_INTXBAR8_EPWM13_INT_SEL<<13) | (MW_INTXBAR8_EPWM14_INT_SEL<<14) | (MW_INTXBAR8_EPWM15_INT_SEL<<15) | (MW_INTXBAR8_EPWM16_INT_SEL<<16) | (MW_INTXBAR8_EPWM17_INT_SEL<<17) | (MW_INTXBAR8_EPWM18_INT_SEL<<18) | (MW_INTXBAR8_EPWM19_INT_SEL<<19) | (MW_INTXBAR8_EPWM20_INT_SEL<<20) | (MW_INTXBAR8_EPWM21_INT_SEL<<21) | (MW_INTXBAR8_EPWM22_INT_SEL<<22) | (MW_INTXBAR8_EPWM23_INT_SEL<<23) | (MW_INTXBAR8_EPWM24_INT_SEL<<24) | (MW_INTXBAR8_EPWM25_INT_SEL<<25) | (MW_INTXBAR8_EPWM26_INT_SEL<<26) | (MW_INTXBAR8_EPWM27_INT_SEL<<27) | (MW_INTXBAR8_EPWM28_INT_SEL<<28) | (MW_INTXBAR8_EPWM29_INT_SEL<<29) | (MW_INTXBAR8_EPWM30_INT_SEL<<30) | (MW_INTXBAR8_EPWM31_INT_SEL<<31);
    group1_mask[8] = (MW_INTXBAR8_EPWM0_TZINT_SEL<<0) | (MW_INTXBAR8_EPWM1_TZINT_SEL<<1) | (MW_INTXBAR8_EPWM2_TZINT_SEL<<2) | (MW_INTXBAR8_EPWM3_TZINT_SEL<<3) | (MW_INTXBAR8_EPWM4_TZINT_SEL<<4) | (MW_INTXBAR8_EPWM5_TZINT_SEL<<5) | (MW_INTXBAR8_EPWM6_TZINT_SEL<<6) | (MW_INTXBAR8_EPWM7_TZINT_SEL<<7) | (MW_INTXBAR8_EPWM8_TZINT_SEL<<8) | (MW_INTXBAR8_EPWM9_TZINT_SEL<<9) | (MW_INTXBAR8_EPWM10_TZINT_SEL<<10) | (MW_INTXBAR8_EPWM11_TZINT_SEL<<11) | (MW_INTXBAR8_EPWM12_TZINT_SEL<<12) | (MW_INTXBAR8_EPWM13_TZINT_SEL<<13) | (MW_INTXBAR8_EPWM14_TZINT_SEL<<14) | (MW_INTXBAR8_EPWM15_TZINT_SEL<<15) | (MW_INTXBAR8_EPWM16_TZINT_SEL<<16) | (MW_INTXBAR8_EPWM17_TZINT_SEL<<17) | (MW_INTXBAR8_EPWM18_TZINT_SEL<<18) | (MW_INTXBAR8_EPWM19_TZINT_SEL<<19) | (MW_INTXBAR8_EPWM20_TZINT_SEL<<20) | (MW_INTXBAR8_EPWM21_TZINT_SEL<<21) | (MW_INTXBAR8_EPWM22_TZINT_SEL<<22) | (MW_INTXBAR8_EPWM23_TZINT_SEL<<23) | (MW_INTXBAR8_EPWM24_TZINT_SEL<<24) | (MW_INTXBAR8_EPWM25_TZINT_SEL<<25) | (MW_INTXBAR8_EPWM26_TZINT_SEL<<26) | (MW_INTXBAR8_EPWM27_TZINT_SEL<<27) | (MW_INTXBAR8_EPWM28_TZINT_SEL<<28) | (MW_INTXBAR8_EPWM29_TZINT_SEL<<29) | (MW_INTXBAR8_EPWM30_TZINT_SEL<<30) | (MW_INTXBAR8_EPWM31_TZINT_SEL<<31);
    group2_mask[8] = (MW_INTXBAR8_ADC0_INT1_SEL<<0) | (MW_INTXBAR8_ADC0_INT2_SEL<<1) | (MW_INTXBAR8_ADC0_INT3_SEL<<2) | (MW_INTXBAR8_ADC0_INT4_SEL<<3) | (MW_INTXBAR8_ADC0_EVTINT_SEL<<4) | (MW_INTXBAR8_ADC1_INT1_SEL<<5) | (MW_INTXBAR8_ADC1_INT2_SEL<<6) | (MW_INTXBAR8_ADC1_INT3_SEL<<7) | (MW_INTXBAR8_ADC1_INT4_SEL<<8) | (MW_INTXBAR8_ADC1_EVTINT_SEL<<9) | (MW_INTXBAR8_ADC2_INT1_SEL<<10) | (MW_INTXBAR8_ADC2_INT2_SEL<<11) | (MW_INTXBAR8_ADC2_INT3_SEL<<12) | (MW_INTXBAR8_ADC2_INT4_SEL<<13) | (MW_INTXBAR8_ADC2_EVTINT_SEL<<14) | (MW_INTXBAR8_ADC3_INT1_SEL<<15) | (MW_INTXBAR8_ADC3_INT2_SEL<<16) | (MW_INTXBAR8_ADC3_INT3_SEL<<17) | (MW_INTXBAR8_ADC3_INT4_SEL<<18) | (MW_INTXBAR8_ADC3_EVTINT_SEL<<19) | (MW_INTXBAR8_ADC4_INT1_SEL<<20) | (MW_INTXBAR8_ADC4_INT2_SEL<<21) | (MW_INTXBAR8_ADC4_INT3_SEL<<22) | (MW_INTXBAR8_ADC4_INT4_SEL<<23) | (MW_INTXBAR8_ADC4_EVTINT_SEL<<24);
    group3_mask[8] = (MW_INTXBAR8_FSIRX0_INT1N_SEL<<0) | (MW_INTXBAR8_FSIRX0_INT2N_SEL<<1) | (MW_INTXBAR8_FSITX0_INT1N_SEL<<2) | (MW_INTXBAR8_FSITX0_INT2N_SEL<<3) | (MW_INTXBAR8_FSIRX1_INT1N_SEL<<4) | (MW_INTXBAR8_FSIRX1_INT2N_SEL<<5) | (MW_INTXBAR8_FSITX1_INT1N_SEL<<6) | (MW_INTXBAR8_FSITX1_INT2N_SEL<<7) | (MW_INTXBAR8_FSIRX2_INT1N_SEL<<8) | (MW_INTXBAR8_FSIRX2_INT2N_SEL<<9) | (MW_INTXBAR8_FSITX2_INT1N_SEL<<10) | (MW_INTXBAR8_FSITX2_INT2N_SEL<<11) | (MW_INTXBAR8_FSIRX3_INT1N_SEL<<12) | (MW_INTXBAR8_FSIRX3_INT2N_SEL<<13) | (MW_INTXBAR8_FSITX3_INT1N_SEL<<14) | (MW_INTXBAR8_FSITX3_INT2N_SEL<<15);
    group4_mask[8] = (MW_INTXBAR8_SD0_ERR_SEL<<0) | (MW_INTXBAR8_SD0_FILT0_DRINT_SEL<<1) | (MW_INTXBAR8_SD0_FILT1_DRINT_SEL<<2) | (MW_INTXBAR8_SD0_FILT2_DRINT_SEL<<3) | (MW_INTXBAR8_SD0_FILT3_DRINT_SEL<<4) | (MW_INTXBAR8_SD1_ERR_SEL<<5) | (MW_INTXBAR8_SD1_FILT0_DRINT_SEL<<6) | (MW_INTXBAR8_SD1_FILT1_DRINT_SEL<<7) | (MW_INTXBAR8_SD1_FILT2_DRINT_SEL<<8) | (MW_INTXBAR8_SD1_FILT3_DRINT_SEL<<9);
    group5_mask[8] = (MW_INTXBAR8_ECAP0_INT_SEL<<0) | (MW_INTXBAR8_ECAP1_INT_SEL<<1) | (MW_INTXBAR8_ECAP2_INT_SEL<<2) | (MW_INTXBAR8_ECAP3_INT_SEL<<3) | (MW_INTXBAR8_ECAP4_INT_SEL<<4) | (MW_INTXBAR8_ECAP5_INT_SEL<<5) | (MW_INTXBAR8_ECAP6_INT_SEL<<6) | (MW_INTXBAR8_ECAP7_INT_SEL<<7) | (MW_INTXBAR8_ECAP8_INT_SEL<<8) | (MW_INTXBAR8_ECAP9_INT_SEL<<9);
    group6_mask[8] = (MW_INTXBAR8_EQEP0_INT_SEL<<0) | (MW_INTXBAR8_EQEP1_INT_SEL<<1) | (MW_INTXBAR8_EQEP2_INT_SEL<<2);
    group0_mask[9] = (MW_INTXBAR9_EPWM0_INT_SEL<<0) | (MW_INTXBAR9_EPWM1_INT_SEL<<1) | (MW_INTXBAR9_EPWM2_INT_SEL<<2) | (MW_INTXBAR9_EPWM3_INT_SEL<<3) | (MW_INTXBAR9_EPWM4_INT_SEL<<4) | (MW_INTXBAR9_EPWM5_INT_SEL<<5) | (MW_INTXBAR9_EPWM6_INT_SEL<<6) | (MW_INTXBAR9_EPWM7_INT_SEL<<7) | (MW_INTXBAR9_EPWM8_INT_SEL<<8) | (MW_INTXBAR9_EPWM9_INT_SEL<<9) | (MW_INTXBAR9_EPWM10_INT_SEL<<10) | (MW_INTXBAR9_EPWM11_INT_SEL<<11) | (MW_INTXBAR9_EPWM12_INT_SEL<<12) | (MW_INTXBAR9_EPWM13_INT_SEL<<13) | (MW_INTXBAR9_EPWM14_INT_SEL<<14) | (MW_INTXBAR9_EPWM15_INT_SEL<<15) | (MW_INTXBAR9_EPWM16_INT_SEL<<16) | (MW_INTXBAR9_EPWM17_INT_SEL<<17) | (MW_INTXBAR9_EPWM18_INT_SEL<<18) | (MW_INTXBAR9_EPWM19_INT_SEL<<19) | (MW_INTXBAR9_EPWM20_INT_SEL<<20) | (MW_INTXBAR9_EPWM21_INT_SEL<<21) | (MW_INTXBAR9_EPWM22_INT_SEL<<22) | (MW_INTXBAR9_EPWM23_INT_SEL<<23) | (MW_INTXBAR9_EPWM24_INT_SEL<<24) | (MW_INTXBAR9_EPWM25_INT_SEL<<25) | (MW_INTXBAR9_EPWM26_INT_SEL<<26) | (MW_INTXBAR9_EPWM27_INT_SEL<<27) | (MW_INTXBAR9_EPWM28_INT_SEL<<28) | (MW_INTXBAR9_EPWM29_INT_SEL<<29) | (MW_INTXBAR9_EPWM30_INT_SEL<<30) | (MW_INTXBAR9_EPWM31_INT_SEL<<31);
    group1_mask[9] = (MW_INTXBAR9_EPWM0_TZINT_SEL<<0) | (MW_INTXBAR9_EPWM1_TZINT_SEL<<1) | (MW_INTXBAR9_EPWM2_TZINT_SEL<<2) | (MW_INTXBAR9_EPWM3_TZINT_SEL<<3) | (MW_INTXBAR9_EPWM4_TZINT_SEL<<4) | (MW_INTXBAR9_EPWM5_TZINT_SEL<<5) | (MW_INTXBAR9_EPWM6_TZINT_SEL<<6) | (MW_INTXBAR9_EPWM7_TZINT_SEL<<7) | (MW_INTXBAR9_EPWM8_TZINT_SEL<<8) | (MW_INTXBAR9_EPWM9_TZINT_SEL<<9) | (MW_INTXBAR9_EPWM10_TZINT_SEL<<10) | (MW_INTXBAR9_EPWM11_TZINT_SEL<<11) | (MW_INTXBAR9_EPWM12_TZINT_SEL<<12) | (MW_INTXBAR9_EPWM13_TZINT_SEL<<13) | (MW_INTXBAR9_EPWM14_TZINT_SEL<<14) | (MW_INTXBAR9_EPWM15_TZINT_SEL<<15) | (MW_INTXBAR9_EPWM16_TZINT_SEL<<16) | (MW_INTXBAR9_EPWM17_TZINT_SEL<<17) | (MW_INTXBAR9_EPWM18_TZINT_SEL<<18) | (MW_INTXBAR9_EPWM19_TZINT_SEL<<19) | (MW_INTXBAR9_EPWM20_TZINT_SEL<<20) | (MW_INTXBAR9_EPWM21_TZINT_SEL<<21) | (MW_INTXBAR9_EPWM22_TZINT_SEL<<22) | (MW_INTXBAR9_EPWM23_TZINT_SEL<<23) | (MW_INTXBAR9_EPWM24_TZINT_SEL<<24) | (MW_INTXBAR9_EPWM25_TZINT_SEL<<25) | (MW_INTXBAR9_EPWM26_TZINT_SEL<<26) | (MW_INTXBAR9_EPWM27_TZINT_SEL<<27) | (MW_INTXBAR9_EPWM28_TZINT_SEL<<28) | (MW_INTXBAR9_EPWM29_TZINT_SEL<<29) | (MW_INTXBAR9_EPWM30_TZINT_SEL<<30) | (MW_INTXBAR9_EPWM31_TZINT_SEL<<31);
    group2_mask[9] = (MW_INTXBAR9_ADC0_INT1_SEL<<0) | (MW_INTXBAR9_ADC0_INT2_SEL<<1) | (MW_INTXBAR9_ADC0_INT3_SEL<<2) | (MW_INTXBAR9_ADC0_INT4_SEL<<3) | (MW_INTXBAR9_ADC0_EVTINT_SEL<<4) | (MW_INTXBAR9_ADC1_INT1_SEL<<5) | (MW_INTXBAR9_ADC1_INT2_SEL<<6) | (MW_INTXBAR9_ADC1_INT3_SEL<<7) | (MW_INTXBAR9_ADC1_INT4_SEL<<8) | (MW_INTXBAR9_ADC1_EVTINT_SEL<<9) | (MW_INTXBAR9_ADC2_INT1_SEL<<10) | (MW_INTXBAR9_ADC2_INT2_SEL<<11) | (MW_INTXBAR9_ADC2_INT3_SEL<<12) | (MW_INTXBAR9_ADC2_INT4_SEL<<13) | (MW_INTXBAR9_ADC2_EVTINT_SEL<<14) | (MW_INTXBAR9_ADC3_INT1_SEL<<15) | (MW_INTXBAR9_ADC3_INT2_SEL<<16) | (MW_INTXBAR9_ADC3_INT3_SEL<<17) | (MW_INTXBAR9_ADC3_INT4_SEL<<18) | (MW_INTXBAR9_ADC3_EVTINT_SEL<<19) | (MW_INTXBAR9_ADC4_INT1_SEL<<20) | (MW_INTXBAR9_ADC4_INT2_SEL<<21) | (MW_INTXBAR9_ADC4_INT3_SEL<<22) | (MW_INTXBAR9_ADC4_INT4_SEL<<23) | (MW_INTXBAR9_ADC4_EVTINT_SEL<<24);
    group3_mask[9] = (MW_INTXBAR9_FSIRX0_INT1N_SEL<<0) | (MW_INTXBAR9_FSIRX0_INT2N_SEL<<1) | (MW_INTXBAR9_FSITX0_INT1N_SEL<<2) | (MW_INTXBAR9_FSITX0_INT2N_SEL<<3) | (MW_INTXBAR9_FSIRX1_INT1N_SEL<<4) | (MW_INTXBAR9_FSIRX1_INT2N_SEL<<5) | (MW_INTXBAR9_FSITX1_INT1N_SEL<<6) | (MW_INTXBAR9_FSITX1_INT2N_SEL<<7) | (MW_INTXBAR9_FSIRX2_INT1N_SEL<<8) | (MW_INTXBAR9_FSIRX2_INT2N_SEL<<9) | (MW_INTXBAR9_FSITX2_INT1N_SEL<<10) | (MW_INTXBAR9_FSITX2_INT2N_SEL<<11) | (MW_INTXBAR9_FSIRX3_INT1N_SEL<<12) | (MW_INTXBAR9_FSIRX3_INT2N_SEL<<13) | (MW_INTXBAR9_FSITX3_INT1N_SEL<<14) | (MW_INTXBAR9_FSITX3_INT2N_SEL<<15);
    group4_mask[9] = (MW_INTXBAR9_SD0_ERR_SEL<<0) | (MW_INTXBAR9_SD0_FILT0_DRINT_SEL<<1) | (MW_INTXBAR9_SD0_FILT1_DRINT_SEL<<2) | (MW_INTXBAR9_SD0_FILT2_DRINT_SEL<<3) | (MW_INTXBAR9_SD0_FILT3_DRINT_SEL<<4) | (MW_INTXBAR9_SD1_ERR_SEL<<5) | (MW_INTXBAR9_SD1_FILT0_DRINT_SEL<<6) | (MW_INTXBAR9_SD1_FILT1_DRINT_SEL<<7) | (MW_INTXBAR9_SD1_FILT2_DRINT_SEL<<8) | (MW_INTXBAR9_SD1_FILT3_DRINT_SEL<<9);
    group5_mask[9] = (MW_INTXBAR9_ECAP0_INT_SEL<<0) | (MW_INTXBAR9_ECAP1_INT_SEL<<1) | (MW_INTXBAR9_ECAP2_INT_SEL<<2) | (MW_INTXBAR9_ECAP3_INT_SEL<<3) | (MW_INTXBAR9_ECAP4_INT_SEL<<4) | (MW_INTXBAR9_ECAP5_INT_SEL<<5) | (MW_INTXBAR9_ECAP6_INT_SEL<<6) | (MW_INTXBAR9_ECAP7_INT_SEL<<7) | (MW_INTXBAR9_ECAP8_INT_SEL<<8) | (MW_INTXBAR9_ECAP9_INT_SEL<<9);
