TexasInstruments/am26x-hsp/src/am263px_init.c
    group6_mask[9] = (MW_INTXBAR9_EQEP0_INT_SEL<<0) | (MW_INTXBAR9_EQEP1_INT_SEL<<1) | (MW_INTXBAR9_EQEP2_INT_SEL<<2);
    group0_mask[10] = (MW_INTXBAR10_EPWM0_INT_SEL<<0) | (MW_INTXBAR10_EPWM1_INT_SEL<<1) | (MW_INTXBAR10_EPWM2_INT_SEL<<2) | (MW_INTXBAR10_EPWM3_INT_SEL<<3) | (MW_INTXBAR10_EPWM4_INT_SEL<<4) | (MW_INTXBAR10_EPWM5_INT_SEL<<5) | (MW_INTXBAR10_EPWM6_INT_SEL<<6) | (MW_INTXBAR10_EPWM7_INT_SEL<<7) | (MW_INTXBAR10_EPWM8_INT_SEL<<8) | (MW_INTXBAR10_EPWM9_INT_SEL<<9) | (MW_INTXBAR10_EPWM10_INT_SEL<<10) | (MW_INTXBAR10_EPWM11_INT_SEL<<11) | (MW_INTXBAR10_EPWM12_INT_SEL<<12) | (MW_INTXBAR10_EPWM13_INT_SEL<<13) | (MW_INTXBAR10_EPWM14_INT_SEL<<14) | (MW_INTXBAR10_EPWM15_INT_SEL<<15) | (MW_INTXBAR10_EPWM16_INT_SEL<<16) | (MW_INTXBAR10_EPWM17_INT_SEL<<17) | (MW_INTXBAR10_EPWM18_INT_SEL<<18) | (MW_INTXBAR10_EPWM19_INT_SEL<<19) | (MW_INTXBAR10_EPWM20_INT_SEL<<20) | (MW_INTXBAR10_EPWM21_INT_SEL<<21) | (MW_INTXBAR10_EPWM22_INT_SEL<<22) | (MW_INTXBAR10_EPWM23_INT_SEL<<23) | (MW_INTXBAR10_EPWM24_INT_SEL<<24) | (MW_INTXBAR10_EPWM25_INT_SEL<<25) | (MW_INTXBAR10_EPWM26_INT_SEL<<26) | (MW_INTXBAR10_EPWM27_INT_SEL<<27) | (MW_INTXBAR10_EPWM28_INT_SEL<<28) | (MW_INTXBAR10_EPWM29_INT_SEL<<29) | (MW_INTXBAR10_EPWM30_INT_SEL<<30) | (MW_INTXBAR10_EPWM31_INT_SEL<<31);
    group1_mask[10] = (MW_INTXBAR10_EPWM0_TZINT_SEL<<0) | (MW_INTXBAR10_EPWM1_TZINT_SEL<<1) | (MW_INTXBAR10_EPWM2_TZINT_SEL<<2) | (MW_INTXBAR10_EPWM3_TZINT_SEL<<3) | (MW_INTXBAR10_EPWM4_TZINT_SEL<<4) | (MW_INTXBAR10_EPWM5_TZINT_SEL<<5) | (MW_INTXBAR10_EPWM6_TZINT_SEL<<6) | (MW_INTXBAR10_EPWM7_TZINT_SEL<<7) | (MW_INTXBAR10_EPWM8_TZINT_SEL<<8) | (MW_INTXBAR10_EPWM9_TZINT_SEL<<9) | (MW_INTXBAR10_EPWM10_TZINT_SEL<<10) | (MW_INTXBAR10_EPWM11_TZINT_SEL<<11) | (MW_INTXBAR10_EPWM12_TZINT_SEL<<12) | (MW_INTXBAR10_EPWM13_TZINT_SEL<<13) | (MW_INTXBAR10_EPWM14_TZINT_SEL<<14) | (MW_INTXBAR10_EPWM15_TZINT_SEL<<15) | (MW_INTXBAR10_EPWM16_TZINT_SEL<<16) | (MW_INTXBAR10_EPWM17_TZINT_SEL<<17) | (MW_INTXBAR10_EPWM18_TZINT_SEL<<18) | (MW_INTXBAR10_EPWM19_TZINT_SEL<<19) | (MW_INTXBAR10_EPWM20_TZINT_SEL<<20) | (MW_INTXBAR10_EPWM21_TZINT_SEL<<21) | (MW_INTXBAR10_EPWM22_TZINT_SEL<<22) | (MW_INTXBAR10_EPWM23_TZINT_SEL<<23) | (MW_INTXBAR10_EPWM24_TZINT_SEL<<24) | (MW_INTXBAR10_EPWM25_TZINT_SEL<<25) | (MW_INTXBAR10_EPWM26_TZINT_SEL<<26) | (MW_INTXBAR10_EPWM27_TZINT_SEL<<27) | (MW_INTXBAR10_EPWM28_TZINT_SEL<<28) | (MW_INTXBAR10_EPWM29_TZINT_SEL<<29) | (MW_INTXBAR10_EPWM30_TZINT_SEL<<30) | (MW_INTXBAR10_EPWM31_TZINT_SEL<<31);
    group2_mask[10] = (MW_INTXBAR10_ADC0_INT1_SEL<<0) | (MW_INTXBAR10_ADC0_INT2_SEL<<1) | (MW_INTXBAR10_ADC0_INT3_SEL<<2) | (MW_INTXBAR10_ADC0_INT4_SEL<<3) | (MW_INTXBAR10_ADC0_EVTINT_SEL<<4) | (MW_INTXBAR10_ADC1_INT1_SEL<<5) | (MW_INTXBAR10_ADC1_INT2_SEL<<6) | (MW_INTXBAR10_ADC1_INT3_SEL<<7) | (MW_INTXBAR10_ADC1_INT4_SEL<<8) | (MW_INTXBAR10_ADC1_EVTINT_SEL<<9) | (MW_INTXBAR10_ADC2_INT1_SEL<<10) | (MW_INTXBAR10_ADC2_INT2_SEL<<11) | (MW_INTXBAR10_ADC2_INT3_SEL<<12) | (MW_INTXBAR10_ADC2_INT4_SEL<<13) | (MW_INTXBAR10_ADC2_EVTINT_SEL<<14) | (MW_INTXBAR10_ADC3_INT1_SEL<<15) | (MW_INTXBAR10_ADC3_INT2_SEL<<16) | (MW_INTXBAR10_ADC3_INT3_SEL<<17) | (MW_INTXBAR10_ADC3_INT4_SEL<<18) | (MW_INTXBAR10_ADC3_EVTINT_SEL<<19) | (MW_INTXBAR10_ADC4_INT1_SEL<<20) | (MW_INTXBAR10_ADC4_INT2_SEL<<21) | (MW_INTXBAR10_ADC4_INT3_SEL<<22) | (MW_INTXBAR10_ADC4_INT4_SEL<<23) | (MW_INTXBAR10_ADC4_EVTINT_SEL<<24);
    group3_mask[10] = (MW_INTXBAR10_FSIRX0_INT1N_SEL<<0) | (MW_INTXBAR10_FSIRX0_INT2N_SEL<<1) | (MW_INTXBAR10_FSITX0_INT1N_SEL<<2) | (MW_INTXBAR10_FSITX0_INT2N_SEL<<3) | (MW_INTXBAR10_FSIRX1_INT1N_SEL<<4) | (MW_INTXBAR10_FSIRX1_INT2N_SEL<<5) | (MW_INTXBAR10_FSITX1_INT1N_SEL<<6) | (MW_INTXBAR10_FSITX1_INT2N_SEL<<7) | (MW_INTXBAR10_FSIRX2_INT1N_SEL<<8) | (MW_INTXBAR10_FSIRX2_INT2N_SEL<<9) | (MW_INTXBAR10_FSITX2_INT1N_SEL<<10) | (MW_INTXBAR10_FSITX2_INT2N_SEL<<11) | (MW_INTXBAR10_FSIRX3_INT1N_SEL<<12) | (MW_INTXBAR10_FSIRX3_INT2N_SEL<<13) | (MW_INTXBAR10_FSITX3_INT1N_SEL<<14) | (MW_INTXBAR10_FSITX3_INT2N_SEL<<15);
    group4_mask[10] = (MW_INTXBAR10_SD0_ERR_SEL<<0) | (MW_INTXBAR10_SD0_FILT0_DRINT_SEL<<1) | (MW_INTXBAR10_SD0_FILT1_DRINT_SEL<<2) | (MW_INTXBAR10_SD0_FILT2_DRINT_SEL<<3) | (MW_INTXBAR10_SD0_FILT3_DRINT_SEL<<4) | (MW_INTXBAR10_SD1_ERR_SEL<<5) | (MW_INTXBAR10_SD1_FILT0_DRINT_SEL<<6) | (MW_INTXBAR10_SD1_FILT1_DRINT_SEL<<7) | (MW_INTXBAR10_SD1_FILT2_DRINT_SEL<<8) | (MW_INTXBAR10_SD1_FILT3_DRINT_SEL<<9);
    group5_mask[10] = (MW_INTXBAR10_ECAP0_INT_SEL<<0) | (MW_INTXBAR10_ECAP1_INT_SEL<<1) | (MW_INTXBAR10_ECAP2_INT_SEL<<2) | (MW_INTXBAR10_ECAP3_INT_SEL<<3) | (MW_INTXBAR10_ECAP4_INT_SEL<<4) | (MW_INTXBAR10_ECAP5_INT_SEL<<5) | (MW_INTXBAR10_ECAP6_INT_SEL<<6) | (MW_INTXBAR10_ECAP7_INT_SEL<<7) | (MW_INTXBAR10_ECAP8_INT_SEL<<8) | (MW_INTXBAR10_ECAP9_INT_SEL<<9);
    group6_mask[10] = (MW_INTXBAR10_EQEP0_INT_SEL<<0) | (MW_INTXBAR10_EQEP1_INT_SEL<<1) | (MW_INTXBAR10_EQEP2_INT_SEL<<2);
    group0_mask[11] = (MW_INTXBAR11_EPWM0_INT_SEL<<0) | (MW_INTXBAR11_EPWM1_INT_SEL<<1) | (MW_INTXBAR11_EPWM2_INT_SEL<<2) | (MW_INTXBAR11_EPWM3_INT_SEL<<3) | (MW_INTXBAR11_EPWM4_INT_SEL<<4) | (MW_INTXBAR11_EPWM5_INT_SEL<<5) | (MW_INTXBAR11_EPWM6_INT_SEL<<6) | (MW_INTXBAR11_EPWM7_INT_SEL<<7) | (MW_INTXBAR11_EPWM8_INT_SEL<<8) | (MW_INTXBAR11_EPWM9_INT_SEL<<9) | (MW_INTXBAR11_EPWM10_INT_SEL<<10) | (MW_INTXBAR11_EPWM11_INT_SEL<<11) | (MW_INTXBAR11_EPWM12_INT_SEL<<12) | (MW_INTXBAR11_EPWM13_INT_SEL<<13) | (MW_INTXBAR11_EPWM14_INT_SEL<<14) | (MW_INTXBAR11_EPWM15_INT_SEL<<15) | (MW_INTXBAR11_EPWM16_INT_SEL<<16) | (MW_INTXBAR11_EPWM17_INT_SEL<<17) | (MW_INTXBAR11_EPWM18_INT_SEL<<18) | (MW_INTXBAR11_EPWM19_INT_SEL<<19) | (MW_INTXBAR11_EPWM20_INT_SEL<<20) | (MW_INTXBAR11_EPWM21_INT_SEL<<21) | (MW_INTXBAR11_EPWM22_INT_SEL<<22) | (MW_INTXBAR11_EPWM23_INT_SEL<<23) | (MW_INTXBAR11_EPWM24_INT_SEL<<24) | (MW_INTXBAR11_EPWM25_INT_SEL<<25) | (MW_INTXBAR11_EPWM26_INT_SEL<<26) | (MW_INTXBAR11_EPWM27_INT_SEL<<27) | (MW_INTXBAR11_EPWM28_INT_SEL<<28) | (MW_INTXBAR11_EPWM29_INT_SEL<<29) | (MW_INTXBAR11_EPWM30_INT_SEL<<30) | (MW_INTXBAR11_EPWM31_INT_SEL<<31);
    group1_mask[11] = (MW_INTXBAR11_EPWM0_TZINT_SEL<<0) | (MW_INTXBAR11_EPWM1_TZINT_SEL<<1) | (MW_INTXBAR11_EPWM2_TZINT_SEL<<2) | (MW_INTXBAR11_EPWM3_TZINT_SEL<<3) | (MW_INTXBAR11_EPWM4_TZINT_SEL<<4) | (MW_INTXBAR11_EPWM5_TZINT_SEL<<5) | (MW_INTXBAR11_EPWM6_TZINT_SEL<<6) | (MW_INTXBAR11_EPWM7_TZINT_SEL<<7) | (MW_INTXBAR11_EPWM8_TZINT_SEL<<8) | (MW_INTXBAR11_EPWM9_TZINT_SEL<<9) | (MW_INTXBAR11_EPWM10_TZINT_SEL<<10) | (MW_INTXBAR11_EPWM11_TZINT_SEL<<11) | (MW_INTXBAR11_EPWM12_TZINT_SEL<<12) | (MW_INTXBAR11_EPWM13_TZINT_SEL<<13) | (MW_INTXBAR11_EPWM14_TZINT_SEL<<14) | (MW_INTXBAR11_EPWM15_TZINT_SEL<<15) | (MW_INTXBAR11_EPWM16_TZINT_SEL<<16) | (MW_INTXBAR11_EPWM17_TZINT_SEL<<17) | (MW_INTXBAR11_EPWM18_TZINT_SEL<<18) | (MW_INTXBAR11_EPWM19_TZINT_SEL<<19) | (MW_INTXBAR11_EPWM20_TZINT_SEL<<20) | (MW_INTXBAR11_EPWM21_TZINT_SEL<<21) | (MW_INTXBAR11_EPWM22_TZINT_SEL<<22) | (MW_INTXBAR11_EPWM23_TZINT_SEL<<23) | (MW_INTXBAR11_EPWM24_TZINT_SEL<<24) | (MW_INTXBAR11_EPWM25_TZINT_SEL<<25) | (MW_INTXBAR11_EPWM26_TZINT_SEL<<26) | (MW_INTXBAR11_EPWM27_TZINT_SEL<<27) | (MW_INTXBAR11_EPWM28_TZINT_SEL<<28) | (MW_INTXBAR11_EPWM29_TZINT_SEL<<29) | (MW_INTXBAR11_EPWM30_TZINT_SEL<<30) | (MW_INTXBAR11_EPWM31_TZINT_SEL<<31);
    group2_mask[11] = (MW_INTXBAR11_ADC0_INT1_SEL<<0) | (MW_INTXBAR11_ADC0_INT2_SEL<<1) | (MW_INTXBAR11_ADC0_INT3_SEL<<2) | (MW_INTXBAR11_ADC0_INT4_SEL<<3) | (MW_INTXBAR11_ADC0_EVTINT_SEL<<4) | (MW_INTXBAR11_ADC1_INT1_SEL<<5) | (MW_INTXBAR11_ADC1_INT2_SEL<<6) | (MW_INTXBAR11_ADC1_INT3_SEL<<7) | (MW_INTXBAR11_ADC1_INT4_SEL<<8) | (MW_INTXBAR11_ADC1_EVTINT_SEL<<9) | (MW_INTXBAR11_ADC2_INT1_SEL<<10) | (MW_INTXBAR11_ADC2_INT2_SEL<<11) | (MW_INTXBAR11_ADC2_INT3_SEL<<12) | (MW_INTXBAR11_ADC2_INT4_SEL<<13) | (MW_INTXBAR11_ADC2_EVTINT_SEL<<14) | (MW_INTXBAR11_ADC3_INT1_SEL<<15) | (MW_INTXBAR11_ADC3_INT2_SEL<<16) | (MW_INTXBAR11_ADC3_INT3_SEL<<17) | (MW_INTXBAR11_ADC3_INT4_SEL<<18) | (MW_INTXBAR11_ADC3_EVTINT_SEL<<19) | (MW_INTXBAR11_ADC4_INT1_SEL<<20) | (MW_INTXBAR11_ADC4_INT2_SEL<<21) | (MW_INTXBAR11_ADC4_INT3_SEL<<22) | (MW_INTXBAR11_ADC4_INT4_SEL<<23) | (MW_INTXBAR11_ADC4_EVTINT_SEL<<24);
    group3_mask[11] = (MW_INTXBAR11_FSIRX0_INT1N_SEL<<0) | (MW_INTXBAR11_FSIRX0_INT2N_SEL<<1) | (MW_INTXBAR11_FSITX0_INT1N_SEL<<2) | (MW_INTXBAR11_FSITX0_INT2N_SEL<<3) | (MW_INTXBAR11_FSIRX1_INT1N_SEL<<4) | (MW_INTXBAR11_FSIRX1_INT2N_SEL<<5) | (MW_INTXBAR11_FSITX1_INT1N_SEL<<6) | (MW_INTXBAR11_FSITX1_INT2N_SEL<<7) | (MW_INTXBAR11_FSIRX2_INT1N_SEL<<8) | (MW_INTXBAR11_FSIRX2_INT2N_SEL<<9) | (MW_INTXBAR11_FSITX2_INT1N_SEL<<10) | (MW_INTXBAR11_FSITX2_INT2N_SEL<<11) | (MW_INTXBAR11_FSIRX3_INT1N_SEL<<12) | (MW_INTXBAR11_FSIRX3_INT2N_SEL<<13) | (MW_INTXBAR11_FSITX3_INT1N_SEL<<14) | (MW_INTXBAR11_FSITX3_INT2N_SEL<<15);
    group4_mask[11] = (MW_INTXBAR11_SD0_ERR_SEL<<0) | (MW_INTXBAR11_SD0_FILT0_DRINT_SEL<<1) | (MW_INTXBAR11_SD0_FILT1_DRINT_SEL<<2) | (MW_INTXBAR11_SD0_FILT2_DRINT_SEL<<3) | (MW_INTXBAR11_SD0_FILT3_DRINT_SEL<<4) | (MW_INTXBAR11_SD1_ERR_SEL<<5) | (MW_INTXBAR11_SD1_FILT0_DRINT_SEL<<6) | (MW_INTXBAR11_SD1_FILT1_DRINT_SEL<<7) | (MW_INTXBAR11_SD1_FILT2_DRINT_SEL<<8) | (MW_INTXBAR11_SD1_FILT3_DRINT_SEL<<9);
    group5_mask[11] = (MW_INTXBAR11_ECAP0_INT_SEL<<0) | (MW_INTXBAR11_ECAP1_INT_SEL<<1) | (MW_INTXBAR11_ECAP2_INT_SEL<<2) | (MW_INTXBAR11_ECAP3_INT_SEL<<3) | (MW_INTXBAR11_ECAP4_INT_SEL<<4) | (MW_INTXBAR11_ECAP5_INT_SEL<<5) | (MW_INTXBAR11_ECAP6_INT_SEL<<6) | (MW_INTXBAR11_ECAP7_INT_SEL<<7) | (MW_INTXBAR11_ECAP8_INT_SEL<<8) | (MW_INTXBAR11_ECAP9_INT_SEL<<9);
    group6_mask[11] = (MW_INTXBAR11_EQEP0_INT_SEL<<0) | (MW_INTXBAR11_EQEP1_INT_SEL<<1) | (MW_INTXBAR11_EQEP2_INT_SEL<<2);
    group0_mask[12] = (MW_INTXBAR12_EPWM0_INT_SEL<<0) | (MW_INTXBAR12_EPWM1_INT_SEL<<1) | (MW_INTXBAR12_EPWM2_INT_SEL<<2) | (MW_INTXBAR12_EPWM3_INT_SEL<<3) | (MW_INTXBAR12_EPWM4_INT_SEL<<4) | (MW_INTXBAR12_EPWM5_INT_SEL<<5) | (MW_INTXBAR12_EPWM6_INT_SEL<<6) | (MW_INTXBAR12_EPWM7_INT_SEL<<7) | (MW_INTXBAR12_EPWM8_INT_SEL<<8) | (MW_INTXBAR12_EPWM9_INT_SEL<<9) | (MW_INTXBAR12_EPWM10_INT_SEL<<10) | (MW_INTXBAR12_EPWM11_INT_SEL<<11) | (MW_INTXBAR12_EPWM12_INT_SEL<<12) | (MW_INTXBAR12_EPWM13_INT_SEL<<13) | (MW_INTXBAR12_EPWM14_INT_SEL<<14) | (MW_INTXBAR12_EPWM15_INT_SEL<<15) | (MW_INTXBAR12_EPWM16_INT_SEL<<16) | (MW_INTXBAR12_EPWM17_INT_SEL<<17) | (MW_INTXBAR12_EPWM18_INT_SEL<<18) | (MW_INTXBAR12_EPWM19_INT_SEL<<19) | (MW_INTXBAR12_EPWM20_INT_SEL<<20) | (MW_INTXBAR12_EPWM21_INT_SEL<<21) | (MW_INTXBAR12_EPWM22_INT_SEL<<22) | (MW_INTXBAR12_EPWM23_INT_SEL<<23) | (MW_INTXBAR12_EPWM24_INT_SEL<<24) | (MW_INTXBAR12_EPWM25_INT_SEL<<25) | (MW_INTXBAR12_EPWM26_INT_SEL<<26) | (MW_INTXBAR12_EPWM27_INT_SEL<<27) | (MW_INTXBAR12_EPWM28_INT_SEL<<28) | (MW_INTXBAR12_EPWM29_INT_SEL<<29) | (MW_INTXBAR12_EPWM30_INT_SEL<<30) | (MW_INTXBAR12_EPWM31_INT_SEL<<31);
    group1_mask[12] = (MW_INTXBAR12_EPWM0_TZINT_SEL<<0) | (MW_INTXBAR12_EPWM1_TZINT_SEL<<1) | (MW_INTXBAR12_EPWM2_TZINT_SEL<<2) | (MW_INTXBAR12_EPWM3_TZINT_SEL<<3) | (MW_INTXBAR12_EPWM4_TZINT_SEL<<4) | (MW_INTXBAR12_EPWM5_TZINT_SEL<<5) | (MW_INTXBAR12_EPWM6_TZINT_SEL<<6) | (MW_INTXBAR12_EPWM7_TZINT_SEL<<7) | (MW_INTXBAR12_EPWM8_TZINT_SEL<<8) | (MW_INTXBAR12_EPWM9_TZINT_SEL<<9) | (MW_INTXBAR12_EPWM10_TZINT_SEL<<10) | (MW_INTXBAR12_EPWM11_TZINT_SEL<<11) | (MW_INTXBAR12_EPWM12_TZINT_SEL<<12) | (MW_INTXBAR12_EPWM13_TZINT_SEL<<13) | (MW_INTXBAR12_EPWM14_TZINT_SEL<<14) | (MW_INTXBAR12_EPWM15_TZINT_SEL<<15) | (MW_INTXBAR12_EPWM16_TZINT_SEL<<16) | (MW_INTXBAR12_EPWM17_TZINT_SEL<<17) | (MW_INTXBAR12_EPWM18_TZINT_SEL<<18) | (MW_INTXBAR12_EPWM19_TZINT_SEL<<19) | (MW_INTXBAR12_EPWM20_TZINT_SEL<<20) | (MW_INTXBAR12_EPWM21_TZINT_SEL<<21) | (MW_INTXBAR12_EPWM22_TZINT_SEL<<22) | (MW_INTXBAR12_EPWM23_TZINT_SEL<<23) | (MW_INTXBAR12_EPWM24_TZINT_SEL<<24) | (MW_INTXBAR12_EPWM25_TZINT_SEL<<25) | (MW_INTXBAR12_EPWM26_TZINT_SEL<<26) | (MW_INTXBAR12_EPWM27_TZINT_SEL<<27) | (MW_INTXBAR12_EPWM28_TZINT_SEL<<28) | (MW_INTXBAR12_EPWM29_TZINT_SEL<<29) | (MW_INTXBAR12_EPWM30_TZINT_SEL<<30) | (MW_INTXBAR12_EPWM31_TZINT_SEL<<31);
    group2_mask[12] = (MW_INTXBAR12_ADC0_INT1_SEL<<0) | (MW_INTXBAR12_ADC0_INT2_SEL<<1) | (MW_INTXBAR12_ADC0_INT3_SEL<<2) | (MW_INTXBAR12_ADC0_INT4_SEL<<3) | (MW_INTXBAR12_ADC0_EVTINT_SEL<<4) | (MW_INTXBAR12_ADC1_INT1_SEL<<5) | (MW_INTXBAR12_ADC1_INT2_SEL<<6) | (MW_INTXBAR12_ADC1_INT3_SEL<<7) | (MW_INTXBAR12_ADC1_INT4_SEL<<8) | (MW_INTXBAR12_ADC1_EVTINT_SEL<<9) | (MW_INTXBAR12_ADC2_INT1_SEL<<10) | (MW_INTXBAR12_ADC2_INT2_SEL<<11) | (MW_INTXBAR12_ADC2_INT3_SEL<<12) | (MW_INTXBAR12_ADC2_INT4_SEL<<13) | (MW_INTXBAR12_ADC2_EVTINT_SEL<<14) | (MW_INTXBAR12_ADC3_INT1_SEL<<15) | (MW_INTXBAR12_ADC3_INT2_SEL<<16) | (MW_INTXBAR12_ADC3_INT3_SEL<<17) | (MW_INTXBAR12_ADC3_INT4_SEL<<18) | (MW_INTXBAR12_ADC3_EVTINT_SEL<<19) | (MW_INTXBAR12_ADC4_INT1_SEL<<20) | (MW_INTXBAR12_ADC4_INT2_SEL<<21) | (MW_INTXBAR12_ADC4_INT3_SEL<<22) | (MW_INTXBAR12_ADC4_INT4_SEL<<23) | (MW_INTXBAR12_ADC4_EVTINT_SEL<<24);
    group3_mask[12] = (MW_INTXBAR12_FSIRX0_INT1N_SEL<<0) | (MW_INTXBAR12_FSIRX0_INT2N_SEL<<1) | (MW_INTXBAR12_FSITX0_INT1N_SEL<<2) | (MW_INTXBAR12_FSITX0_INT2N_SEL<<3) | (MW_INTXBAR12_FSIRX1_INT1N_SEL<<4) | (MW_INTXBAR12_FSIRX1_INT2N_SEL<<5) | (MW_INTXBAR12_FSITX1_INT1N_SEL<<6) | (MW_INTXBAR12_FSITX1_INT2N_SEL<<7) | (MW_INTXBAR12_FSIRX2_INT1N_SEL<<8) | (MW_INTXBAR12_FSIRX2_INT2N_SEL<<9) | (MW_INTXBAR12_FSITX2_INT1N_SEL<<10) | (MW_INTXBAR12_FSITX2_INT2N_SEL<<11) | (MW_INTXBAR12_FSIRX3_INT1N_SEL<<12) | (MW_INTXBAR12_FSIRX3_INT2N_SEL<<13) | (MW_INTXBAR12_FSITX3_INT1N_SEL<<14) | (MW_INTXBAR12_FSITX3_INT2N_SEL<<15);
    group4_mask[12] = (MW_INTXBAR12_SD0_ERR_SEL<<0) | (MW_INTXBAR12_SD0_FILT0_DRINT_SEL<<1) | (MW_INTXBAR12_SD0_FILT1_DRINT_SEL<<2) | (MW_INTXBAR12_SD0_FILT2_DRINT_SEL<<3) | (MW_INTXBAR12_SD0_FILT3_DRINT_SEL<<4) | (MW_INTXBAR12_SD1_ERR_SEL<<5) | (MW_INTXBAR12_SD1_FILT0_DRINT_SEL<<6) | (MW_INTXBAR12_SD1_FILT1_DRINT_SEL<<7) | (MW_INTXBAR12_SD1_FILT2_DRINT_SEL<<8) | (MW_INTXBAR12_SD1_FILT3_DRINT_SEL<<9);
    group5_mask[12] = (MW_INTXBAR12_ECAP0_INT_SEL<<0) | (MW_INTXBAR12_ECAP1_INT_SEL<<1) | (MW_INTXBAR12_ECAP2_INT_SEL<<2) | (MW_INTXBAR12_ECAP3_INT_SEL<<3) | (MW_INTXBAR12_ECAP4_INT_SEL<<4) | (MW_INTXBAR12_ECAP5_INT_SEL<<5) | (MW_INTXBAR12_ECAP6_INT_SEL<<6) | (MW_INTXBAR12_ECAP7_INT_SEL<<7) | (MW_INTXBAR12_ECAP8_INT_SEL<<8) | (MW_INTXBAR12_ECAP9_INT_SEL<<9);
    group6_mask[12] = (MW_INTXBAR12_EQEP0_INT_SEL<<0) | (MW_INTXBAR12_EQEP1_INT_SEL<<1) | (MW_INTXBAR12_EQEP2_INT_SEL<<2);
    group0_mask[13] = (MW_INTXBAR13_EPWM0_INT_SEL<<0) | (MW_INTXBAR13_EPWM1_INT_SEL<<1) | (MW_INTXBAR13_EPWM2_INT_SEL<<2) | (MW_INTXBAR13_EPWM3_INT_SEL<<3) | (MW_INTXBAR13_EPWM4_INT_SEL<<4) | (MW_INTXBAR13_EPWM5_INT_SEL<<5) | (MW_INTXBAR13_EPWM6_INT_SEL<<6) | (MW_INTXBAR13_EPWM7_INT_SEL<<7) | (MW_INTXBAR13_EPWM8_INT_SEL<<8) | (MW_INTXBAR13_EPWM9_INT_SEL<<9) | (MW_INTXBAR13_EPWM10_INT_SEL<<10) | (MW_INTXBAR13_EPWM11_INT_SEL<<11) | (MW_INTXBAR13_EPWM12_INT_SEL<<12) | (MW_INTXBAR13_EPWM13_INT_SEL<<13) | (MW_INTXBAR13_EPWM14_INT_SEL<<14) | (MW_INTXBAR13_EPWM15_INT_SEL<<15) | (MW_INTXBAR13_EPWM16_INT_SEL<<16) | (MW_INTXBAR13_EPWM17_INT_SEL<<17) | (MW_INTXBAR13_EPWM18_INT_SEL<<18) | (MW_INTXBAR13_EPWM19_INT_SEL<<19) | (MW_INTXBAR13_EPWM20_INT_SEL<<20) | (MW_INTXBAR13_EPWM21_INT_SEL<<21) | (MW_INTXBAR13_EPWM22_INT_SEL<<22) | (MW_INTXBAR13_EPWM23_INT_SEL<<23) | (MW_INTXBAR13_EPWM24_INT_SEL<<24) | (MW_INTXBAR13_EPWM25_INT_SEL<<25) | (MW_INTXBAR13_EPWM26_INT_SEL<<26) | (MW_INTXBAR13_EPWM27_INT_SEL<<27) | (MW_INTXBAR13_EPWM28_INT_SEL<<28) | (MW_INTXBAR13_EPWM29_INT_SEL<<29) | (MW_INTXBAR13_EPWM30_INT_SEL<<30) | (MW_INTXBAR13_EPWM31_INT_SEL<<31);
    group1_mask[13] = (MW_INTXBAR13_EPWM0_TZINT_SEL<<0) | (MW_INTXBAR13_EPWM1_TZINT_SEL<<1) | (MW_INTXBAR13_EPWM2_TZINT_SEL<<2) | (MW_INTXBAR13_EPWM3_TZINT_SEL<<3) | (MW_INTXBAR13_EPWM4_TZINT_SEL<<4) | (MW_INTXBAR13_EPWM5_TZINT_SEL<<5) | (MW_INTXBAR13_EPWM6_TZINT_SEL<<6) | (MW_INTXBAR13_EPWM7_TZINT_SEL<<7) | (MW_INTXBAR13_EPWM8_TZINT_SEL<<8) | (MW_INTXBAR13_EPWM9_TZINT_SEL<<9) | (MW_INTXBAR13_EPWM10_TZINT_SEL<<10) | (MW_INTXBAR13_EPWM11_TZINT_SEL<<11) | (MW_INTXBAR13_EPWM12_TZINT_SEL<<12) | (MW_INTXBAR13_EPWM13_TZINT_SEL<<13) | (MW_INTXBAR13_EPWM14_TZINT_SEL<<14) | (MW_INTXBAR13_EPWM15_TZINT_SEL<<15) | (MW_INTXBAR13_EPWM16_TZINT_SEL<<16) | (MW_INTXBAR13_EPWM17_TZINT_SEL<<17) | (MW_INTXBAR13_EPWM18_TZINT_SEL<<18) | (MW_INTXBAR13_EPWM19_TZINT_SEL<<19) | (MW_INTXBAR13_EPWM20_TZINT_SEL<<20) | (MW_INTXBAR13_EPWM21_TZINT_SEL<<21) | (MW_INTXBAR13_EPWM22_TZINT_SEL<<22) | (MW_INTXBAR13_EPWM23_TZINT_SEL<<23) | (MW_INTXBAR13_EPWM24_TZINT_SEL<<24) | (MW_INTXBAR13_EPWM25_TZINT_SEL<<25) | (MW_INTXBAR13_EPWM26_TZINT_SEL<<26) | (MW_INTXBAR13_EPWM27_TZINT_SEL<<27) | (MW_INTXBAR13_EPWM28_TZINT_SEL<<28) | (MW_INTXBAR13_EPWM29_TZINT_SEL<<29) | (MW_INTXBAR13_EPWM30_TZINT_SEL<<30) | (MW_INTXBAR13_EPWM31_TZINT_SEL<<31);
    group2_mask[13] = (MW_INTXBAR13_ADC0_INT1_SEL<<0) | (MW_INTXBAR13_ADC0_INT2_SEL<<1) | (MW_INTXBAR13_ADC0_INT3_SEL<<2) | (MW_INTXBAR13_ADC0_INT4_SEL<<3) | (MW_INTXBAR13_ADC0_EVTINT_SEL<<4) | (MW_INTXBAR13_ADC1_INT1_SEL<<5) | (MW_INTXBAR13_ADC1_INT2_SEL<<6) | (MW_INTXBAR13_ADC1_INT3_SEL<<7) | (MW_INTXBAR13_ADC1_INT4_SEL<<8) | (MW_INTXBAR13_ADC1_EVTINT_SEL<<9) | (MW_INTXBAR13_ADC2_INT1_SEL<<10) | (MW_INTXBAR13_ADC2_INT2_SEL<<11) | (MW_INTXBAR13_ADC2_INT3_SEL<<12) | (MW_INTXBAR13_ADC2_INT4_SEL<<13) | (MW_INTXBAR13_ADC2_EVTINT_SEL<<14) | (MW_INTXBAR13_ADC3_INT1_SEL<<15) | (MW_INTXBAR13_ADC3_INT2_SEL<<16) | (MW_INTXBAR13_ADC3_INT3_SEL<<17) | (MW_INTXBAR13_ADC3_INT4_SEL<<18) | (MW_INTXBAR13_ADC3_EVTINT_SEL<<19) | (MW_INTXBAR13_ADC4_INT1_SEL<<20) | (MW_INTXBAR13_ADC4_INT2_SEL<<21) | (MW_INTXBAR13_ADC4_INT3_SEL<<22) | (MW_INTXBAR13_ADC4_INT4_SEL<<23) | (MW_INTXBAR13_ADC4_EVTINT_SEL<<24);
    group3_mask[13] = (MW_INTXBAR13_FSIRX0_INT1N_SEL<<0) | (MW_INTXBAR13_FSIRX0_INT2N_SEL<<1) | (MW_INTXBAR13_FSITX0_INT1N_SEL<<2) | (MW_INTXBAR13_FSITX0_INT2N_SEL<<3) | (MW_INTXBAR13_FSIRX1_INT1N_SEL<<4) | (MW_INTXBAR13_FSIRX1_INT2N_SEL<<5) | (MW_INTXBAR13_FSITX1_INT1N_SEL<<6) | (MW_INTXBAR13_FSITX1_INT2N_SEL<<7) | (MW_INTXBAR13_FSIRX2_INT1N_SEL<<8) | (MW_INTXBAR13_FSIRX2_INT2N_SEL<<9) | (MW_INTXBAR13_FSITX2_INT1N_SEL<<10) | (MW_INTXBAR13_FSITX2_INT2N_SEL<<11) | (MW_INTXBAR13_FSIRX3_INT1N_SEL<<12) | (MW_INTXBAR13_FSIRX3_INT2N_SEL<<13) | (MW_INTXBAR13_FSITX3_INT1N_SEL<<14) | (MW_INTXBAR13_FSITX3_INT2N_SEL<<15);
    group4_mask[13] = (MW_INTXBAR13_SD0_ERR_SEL<<0) | (MW_INTXBAR13_SD0_FILT0_DRINT_SEL<<1) | (MW_INTXBAR13_SD0_FILT1_DRINT_SEL<<2) | (MW_INTXBAR13_SD0_FILT2_DRINT_SEL<<3) | (MW_INTXBAR13_SD0_FILT3_DRINT_SEL<<4) | (MW_INTXBAR13_SD1_ERR_SEL<<5) | (MW_INTXBAR13_SD1_FILT0_DRINT_SEL<<6) | (MW_INTXBAR13_SD1_FILT1_DRINT_SEL<<7) | (MW_INTXBAR13_SD1_FILT2_DRINT_SEL<<8) | (MW_INTXBAR13_SD1_FILT3_DRINT_SEL<<9);
    group5_mask[13] = (MW_INTXBAR13_ECAP0_INT_SEL<<0) | (MW_INTXBAR13_ECAP1_INT_SEL<<1) | (MW_INTXBAR13_ECAP2_INT_SEL<<2) | (MW_INTXBAR13_ECAP3_INT_SEL<<3) | (MW_INTXBAR13_ECAP4_INT_SEL<<4) | (MW_INTXBAR13_ECAP5_INT_SEL<<5) | (MW_INTXBAR13_ECAP6_INT_SEL<<6) | (MW_INTXBAR13_ECAP7_INT_SEL<<7) | (MW_INTXBAR13_ECAP8_INT_SEL<<8) | (MW_INTXBAR13_ECAP9_INT_SEL<<9);
    group6_mask[13] = (MW_INTXBAR13_EQEP0_INT_SEL<<0) | (MW_INTXBAR13_EQEP1_INT_SEL<<1) | (MW_INTXBAR13_EQEP2_INT_SEL<<2);
    group0_mask[14] = (MW_INTXBAR14_EPWM0_INT_SEL<<0) | (MW_INTXBAR14_EPWM1_INT_SEL<<1) | (MW_INTXBAR14_EPWM2_INT_SEL<<2) | (MW_INTXBAR14_EPWM3_INT_SEL<<3) | (MW_INTXBAR14_EPWM4_INT_SEL<<4) | (MW_INTXBAR14_EPWM5_INT_SEL<<5) | (MW_INTXBAR14_EPWM6_INT_SEL<<6) | (MW_INTXBAR14_EPWM7_INT_SEL<<7) | (MW_INTXBAR14_EPWM8_INT_SEL<<8) | (MW_INTXBAR14_EPWM9_INT_SEL<<9) | (MW_INTXBAR14_EPWM10_INT_SEL<<10) | (MW_INTXBAR14_EPWM11_INT_SEL<<11) | (MW_INTXBAR14_EPWM12_INT_SEL<<12) | (MW_INTXBAR14_EPWM13_INT_SEL<<13) | (MW_INTXBAR14_EPWM14_INT_SEL<<14) | (MW_INTXBAR14_EPWM15_INT_SEL<<15) | (MW_INTXBAR14_EPWM16_INT_SEL<<16) | (MW_INTXBAR14_EPWM17_INT_SEL<<17) | (MW_INTXBAR14_EPWM18_INT_SEL<<18) | (MW_INTXBAR14_EPWM19_INT_SEL<<19) | (MW_INTXBAR14_EPWM20_INT_SEL<<20) | (MW_INTXBAR14_EPWM21_INT_SEL<<21) | (MW_INTXBAR14_EPWM22_INT_SEL<<22) | (MW_INTXBAR14_EPWM23_INT_SEL<<23) | (MW_INTXBAR14_EPWM24_INT_SEL<<24) | (MW_INTXBAR14_EPWM25_INT_SEL<<25) | (MW_INTXBAR14_EPWM26_INT_SEL<<26) | (MW_INTXBAR14_EPWM27_INT_SEL<<27) | (MW_INTXBAR14_EPWM28_INT_SEL<<28) | (MW_INTXBAR14_EPWM29_INT_SEL<<29) | (MW_INTXBAR14_EPWM30_INT_SEL<<30) | (MW_INTXBAR14_EPWM31_INT_SEL<<31);
    group1_mask[14] = (MW_INTXBAR14_EPWM0_TZINT_SEL<<0) | (MW_INTXBAR14_EPWM1_TZINT_SEL<<1) | (MW_INTXBAR14_EPWM2_TZINT_SEL<<2) | (MW_INTXBAR14_EPWM3_TZINT_SEL<<3) | (MW_INTXBAR14_EPWM4_TZINT_SEL<<4) | (MW_INTXBAR14_EPWM5_TZINT_SEL<<5) | (MW_INTXBAR14_EPWM6_TZINT_SEL<<6) | (MW_INTXBAR14_EPWM7_TZINT_SEL<<7) | (MW_INTXBAR14_EPWM8_TZINT_SEL<<8) | (MW_INTXBAR14_EPWM9_TZINT_SEL<<9) | (MW_INTXBAR14_EPWM10_TZINT_SEL<<10) | (MW_INTXBAR14_EPWM11_TZINT_SEL<<11) | (MW_INTXBAR14_EPWM12_TZINT_SEL<<12) | (MW_INTXBAR14_EPWM13_TZINT_SEL<<13) | (MW_INTXBAR14_EPWM14_TZINT_SEL<<14) | (MW_INTXBAR14_EPWM15_TZINT_SEL<<15) | (MW_INTXBAR14_EPWM16_TZINT_SEL<<16) | (MW_INTXBAR14_EPWM17_TZINT_SEL<<17) | (MW_INTXBAR14_EPWM18_TZINT_SEL<<18) | (MW_INTXBAR14_EPWM19_TZINT_SEL<<19) | (MW_INTXBAR14_EPWM20_TZINT_SEL<<20) | (MW_INTXBAR14_EPWM21_TZINT_SEL<<21) | (MW_INTXBAR14_EPWM22_TZINT_SEL<<22) | (MW_INTXBAR14_EPWM23_TZINT_SEL<<23) | (MW_INTXBAR14_EPWM24_TZINT_SEL<<24) | (MW_INTXBAR14_EPWM25_TZINT_SEL<<25) | (MW_INTXBAR14_EPWM26_TZINT_SEL<<26) | (MW_INTXBAR14_EPWM27_TZINT_SEL<<27) | (MW_INTXBAR14_EPWM28_TZINT_SEL<<28) | (MW_INTXBAR14_EPWM29_TZINT_SEL<<29) | (MW_INTXBAR14_EPWM30_TZINT_SEL<<30) | (MW_INTXBAR14_EPWM31_TZINT_SEL<<31);
    group2_mask[14] = (MW_INTXBAR14_ADC0_INT1_SEL<<0) | (MW_INTXBAR14_ADC0_INT2_SEL<<1) | (MW_INTXBAR14_ADC0_INT3_SEL<<2) | (MW_INTXBAR14_ADC0_INT4_SEL<<3) | (MW_INTXBAR14_ADC0_EVTINT_SEL<<4) | (MW_INTXBAR14_ADC1_INT1_SEL<<5) | (MW_INTXBAR14_ADC1_INT2_SEL<<6) | (MW_INTXBAR14_ADC1_INT3_SEL<<7) | (MW_INTXBAR14_ADC1_INT4_SEL<<8) | (MW_INTXBAR14_ADC1_EVTINT_SEL<<9) | (MW_INTXBAR14_ADC2_INT1_SEL<<10) | (MW_INTXBAR14_ADC2_INT2_SEL<<11) | (MW_INTXBAR14_ADC2_INT3_SEL<<12) | (MW_INTXBAR14_ADC2_INT4_SEL<<13) | (MW_INTXBAR14_ADC2_EVTINT_SEL<<14) | (MW_INTXBAR14_ADC3_INT1_SEL<<15) | (MW_INTXBAR14_ADC3_INT2_SEL<<16) | (MW_INTXBAR14_ADC3_INT3_SEL<<17) | (MW_INTXBAR14_ADC3_INT4_SEL<<18) | (MW_INTXBAR14_ADC3_EVTINT_SEL<<19) | (MW_INTXBAR14_ADC4_INT1_SEL<<20) | (MW_INTXBAR14_ADC4_INT2_SEL<<21) | (MW_INTXBAR14_ADC4_INT3_SEL<<22) | (MW_INTXBAR14_ADC4_INT4_SEL<<23) | (MW_INTXBAR14_ADC4_EVTINT_SEL<<24);
    group3_mask[14] = (MW_INTXBAR14_FSIRX0_INT1N_SEL<<0) | (MW_INTXBAR14_FSIRX0_INT2N_SEL<<1) | (MW_INTXBAR14_FSITX0_INT1N_SEL<<2) | (MW_INTXBAR14_FSITX0_INT2N_SEL<<3) | (MW_INTXBAR14_FSIRX1_INT1N_SEL<<4) | (MW_INTXBAR14_FSIRX1_INT2N_SEL<<5) | (MW_INTXBAR14_FSITX1_INT1N_SEL<<6) | (MW_INTXBAR14_FSITX1_INT2N_SEL<<7) | (MW_INTXBAR14_FSIRX2_INT1N_SEL<<8) | (MW_INTXBAR14_FSIRX2_INT2N_SEL<<9) | (MW_INTXBAR14_FSITX2_INT1N_SEL<<10) | (MW_INTXBAR14_FSITX2_INT2N_SEL<<11) | (MW_INTXBAR14_FSIRX3_INT1N_SEL<<12) | (MW_INTXBAR14_FSIRX3_INT2N_SEL<<13) | (MW_INTXBAR14_FSITX3_INT1N_SEL<<14) | (MW_INTXBAR14_FSITX3_INT2N_SEL<<15);
    group4_mask[14] = (MW_INTXBAR14_SD0_ERR_SEL<<0) | (MW_INTXBAR14_SD0_FILT0_DRINT_SEL<<1) | (MW_INTXBAR14_SD0_FILT1_DRINT_SEL<<2) | (MW_INTXBAR14_SD0_FILT2_DRINT_SEL<<3) | (MW_INTXBAR14_SD0_FILT3_DRINT_SEL<<4) | (MW_INTXBAR14_SD1_ERR_SEL<<5) | (MW_INTXBAR14_SD1_FILT0_DRINT_SEL<<6) | (MW_INTXBAR14_SD1_FILT1_DRINT_SEL<<7) | (MW_INTXBAR14_SD1_FILT2_DRINT_SEL<<8) | (MW_INTXBAR14_SD1_FILT3_DRINT_SEL<<9);
    group5_mask[14] = (MW_INTXBAR14_ECAP0_INT_SEL<<0) | (MW_INTXBAR14_ECAP1_INT_SEL<<1) | (MW_INTXBAR14_ECAP2_INT_SEL<<2) | (MW_INTXBAR14_ECAP3_INT_SEL<<3) | (MW_INTXBAR14_ECAP4_INT_SEL<<4) | (MW_INTXBAR14_ECAP5_INT_SEL<<5) | (MW_INTXBAR14_ECAP6_INT_SEL<<6) | (MW_INTXBAR14_ECAP7_INT_SEL<<7) | (MW_INTXBAR14_ECAP8_INT_SEL<<8) | (MW_INTXBAR14_ECAP9_INT_SEL<<9);
