TexasInstruments/am26x-hsp/src/am263px_init.c
    group6_mask[14] = (MW_INTXBAR14_EQEP0_INT_SEL<<0) | (MW_INTXBAR14_EQEP1_INT_SEL<<1) | (MW_INTXBAR14_EQEP2_INT_SEL<<2);
    group0_mask[15] = (MW_INTXBAR15_EPWM0_INT_SEL<<0) | (MW_INTXBAR15_EPWM1_INT_SEL<<1) | (MW_INTXBAR15_EPWM2_INT_SEL<<2) | (MW_INTXBAR15_EPWM3_INT_SEL<<3) | (MW_INTXBAR15_EPWM4_INT_SEL<<4) | (MW_INTXBAR15_EPWM5_INT_SEL<<5) | (MW_INTXBAR15_EPWM6_INT_SEL<<6) | (MW_INTXBAR15_EPWM7_INT_SEL<<7) | (MW_INTXBAR15_EPWM8_INT_SEL<<8) | (MW_INTXBAR15_EPWM9_INT_SEL<<9) | (MW_INTXBAR15_EPWM10_INT_SEL<<10) | (MW_INTXBAR15_EPWM11_INT_SEL<<11) | (MW_INTXBAR15_EPWM12_INT_SEL<<12) | (MW_INTXBAR15_EPWM13_INT_SEL<<13) | (MW_INTXBAR15_EPWM14_INT_SEL<<14) | (MW_INTXBAR15_EPWM15_INT_SEL<<15) | (MW_INTXBAR15_EPWM16_INT_SEL<<16) | (MW_INTXBAR15_EPWM17_INT_SEL<<17) | (MW_INTXBAR15_EPWM18_INT_SEL<<18) | (MW_INTXBAR15_EPWM19_INT_SEL<<19) | (MW_INTXBAR15_EPWM20_INT_SEL<<20) | (MW_INTXBAR15_EPWM21_INT_SEL<<21) | (MW_INTXBAR15_EPWM22_INT_SEL<<22) | (MW_INTXBAR15_EPWM23_INT_SEL<<23) | (MW_INTXBAR15_EPWM24_INT_SEL<<24) | (MW_INTXBAR15_EPWM25_INT_SEL<<25) | (MW_INTXBAR15_EPWM26_INT_SEL<<26) | (MW_INTXBAR15_EPWM27_INT_SEL<<27) | (MW_INTXBAR15_EPWM28_INT_SEL<<28) | (MW_INTXBAR15_EPWM29_INT_SEL<<29) | (MW_INTXBAR15_EPWM30_INT_SEL<<30) | (MW_INTXBAR15_EPWM31_INT_SEL<<31);
    group1_mask[15] = (MW_INTXBAR15_EPWM0_TZINT_SEL<<0) | (MW_INTXBAR15_EPWM1_TZINT_SEL<<1) | (MW_INTXBAR15_EPWM2_TZINT_SEL<<2) | (MW_INTXBAR15_EPWM3_TZINT_SEL<<3) | (MW_INTXBAR15_EPWM4_TZINT_SEL<<4) | (MW_INTXBAR15_EPWM5_TZINT_SEL<<5) | (MW_INTXBAR15_EPWM6_TZINT_SEL<<6) | (MW_INTXBAR15_EPWM7_TZINT_SEL<<7) | (MW_INTXBAR15_EPWM8_TZINT_SEL<<8) | (MW_INTXBAR15_EPWM9_TZINT_SEL<<9) | (MW_INTXBAR15_EPWM10_TZINT_SEL<<10) | (MW_INTXBAR15_EPWM11_TZINT_SEL<<11) | (MW_INTXBAR15_EPWM12_TZINT_SEL<<12) | (MW_INTXBAR15_EPWM13_TZINT_SEL<<13) | (MW_INTXBAR15_EPWM14_TZINT_SEL<<14) | (MW_INTXBAR15_EPWM15_TZINT_SEL<<15) | (MW_INTXBAR15_EPWM16_TZINT_SEL<<16) | (MW_INTXBAR15_EPWM17_TZINT_SEL<<17) | (MW_INTXBAR15_EPWM18_TZINT_SEL<<18) | (MW_INTXBAR15_EPWM19_TZINT_SEL<<19) | (MW_INTXBAR15_EPWM20_TZINT_SEL<<20) | (MW_INTXBAR15_EPWM21_TZINT_SEL<<21) | (MW_INTXBAR15_EPWM22_TZINT_SEL<<22) | (MW_INTXBAR15_EPWM23_TZINT_SEL<<23) | (MW_INTXBAR15_EPWM24_TZINT_SEL<<24) | (MW_INTXBAR15_EPWM25_TZINT_SEL<<25) | (MW_INTXBAR15_EPWM26_TZINT_SEL<<26) | (MW_INTXBAR15_EPWM27_TZINT_SEL<<27) | (MW_INTXBAR15_EPWM28_TZINT_SEL<<28) | (MW_INTXBAR15_EPWM29_TZINT_SEL<<29) | (MW_INTXBAR15_EPWM30_TZINT_SEL<<30) | (MW_INTXBAR15_EPWM31_TZINT_SEL<<31);
    group2_mask[15] = (MW_INTXBAR15_ADC0_INT1_SEL<<0) | (MW_INTXBAR15_ADC0_INT2_SEL<<1) | (MW_INTXBAR15_ADC0_INT3_SEL<<2) | (MW_INTXBAR15_ADC0_INT4_SEL<<3) | (MW_INTXBAR15_ADC0_EVTINT_SEL<<4) | (MW_INTXBAR15_ADC1_INT1_SEL<<5) | (MW_INTXBAR15_ADC1_INT2_SEL<<6) | (MW_INTXBAR15_ADC1_INT3_SEL<<7) | (MW_INTXBAR15_ADC1_INT4_SEL<<8) | (MW_INTXBAR15_ADC1_EVTINT_SEL<<9) | (MW_INTXBAR15_ADC2_INT1_SEL<<10) | (MW_INTXBAR15_ADC2_INT2_SEL<<11) | (MW_INTXBAR15_ADC2_INT3_SEL<<12) | (MW_INTXBAR15_ADC2_INT4_SEL<<13) | (MW_INTXBAR15_ADC2_EVTINT_SEL<<14) | (MW_INTXBAR15_ADC3_INT1_SEL<<15) | (MW_INTXBAR15_ADC3_INT2_SEL<<16) | (MW_INTXBAR15_ADC3_INT3_SEL<<17) | (MW_INTXBAR15_ADC3_INT4_SEL<<18) | (MW_INTXBAR15_ADC3_EVTINT_SEL<<19) | (MW_INTXBAR15_ADC4_INT1_SEL<<20) | (MW_INTXBAR15_ADC4_INT2_SEL<<21) | (MW_INTXBAR15_ADC4_INT3_SEL<<22) | (MW_INTXBAR15_ADC4_INT4_SEL<<23) | (MW_INTXBAR15_ADC4_EVTINT_SEL<<24);
    group3_mask[15] = (MW_INTXBAR15_FSIRX0_INT1N_SEL<<0) | (MW_INTXBAR15_FSIRX0_INT2N_SEL<<1) | (MW_INTXBAR15_FSITX0_INT1N_SEL<<2) | (MW_INTXBAR15_FSITX0_INT2N_SEL<<3) | (MW_INTXBAR15_FSIRX1_INT1N_SEL<<4) | (MW_INTXBAR15_FSIRX1_INT2N_SEL<<5) | (MW_INTXBAR15_FSITX1_INT1N_SEL<<6) | (MW_INTXBAR15_FSITX1_INT2N_SEL<<7) | (MW_INTXBAR15_FSIRX2_INT1N_SEL<<8) | (MW_INTXBAR15_FSIRX2_INT2N_SEL<<9) | (MW_INTXBAR15_FSITX2_INT1N_SEL<<10) | (MW_INTXBAR15_FSITX2_INT2N_SEL<<11) | (MW_INTXBAR15_FSIRX3_INT1N_SEL<<12) | (MW_INTXBAR15_FSIRX3_INT2N_SEL<<13) | (MW_INTXBAR15_FSITX3_INT1N_SEL<<14) | (MW_INTXBAR15_FSITX3_INT2N_SEL<<15);
    group4_mask[15] = (MW_INTXBAR15_SD0_ERR_SEL<<0) | (MW_INTXBAR15_SD0_FILT0_DRINT_SEL<<1) | (MW_INTXBAR15_SD0_FILT1_DRINT_SEL<<2) | (MW_INTXBAR15_SD0_FILT2_DRINT_SEL<<3) | (MW_INTXBAR15_SD0_FILT3_DRINT_SEL<<4) | (MW_INTXBAR15_SD1_ERR_SEL<<5) | (MW_INTXBAR15_SD1_FILT0_DRINT_SEL<<6) | (MW_INTXBAR15_SD1_FILT1_DRINT_SEL<<7) | (MW_INTXBAR15_SD1_FILT2_DRINT_SEL<<8) | (MW_INTXBAR15_SD1_FILT3_DRINT_SEL<<9);
    group5_mask[15] = (MW_INTXBAR15_ECAP0_INT_SEL<<0) | (MW_INTXBAR15_ECAP1_INT_SEL<<1) | (MW_INTXBAR15_ECAP2_INT_SEL<<2) | (MW_INTXBAR15_ECAP3_INT_SEL<<3) | (MW_INTXBAR15_ECAP4_INT_SEL<<4) | (MW_INTXBAR15_ECAP5_INT_SEL<<5) | (MW_INTXBAR15_ECAP6_INT_SEL<<6) | (MW_INTXBAR15_ECAP7_INT_SEL<<7) | (MW_INTXBAR15_ECAP8_INT_SEL<<8) | (MW_INTXBAR15_ECAP9_INT_SEL<<9);
    group6_mask[15] = (MW_INTXBAR15_EQEP0_INT_SEL<<0) | (MW_INTXBAR15_EQEP1_INT_SEL<<1) | (MW_INTXBAR15_EQEP2_INT_SEL<<2);
    group0_mask[16] = (MW_INTXBAR16_EPWM0_INT_SEL<<0) | (MW_INTXBAR16_EPWM1_INT_SEL<<1) | (MW_INTXBAR16_EPWM2_INT_SEL<<2) | (MW_INTXBAR16_EPWM3_INT_SEL<<3) | (MW_INTXBAR16_EPWM4_INT_SEL<<4) | (MW_INTXBAR16_EPWM5_INT_SEL<<5) | (MW_INTXBAR16_EPWM6_INT_SEL<<6) | (MW_INTXBAR16_EPWM7_INT_SEL<<7) | (MW_INTXBAR16_EPWM8_INT_SEL<<8) | (MW_INTXBAR16_EPWM9_INT_SEL<<9) | (MW_INTXBAR16_EPWM10_INT_SEL<<10) | (MW_INTXBAR16_EPWM11_INT_SEL<<11) | (MW_INTXBAR16_EPWM12_INT_SEL<<12) | (MW_INTXBAR16_EPWM13_INT_SEL<<13) | (MW_INTXBAR16_EPWM14_INT_SEL<<14) | (MW_INTXBAR16_EPWM15_INT_SEL<<15) | (MW_INTXBAR16_EPWM16_INT_SEL<<16) | (MW_INTXBAR16_EPWM17_INT_SEL<<17) | (MW_INTXBAR16_EPWM18_INT_SEL<<18) | (MW_INTXBAR16_EPWM19_INT_SEL<<19) | (MW_INTXBAR16_EPWM20_INT_SEL<<20) | (MW_INTXBAR16_EPWM21_INT_SEL<<21) | (MW_INTXBAR16_EPWM22_INT_SEL<<22) | (MW_INTXBAR16_EPWM23_INT_SEL<<23) | (MW_INTXBAR16_EPWM24_INT_SEL<<24) | (MW_INTXBAR16_EPWM25_INT_SEL<<25) | (MW_INTXBAR16_EPWM26_INT_SEL<<26) | (MW_INTXBAR16_EPWM27_INT_SEL<<27) | (MW_INTXBAR16_EPWM28_INT_SEL<<28) | (MW_INTXBAR16_EPWM29_INT_SEL<<29) | (MW_INTXBAR16_EPWM30_INT_SEL<<30) | (MW_INTXBAR16_EPWM31_INT_SEL<<31);
    group1_mask[16] = (MW_INTXBAR16_EPWM0_TZINT_SEL<<0) | (MW_INTXBAR16_EPWM1_TZINT_SEL<<1) | (MW_INTXBAR16_EPWM2_TZINT_SEL<<2) | (MW_INTXBAR16_EPWM3_TZINT_SEL<<3) | (MW_INTXBAR16_EPWM4_TZINT_SEL<<4) | (MW_INTXBAR16_EPWM5_TZINT_SEL<<5) | (MW_INTXBAR16_EPWM6_TZINT_SEL<<6) | (MW_INTXBAR16_EPWM7_TZINT_SEL<<7) | (MW_INTXBAR16_EPWM8_TZINT_SEL<<8) | (MW_INTXBAR16_EPWM9_TZINT_SEL<<9) | (MW_INTXBAR16_EPWM10_TZINT_SEL<<10) | (MW_INTXBAR16_EPWM11_TZINT_SEL<<11) | (MW_INTXBAR16_EPWM12_TZINT_SEL<<12) | (MW_INTXBAR16_EPWM13_TZINT_SEL<<13) | (MW_INTXBAR16_EPWM14_TZINT_SEL<<14) | (MW_INTXBAR16_EPWM15_TZINT_SEL<<15) | (MW_INTXBAR16_EPWM16_TZINT_SEL<<16) | (MW_INTXBAR16_EPWM17_TZINT_SEL<<17) | (MW_INTXBAR16_EPWM18_TZINT_SEL<<18) | (MW_INTXBAR16_EPWM19_TZINT_SEL<<19) | (MW_INTXBAR16_EPWM20_TZINT_SEL<<20) | (MW_INTXBAR16_EPWM21_TZINT_SEL<<21) | (MW_INTXBAR16_EPWM22_TZINT_SEL<<22) | (MW_INTXBAR16_EPWM23_TZINT_SEL<<23) | (MW_INTXBAR16_EPWM24_TZINT_SEL<<24) | (MW_INTXBAR16_EPWM25_TZINT_SEL<<25) | (MW_INTXBAR16_EPWM26_TZINT_SEL<<26) | (MW_INTXBAR16_EPWM27_TZINT_SEL<<27) | (MW_INTXBAR16_EPWM28_TZINT_SEL<<28) | (MW_INTXBAR16_EPWM29_TZINT_SEL<<29) | (MW_INTXBAR16_EPWM30_TZINT_SEL<<30) | (MW_INTXBAR16_EPWM31_TZINT_SEL<<31);
    group2_mask[16] = (MW_INTXBAR16_ADC0_INT1_SEL<<0) | (MW_INTXBAR16_ADC0_INT2_SEL<<1) | (MW_INTXBAR16_ADC0_INT3_SEL<<2) | (MW_INTXBAR16_ADC0_INT4_SEL<<3) | (MW_INTXBAR16_ADC0_EVTINT_SEL<<4) | (MW_INTXBAR16_ADC1_INT1_SEL<<5) | (MW_INTXBAR16_ADC1_INT2_SEL<<6) | (MW_INTXBAR16_ADC1_INT3_SEL<<7) | (MW_INTXBAR16_ADC1_INT4_SEL<<8) | (MW_INTXBAR16_ADC1_EVTINT_SEL<<9) | (MW_INTXBAR16_ADC2_INT1_SEL<<10) | (MW_INTXBAR16_ADC2_INT2_SEL<<11) | (MW_INTXBAR16_ADC2_INT3_SEL<<12) | (MW_INTXBAR16_ADC2_INT4_SEL<<13) | (MW_INTXBAR16_ADC2_EVTINT_SEL<<14) | (MW_INTXBAR16_ADC3_INT1_SEL<<15) | (MW_INTXBAR16_ADC3_INT2_SEL<<16) | (MW_INTXBAR16_ADC3_INT3_SEL<<17) | (MW_INTXBAR16_ADC3_INT4_SEL<<18) | (MW_INTXBAR16_ADC3_EVTINT_SEL<<19) | (MW_INTXBAR16_ADC4_INT1_SEL<<20) | (MW_INTXBAR16_ADC4_INT2_SEL<<21) | (MW_INTXBAR16_ADC4_INT3_SEL<<22) | (MW_INTXBAR16_ADC4_INT4_SEL<<23) | (MW_INTXBAR16_ADC4_EVTINT_SEL<<24);
    group3_mask[16] = (MW_INTXBAR16_FSIRX0_INT1N_SEL<<0) | (MW_INTXBAR16_FSIRX0_INT2N_SEL<<1) | (MW_INTXBAR16_FSITX0_INT1N_SEL<<2) | (MW_INTXBAR16_FSITX0_INT2N_SEL<<3) | (MW_INTXBAR16_FSIRX1_INT1N_SEL<<4) | (MW_INTXBAR16_FSIRX1_INT2N_SEL<<5) | (MW_INTXBAR16_FSITX1_INT1N_SEL<<6) | (MW_INTXBAR16_FSITX1_INT2N_SEL<<7) | (MW_INTXBAR16_FSIRX2_INT1N_SEL<<8) | (MW_INTXBAR16_FSIRX2_INT2N_SEL<<9) | (MW_INTXBAR16_FSITX2_INT1N_SEL<<10) | (MW_INTXBAR16_FSITX2_INT2N_SEL<<11) | (MW_INTXBAR16_FSIRX3_INT1N_SEL<<12) | (MW_INTXBAR16_FSIRX3_INT2N_SEL<<13) | (MW_INTXBAR16_FSITX3_INT1N_SEL<<14) | (MW_INTXBAR16_FSITX3_INT2N_SEL<<15);
    group4_mask[16] = (MW_INTXBAR16_SD0_ERR_SEL<<0) | (MW_INTXBAR16_SD0_FILT0_DRINT_SEL<<1) | (MW_INTXBAR16_SD0_FILT1_DRINT_SEL<<2) | (MW_INTXBAR16_SD0_FILT2_DRINT_SEL<<3) | (MW_INTXBAR16_SD0_FILT3_DRINT_SEL<<4) | (MW_INTXBAR16_SD1_ERR_SEL<<5) | (MW_INTXBAR16_SD1_FILT0_DRINT_SEL<<6) | (MW_INTXBAR16_SD1_FILT1_DRINT_SEL<<7) | (MW_INTXBAR16_SD1_FILT2_DRINT_SEL<<8) | (MW_INTXBAR16_SD1_FILT3_DRINT_SEL<<9);
    group5_mask[16] = (MW_INTXBAR16_ECAP0_INT_SEL<<0) | (MW_INTXBAR16_ECAP1_INT_SEL<<1) | (MW_INTXBAR16_ECAP2_INT_SEL<<2) | (MW_INTXBAR16_ECAP3_INT_SEL<<3) | (MW_INTXBAR16_ECAP4_INT_SEL<<4) | (MW_INTXBAR16_ECAP5_INT_SEL<<5) | (MW_INTXBAR16_ECAP6_INT_SEL<<6) | (MW_INTXBAR16_ECAP7_INT_SEL<<7) | (MW_INTXBAR16_ECAP8_INT_SEL<<8) | (MW_INTXBAR16_ECAP9_INT_SEL<<9);
    group6_mask[16] = (MW_INTXBAR16_EQEP0_INT_SEL<<0) | (MW_INTXBAR16_EQEP1_INT_SEL<<1) | (MW_INTXBAR16_EQEP2_INT_SEL<<2);
    group0_mask[17] = (MW_INTXBAR17_EPWM0_INT_SEL<<0) | (MW_INTXBAR17_EPWM1_INT_SEL<<1) | (MW_INTXBAR17_EPWM2_INT_SEL<<2) | (MW_INTXBAR17_EPWM3_INT_SEL<<3) | (MW_INTXBAR17_EPWM4_INT_SEL<<4) | (MW_INTXBAR17_EPWM5_INT_SEL<<5) | (MW_INTXBAR17_EPWM6_INT_SEL<<6) | (MW_INTXBAR17_EPWM7_INT_SEL<<7) | (MW_INTXBAR17_EPWM8_INT_SEL<<8) | (MW_INTXBAR17_EPWM9_INT_SEL<<9) | (MW_INTXBAR17_EPWM10_INT_SEL<<10) | (MW_INTXBAR17_EPWM11_INT_SEL<<11) | (MW_INTXBAR17_EPWM12_INT_SEL<<12) | (MW_INTXBAR17_EPWM13_INT_SEL<<13) | (MW_INTXBAR17_EPWM14_INT_SEL<<14) | (MW_INTXBAR17_EPWM15_INT_SEL<<15) | (MW_INTXBAR17_EPWM16_INT_SEL<<16) | (MW_INTXBAR17_EPWM17_INT_SEL<<17) | (MW_INTXBAR17_EPWM18_INT_SEL<<18) | (MW_INTXBAR17_EPWM19_INT_SEL<<19) | (MW_INTXBAR17_EPWM20_INT_SEL<<20) | (MW_INTXBAR17_EPWM21_INT_SEL<<21) | (MW_INTXBAR17_EPWM22_INT_SEL<<22) | (MW_INTXBAR17_EPWM23_INT_SEL<<23) | (MW_INTXBAR17_EPWM24_INT_SEL<<24) | (MW_INTXBAR17_EPWM25_INT_SEL<<25) | (MW_INTXBAR17_EPWM26_INT_SEL<<26) | (MW_INTXBAR17_EPWM27_INT_SEL<<27) | (MW_INTXBAR17_EPWM28_INT_SEL<<28) | (MW_INTXBAR17_EPWM29_INT_SEL<<29) | (MW_INTXBAR17_EPWM30_INT_SEL<<30) | (MW_INTXBAR17_EPWM31_INT_SEL<<31);
    group1_mask[17] = (MW_INTXBAR17_EPWM0_TZINT_SEL<<0) | (MW_INTXBAR17_EPWM1_TZINT_SEL<<1) | (MW_INTXBAR17_EPWM2_TZINT_SEL<<2) | (MW_INTXBAR17_EPWM3_TZINT_SEL<<3) | (MW_INTXBAR17_EPWM4_TZINT_SEL<<4) | (MW_INTXBAR17_EPWM5_TZINT_SEL<<5) | (MW_INTXBAR17_EPWM6_TZINT_SEL<<6) | (MW_INTXBAR17_EPWM7_TZINT_SEL<<7) | (MW_INTXBAR17_EPWM8_TZINT_SEL<<8) | (MW_INTXBAR17_EPWM9_TZINT_SEL<<9) | (MW_INTXBAR17_EPWM10_TZINT_SEL<<10) | (MW_INTXBAR17_EPWM11_TZINT_SEL<<11) | (MW_INTXBAR17_EPWM12_TZINT_SEL<<12) | (MW_INTXBAR17_EPWM13_TZINT_SEL<<13) | (MW_INTXBAR17_EPWM14_TZINT_SEL<<14) | (MW_INTXBAR17_EPWM15_TZINT_SEL<<15) | (MW_INTXBAR17_EPWM16_TZINT_SEL<<16) | (MW_INTXBAR17_EPWM17_TZINT_SEL<<17) | (MW_INTXBAR17_EPWM18_TZINT_SEL<<18) | (MW_INTXBAR17_EPWM19_TZINT_SEL<<19) | (MW_INTXBAR17_EPWM20_TZINT_SEL<<20) | (MW_INTXBAR17_EPWM21_TZINT_SEL<<21) | (MW_INTXBAR17_EPWM22_TZINT_SEL<<22) | (MW_INTXBAR17_EPWM23_TZINT_SEL<<23) | (MW_INTXBAR17_EPWM24_TZINT_SEL<<24) | (MW_INTXBAR17_EPWM25_TZINT_SEL<<25) | (MW_INTXBAR17_EPWM26_TZINT_SEL<<26) | (MW_INTXBAR17_EPWM27_TZINT_SEL<<27) | (MW_INTXBAR17_EPWM28_TZINT_SEL<<28) | (MW_INTXBAR17_EPWM29_TZINT_SEL<<29) | (MW_INTXBAR17_EPWM30_TZINT_SEL<<30) | (MW_INTXBAR17_EPWM31_TZINT_SEL<<31);
    group2_mask[17] = (MW_INTXBAR17_ADC0_INT1_SEL<<0) | (MW_INTXBAR17_ADC0_INT2_SEL<<1) | (MW_INTXBAR17_ADC0_INT3_SEL<<2) | (MW_INTXBAR17_ADC0_INT4_SEL<<3) | (MW_INTXBAR17_ADC0_EVTINT_SEL<<4) | (MW_INTXBAR17_ADC1_INT1_SEL<<5) | (MW_INTXBAR17_ADC1_INT2_SEL<<6) | (MW_INTXBAR17_ADC1_INT3_SEL<<7) | (MW_INTXBAR17_ADC1_INT4_SEL<<8) | (MW_INTXBAR17_ADC1_EVTINT_SEL<<9) | (MW_INTXBAR17_ADC2_INT1_SEL<<10) | (MW_INTXBAR17_ADC2_INT2_SEL<<11) | (MW_INTXBAR17_ADC2_INT3_SEL<<12) | (MW_INTXBAR17_ADC2_INT4_SEL<<13) | (MW_INTXBAR17_ADC2_EVTINT_SEL<<14) | (MW_INTXBAR17_ADC3_INT1_SEL<<15) | (MW_INTXBAR17_ADC3_INT2_SEL<<16) | (MW_INTXBAR17_ADC3_INT3_SEL<<17) | (MW_INTXBAR17_ADC3_INT4_SEL<<18) | (MW_INTXBAR17_ADC3_EVTINT_SEL<<19) | (MW_INTXBAR17_ADC4_INT1_SEL<<20) | (MW_INTXBAR17_ADC4_INT2_SEL<<21) | (MW_INTXBAR17_ADC4_INT3_SEL<<22) | (MW_INTXBAR17_ADC4_INT4_SEL<<23) | (MW_INTXBAR17_ADC4_EVTINT_SEL<<24);
    group3_mask[17] = (MW_INTXBAR17_FSIRX0_INT1N_SEL<<0) | (MW_INTXBAR17_FSIRX0_INT2N_SEL<<1) | (MW_INTXBAR17_FSITX0_INT1N_SEL<<2) | (MW_INTXBAR17_FSITX0_INT2N_SEL<<3) | (MW_INTXBAR17_FSIRX1_INT1N_SEL<<4) | (MW_INTXBAR17_FSIRX1_INT2N_SEL<<5) | (MW_INTXBAR17_FSITX1_INT1N_SEL<<6) | (MW_INTXBAR17_FSITX1_INT2N_SEL<<7) | (MW_INTXBAR17_FSIRX2_INT1N_SEL<<8) | (MW_INTXBAR17_FSIRX2_INT2N_SEL<<9) | (MW_INTXBAR17_FSITX2_INT1N_SEL<<10) | (MW_INTXBAR17_FSITX2_INT2N_SEL<<11) | (MW_INTXBAR17_FSIRX3_INT1N_SEL<<12) | (MW_INTXBAR17_FSIRX3_INT2N_SEL<<13) | (MW_INTXBAR17_FSITX3_INT1N_SEL<<14) | (MW_INTXBAR17_FSITX3_INT2N_SEL<<15);
    group4_mask[17] = (MW_INTXBAR17_SD0_ERR_SEL<<0) | (MW_INTXBAR17_SD0_FILT0_DRINT_SEL<<1) | (MW_INTXBAR17_SD0_FILT1_DRINT_SEL<<2) | (MW_INTXBAR17_SD0_FILT2_DRINT_SEL<<3) | (MW_INTXBAR17_SD0_FILT3_DRINT_SEL<<4) | (MW_INTXBAR17_SD1_ERR_SEL<<5) | (MW_INTXBAR17_SD1_FILT0_DRINT_SEL<<6) | (MW_INTXBAR17_SD1_FILT1_DRINT_SEL<<7) | (MW_INTXBAR17_SD1_FILT2_DRINT_SEL<<8) | (MW_INTXBAR17_SD1_FILT3_DRINT_SEL<<9);
    group5_mask[17] = (MW_INTXBAR17_ECAP0_INT_SEL<<0) | (MW_INTXBAR17_ECAP1_INT_SEL<<1) | (MW_INTXBAR17_ECAP2_INT_SEL<<2) | (MW_INTXBAR17_ECAP3_INT_SEL<<3) | (MW_INTXBAR17_ECAP4_INT_SEL<<4) | (MW_INTXBAR17_ECAP5_INT_SEL<<5) | (MW_INTXBAR17_ECAP6_INT_SEL<<6) | (MW_INTXBAR17_ECAP7_INT_SEL<<7) | (MW_INTXBAR17_ECAP8_INT_SEL<<8) | (MW_INTXBAR17_ECAP9_INT_SEL<<9);
    group6_mask[17] = (MW_INTXBAR17_EQEP0_INT_SEL<<0) | (MW_INTXBAR17_EQEP1_INT_SEL<<1) | (MW_INTXBAR17_EQEP2_INT_SEL<<2);
    group0_mask[18] = (MW_INTXBAR18_EPWM0_INT_SEL<<0) | (MW_INTXBAR18_EPWM1_INT_SEL<<1) | (MW_INTXBAR18_EPWM2_INT_SEL<<2) | (MW_INTXBAR18_EPWM3_INT_SEL<<3) | (MW_INTXBAR18_EPWM4_INT_SEL<<4) | (MW_INTXBAR18_EPWM5_INT_SEL<<5) | (MW_INTXBAR18_EPWM6_INT_SEL<<6) | (MW_INTXBAR18_EPWM7_INT_SEL<<7) | (MW_INTXBAR18_EPWM8_INT_SEL<<8) | (MW_INTXBAR18_EPWM9_INT_SEL<<9) | (MW_INTXBAR18_EPWM10_INT_SEL<<10) | (MW_INTXBAR18_EPWM11_INT_SEL<<11) | (MW_INTXBAR18_EPWM12_INT_SEL<<12) | (MW_INTXBAR18_EPWM13_INT_SEL<<13) | (MW_INTXBAR18_EPWM14_INT_SEL<<14) | (MW_INTXBAR18_EPWM15_INT_SEL<<15) | (MW_INTXBAR18_EPWM16_INT_SEL<<16) | (MW_INTXBAR18_EPWM17_INT_SEL<<17) | (MW_INTXBAR18_EPWM18_INT_SEL<<18) | (MW_INTXBAR18_EPWM19_INT_SEL<<19) | (MW_INTXBAR18_EPWM20_INT_SEL<<20) | (MW_INTXBAR18_EPWM21_INT_SEL<<21) | (MW_INTXBAR18_EPWM22_INT_SEL<<22) | (MW_INTXBAR18_EPWM23_INT_SEL<<23) | (MW_INTXBAR18_EPWM24_INT_SEL<<24) | (MW_INTXBAR18_EPWM25_INT_SEL<<25) | (MW_INTXBAR18_EPWM26_INT_SEL<<26) | (MW_INTXBAR18_EPWM27_INT_SEL<<27) | (MW_INTXBAR18_EPWM28_INT_SEL<<28) | (MW_INTXBAR18_EPWM29_INT_SEL<<29) | (MW_INTXBAR18_EPWM30_INT_SEL<<30) | (MW_INTXBAR18_EPWM31_INT_SEL<<31);
    group1_mask[18] = (MW_INTXBAR18_EPWM0_TZINT_SEL<<0) | (MW_INTXBAR18_EPWM1_TZINT_SEL<<1) | (MW_INTXBAR18_EPWM2_TZINT_SEL<<2) | (MW_INTXBAR18_EPWM3_TZINT_SEL<<3) | (MW_INTXBAR18_EPWM4_TZINT_SEL<<4) | (MW_INTXBAR18_EPWM5_TZINT_SEL<<5) | (MW_INTXBAR18_EPWM6_TZINT_SEL<<6) | (MW_INTXBAR18_EPWM7_TZINT_SEL<<7) | (MW_INTXBAR18_EPWM8_TZINT_SEL<<8) | (MW_INTXBAR18_EPWM9_TZINT_SEL<<9) | (MW_INTXBAR18_EPWM10_TZINT_SEL<<10) | (MW_INTXBAR18_EPWM11_TZINT_SEL<<11) | (MW_INTXBAR18_EPWM12_TZINT_SEL<<12) | (MW_INTXBAR18_EPWM13_TZINT_SEL<<13) | (MW_INTXBAR18_EPWM14_TZINT_SEL<<14) | (MW_INTXBAR18_EPWM15_TZINT_SEL<<15) | (MW_INTXBAR18_EPWM16_TZINT_SEL<<16) | (MW_INTXBAR18_EPWM17_TZINT_SEL<<17) | (MW_INTXBAR18_EPWM18_TZINT_SEL<<18) | (MW_INTXBAR18_EPWM19_TZINT_SEL<<19) | (MW_INTXBAR18_EPWM20_TZINT_SEL<<20) | (MW_INTXBAR18_EPWM21_TZINT_SEL<<21) | (MW_INTXBAR18_EPWM22_TZINT_SEL<<22) | (MW_INTXBAR18_EPWM23_TZINT_SEL<<23) | (MW_INTXBAR18_EPWM24_TZINT_SEL<<24) | (MW_INTXBAR18_EPWM25_TZINT_SEL<<25) | (MW_INTXBAR18_EPWM26_TZINT_SEL<<26) | (MW_INTXBAR18_EPWM27_TZINT_SEL<<27) | (MW_INTXBAR18_EPWM28_TZINT_SEL<<28) | (MW_INTXBAR18_EPWM29_TZINT_SEL<<29) | (MW_INTXBAR18_EPWM30_TZINT_SEL<<30) | (MW_INTXBAR18_EPWM31_TZINT_SEL<<31);
    group2_mask[18] = (MW_INTXBAR18_ADC0_INT1_SEL<<0) | (MW_INTXBAR18_ADC0_INT2_SEL<<1) | (MW_INTXBAR18_ADC0_INT3_SEL<<2) | (MW_INTXBAR18_ADC0_INT4_SEL<<3) | (MW_INTXBAR18_ADC0_EVTINT_SEL<<4) | (MW_INTXBAR18_ADC1_INT1_SEL<<5) | (MW_INTXBAR18_ADC1_INT2_SEL<<6) | (MW_INTXBAR18_ADC1_INT3_SEL<<7) | (MW_INTXBAR18_ADC1_INT4_SEL<<8) | (MW_INTXBAR18_ADC1_EVTINT_SEL<<9) | (MW_INTXBAR18_ADC2_INT1_SEL<<10) | (MW_INTXBAR18_ADC2_INT2_SEL<<11) | (MW_INTXBAR18_ADC2_INT3_SEL<<12) | (MW_INTXBAR18_ADC2_INT4_SEL<<13) | (MW_INTXBAR18_ADC2_EVTINT_SEL<<14) | (MW_INTXBAR18_ADC3_INT1_SEL<<15) | (MW_INTXBAR18_ADC3_INT2_SEL<<16) | (MW_INTXBAR18_ADC3_INT3_SEL<<17) | (MW_INTXBAR18_ADC3_INT4_SEL<<18) | (MW_INTXBAR18_ADC3_EVTINT_SEL<<19) | (MW_INTXBAR18_ADC4_INT1_SEL<<20) | (MW_INTXBAR18_ADC4_INT2_SEL<<21) | (MW_INTXBAR18_ADC4_INT3_SEL<<22) | (MW_INTXBAR18_ADC4_INT4_SEL<<23) | (MW_INTXBAR18_ADC4_EVTINT_SEL<<24);
    group3_mask[18] = (MW_INTXBAR18_FSIRX0_INT1N_SEL<<0) | (MW_INTXBAR18_FSIRX0_INT2N_SEL<<1) | (MW_INTXBAR18_FSITX0_INT1N_SEL<<2) | (MW_INTXBAR18_FSITX0_INT2N_SEL<<3) | (MW_INTXBAR18_FSIRX1_INT1N_SEL<<4) | (MW_INTXBAR18_FSIRX1_INT2N_SEL<<5) | (MW_INTXBAR18_FSITX1_INT1N_SEL<<6) | (MW_INTXBAR18_FSITX1_INT2N_SEL<<7) | (MW_INTXBAR18_FSIRX2_INT1N_SEL<<8) | (MW_INTXBAR18_FSIRX2_INT2N_SEL<<9) | (MW_INTXBAR18_FSITX2_INT1N_SEL<<10) | (MW_INTXBAR18_FSITX2_INT2N_SEL<<11) | (MW_INTXBAR18_FSIRX3_INT1N_SEL<<12) | (MW_INTXBAR18_FSIRX3_INT2N_SEL<<13) | (MW_INTXBAR18_FSITX3_INT1N_SEL<<14) | (MW_INTXBAR18_FSITX3_INT2N_SEL<<15);
    group4_mask[18] = (MW_INTXBAR18_SD0_ERR_SEL<<0) | (MW_INTXBAR18_SD0_FILT0_DRINT_SEL<<1) | (MW_INTXBAR18_SD0_FILT1_DRINT_SEL<<2) | (MW_INTXBAR18_SD0_FILT2_DRINT_SEL<<3) | (MW_INTXBAR18_SD0_FILT3_DRINT_SEL<<4) | (MW_INTXBAR18_SD1_ERR_SEL<<5) | (MW_INTXBAR18_SD1_FILT0_DRINT_SEL<<6) | (MW_INTXBAR18_SD1_FILT1_DRINT_SEL<<7) | (MW_INTXBAR18_SD1_FILT2_DRINT_SEL<<8) | (MW_INTXBAR18_SD1_FILT3_DRINT_SEL<<9);
    group5_mask[18] = (MW_INTXBAR18_ECAP0_INT_SEL<<0) | (MW_INTXBAR18_ECAP1_INT_SEL<<1) | (MW_INTXBAR18_ECAP2_INT_SEL<<2) | (MW_INTXBAR18_ECAP3_INT_SEL<<3) | (MW_INTXBAR18_ECAP4_INT_SEL<<4) | (MW_INTXBAR18_ECAP5_INT_SEL<<5) | (MW_INTXBAR18_ECAP6_INT_SEL<<6) | (MW_INTXBAR18_ECAP7_INT_SEL<<7) | (MW_INTXBAR18_ECAP8_INT_SEL<<8) | (MW_INTXBAR18_ECAP9_INT_SEL<<9);
    group6_mask[18] = (MW_INTXBAR18_EQEP0_INT_SEL<<0) | (MW_INTXBAR18_EQEP1_INT_SEL<<1) | (MW_INTXBAR18_EQEP2_INT_SEL<<2);
    group0_mask[19] = (MW_INTXBAR19_EPWM0_INT_SEL<<0) | (MW_INTXBAR19_EPWM1_INT_SEL<<1) | (MW_INTXBAR19_EPWM2_INT_SEL<<2) | (MW_INTXBAR19_EPWM3_INT_SEL<<3) | (MW_INTXBAR19_EPWM4_INT_SEL<<4) | (MW_INTXBAR19_EPWM5_INT_SEL<<5) | (MW_INTXBAR19_EPWM6_INT_SEL<<6) | (MW_INTXBAR19_EPWM7_INT_SEL<<7) | (MW_INTXBAR19_EPWM8_INT_SEL<<8) | (MW_INTXBAR19_EPWM9_INT_SEL<<9) | (MW_INTXBAR19_EPWM10_INT_SEL<<10) | (MW_INTXBAR19_EPWM11_INT_SEL<<11) | (MW_INTXBAR19_EPWM12_INT_SEL<<12) | (MW_INTXBAR19_EPWM13_INT_SEL<<13) | (MW_INTXBAR19_EPWM14_INT_SEL<<14) | (MW_INTXBAR19_EPWM15_INT_SEL<<15) | (MW_INTXBAR19_EPWM16_INT_SEL<<16) | (MW_INTXBAR19_EPWM17_INT_SEL<<17) | (MW_INTXBAR19_EPWM18_INT_SEL<<18) | (MW_INTXBAR19_EPWM19_INT_SEL<<19) | (MW_INTXBAR19_EPWM20_INT_SEL<<20) | (MW_INTXBAR19_EPWM21_INT_SEL<<21) | (MW_INTXBAR19_EPWM22_INT_SEL<<22) | (MW_INTXBAR19_EPWM23_INT_SEL<<23) | (MW_INTXBAR19_EPWM24_INT_SEL<<24) | (MW_INTXBAR19_EPWM25_INT_SEL<<25) | (MW_INTXBAR19_EPWM26_INT_SEL<<26) | (MW_INTXBAR19_EPWM27_INT_SEL<<27) | (MW_INTXBAR19_EPWM28_INT_SEL<<28) | (MW_INTXBAR19_EPWM29_INT_SEL<<29) | (MW_INTXBAR19_EPWM30_INT_SEL<<30) | (MW_INTXBAR19_EPWM31_INT_SEL<<31);
    group1_mask[19] = (MW_INTXBAR19_EPWM0_TZINT_SEL<<0) | (MW_INTXBAR19_EPWM1_TZINT_SEL<<1) | (MW_INTXBAR19_EPWM2_TZINT_SEL<<2) | (MW_INTXBAR19_EPWM3_TZINT_SEL<<3) | (MW_INTXBAR19_EPWM4_TZINT_SEL<<4) | (MW_INTXBAR19_EPWM5_TZINT_SEL<<5) | (MW_INTXBAR19_EPWM6_TZINT_SEL<<6) | (MW_INTXBAR19_EPWM7_TZINT_SEL<<7) | (MW_INTXBAR19_EPWM8_TZINT_SEL<<8) | (MW_INTXBAR19_EPWM9_TZINT_SEL<<9) | (MW_INTXBAR19_EPWM10_TZINT_SEL<<10) | (MW_INTXBAR19_EPWM11_TZINT_SEL<<11) | (MW_INTXBAR19_EPWM12_TZINT_SEL<<12) | (MW_INTXBAR19_EPWM13_TZINT_SEL<<13) | (MW_INTXBAR19_EPWM14_TZINT_SEL<<14) | (MW_INTXBAR19_EPWM15_TZINT_SEL<<15) | (MW_INTXBAR19_EPWM16_TZINT_SEL<<16) | (MW_INTXBAR19_EPWM17_TZINT_SEL<<17) | (MW_INTXBAR19_EPWM18_TZINT_SEL<<18) | (MW_INTXBAR19_EPWM19_TZINT_SEL<<19) | (MW_INTXBAR19_EPWM20_TZINT_SEL<<20) | (MW_INTXBAR19_EPWM21_TZINT_SEL<<21) | (MW_INTXBAR19_EPWM22_TZINT_SEL<<22) | (MW_INTXBAR19_EPWM23_TZINT_SEL<<23) | (MW_INTXBAR19_EPWM24_TZINT_SEL<<24) | (MW_INTXBAR19_EPWM25_TZINT_SEL<<25) | (MW_INTXBAR19_EPWM26_TZINT_SEL<<26) | (MW_INTXBAR19_EPWM27_TZINT_SEL<<27) | (MW_INTXBAR19_EPWM28_TZINT_SEL<<28) | (MW_INTXBAR19_EPWM29_TZINT_SEL<<29) | (MW_INTXBAR19_EPWM30_TZINT_SEL<<30) | (MW_INTXBAR19_EPWM31_TZINT_SEL<<31);
    group2_mask[19] = (MW_INTXBAR19_ADC0_INT1_SEL<<0) | (MW_INTXBAR19_ADC0_INT2_SEL<<1) | (MW_INTXBAR19_ADC0_INT3_SEL<<2) | (MW_INTXBAR19_ADC0_INT4_SEL<<3) | (MW_INTXBAR19_ADC0_EVTINT_SEL<<4) | (MW_INTXBAR19_ADC1_INT1_SEL<<5) | (MW_INTXBAR19_ADC1_INT2_SEL<<6) | (MW_INTXBAR19_ADC1_INT3_SEL<<7) | (MW_INTXBAR19_ADC1_INT4_SEL<<8) | (MW_INTXBAR19_ADC1_EVTINT_SEL<<9) | (MW_INTXBAR19_ADC2_INT1_SEL<<10) | (MW_INTXBAR19_ADC2_INT2_SEL<<11) | (MW_INTXBAR19_ADC2_INT3_SEL<<12) | (MW_INTXBAR19_ADC2_INT4_SEL<<13) | (MW_INTXBAR19_ADC2_EVTINT_SEL<<14) | (MW_INTXBAR19_ADC3_INT1_SEL<<15) | (MW_INTXBAR19_ADC3_INT2_SEL<<16) | (MW_INTXBAR19_ADC3_INT3_SEL<<17) | (MW_INTXBAR19_ADC3_INT4_SEL<<18) | (MW_INTXBAR19_ADC3_EVTINT_SEL<<19) | (MW_INTXBAR19_ADC4_INT1_SEL<<20) | (MW_INTXBAR19_ADC4_INT2_SEL<<21) | (MW_INTXBAR19_ADC4_INT3_SEL<<22) | (MW_INTXBAR19_ADC4_INT4_SEL<<23) | (MW_INTXBAR19_ADC4_EVTINT_SEL<<24);
    group3_mask[19] = (MW_INTXBAR19_FSIRX0_INT1N_SEL<<0) | (MW_INTXBAR19_FSIRX0_INT2N_SEL<<1) | (MW_INTXBAR19_FSITX0_INT1N_SEL<<2) | (MW_INTXBAR19_FSITX0_INT2N_SEL<<3) | (MW_INTXBAR19_FSIRX1_INT1N_SEL<<4) | (MW_INTXBAR19_FSIRX1_INT2N_SEL<<5) | (MW_INTXBAR19_FSITX1_INT1N_SEL<<6) | (MW_INTXBAR19_FSITX1_INT2N_SEL<<7) | (MW_INTXBAR19_FSIRX2_INT1N_SEL<<8) | (MW_INTXBAR19_FSIRX2_INT2N_SEL<<9) | (MW_INTXBAR19_FSITX2_INT1N_SEL<<10) | (MW_INTXBAR19_FSITX2_INT2N_SEL<<11) | (MW_INTXBAR19_FSIRX3_INT1N_SEL<<12) | (MW_INTXBAR19_FSIRX3_INT2N_SEL<<13) | (MW_INTXBAR19_FSITX3_INT1N_SEL<<14) | (MW_INTXBAR19_FSITX3_INT2N_SEL<<15);
    group4_mask[19] = (MW_INTXBAR19_SD0_ERR_SEL<<0) | (MW_INTXBAR19_SD0_FILT0_DRINT_SEL<<1) | (MW_INTXBAR19_SD0_FILT1_DRINT_SEL<<2) | (MW_INTXBAR19_SD0_FILT2_DRINT_SEL<<3) | (MW_INTXBAR19_SD0_FILT3_DRINT_SEL<<4) | (MW_INTXBAR19_SD1_ERR_SEL<<5) | (MW_INTXBAR19_SD1_FILT0_DRINT_SEL<<6) | (MW_INTXBAR19_SD1_FILT1_DRINT_SEL<<7) | (MW_INTXBAR19_SD1_FILT2_DRINT_SEL<<8) | (MW_INTXBAR19_SD1_FILT3_DRINT_SEL<<9);
    group5_mask[19] = (MW_INTXBAR19_ECAP0_INT_SEL<<0) | (MW_INTXBAR19_ECAP1_INT_SEL<<1) | (MW_INTXBAR19_ECAP2_INT_SEL<<2) | (MW_INTXBAR19_ECAP3_INT_SEL<<3) | (MW_INTXBAR19_ECAP4_INT_SEL<<4) | (MW_INTXBAR19_ECAP5_INT_SEL<<5) | (MW_INTXBAR19_ECAP6_INT_SEL<<6) | (MW_INTXBAR19_ECAP7_INT_SEL<<7) | (MW_INTXBAR19_ECAP8_INT_SEL<<8) | (MW_INTXBAR19_ECAP9_INT_SEL<<9);
