TexasInstruments/am26x-hsp/src/am263px_init.c
    group6_mask[19] = (MW_INTXBAR19_EQEP0_INT_SEL<<0) | (MW_INTXBAR19_EQEP1_INT_SEL<<1) | (MW_INTXBAR19_EQEP2_INT_SEL<<2);
    group0_mask[20] = (MW_INTXBAR20_EPWM0_INT_SEL<<0) | (MW_INTXBAR20_EPWM1_INT_SEL<<1) | (MW_INTXBAR20_EPWM2_INT_SEL<<2) | (MW_INTXBAR20_EPWM3_INT_SEL<<3) | (MW_INTXBAR20_EPWM4_INT_SEL<<4) | (MW_INTXBAR20_EPWM5_INT_SEL<<5) | (MW_INTXBAR20_EPWM6_INT_SEL<<6) | (MW_INTXBAR20_EPWM7_INT_SEL<<7) | (MW_INTXBAR20_EPWM8_INT_SEL<<8) | (MW_INTXBAR20_EPWM9_INT_SEL<<9) | (MW_INTXBAR20_EPWM10_INT_SEL<<10) | (MW_INTXBAR20_EPWM11_INT_SEL<<11) | (MW_INTXBAR20_EPWM12_INT_SEL<<12) | (MW_INTXBAR20_EPWM13_INT_SEL<<13) | (MW_INTXBAR20_EPWM14_INT_SEL<<14) | (MW_INTXBAR20_EPWM15_INT_SEL<<15) | (MW_INTXBAR20_EPWM16_INT_SEL<<16) | (MW_INTXBAR20_EPWM17_INT_SEL<<17) | (MW_INTXBAR20_EPWM18_INT_SEL<<18) | (MW_INTXBAR20_EPWM19_INT_SEL<<19) | (MW_INTXBAR20_EPWM20_INT_SEL<<20) | (MW_INTXBAR20_EPWM21_INT_SEL<<21) | (MW_INTXBAR20_EPWM22_INT_SEL<<22) | (MW_INTXBAR20_EPWM23_INT_SEL<<23) | (MW_INTXBAR20_EPWM24_INT_SEL<<24) | (MW_INTXBAR20_EPWM25_INT_SEL<<25) | (MW_INTXBAR20_EPWM26_INT_SEL<<26) | (MW_INTXBAR20_EPWM27_INT_SEL<<27) | (MW_INTXBAR20_EPWM28_INT_SEL<<28) | (MW_INTXBAR20_EPWM29_INT_SEL<<29) | (MW_INTXBAR20_EPWM30_INT_SEL<<30) | (MW_INTXBAR20_EPWM31_INT_SEL<<31);
    group1_mask[20] = (MW_INTXBAR20_EPWM0_TZINT_SEL<<0) | (MW_INTXBAR20_EPWM1_TZINT_SEL<<1) | (MW_INTXBAR20_EPWM2_TZINT_SEL<<2) | (MW_INTXBAR20_EPWM3_TZINT_SEL<<3) | (MW_INTXBAR20_EPWM4_TZINT_SEL<<4) | (MW_INTXBAR20_EPWM5_TZINT_SEL<<5) | (MW_INTXBAR20_EPWM6_TZINT_SEL<<6) | (MW_INTXBAR20_EPWM7_TZINT_SEL<<7) | (MW_INTXBAR20_EPWM8_TZINT_SEL<<8) | (MW_INTXBAR20_EPWM9_TZINT_SEL<<9) | (MW_INTXBAR20_EPWM10_TZINT_SEL<<10) | (MW_INTXBAR20_EPWM11_TZINT_SEL<<11) | (MW_INTXBAR20_EPWM12_TZINT_SEL<<12) | (MW_INTXBAR20_EPWM13_TZINT_SEL<<13) | (MW_INTXBAR20_EPWM14_TZINT_SEL<<14) | (MW_INTXBAR20_EPWM15_TZINT_SEL<<15) | (MW_INTXBAR20_EPWM16_TZINT_SEL<<16) | (MW_INTXBAR20_EPWM17_TZINT_SEL<<17) | (MW_INTXBAR20_EPWM18_TZINT_SEL<<18) | (MW_INTXBAR20_EPWM19_TZINT_SEL<<19) | (MW_INTXBAR20_EPWM20_TZINT_SEL<<20) | (MW_INTXBAR20_EPWM21_TZINT_SEL<<21) | (MW_INTXBAR20_EPWM22_TZINT_SEL<<22) | (MW_INTXBAR20_EPWM23_TZINT_SEL<<23) | (MW_INTXBAR20_EPWM24_TZINT_SEL<<24) | (MW_INTXBAR20_EPWM25_TZINT_SEL<<25) | (MW_INTXBAR20_EPWM26_TZINT_SEL<<26) | (MW_INTXBAR20_EPWM27_TZINT_SEL<<27) | (MW_INTXBAR20_EPWM28_TZINT_SEL<<28) | (MW_INTXBAR20_EPWM29_TZINT_SEL<<29) | (MW_INTXBAR20_EPWM30_TZINT_SEL<<30) | (MW_INTXBAR20_EPWM31_TZINT_SEL<<31);
    group2_mask[20] = (MW_INTXBAR20_ADC0_INT1_SEL<<0) | (MW_INTXBAR20_ADC0_INT2_SEL<<1) | (MW_INTXBAR20_ADC0_INT3_SEL<<2) | (MW_INTXBAR20_ADC0_INT4_SEL<<3) | (MW_INTXBAR20_ADC0_EVTINT_SEL<<4) | (MW_INTXBAR20_ADC1_INT1_SEL<<5) | (MW_INTXBAR20_ADC1_INT2_SEL<<6) | (MW_INTXBAR20_ADC1_INT3_SEL<<7) | (MW_INTXBAR20_ADC1_INT4_SEL<<8) | (MW_INTXBAR20_ADC1_EVTINT_SEL<<9) | (MW_INTXBAR20_ADC2_INT1_SEL<<10) | (MW_INTXBAR20_ADC2_INT2_SEL<<11) | (MW_INTXBAR20_ADC2_INT3_SEL<<12) | (MW_INTXBAR20_ADC2_INT4_SEL<<13) | (MW_INTXBAR20_ADC2_EVTINT_SEL<<14) | (MW_INTXBAR20_ADC3_INT1_SEL<<15) | (MW_INTXBAR20_ADC3_INT2_SEL<<16) | (MW_INTXBAR20_ADC3_INT3_SEL<<17) | (MW_INTXBAR20_ADC3_INT4_SEL<<18) | (MW_INTXBAR20_ADC3_EVTINT_SEL<<19) | (MW_INTXBAR20_ADC4_INT1_SEL<<20) | (MW_INTXBAR20_ADC4_INT2_SEL<<21) | (MW_INTXBAR20_ADC4_INT3_SEL<<22) | (MW_INTXBAR20_ADC4_INT4_SEL<<23) | (MW_INTXBAR20_ADC4_EVTINT_SEL<<24);
    group3_mask[20] = (MW_INTXBAR20_FSIRX0_INT1N_SEL<<0) | (MW_INTXBAR20_FSIRX0_INT2N_SEL<<1) | (MW_INTXBAR20_FSITX0_INT1N_SEL<<2) | (MW_INTXBAR20_FSITX0_INT2N_SEL<<3) | (MW_INTXBAR20_FSIRX1_INT1N_SEL<<4) | (MW_INTXBAR20_FSIRX1_INT2N_SEL<<5) | (MW_INTXBAR20_FSITX1_INT1N_SEL<<6) | (MW_INTXBAR20_FSITX1_INT2N_SEL<<7) | (MW_INTXBAR20_FSIRX2_INT1N_SEL<<8) | (MW_INTXBAR20_FSIRX2_INT2N_SEL<<9) | (MW_INTXBAR20_FSITX2_INT1N_SEL<<10) | (MW_INTXBAR20_FSITX2_INT2N_SEL<<11) | (MW_INTXBAR20_FSIRX3_INT1N_SEL<<12) | (MW_INTXBAR20_FSIRX3_INT2N_SEL<<13) | (MW_INTXBAR20_FSITX3_INT1N_SEL<<14) | (MW_INTXBAR20_FSITX3_INT2N_SEL<<15);
    group4_mask[20] = (MW_INTXBAR20_SD0_ERR_SEL<<0) | (MW_INTXBAR20_SD0_FILT0_DRINT_SEL<<1) | (MW_INTXBAR20_SD0_FILT1_DRINT_SEL<<2) | (MW_INTXBAR20_SD0_FILT2_DRINT_SEL<<3) | (MW_INTXBAR20_SD0_FILT3_DRINT_SEL<<4) | (MW_INTXBAR20_SD1_ERR_SEL<<5) | (MW_INTXBAR20_SD1_FILT0_DRINT_SEL<<6) | (MW_INTXBAR20_SD1_FILT1_DRINT_SEL<<7) | (MW_INTXBAR20_SD1_FILT2_DRINT_SEL<<8) | (MW_INTXBAR20_SD1_FILT3_DRINT_SEL<<9);
    group5_mask[20] = (MW_INTXBAR20_ECAP0_INT_SEL<<0) | (MW_INTXBAR20_ECAP1_INT_SEL<<1) | (MW_INTXBAR20_ECAP2_INT_SEL<<2) | (MW_INTXBAR20_ECAP3_INT_SEL<<3) | (MW_INTXBAR20_ECAP4_INT_SEL<<4) | (MW_INTXBAR20_ECAP5_INT_SEL<<5) | (MW_INTXBAR20_ECAP6_INT_SEL<<6) | (MW_INTXBAR20_ECAP7_INT_SEL<<7) | (MW_INTXBAR20_ECAP8_INT_SEL<<8) | (MW_INTXBAR20_ECAP9_INT_SEL<<9);
    group6_mask[20] = (MW_INTXBAR20_EQEP0_INT_SEL<<0) | (MW_INTXBAR20_EQEP1_INT_SEL<<1) | (MW_INTXBAR20_EQEP2_INT_SEL<<2);
    group0_mask[21] = (MW_INTXBAR21_EPWM0_INT_SEL<<0) | (MW_INTXBAR21_EPWM1_INT_SEL<<1) | (MW_INTXBAR21_EPWM2_INT_SEL<<2) | (MW_INTXBAR21_EPWM3_INT_SEL<<3) | (MW_INTXBAR21_EPWM4_INT_SEL<<4) | (MW_INTXBAR21_EPWM5_INT_SEL<<5) | (MW_INTXBAR21_EPWM6_INT_SEL<<6) | (MW_INTXBAR21_EPWM7_INT_SEL<<7) | (MW_INTXBAR21_EPWM8_INT_SEL<<8) | (MW_INTXBAR21_EPWM9_INT_SEL<<9) | (MW_INTXBAR21_EPWM10_INT_SEL<<10) | (MW_INTXBAR21_EPWM11_INT_SEL<<11) | (MW_INTXBAR21_EPWM12_INT_SEL<<12) | (MW_INTXBAR21_EPWM13_INT_SEL<<13) | (MW_INTXBAR21_EPWM14_INT_SEL<<14) | (MW_INTXBAR21_EPWM15_INT_SEL<<15) | (MW_INTXBAR21_EPWM16_INT_SEL<<16) | (MW_INTXBAR21_EPWM17_INT_SEL<<17) | (MW_INTXBAR21_EPWM18_INT_SEL<<18) | (MW_INTXBAR21_EPWM19_INT_SEL<<19) | (MW_INTXBAR21_EPWM20_INT_SEL<<20) | (MW_INTXBAR21_EPWM21_INT_SEL<<21) | (MW_INTXBAR21_EPWM22_INT_SEL<<22) | (MW_INTXBAR21_EPWM23_INT_SEL<<23) | (MW_INTXBAR21_EPWM24_INT_SEL<<24) | (MW_INTXBAR21_EPWM25_INT_SEL<<25) | (MW_INTXBAR21_EPWM26_INT_SEL<<26) | (MW_INTXBAR21_EPWM27_INT_SEL<<27) | (MW_INTXBAR21_EPWM28_INT_SEL<<28) | (MW_INTXBAR21_EPWM29_INT_SEL<<29) | (MW_INTXBAR21_EPWM30_INT_SEL<<30) | (MW_INTXBAR21_EPWM31_INT_SEL<<31);
    group1_mask[21] = (MW_INTXBAR21_EPWM0_TZINT_SEL<<0) | (MW_INTXBAR21_EPWM1_TZINT_SEL<<1) | (MW_INTXBAR21_EPWM2_TZINT_SEL<<2) | (MW_INTXBAR21_EPWM3_TZINT_SEL<<3) | (MW_INTXBAR21_EPWM4_TZINT_SEL<<4) | (MW_INTXBAR21_EPWM5_TZINT_SEL<<5) | (MW_INTXBAR21_EPWM6_TZINT_SEL<<6) | (MW_INTXBAR21_EPWM7_TZINT_SEL<<7) | (MW_INTXBAR21_EPWM8_TZINT_SEL<<8) | (MW_INTXBAR21_EPWM9_TZINT_SEL<<9) | (MW_INTXBAR21_EPWM10_TZINT_SEL<<10) | (MW_INTXBAR21_EPWM11_TZINT_SEL<<11) | (MW_INTXBAR21_EPWM12_TZINT_SEL<<12) | (MW_INTXBAR21_EPWM13_TZINT_SEL<<13) | (MW_INTXBAR21_EPWM14_TZINT_SEL<<14) | (MW_INTXBAR21_EPWM15_TZINT_SEL<<15) | (MW_INTXBAR21_EPWM16_TZINT_SEL<<16) | (MW_INTXBAR21_EPWM17_TZINT_SEL<<17) | (MW_INTXBAR21_EPWM18_TZINT_SEL<<18) | (MW_INTXBAR21_EPWM19_TZINT_SEL<<19) | (MW_INTXBAR21_EPWM20_TZINT_SEL<<20) | (MW_INTXBAR21_EPWM21_TZINT_SEL<<21) | (MW_INTXBAR21_EPWM22_TZINT_SEL<<22) | (MW_INTXBAR21_EPWM23_TZINT_SEL<<23) | (MW_INTXBAR21_EPWM24_TZINT_SEL<<24) | (MW_INTXBAR21_EPWM25_TZINT_SEL<<25) | (MW_INTXBAR21_EPWM26_TZINT_SEL<<26) | (MW_INTXBAR21_EPWM27_TZINT_SEL<<27) | (MW_INTXBAR21_EPWM28_TZINT_SEL<<28) | (MW_INTXBAR21_EPWM29_TZINT_SEL<<29) | (MW_INTXBAR21_EPWM30_TZINT_SEL<<30) | (MW_INTXBAR21_EPWM31_TZINT_SEL<<31);
    group2_mask[21] = (MW_INTXBAR21_ADC0_INT1_SEL<<0) | (MW_INTXBAR21_ADC0_INT2_SEL<<1) | (MW_INTXBAR21_ADC0_INT3_SEL<<2) | (MW_INTXBAR21_ADC0_INT4_SEL<<3) | (MW_INTXBAR21_ADC0_EVTINT_SEL<<4) | (MW_INTXBAR21_ADC1_INT1_SEL<<5) | (MW_INTXBAR21_ADC1_INT2_SEL<<6) | (MW_INTXBAR21_ADC1_INT3_SEL<<7) | (MW_INTXBAR21_ADC1_INT4_SEL<<8) | (MW_INTXBAR21_ADC1_EVTINT_SEL<<9) | (MW_INTXBAR21_ADC2_INT1_SEL<<10) | (MW_INTXBAR21_ADC2_INT2_SEL<<11) | (MW_INTXBAR21_ADC2_INT3_SEL<<12) | (MW_INTXBAR21_ADC2_INT4_SEL<<13) | (MW_INTXBAR21_ADC2_EVTINT_SEL<<14) | (MW_INTXBAR21_ADC3_INT1_SEL<<15) | (MW_INTXBAR21_ADC3_INT2_SEL<<16) | (MW_INTXBAR21_ADC3_INT3_SEL<<17) | (MW_INTXBAR21_ADC3_INT4_SEL<<18) | (MW_INTXBAR21_ADC3_EVTINT_SEL<<19) | (MW_INTXBAR21_ADC4_INT1_SEL<<20) | (MW_INTXBAR21_ADC4_INT2_SEL<<21) | (MW_INTXBAR21_ADC4_INT3_SEL<<22) | (MW_INTXBAR21_ADC4_INT4_SEL<<23) | (MW_INTXBAR21_ADC4_EVTINT_SEL<<24);
    group3_mask[21] = (MW_INTXBAR21_FSIRX0_INT1N_SEL<<0) | (MW_INTXBAR21_FSIRX0_INT2N_SEL<<1) | (MW_INTXBAR21_FSITX0_INT1N_SEL<<2) | (MW_INTXBAR21_FSITX0_INT2N_SEL<<3) | (MW_INTXBAR21_FSIRX1_INT1N_SEL<<4) | (MW_INTXBAR21_FSIRX1_INT2N_SEL<<5) | (MW_INTXBAR21_FSITX1_INT1N_SEL<<6) | (MW_INTXBAR21_FSITX1_INT2N_SEL<<7) | (MW_INTXBAR21_FSIRX2_INT1N_SEL<<8) | (MW_INTXBAR21_FSIRX2_INT2N_SEL<<9) | (MW_INTXBAR21_FSITX2_INT1N_SEL<<10) | (MW_INTXBAR21_FSITX2_INT2N_SEL<<11) | (MW_INTXBAR21_FSIRX3_INT1N_SEL<<12) | (MW_INTXBAR21_FSIRX3_INT2N_SEL<<13) | (MW_INTXBAR21_FSITX3_INT1N_SEL<<14) | (MW_INTXBAR21_FSITX3_INT2N_SEL<<15);
    group4_mask[21] = (MW_INTXBAR21_SD0_ERR_SEL<<0) | (MW_INTXBAR21_SD0_FILT0_DRINT_SEL<<1) | (MW_INTXBAR21_SD0_FILT1_DRINT_SEL<<2) | (MW_INTXBAR21_SD0_FILT2_DRINT_SEL<<3) | (MW_INTXBAR21_SD0_FILT3_DRINT_SEL<<4) | (MW_INTXBAR21_SD1_ERR_SEL<<5) | (MW_INTXBAR21_SD1_FILT0_DRINT_SEL<<6) | (MW_INTXBAR21_SD1_FILT1_DRINT_SEL<<7) | (MW_INTXBAR21_SD1_FILT2_DRINT_SEL<<8) | (MW_INTXBAR21_SD1_FILT3_DRINT_SEL<<9);
    group5_mask[21] = (MW_INTXBAR21_ECAP0_INT_SEL<<0) | (MW_INTXBAR21_ECAP1_INT_SEL<<1) | (MW_INTXBAR21_ECAP2_INT_SEL<<2) | (MW_INTXBAR21_ECAP3_INT_SEL<<3) | (MW_INTXBAR21_ECAP4_INT_SEL<<4) | (MW_INTXBAR21_ECAP5_INT_SEL<<5) | (MW_INTXBAR21_ECAP6_INT_SEL<<6) | (MW_INTXBAR21_ECAP7_INT_SEL<<7) | (MW_INTXBAR21_ECAP8_INT_SEL<<8) | (MW_INTXBAR21_ECAP9_INT_SEL<<9);
    group6_mask[21] = (MW_INTXBAR21_EQEP0_INT_SEL<<0) | (MW_INTXBAR21_EQEP1_INT_SEL<<1) | (MW_INTXBAR21_EQEP2_INT_SEL<<2);
    group0_mask[22] = (MW_INTXBAR22_EPWM0_INT_SEL<<0) | (MW_INTXBAR22_EPWM1_INT_SEL<<1) | (MW_INTXBAR22_EPWM2_INT_SEL<<2) | (MW_INTXBAR22_EPWM3_INT_SEL<<3) | (MW_INTXBAR22_EPWM4_INT_SEL<<4) | (MW_INTXBAR22_EPWM5_INT_SEL<<5) | (MW_INTXBAR22_EPWM6_INT_SEL<<6) | (MW_INTXBAR22_EPWM7_INT_SEL<<7) | (MW_INTXBAR22_EPWM8_INT_SEL<<8) | (MW_INTXBAR22_EPWM9_INT_SEL<<9) | (MW_INTXBAR22_EPWM10_INT_SEL<<10) | (MW_INTXBAR22_EPWM11_INT_SEL<<11) | (MW_INTXBAR22_EPWM12_INT_SEL<<12) | (MW_INTXBAR22_EPWM13_INT_SEL<<13) | (MW_INTXBAR22_EPWM14_INT_SEL<<14) | (MW_INTXBAR22_EPWM15_INT_SEL<<15) | (MW_INTXBAR22_EPWM16_INT_SEL<<16) | (MW_INTXBAR22_EPWM17_INT_SEL<<17) | (MW_INTXBAR22_EPWM18_INT_SEL<<18) | (MW_INTXBAR22_EPWM19_INT_SEL<<19) | (MW_INTXBAR22_EPWM20_INT_SEL<<20) | (MW_INTXBAR22_EPWM21_INT_SEL<<21) | (MW_INTXBAR22_EPWM22_INT_SEL<<22) | (MW_INTXBAR22_EPWM23_INT_SEL<<23) | (MW_INTXBAR22_EPWM24_INT_SEL<<24) | (MW_INTXBAR22_EPWM25_INT_SEL<<25) | (MW_INTXBAR22_EPWM26_INT_SEL<<26) | (MW_INTXBAR22_EPWM27_INT_SEL<<27) | (MW_INTXBAR22_EPWM28_INT_SEL<<28) | (MW_INTXBAR22_EPWM29_INT_SEL<<29) | (MW_INTXBAR22_EPWM30_INT_SEL<<30) | (MW_INTXBAR22_EPWM31_INT_SEL<<31);
    group1_mask[22] = (MW_INTXBAR22_EPWM0_TZINT_SEL<<0) | (MW_INTXBAR22_EPWM1_TZINT_SEL<<1) | (MW_INTXBAR22_EPWM2_TZINT_SEL<<2) | (MW_INTXBAR22_EPWM3_TZINT_SEL<<3) | (MW_INTXBAR22_EPWM4_TZINT_SEL<<4) | (MW_INTXBAR22_EPWM5_TZINT_SEL<<5) | (MW_INTXBAR22_EPWM6_TZINT_SEL<<6) | (MW_INTXBAR22_EPWM7_TZINT_SEL<<7) | (MW_INTXBAR22_EPWM8_TZINT_SEL<<8) | (MW_INTXBAR22_EPWM9_TZINT_SEL<<9) | (MW_INTXBAR22_EPWM10_TZINT_SEL<<10) | (MW_INTXBAR22_EPWM11_TZINT_SEL<<11) | (MW_INTXBAR22_EPWM12_TZINT_SEL<<12) | (MW_INTXBAR22_EPWM13_TZINT_SEL<<13) | (MW_INTXBAR22_EPWM14_TZINT_SEL<<14) | (MW_INTXBAR22_EPWM15_TZINT_SEL<<15) | (MW_INTXBAR22_EPWM16_TZINT_SEL<<16) | (MW_INTXBAR22_EPWM17_TZINT_SEL<<17) | (MW_INTXBAR22_EPWM18_TZINT_SEL<<18) | (MW_INTXBAR22_EPWM19_TZINT_SEL<<19) | (MW_INTXBAR22_EPWM20_TZINT_SEL<<20) | (MW_INTXBAR22_EPWM21_TZINT_SEL<<21) | (MW_INTXBAR22_EPWM22_TZINT_SEL<<22) | (MW_INTXBAR22_EPWM23_TZINT_SEL<<23) | (MW_INTXBAR22_EPWM24_TZINT_SEL<<24) | (MW_INTXBAR22_EPWM25_TZINT_SEL<<25) | (MW_INTXBAR22_EPWM26_TZINT_SEL<<26) | (MW_INTXBAR22_EPWM27_TZINT_SEL<<27) | (MW_INTXBAR22_EPWM28_TZINT_SEL<<28) | (MW_INTXBAR22_EPWM29_TZINT_SEL<<29) | (MW_INTXBAR22_EPWM30_TZINT_SEL<<30) | (MW_INTXBAR22_EPWM31_TZINT_SEL<<31);
    group2_mask[22] = (MW_INTXBAR22_ADC0_INT1_SEL<<0) | (MW_INTXBAR22_ADC0_INT2_SEL<<1) | (MW_INTXBAR22_ADC0_INT3_SEL<<2) | (MW_INTXBAR22_ADC0_INT4_SEL<<3) | (MW_INTXBAR22_ADC0_EVTINT_SEL<<4) | (MW_INTXBAR22_ADC1_INT1_SEL<<5) | (MW_INTXBAR22_ADC1_INT2_SEL<<6) | (MW_INTXBAR22_ADC1_INT3_SEL<<7) | (MW_INTXBAR22_ADC1_INT4_SEL<<8) | (MW_INTXBAR22_ADC1_EVTINT_SEL<<9) | (MW_INTXBAR22_ADC2_INT1_SEL<<10) | (MW_INTXBAR22_ADC2_INT2_SEL<<11) | (MW_INTXBAR22_ADC2_INT3_SEL<<12) | (MW_INTXBAR22_ADC2_INT4_SEL<<13) | (MW_INTXBAR22_ADC2_EVTINT_SEL<<14) | (MW_INTXBAR22_ADC3_INT1_SEL<<15) | (MW_INTXBAR22_ADC3_INT2_SEL<<16) | (MW_INTXBAR22_ADC3_INT3_SEL<<17) | (MW_INTXBAR22_ADC3_INT4_SEL<<18) | (MW_INTXBAR22_ADC3_EVTINT_SEL<<19) | (MW_INTXBAR22_ADC4_INT1_SEL<<20) | (MW_INTXBAR22_ADC4_INT2_SEL<<21) | (MW_INTXBAR22_ADC4_INT3_SEL<<22) | (MW_INTXBAR22_ADC4_INT4_SEL<<23) | (MW_INTXBAR22_ADC4_EVTINT_SEL<<24);
    group3_mask[22] = (MW_INTXBAR22_FSIRX0_INT1N_SEL<<0) | (MW_INTXBAR22_FSIRX0_INT2N_SEL<<1) | (MW_INTXBAR22_FSITX0_INT1N_SEL<<2) | (MW_INTXBAR22_FSITX0_INT2N_SEL<<3) | (MW_INTXBAR22_FSIRX1_INT1N_SEL<<4) | (MW_INTXBAR22_FSIRX1_INT2N_SEL<<5) | (MW_INTXBAR22_FSITX1_INT1N_SEL<<6) | (MW_INTXBAR22_FSITX1_INT2N_SEL<<7) | (MW_INTXBAR22_FSIRX2_INT1N_SEL<<8) | (MW_INTXBAR22_FSIRX2_INT2N_SEL<<9) | (MW_INTXBAR22_FSITX2_INT1N_SEL<<10) | (MW_INTXBAR22_FSITX2_INT2N_SEL<<11) | (MW_INTXBAR22_FSIRX3_INT1N_SEL<<12) | (MW_INTXBAR22_FSIRX3_INT2N_SEL<<13) | (MW_INTXBAR22_FSITX3_INT1N_SEL<<14) | (MW_INTXBAR22_FSITX3_INT2N_SEL<<15);
    group4_mask[22] = (MW_INTXBAR22_SD0_ERR_SEL<<0) | (MW_INTXBAR22_SD0_FILT0_DRINT_SEL<<1) | (MW_INTXBAR22_SD0_FILT1_DRINT_SEL<<2) | (MW_INTXBAR22_SD0_FILT2_DRINT_SEL<<3) | (MW_INTXBAR22_SD0_FILT3_DRINT_SEL<<4) | (MW_INTXBAR22_SD1_ERR_SEL<<5) | (MW_INTXBAR22_SD1_FILT0_DRINT_SEL<<6) | (MW_INTXBAR22_SD1_FILT1_DRINT_SEL<<7) | (MW_INTXBAR22_SD1_FILT2_DRINT_SEL<<8) | (MW_INTXBAR22_SD1_FILT3_DRINT_SEL<<9);
    group5_mask[22] = (MW_INTXBAR22_ECAP0_INT_SEL<<0) | (MW_INTXBAR22_ECAP1_INT_SEL<<1) | (MW_INTXBAR22_ECAP2_INT_SEL<<2) | (MW_INTXBAR22_ECAP3_INT_SEL<<3) | (MW_INTXBAR22_ECAP4_INT_SEL<<4) | (MW_INTXBAR22_ECAP5_INT_SEL<<5) | (MW_INTXBAR22_ECAP6_INT_SEL<<6) | (MW_INTXBAR22_ECAP7_INT_SEL<<7) | (MW_INTXBAR22_ECAP8_INT_SEL<<8) | (MW_INTXBAR22_ECAP9_INT_SEL<<9);
    group6_mask[22] = (MW_INTXBAR22_EQEP0_INT_SEL<<0) | (MW_INTXBAR22_EQEP1_INT_SEL<<1) | (MW_INTXBAR22_EQEP2_INT_SEL<<2);
    group0_mask[23] = (MW_INTXBAR23_EPWM0_INT_SEL<<0) | (MW_INTXBAR23_EPWM1_INT_SEL<<1) | (MW_INTXBAR23_EPWM2_INT_SEL<<2) | (MW_INTXBAR23_EPWM3_INT_SEL<<3) | (MW_INTXBAR23_EPWM4_INT_SEL<<4) | (MW_INTXBAR23_EPWM5_INT_SEL<<5) | (MW_INTXBAR23_EPWM6_INT_SEL<<6) | (MW_INTXBAR23_EPWM7_INT_SEL<<7) | (MW_INTXBAR23_EPWM8_INT_SEL<<8) | (MW_INTXBAR23_EPWM9_INT_SEL<<9) | (MW_INTXBAR23_EPWM10_INT_SEL<<10) | (MW_INTXBAR23_EPWM11_INT_SEL<<11) | (MW_INTXBAR23_EPWM12_INT_SEL<<12) | (MW_INTXBAR23_EPWM13_INT_SEL<<13) | (MW_INTXBAR23_EPWM14_INT_SEL<<14) | (MW_INTXBAR23_EPWM15_INT_SEL<<15) | (MW_INTXBAR23_EPWM16_INT_SEL<<16) | (MW_INTXBAR23_EPWM17_INT_SEL<<17) | (MW_INTXBAR23_EPWM18_INT_SEL<<18) | (MW_INTXBAR23_EPWM19_INT_SEL<<19) | (MW_INTXBAR23_EPWM20_INT_SEL<<20) | (MW_INTXBAR23_EPWM21_INT_SEL<<21) | (MW_INTXBAR23_EPWM22_INT_SEL<<22) | (MW_INTXBAR23_EPWM23_INT_SEL<<23) | (MW_INTXBAR23_EPWM24_INT_SEL<<24) | (MW_INTXBAR23_EPWM25_INT_SEL<<25) | (MW_INTXBAR23_EPWM26_INT_SEL<<26) | (MW_INTXBAR23_EPWM27_INT_SEL<<27) | (MW_INTXBAR23_EPWM28_INT_SEL<<28) | (MW_INTXBAR23_EPWM29_INT_SEL<<29) | (MW_INTXBAR23_EPWM30_INT_SEL<<30) | (MW_INTXBAR23_EPWM31_INT_SEL<<31);
    group1_mask[23] = (MW_INTXBAR23_EPWM0_TZINT_SEL<<0) | (MW_INTXBAR23_EPWM1_TZINT_SEL<<1) | (MW_INTXBAR23_EPWM2_TZINT_SEL<<2) | (MW_INTXBAR23_EPWM3_TZINT_SEL<<3) | (MW_INTXBAR23_EPWM4_TZINT_SEL<<4) | (MW_INTXBAR23_EPWM5_TZINT_SEL<<5) | (MW_INTXBAR23_EPWM6_TZINT_SEL<<6) | (MW_INTXBAR23_EPWM7_TZINT_SEL<<7) | (MW_INTXBAR23_EPWM8_TZINT_SEL<<8) | (MW_INTXBAR23_EPWM9_TZINT_SEL<<9) | (MW_INTXBAR23_EPWM10_TZINT_SEL<<10) | (MW_INTXBAR23_EPWM11_TZINT_SEL<<11) | (MW_INTXBAR23_EPWM12_TZINT_SEL<<12) | (MW_INTXBAR23_EPWM13_TZINT_SEL<<13) | (MW_INTXBAR23_EPWM14_TZINT_SEL<<14) | (MW_INTXBAR23_EPWM15_TZINT_SEL<<15) | (MW_INTXBAR23_EPWM16_TZINT_SEL<<16) | (MW_INTXBAR23_EPWM17_TZINT_SEL<<17) | (MW_INTXBAR23_EPWM18_TZINT_SEL<<18) | (MW_INTXBAR23_EPWM19_TZINT_SEL<<19) | (MW_INTXBAR23_EPWM20_TZINT_SEL<<20) | (MW_INTXBAR23_EPWM21_TZINT_SEL<<21) | (MW_INTXBAR23_EPWM22_TZINT_SEL<<22) | (MW_INTXBAR23_EPWM23_TZINT_SEL<<23) | (MW_INTXBAR23_EPWM24_TZINT_SEL<<24) | (MW_INTXBAR23_EPWM25_TZINT_SEL<<25) | (MW_INTXBAR23_EPWM26_TZINT_SEL<<26) | (MW_INTXBAR23_EPWM27_TZINT_SEL<<27) | (MW_INTXBAR23_EPWM28_TZINT_SEL<<28) | (MW_INTXBAR23_EPWM29_TZINT_SEL<<29) | (MW_INTXBAR23_EPWM30_TZINT_SEL<<30) | (MW_INTXBAR23_EPWM31_TZINT_SEL<<31);
    group2_mask[23] = (MW_INTXBAR23_ADC0_INT1_SEL<<0) | (MW_INTXBAR23_ADC0_INT2_SEL<<1) | (MW_INTXBAR23_ADC0_INT3_SEL<<2) | (MW_INTXBAR23_ADC0_INT4_SEL<<3) | (MW_INTXBAR23_ADC0_EVTINT_SEL<<4) | (MW_INTXBAR23_ADC1_INT1_SEL<<5) | (MW_INTXBAR23_ADC1_INT2_SEL<<6) | (MW_INTXBAR23_ADC1_INT3_SEL<<7) | (MW_INTXBAR23_ADC1_INT4_SEL<<8) | (MW_INTXBAR23_ADC1_EVTINT_SEL<<9) | (MW_INTXBAR23_ADC2_INT1_SEL<<10) | (MW_INTXBAR23_ADC2_INT2_SEL<<11) | (MW_INTXBAR23_ADC2_INT3_SEL<<12) | (MW_INTXBAR23_ADC2_INT4_SEL<<13) | (MW_INTXBAR23_ADC2_EVTINT_SEL<<14) | (MW_INTXBAR23_ADC3_INT1_SEL<<15) | (MW_INTXBAR23_ADC3_INT2_SEL<<16) | (MW_INTXBAR23_ADC3_INT3_SEL<<17) | (MW_INTXBAR23_ADC3_INT4_SEL<<18) | (MW_INTXBAR23_ADC3_EVTINT_SEL<<19) | (MW_INTXBAR23_ADC4_INT1_SEL<<20) | (MW_INTXBAR23_ADC4_INT2_SEL<<21) | (MW_INTXBAR23_ADC4_INT3_SEL<<22) | (MW_INTXBAR23_ADC4_INT4_SEL<<23) | (MW_INTXBAR23_ADC4_EVTINT_SEL<<24);
    group3_mask[23] = (MW_INTXBAR23_FSIRX0_INT1N_SEL<<0) | (MW_INTXBAR23_FSIRX0_INT2N_SEL<<1) | (MW_INTXBAR23_FSITX0_INT1N_SEL<<2) | (MW_INTXBAR23_FSITX0_INT2N_SEL<<3) | (MW_INTXBAR23_FSIRX1_INT1N_SEL<<4) | (MW_INTXBAR23_FSIRX1_INT2N_SEL<<5) | (MW_INTXBAR23_FSITX1_INT1N_SEL<<6) | (MW_INTXBAR23_FSITX1_INT2N_SEL<<7) | (MW_INTXBAR23_FSIRX2_INT1N_SEL<<8) | (MW_INTXBAR23_FSIRX2_INT2N_SEL<<9) | (MW_INTXBAR23_FSITX2_INT1N_SEL<<10) | (MW_INTXBAR23_FSITX2_INT2N_SEL<<11) | (MW_INTXBAR23_FSIRX3_INT1N_SEL<<12) | (MW_INTXBAR23_FSIRX3_INT2N_SEL<<13) | (MW_INTXBAR23_FSITX3_INT1N_SEL<<14) | (MW_INTXBAR23_FSITX3_INT2N_SEL<<15);
    group4_mask[23] = (MW_INTXBAR23_SD0_ERR_SEL<<0) | (MW_INTXBAR23_SD0_FILT0_DRINT_SEL<<1) | (MW_INTXBAR23_SD0_FILT1_DRINT_SEL<<2) | (MW_INTXBAR23_SD0_FILT2_DRINT_SEL<<3) | (MW_INTXBAR23_SD0_FILT3_DRINT_SEL<<4) | (MW_INTXBAR23_SD1_ERR_SEL<<5) | (MW_INTXBAR23_SD1_FILT0_DRINT_SEL<<6) | (MW_INTXBAR23_SD1_FILT1_DRINT_SEL<<7) | (MW_INTXBAR23_SD1_FILT2_DRINT_SEL<<8) | (MW_INTXBAR23_SD1_FILT3_DRINT_SEL<<9);
    group5_mask[23] = (MW_INTXBAR23_ECAP0_INT_SEL<<0) | (MW_INTXBAR23_ECAP1_INT_SEL<<1) | (MW_INTXBAR23_ECAP2_INT_SEL<<2) | (MW_INTXBAR23_ECAP3_INT_SEL<<3) | (MW_INTXBAR23_ECAP4_INT_SEL<<4) | (MW_INTXBAR23_ECAP5_INT_SEL<<5) | (MW_INTXBAR23_ECAP6_INT_SEL<<6) | (MW_INTXBAR23_ECAP7_INT_SEL<<7) | (MW_INTXBAR23_ECAP8_INT_SEL<<8) | (MW_INTXBAR23_ECAP9_INT_SEL<<9);
    group6_mask[23] = (MW_INTXBAR23_EQEP0_INT_SEL<<0) | (MW_INTXBAR23_EQEP1_INT_SEL<<1) | (MW_INTXBAR23_EQEP2_INT_SEL<<2);
    group0_mask[24] = (MW_INTXBAR24_EPWM0_INT_SEL<<0) | (MW_INTXBAR24_EPWM1_INT_SEL<<1) | (MW_INTXBAR24_EPWM2_INT_SEL<<2) | (MW_INTXBAR24_EPWM3_INT_SEL<<3) | (MW_INTXBAR24_EPWM4_INT_SEL<<4) | (MW_INTXBAR24_EPWM5_INT_SEL<<5) | (MW_INTXBAR24_EPWM6_INT_SEL<<6) | (MW_INTXBAR24_EPWM7_INT_SEL<<7) | (MW_INTXBAR24_EPWM8_INT_SEL<<8) | (MW_INTXBAR24_EPWM9_INT_SEL<<9) | (MW_INTXBAR24_EPWM10_INT_SEL<<10) | (MW_INTXBAR24_EPWM11_INT_SEL<<11) | (MW_INTXBAR24_EPWM12_INT_SEL<<12) | (MW_INTXBAR24_EPWM13_INT_SEL<<13) | (MW_INTXBAR24_EPWM14_INT_SEL<<14) | (MW_INTXBAR24_EPWM15_INT_SEL<<15) | (MW_INTXBAR24_EPWM16_INT_SEL<<16) | (MW_INTXBAR24_EPWM17_INT_SEL<<17) | (MW_INTXBAR24_EPWM18_INT_SEL<<18) | (MW_INTXBAR24_EPWM19_INT_SEL<<19) | (MW_INTXBAR24_EPWM20_INT_SEL<<20) | (MW_INTXBAR24_EPWM21_INT_SEL<<21) | (MW_INTXBAR24_EPWM22_INT_SEL<<22) | (MW_INTXBAR24_EPWM23_INT_SEL<<23) | (MW_INTXBAR24_EPWM24_INT_SEL<<24) | (MW_INTXBAR24_EPWM25_INT_SEL<<25) | (MW_INTXBAR24_EPWM26_INT_SEL<<26) | (MW_INTXBAR24_EPWM27_INT_SEL<<27) | (MW_INTXBAR24_EPWM28_INT_SEL<<28) | (MW_INTXBAR24_EPWM29_INT_SEL<<29) | (MW_INTXBAR24_EPWM30_INT_SEL<<30) | (MW_INTXBAR24_EPWM31_INT_SEL<<31);
    group1_mask[24] = (MW_INTXBAR24_EPWM0_TZINT_SEL<<0) | (MW_INTXBAR24_EPWM1_TZINT_SEL<<1) | (MW_INTXBAR24_EPWM2_TZINT_SEL<<2) | (MW_INTXBAR24_EPWM3_TZINT_SEL<<3) | (MW_INTXBAR24_EPWM4_TZINT_SEL<<4) | (MW_INTXBAR24_EPWM5_TZINT_SEL<<5) | (MW_INTXBAR24_EPWM6_TZINT_SEL<<6) | (MW_INTXBAR24_EPWM7_TZINT_SEL<<7) | (MW_INTXBAR24_EPWM8_TZINT_SEL<<8) | (MW_INTXBAR24_EPWM9_TZINT_SEL<<9) | (MW_INTXBAR24_EPWM10_TZINT_SEL<<10) | (MW_INTXBAR24_EPWM11_TZINT_SEL<<11) | (MW_INTXBAR24_EPWM12_TZINT_SEL<<12) | (MW_INTXBAR24_EPWM13_TZINT_SEL<<13) | (MW_INTXBAR24_EPWM14_TZINT_SEL<<14) | (MW_INTXBAR24_EPWM15_TZINT_SEL<<15) | (MW_INTXBAR24_EPWM16_TZINT_SEL<<16) | (MW_INTXBAR24_EPWM17_TZINT_SEL<<17) | (MW_INTXBAR24_EPWM18_TZINT_SEL<<18) | (MW_INTXBAR24_EPWM19_TZINT_SEL<<19) | (MW_INTXBAR24_EPWM20_TZINT_SEL<<20) | (MW_INTXBAR24_EPWM21_TZINT_SEL<<21) | (MW_INTXBAR24_EPWM22_TZINT_SEL<<22) | (MW_INTXBAR24_EPWM23_TZINT_SEL<<23) | (MW_INTXBAR24_EPWM24_TZINT_SEL<<24) | (MW_INTXBAR24_EPWM25_TZINT_SEL<<25) | (MW_INTXBAR24_EPWM26_TZINT_SEL<<26) | (MW_INTXBAR24_EPWM27_TZINT_SEL<<27) | (MW_INTXBAR24_EPWM28_TZINT_SEL<<28) | (MW_INTXBAR24_EPWM29_TZINT_SEL<<29) | (MW_INTXBAR24_EPWM30_TZINT_SEL<<30) | (MW_INTXBAR24_EPWM31_TZINT_SEL<<31);
    group2_mask[24] = (MW_INTXBAR24_ADC0_INT1_SEL<<0) | (MW_INTXBAR24_ADC0_INT2_SEL<<1) | (MW_INTXBAR24_ADC0_INT3_SEL<<2) | (MW_INTXBAR24_ADC0_INT4_SEL<<3) | (MW_INTXBAR24_ADC0_EVTINT_SEL<<4) | (MW_INTXBAR24_ADC1_INT1_SEL<<5) | (MW_INTXBAR24_ADC1_INT2_SEL<<6) | (MW_INTXBAR24_ADC1_INT3_SEL<<7) | (MW_INTXBAR24_ADC1_INT4_SEL<<8) | (MW_INTXBAR24_ADC1_EVTINT_SEL<<9) | (MW_INTXBAR24_ADC2_INT1_SEL<<10) | (MW_INTXBAR24_ADC2_INT2_SEL<<11) | (MW_INTXBAR24_ADC2_INT3_SEL<<12) | (MW_INTXBAR24_ADC2_INT4_SEL<<13) | (MW_INTXBAR24_ADC2_EVTINT_SEL<<14) | (MW_INTXBAR24_ADC3_INT1_SEL<<15) | (MW_INTXBAR24_ADC3_INT2_SEL<<16) | (MW_INTXBAR24_ADC3_INT3_SEL<<17) | (MW_INTXBAR24_ADC3_INT4_SEL<<18) | (MW_INTXBAR24_ADC3_EVTINT_SEL<<19) | (MW_INTXBAR24_ADC4_INT1_SEL<<20) | (MW_INTXBAR24_ADC4_INT2_SEL<<21) | (MW_INTXBAR24_ADC4_INT3_SEL<<22) | (MW_INTXBAR24_ADC4_INT4_SEL<<23) | (MW_INTXBAR24_ADC4_EVTINT_SEL<<24);
    group3_mask[24] = (MW_INTXBAR24_FSIRX0_INT1N_SEL<<0) | (MW_INTXBAR24_FSIRX0_INT2N_SEL<<1) | (MW_INTXBAR24_FSITX0_INT1N_SEL<<2) | (MW_INTXBAR24_FSITX0_INT2N_SEL<<3) | (MW_INTXBAR24_FSIRX1_INT1N_SEL<<4) | (MW_INTXBAR24_FSIRX1_INT2N_SEL<<5) | (MW_INTXBAR24_FSITX1_INT1N_SEL<<6) | (MW_INTXBAR24_FSITX1_INT2N_SEL<<7) | (MW_INTXBAR24_FSIRX2_INT1N_SEL<<8) | (MW_INTXBAR24_FSIRX2_INT2N_SEL<<9) | (MW_INTXBAR24_FSITX2_INT1N_SEL<<10) | (MW_INTXBAR24_FSITX2_INT2N_SEL<<11) | (MW_INTXBAR24_FSIRX3_INT1N_SEL<<12) | (MW_INTXBAR24_FSIRX3_INT2N_SEL<<13) | (MW_INTXBAR24_FSITX3_INT1N_SEL<<14) | (MW_INTXBAR24_FSITX3_INT2N_SEL<<15);
    group4_mask[24] = (MW_INTXBAR24_SD0_ERR_SEL<<0) | (MW_INTXBAR24_SD0_FILT0_DRINT_SEL<<1) | (MW_INTXBAR24_SD0_FILT1_DRINT_SEL<<2) | (MW_INTXBAR24_SD0_FILT2_DRINT_SEL<<3) | (MW_INTXBAR24_SD0_FILT3_DRINT_SEL<<4) | (MW_INTXBAR24_SD1_ERR_SEL<<5) | (MW_INTXBAR24_SD1_FILT0_DRINT_SEL<<6) | (MW_INTXBAR24_SD1_FILT1_DRINT_SEL<<7) | (MW_INTXBAR24_SD1_FILT2_DRINT_SEL<<8) | (MW_INTXBAR24_SD1_FILT3_DRINT_SEL<<9);
    group5_mask[24] = (MW_INTXBAR24_ECAP0_INT_SEL<<0) | (MW_INTXBAR24_ECAP1_INT_SEL<<1) | (MW_INTXBAR24_ECAP2_INT_SEL<<2) | (MW_INTXBAR24_ECAP3_INT_SEL<<3) | (MW_INTXBAR24_ECAP4_INT_SEL<<4) | (MW_INTXBAR24_ECAP5_INT_SEL<<5) | (MW_INTXBAR24_ECAP6_INT_SEL<<6) | (MW_INTXBAR24_ECAP7_INT_SEL<<7) | (MW_INTXBAR24_ECAP8_INT_SEL<<8) | (MW_INTXBAR24_ECAP9_INT_SEL<<9);
