TexasInstruments/am26x-hsp/src/am263px_init.c
    group6_mask[24] = (MW_INTXBAR24_EQEP0_INT_SEL<<0) | (MW_INTXBAR24_EQEP1_INT_SEL<<1) | (MW_INTXBAR24_EQEP2_INT_SEL<<2);
    group0_mask[25] = (MW_INTXBAR25_EPWM0_INT_SEL<<0) | (MW_INTXBAR25_EPWM1_INT_SEL<<1) | (MW_INTXBAR25_EPWM2_INT_SEL<<2) | (MW_INTXBAR25_EPWM3_INT_SEL<<3) | (MW_INTXBAR25_EPWM4_INT_SEL<<4) | (MW_INTXBAR25_EPWM5_INT_SEL<<5) | (MW_INTXBAR25_EPWM6_INT_SEL<<6) | (MW_INTXBAR25_EPWM7_INT_SEL<<7) | (MW_INTXBAR25_EPWM8_INT_SEL<<8) | (MW_INTXBAR25_EPWM9_INT_SEL<<9) | (MW_INTXBAR25_EPWM10_INT_SEL<<10) | (MW_INTXBAR25_EPWM11_INT_SEL<<11) | (MW_INTXBAR25_EPWM12_INT_SEL<<12) | (MW_INTXBAR25_EPWM13_INT_SEL<<13) | (MW_INTXBAR25_EPWM14_INT_SEL<<14) | (MW_INTXBAR25_EPWM15_INT_SEL<<15) | (MW_INTXBAR25_EPWM16_INT_SEL<<16) | (MW_INTXBAR25_EPWM17_INT_SEL<<17) | (MW_INTXBAR25_EPWM18_INT_SEL<<18) | (MW_INTXBAR25_EPWM19_INT_SEL<<19) | (MW_INTXBAR25_EPWM20_INT_SEL<<20) | (MW_INTXBAR25_EPWM21_INT_SEL<<21) | (MW_INTXBAR25_EPWM22_INT_SEL<<22) | (MW_INTXBAR25_EPWM23_INT_SEL<<23) | (MW_INTXBAR25_EPWM24_INT_SEL<<24) | (MW_INTXBAR25_EPWM25_INT_SEL<<25) | (MW_INTXBAR25_EPWM26_INT_SEL<<26) | (MW_INTXBAR25_EPWM27_INT_SEL<<27) | (MW_INTXBAR25_EPWM28_INT_SEL<<28) | (MW_INTXBAR25_EPWM29_INT_SEL<<29) | (MW_INTXBAR25_EPWM30_INT_SEL<<30) | (MW_INTXBAR25_EPWM31_INT_SEL<<31);
    group1_mask[25] = (MW_INTXBAR25_EPWM0_TZINT_SEL<<0) | (MW_INTXBAR25_EPWM1_TZINT_SEL<<1) | (MW_INTXBAR25_EPWM2_TZINT_SEL<<2) | (MW_INTXBAR25_EPWM3_TZINT_SEL<<3) | (MW_INTXBAR25_EPWM4_TZINT_SEL<<4) | (MW_INTXBAR25_EPWM5_TZINT_SEL<<5) | (MW_INTXBAR25_EPWM6_TZINT_SEL<<6) | (MW_INTXBAR25_EPWM7_TZINT_SEL<<7) | (MW_INTXBAR25_EPWM8_TZINT_SEL<<8) | (MW_INTXBAR25_EPWM9_TZINT_SEL<<9) | (MW_INTXBAR25_EPWM10_TZINT_SEL<<10) | (MW_INTXBAR25_EPWM11_TZINT_SEL<<11) | (MW_INTXBAR25_EPWM12_TZINT_SEL<<12) | (MW_INTXBAR25_EPWM13_TZINT_SEL<<13) | (MW_INTXBAR25_EPWM14_TZINT_SEL<<14) | (MW_INTXBAR25_EPWM15_TZINT_SEL<<15) | (MW_INTXBAR25_EPWM16_TZINT_SEL<<16) | (MW_INTXBAR25_EPWM17_TZINT_SEL<<17) | (MW_INTXBAR25_EPWM18_TZINT_SEL<<18) | (MW_INTXBAR25_EPWM19_TZINT_SEL<<19) | (MW_INTXBAR25_EPWM20_TZINT_SEL<<20) | (MW_INTXBAR25_EPWM21_TZINT_SEL<<21) | (MW_INTXBAR25_EPWM22_TZINT_SEL<<22) | (MW_INTXBAR25_EPWM23_TZINT_SEL<<23) | (MW_INTXBAR25_EPWM24_TZINT_SEL<<24) | (MW_INTXBAR25_EPWM25_TZINT_SEL<<25) | (MW_INTXBAR25_EPWM26_TZINT_SEL<<26) | (MW_INTXBAR25_EPWM27_TZINT_SEL<<27) | (MW_INTXBAR25_EPWM28_TZINT_SEL<<28) | (MW_INTXBAR25_EPWM29_TZINT_SEL<<29) | (MW_INTXBAR25_EPWM30_TZINT_SEL<<30) | (MW_INTXBAR25_EPWM31_TZINT_SEL<<31);
    group2_mask[25] = (MW_INTXBAR25_ADC0_INT1_SEL<<0) | (MW_INTXBAR25_ADC0_INT2_SEL<<1) | (MW_INTXBAR25_ADC0_INT3_SEL<<2) | (MW_INTXBAR25_ADC0_INT4_SEL<<3) | (MW_INTXBAR25_ADC0_EVTINT_SEL<<4) | (MW_INTXBAR25_ADC1_INT1_SEL<<5) | (MW_INTXBAR25_ADC1_INT2_SEL<<6) | (MW_INTXBAR25_ADC1_INT3_SEL<<7) | (MW_INTXBAR25_ADC1_INT4_SEL<<8) | (MW_INTXBAR25_ADC1_EVTINT_SEL<<9) | (MW_INTXBAR25_ADC2_INT1_SEL<<10) | (MW_INTXBAR25_ADC2_INT2_SEL<<11) | (MW_INTXBAR25_ADC2_INT3_SEL<<12) | (MW_INTXBAR25_ADC2_INT4_SEL<<13) | (MW_INTXBAR25_ADC2_EVTINT_SEL<<14) | (MW_INTXBAR25_ADC3_INT1_SEL<<15) | (MW_INTXBAR25_ADC3_INT2_SEL<<16) | (MW_INTXBAR25_ADC3_INT3_SEL<<17) | (MW_INTXBAR25_ADC3_INT4_SEL<<18) | (MW_INTXBAR25_ADC3_EVTINT_SEL<<19) | (MW_INTXBAR25_ADC4_INT1_SEL<<20) | (MW_INTXBAR25_ADC4_INT2_SEL<<21) | (MW_INTXBAR25_ADC4_INT3_SEL<<22) | (MW_INTXBAR25_ADC4_INT4_SEL<<23) | (MW_INTXBAR25_ADC4_EVTINT_SEL<<24);
    group3_mask[25] = (MW_INTXBAR25_FSIRX0_INT1N_SEL<<0) | (MW_INTXBAR25_FSIRX0_INT2N_SEL<<1) | (MW_INTXBAR25_FSITX0_INT1N_SEL<<2) | (MW_INTXBAR25_FSITX0_INT2N_SEL<<3) | (MW_INTXBAR25_FSIRX1_INT1N_SEL<<4) | (MW_INTXBAR25_FSIRX1_INT2N_SEL<<5) | (MW_INTXBAR25_FSITX1_INT1N_SEL<<6) | (MW_INTXBAR25_FSITX1_INT2N_SEL<<7) | (MW_INTXBAR25_FSIRX2_INT1N_SEL<<8) | (MW_INTXBAR25_FSIRX2_INT2N_SEL<<9) | (MW_INTXBAR25_FSITX2_INT1N_SEL<<10) | (MW_INTXBAR25_FSITX2_INT2N_SEL<<11) | (MW_INTXBAR25_FSIRX3_INT1N_SEL<<12) | (MW_INTXBAR25_FSIRX3_INT2N_SEL<<13) | (MW_INTXBAR25_FSITX3_INT1N_SEL<<14) | (MW_INTXBAR25_FSITX3_INT2N_SEL<<15);
    group4_mask[25] = (MW_INTXBAR25_SD0_ERR_SEL<<0) | (MW_INTXBAR25_SD0_FILT0_DRINT_SEL<<1) | (MW_INTXBAR25_SD0_FILT1_DRINT_SEL<<2) | (MW_INTXBAR25_SD0_FILT2_DRINT_SEL<<3) | (MW_INTXBAR25_SD0_FILT3_DRINT_SEL<<4) | (MW_INTXBAR25_SD1_ERR_SEL<<5) | (MW_INTXBAR25_SD1_FILT0_DRINT_SEL<<6) | (MW_INTXBAR25_SD1_FILT1_DRINT_SEL<<7) | (MW_INTXBAR25_SD1_FILT2_DRINT_SEL<<8) | (MW_INTXBAR25_SD1_FILT3_DRINT_SEL<<9);
    group5_mask[25] = (MW_INTXBAR25_ECAP0_INT_SEL<<0) | (MW_INTXBAR25_ECAP1_INT_SEL<<1) | (MW_INTXBAR25_ECAP2_INT_SEL<<2) | (MW_INTXBAR25_ECAP3_INT_SEL<<3) | (MW_INTXBAR25_ECAP4_INT_SEL<<4) | (MW_INTXBAR25_ECAP5_INT_SEL<<5) | (MW_INTXBAR25_ECAP6_INT_SEL<<6) | (MW_INTXBAR25_ECAP7_INT_SEL<<7) | (MW_INTXBAR25_ECAP8_INT_SEL<<8) | (MW_INTXBAR25_ECAP9_INT_SEL<<9);
    group6_mask[25] = (MW_INTXBAR25_EQEP0_INT_SEL<<0) | (MW_INTXBAR25_EQEP1_INT_SEL<<1) | (MW_INTXBAR25_EQEP2_INT_SEL<<2);
    group0_mask[26] = (MW_INTXBAR26_EPWM0_INT_SEL<<0) | (MW_INTXBAR26_EPWM1_INT_SEL<<1) | (MW_INTXBAR26_EPWM2_INT_SEL<<2) | (MW_INTXBAR26_EPWM3_INT_SEL<<3) | (MW_INTXBAR26_EPWM4_INT_SEL<<4) | (MW_INTXBAR26_EPWM5_INT_SEL<<5) | (MW_INTXBAR26_EPWM6_INT_SEL<<6) | (MW_INTXBAR26_EPWM7_INT_SEL<<7) | (MW_INTXBAR26_EPWM8_INT_SEL<<8) | (MW_INTXBAR26_EPWM9_INT_SEL<<9) | (MW_INTXBAR26_EPWM10_INT_SEL<<10) | (MW_INTXBAR26_EPWM11_INT_SEL<<11) | (MW_INTXBAR26_EPWM12_INT_SEL<<12) | (MW_INTXBAR26_EPWM13_INT_SEL<<13) | (MW_INTXBAR26_EPWM14_INT_SEL<<14) | (MW_INTXBAR26_EPWM15_INT_SEL<<15) | (MW_INTXBAR26_EPWM16_INT_SEL<<16) | (MW_INTXBAR26_EPWM17_INT_SEL<<17) | (MW_INTXBAR26_EPWM18_INT_SEL<<18) | (MW_INTXBAR26_EPWM19_INT_SEL<<19) | (MW_INTXBAR26_EPWM20_INT_SEL<<20) | (MW_INTXBAR26_EPWM21_INT_SEL<<21) | (MW_INTXBAR26_EPWM22_INT_SEL<<22) | (MW_INTXBAR26_EPWM23_INT_SEL<<23) | (MW_INTXBAR26_EPWM24_INT_SEL<<24) | (MW_INTXBAR26_EPWM25_INT_SEL<<25) | (MW_INTXBAR26_EPWM26_INT_SEL<<26) | (MW_INTXBAR26_EPWM27_INT_SEL<<27) | (MW_INTXBAR26_EPWM28_INT_SEL<<28) | (MW_INTXBAR26_EPWM29_INT_SEL<<29) | (MW_INTXBAR26_EPWM30_INT_SEL<<30) | (MW_INTXBAR26_EPWM31_INT_SEL<<31);
    group1_mask[26] = (MW_INTXBAR26_EPWM0_TZINT_SEL<<0) | (MW_INTXBAR26_EPWM1_TZINT_SEL<<1) | (MW_INTXBAR26_EPWM2_TZINT_SEL<<2) | (MW_INTXBAR26_EPWM3_TZINT_SEL<<3) | (MW_INTXBAR26_EPWM4_TZINT_SEL<<4) | (MW_INTXBAR26_EPWM5_TZINT_SEL<<5) | (MW_INTXBAR26_EPWM6_TZINT_SEL<<6) | (MW_INTXBAR26_EPWM7_TZINT_SEL<<7) | (MW_INTXBAR26_EPWM8_TZINT_SEL<<8) | (MW_INTXBAR26_EPWM9_TZINT_SEL<<9) | (MW_INTXBAR26_EPWM10_TZINT_SEL<<10) | (MW_INTXBAR26_EPWM11_TZINT_SEL<<11) | (MW_INTXBAR26_EPWM12_TZINT_SEL<<12) | (MW_INTXBAR26_EPWM13_TZINT_SEL<<13) | (MW_INTXBAR26_EPWM14_TZINT_SEL<<14) | (MW_INTXBAR26_EPWM15_TZINT_SEL<<15) | (MW_INTXBAR26_EPWM16_TZINT_SEL<<16) | (MW_INTXBAR26_EPWM17_TZINT_SEL<<17) | (MW_INTXBAR26_EPWM18_TZINT_SEL<<18) | (MW_INTXBAR26_EPWM19_TZINT_SEL<<19) | (MW_INTXBAR26_EPWM20_TZINT_SEL<<20) | (MW_INTXBAR26_EPWM21_TZINT_SEL<<21) | (MW_INTXBAR26_EPWM22_TZINT_SEL<<22) | (MW_INTXBAR26_EPWM23_TZINT_SEL<<23) | (MW_INTXBAR26_EPWM24_TZINT_SEL<<24) | (MW_INTXBAR26_EPWM25_TZINT_SEL<<25) | (MW_INTXBAR26_EPWM26_TZINT_SEL<<26) | (MW_INTXBAR26_EPWM27_TZINT_SEL<<27) | (MW_INTXBAR26_EPWM28_TZINT_SEL<<28) | (MW_INTXBAR26_EPWM29_TZINT_SEL<<29) | (MW_INTXBAR26_EPWM30_TZINT_SEL<<30) | (MW_INTXBAR26_EPWM31_TZINT_SEL<<31);
    group2_mask[26] = (MW_INTXBAR26_ADC0_INT1_SEL<<0) | (MW_INTXBAR26_ADC0_INT2_SEL<<1) | (MW_INTXBAR26_ADC0_INT3_SEL<<2) | (MW_INTXBAR26_ADC0_INT4_SEL<<3) | (MW_INTXBAR26_ADC0_EVTINT_SEL<<4) | (MW_INTXBAR26_ADC1_INT1_SEL<<5) | (MW_INTXBAR26_ADC1_INT2_SEL<<6) | (MW_INTXBAR26_ADC1_INT3_SEL<<7) | (MW_INTXBAR26_ADC1_INT4_SEL<<8) | (MW_INTXBAR26_ADC1_EVTINT_SEL<<9) | (MW_INTXBAR26_ADC2_INT1_SEL<<10) | (MW_INTXBAR26_ADC2_INT2_SEL<<11) | (MW_INTXBAR26_ADC2_INT3_SEL<<12) | (MW_INTXBAR26_ADC2_INT4_SEL<<13) | (MW_INTXBAR26_ADC2_EVTINT_SEL<<14) | (MW_INTXBAR26_ADC3_INT1_SEL<<15) | (MW_INTXBAR26_ADC3_INT2_SEL<<16) | (MW_INTXBAR26_ADC3_INT3_SEL<<17) | (MW_INTXBAR26_ADC3_INT4_SEL<<18) | (MW_INTXBAR26_ADC3_EVTINT_SEL<<19) | (MW_INTXBAR26_ADC4_INT1_SEL<<20) | (MW_INTXBAR26_ADC4_INT2_SEL<<21) | (MW_INTXBAR26_ADC4_INT3_SEL<<22) | (MW_INTXBAR26_ADC4_INT4_SEL<<23) | (MW_INTXBAR26_ADC4_EVTINT_SEL<<24);
    group3_mask[26] = (MW_INTXBAR26_FSIRX0_INT1N_SEL<<0) | (MW_INTXBAR26_FSIRX0_INT2N_SEL<<1) | (MW_INTXBAR26_FSITX0_INT1N_SEL<<2) | (MW_INTXBAR26_FSITX0_INT2N_SEL<<3) | (MW_INTXBAR26_FSIRX1_INT1N_SEL<<4) | (MW_INTXBAR26_FSIRX1_INT2N_SEL<<5) | (MW_INTXBAR26_FSITX1_INT1N_SEL<<6) | (MW_INTXBAR26_FSITX1_INT2N_SEL<<7) | (MW_INTXBAR26_FSIRX2_INT1N_SEL<<8) | (MW_INTXBAR26_FSIRX2_INT2N_SEL<<9) | (MW_INTXBAR26_FSITX2_INT1N_SEL<<10) | (MW_INTXBAR26_FSITX2_INT2N_SEL<<11) | (MW_INTXBAR26_FSIRX3_INT1N_SEL<<12) | (MW_INTXBAR26_FSIRX3_INT2N_SEL<<13) | (MW_INTXBAR26_FSITX3_INT1N_SEL<<14) | (MW_INTXBAR26_FSITX3_INT2N_SEL<<15);
    group4_mask[26] = (MW_INTXBAR26_SD0_ERR_SEL<<0) | (MW_INTXBAR26_SD0_FILT0_DRINT_SEL<<1) | (MW_INTXBAR26_SD0_FILT1_DRINT_SEL<<2) | (MW_INTXBAR26_SD0_FILT2_DRINT_SEL<<3) | (MW_INTXBAR26_SD0_FILT3_DRINT_SEL<<4) | (MW_INTXBAR26_SD1_ERR_SEL<<5) | (MW_INTXBAR26_SD1_FILT0_DRINT_SEL<<6) | (MW_INTXBAR26_SD1_FILT1_DRINT_SEL<<7) | (MW_INTXBAR26_SD1_FILT2_DRINT_SEL<<8) | (MW_INTXBAR26_SD1_FILT3_DRINT_SEL<<9);
    group5_mask[26] = (MW_INTXBAR26_ECAP0_INT_SEL<<0) | (MW_INTXBAR26_ECAP1_INT_SEL<<1) | (MW_INTXBAR26_ECAP2_INT_SEL<<2) | (MW_INTXBAR26_ECAP3_INT_SEL<<3) | (MW_INTXBAR26_ECAP4_INT_SEL<<4) | (MW_INTXBAR26_ECAP5_INT_SEL<<5) | (MW_INTXBAR26_ECAP6_INT_SEL<<6) | (MW_INTXBAR26_ECAP7_INT_SEL<<7) | (MW_INTXBAR26_ECAP8_INT_SEL<<8) | (MW_INTXBAR26_ECAP9_INT_SEL<<9);
    group6_mask[26] = (MW_INTXBAR26_EQEP0_INT_SEL<<0) | (MW_INTXBAR26_EQEP1_INT_SEL<<1) | (MW_INTXBAR26_EQEP2_INT_SEL<<2);
    group0_mask[27] = (MW_INTXBAR27_EPWM0_INT_SEL<<0) | (MW_INTXBAR27_EPWM1_INT_SEL<<1) | (MW_INTXBAR27_EPWM2_INT_SEL<<2) | (MW_INTXBAR27_EPWM3_INT_SEL<<3) | (MW_INTXBAR27_EPWM4_INT_SEL<<4) | (MW_INTXBAR27_EPWM5_INT_SEL<<5) | (MW_INTXBAR27_EPWM6_INT_SEL<<6) | (MW_INTXBAR27_EPWM7_INT_SEL<<7) | (MW_INTXBAR27_EPWM8_INT_SEL<<8) | (MW_INTXBAR27_EPWM9_INT_SEL<<9) | (MW_INTXBAR27_EPWM10_INT_SEL<<10) | (MW_INTXBAR27_EPWM11_INT_SEL<<11) | (MW_INTXBAR27_EPWM12_INT_SEL<<12) | (MW_INTXBAR27_EPWM13_INT_SEL<<13) | (MW_INTXBAR27_EPWM14_INT_SEL<<14) | (MW_INTXBAR27_EPWM15_INT_SEL<<15) | (MW_INTXBAR27_EPWM16_INT_SEL<<16) | (MW_INTXBAR27_EPWM17_INT_SEL<<17) | (MW_INTXBAR27_EPWM18_INT_SEL<<18) | (MW_INTXBAR27_EPWM19_INT_SEL<<19) | (MW_INTXBAR27_EPWM20_INT_SEL<<20) | (MW_INTXBAR27_EPWM21_INT_SEL<<21) | (MW_INTXBAR27_EPWM22_INT_SEL<<22) | (MW_INTXBAR27_EPWM23_INT_SEL<<23) | (MW_INTXBAR27_EPWM24_INT_SEL<<24) | (MW_INTXBAR27_EPWM25_INT_SEL<<25) | (MW_INTXBAR27_EPWM26_INT_SEL<<26) | (MW_INTXBAR27_EPWM27_INT_SEL<<27) | (MW_INTXBAR27_EPWM28_INT_SEL<<28) | (MW_INTXBAR27_EPWM29_INT_SEL<<29) | (MW_INTXBAR27_EPWM30_INT_SEL<<30) | (MW_INTXBAR27_EPWM31_INT_SEL<<31);
    group1_mask[27] = (MW_INTXBAR27_EPWM0_TZINT_SEL<<0) | (MW_INTXBAR27_EPWM1_TZINT_SEL<<1) | (MW_INTXBAR27_EPWM2_TZINT_SEL<<2) | (MW_INTXBAR27_EPWM3_TZINT_SEL<<3) | (MW_INTXBAR27_EPWM4_TZINT_SEL<<4) | (MW_INTXBAR27_EPWM5_TZINT_SEL<<5) | (MW_INTXBAR27_EPWM6_TZINT_SEL<<6) | (MW_INTXBAR27_EPWM7_TZINT_SEL<<7) | (MW_INTXBAR27_EPWM8_TZINT_SEL<<8) | (MW_INTXBAR27_EPWM9_TZINT_SEL<<9) | (MW_INTXBAR27_EPWM10_TZINT_SEL<<10) | (MW_INTXBAR27_EPWM11_TZINT_SEL<<11) | (MW_INTXBAR27_EPWM12_TZINT_SEL<<12) | (MW_INTXBAR27_EPWM13_TZINT_SEL<<13) | (MW_INTXBAR27_EPWM14_TZINT_SEL<<14) | (MW_INTXBAR27_EPWM15_TZINT_SEL<<15) | (MW_INTXBAR27_EPWM16_TZINT_SEL<<16) | (MW_INTXBAR27_EPWM17_TZINT_SEL<<17) | (MW_INTXBAR27_EPWM18_TZINT_SEL<<18) | (MW_INTXBAR27_EPWM19_TZINT_SEL<<19) | (MW_INTXBAR27_EPWM20_TZINT_SEL<<20) | (MW_INTXBAR27_EPWM21_TZINT_SEL<<21) | (MW_INTXBAR27_EPWM22_TZINT_SEL<<22) | (MW_INTXBAR27_EPWM23_TZINT_SEL<<23) | (MW_INTXBAR27_EPWM24_TZINT_SEL<<24) | (MW_INTXBAR27_EPWM25_TZINT_SEL<<25) | (MW_INTXBAR27_EPWM26_TZINT_SEL<<26) | (MW_INTXBAR27_EPWM27_TZINT_SEL<<27) | (MW_INTXBAR27_EPWM28_TZINT_SEL<<28) | (MW_INTXBAR27_EPWM29_TZINT_SEL<<29) | (MW_INTXBAR27_EPWM30_TZINT_SEL<<30) | (MW_INTXBAR27_EPWM31_TZINT_SEL<<31);
    group2_mask[27] = (MW_INTXBAR27_ADC0_INT1_SEL<<0) | (MW_INTXBAR27_ADC0_INT2_SEL<<1) | (MW_INTXBAR27_ADC0_INT3_SEL<<2) | (MW_INTXBAR27_ADC0_INT4_SEL<<3) | (MW_INTXBAR27_ADC0_EVTINT_SEL<<4) | (MW_INTXBAR27_ADC1_INT1_SEL<<5) | (MW_INTXBAR27_ADC1_INT2_SEL<<6) | (MW_INTXBAR27_ADC1_INT3_SEL<<7) | (MW_INTXBAR27_ADC1_INT4_SEL<<8) | (MW_INTXBAR27_ADC1_EVTINT_SEL<<9) | (MW_INTXBAR27_ADC2_INT1_SEL<<10) | (MW_INTXBAR27_ADC2_INT2_SEL<<11) | (MW_INTXBAR27_ADC2_INT3_SEL<<12) | (MW_INTXBAR27_ADC2_INT4_SEL<<13) | (MW_INTXBAR27_ADC2_EVTINT_SEL<<14) | (MW_INTXBAR27_ADC3_INT1_SEL<<15) | (MW_INTXBAR27_ADC3_INT2_SEL<<16) | (MW_INTXBAR27_ADC3_INT3_SEL<<17) | (MW_INTXBAR27_ADC3_INT4_SEL<<18) | (MW_INTXBAR27_ADC3_EVTINT_SEL<<19) | (MW_INTXBAR27_ADC4_INT1_SEL<<20) | (MW_INTXBAR27_ADC4_INT2_SEL<<21) | (MW_INTXBAR27_ADC4_INT3_SEL<<22) | (MW_INTXBAR27_ADC4_INT4_SEL<<23) | (MW_INTXBAR27_ADC4_EVTINT_SEL<<24);
    group3_mask[27] = (MW_INTXBAR27_FSIRX0_INT1N_SEL<<0) | (MW_INTXBAR27_FSIRX0_INT2N_SEL<<1) | (MW_INTXBAR27_FSITX0_INT1N_SEL<<2) | (MW_INTXBAR27_FSITX0_INT2N_SEL<<3) | (MW_INTXBAR27_FSIRX1_INT1N_SEL<<4) | (MW_INTXBAR27_FSIRX1_INT2N_SEL<<5) | (MW_INTXBAR27_FSITX1_INT1N_SEL<<6) | (MW_INTXBAR27_FSITX1_INT2N_SEL<<7) | (MW_INTXBAR27_FSIRX2_INT1N_SEL<<8) | (MW_INTXBAR27_FSIRX2_INT2N_SEL<<9) | (MW_INTXBAR27_FSITX2_INT1N_SEL<<10) | (MW_INTXBAR27_FSITX2_INT2N_SEL<<11) | (MW_INTXBAR27_FSIRX3_INT1N_SEL<<12) | (MW_INTXBAR27_FSIRX3_INT2N_SEL<<13) | (MW_INTXBAR27_FSITX3_INT1N_SEL<<14) | (MW_INTXBAR27_FSITX3_INT2N_SEL<<15);
    group4_mask[27] = (MW_INTXBAR27_SD0_ERR_SEL<<0) | (MW_INTXBAR27_SD0_FILT0_DRINT_SEL<<1) | (MW_INTXBAR27_SD0_FILT1_DRINT_SEL<<2) | (MW_INTXBAR27_SD0_FILT2_DRINT_SEL<<3) | (MW_INTXBAR27_SD0_FILT3_DRINT_SEL<<4) | (MW_INTXBAR27_SD1_ERR_SEL<<5) | (MW_INTXBAR27_SD1_FILT0_DRINT_SEL<<6) | (MW_INTXBAR27_SD1_FILT1_DRINT_SEL<<7) | (MW_INTXBAR27_SD1_FILT2_DRINT_SEL<<8) | (MW_INTXBAR27_SD1_FILT3_DRINT_SEL<<9);
    group5_mask[27] = (MW_INTXBAR27_ECAP0_INT_SEL<<0) | (MW_INTXBAR27_ECAP1_INT_SEL<<1) | (MW_INTXBAR27_ECAP2_INT_SEL<<2) | (MW_INTXBAR27_ECAP3_INT_SEL<<3) | (MW_INTXBAR27_ECAP4_INT_SEL<<4) | (MW_INTXBAR27_ECAP5_INT_SEL<<5) | (MW_INTXBAR27_ECAP6_INT_SEL<<6) | (MW_INTXBAR27_ECAP7_INT_SEL<<7) | (MW_INTXBAR27_ECAP8_INT_SEL<<8) | (MW_INTXBAR27_ECAP9_INT_SEL<<9);
    group6_mask[27] = (MW_INTXBAR27_EQEP0_INT_SEL<<0) | (MW_INTXBAR27_EQEP1_INT_SEL<<1) | (MW_INTXBAR27_EQEP2_INT_SEL<<2);
    group0_mask[28] = (MW_INTXBAR28_EPWM0_INT_SEL<<0) | (MW_INTXBAR28_EPWM1_INT_SEL<<1) | (MW_INTXBAR28_EPWM2_INT_SEL<<2) | (MW_INTXBAR28_EPWM3_INT_SEL<<3) | (MW_INTXBAR28_EPWM4_INT_SEL<<4) | (MW_INTXBAR28_EPWM5_INT_SEL<<5) | (MW_INTXBAR28_EPWM6_INT_SEL<<6) | (MW_INTXBAR28_EPWM7_INT_SEL<<7) | (MW_INTXBAR28_EPWM8_INT_SEL<<8) | (MW_INTXBAR28_EPWM9_INT_SEL<<9) | (MW_INTXBAR28_EPWM10_INT_SEL<<10) | (MW_INTXBAR28_EPWM11_INT_SEL<<11) | (MW_INTXBAR28_EPWM12_INT_SEL<<12) | (MW_INTXBAR28_EPWM13_INT_SEL<<13) | (MW_INTXBAR28_EPWM14_INT_SEL<<14) | (MW_INTXBAR28_EPWM15_INT_SEL<<15) | (MW_INTXBAR28_EPWM16_INT_SEL<<16) | (MW_INTXBAR28_EPWM17_INT_SEL<<17) | (MW_INTXBAR28_EPWM18_INT_SEL<<18) | (MW_INTXBAR28_EPWM19_INT_SEL<<19) | (MW_INTXBAR28_EPWM20_INT_SEL<<20) | (MW_INTXBAR28_EPWM21_INT_SEL<<21) | (MW_INTXBAR28_EPWM22_INT_SEL<<22) | (MW_INTXBAR28_EPWM23_INT_SEL<<23) | (MW_INTXBAR28_EPWM24_INT_SEL<<24) | (MW_INTXBAR28_EPWM25_INT_SEL<<25) | (MW_INTXBAR28_EPWM26_INT_SEL<<26) | (MW_INTXBAR28_EPWM27_INT_SEL<<27) | (MW_INTXBAR28_EPWM28_INT_SEL<<28) | (MW_INTXBAR28_EPWM29_INT_SEL<<29) | (MW_INTXBAR28_EPWM30_INT_SEL<<30) | (MW_INTXBAR28_EPWM31_INT_SEL<<31);
    group1_mask[28] = (MW_INTXBAR28_EPWM0_TZINT_SEL<<0) | (MW_INTXBAR28_EPWM1_TZINT_SEL<<1) | (MW_INTXBAR28_EPWM2_TZINT_SEL<<2) | (MW_INTXBAR28_EPWM3_TZINT_SEL<<3) | (MW_INTXBAR28_EPWM4_TZINT_SEL<<4) | (MW_INTXBAR28_EPWM5_TZINT_SEL<<5) | (MW_INTXBAR28_EPWM6_TZINT_SEL<<6) | (MW_INTXBAR28_EPWM7_TZINT_SEL<<7) | (MW_INTXBAR28_EPWM8_TZINT_SEL<<8) | (MW_INTXBAR28_EPWM9_TZINT_SEL<<9) | (MW_INTXBAR28_EPWM10_TZINT_SEL<<10) | (MW_INTXBAR28_EPWM11_TZINT_SEL<<11) | (MW_INTXBAR28_EPWM12_TZINT_SEL<<12) | (MW_INTXBAR28_EPWM13_TZINT_SEL<<13) | (MW_INTXBAR28_EPWM14_TZINT_SEL<<14) | (MW_INTXBAR28_EPWM15_TZINT_SEL<<15) | (MW_INTXBAR28_EPWM16_TZINT_SEL<<16) | (MW_INTXBAR28_EPWM17_TZINT_SEL<<17) | (MW_INTXBAR28_EPWM18_TZINT_SEL<<18) | (MW_INTXBAR28_EPWM19_TZINT_SEL<<19) | (MW_INTXBAR28_EPWM20_TZINT_SEL<<20) | (MW_INTXBAR28_EPWM21_TZINT_SEL<<21) | (MW_INTXBAR28_EPWM22_TZINT_SEL<<22) | (MW_INTXBAR28_EPWM23_TZINT_SEL<<23) | (MW_INTXBAR28_EPWM24_TZINT_SEL<<24) | (MW_INTXBAR28_EPWM25_TZINT_SEL<<25) | (MW_INTXBAR28_EPWM26_TZINT_SEL<<26) | (MW_INTXBAR28_EPWM27_TZINT_SEL<<27) | (MW_INTXBAR28_EPWM28_TZINT_SEL<<28) | (MW_INTXBAR28_EPWM29_TZINT_SEL<<29) | (MW_INTXBAR28_EPWM30_TZINT_SEL<<30) | (MW_INTXBAR28_EPWM31_TZINT_SEL<<31);
    group2_mask[28] = (MW_INTXBAR28_ADC0_INT1_SEL<<0) | (MW_INTXBAR28_ADC0_INT2_SEL<<1) | (MW_INTXBAR28_ADC0_INT3_SEL<<2) | (MW_INTXBAR28_ADC0_INT4_SEL<<3) | (MW_INTXBAR28_ADC0_EVTINT_SEL<<4) | (MW_INTXBAR28_ADC1_INT1_SEL<<5) | (MW_INTXBAR28_ADC1_INT2_SEL<<6) | (MW_INTXBAR28_ADC1_INT3_SEL<<7) | (MW_INTXBAR28_ADC1_INT4_SEL<<8) | (MW_INTXBAR28_ADC1_EVTINT_SEL<<9) | (MW_INTXBAR28_ADC2_INT1_SEL<<10) | (MW_INTXBAR28_ADC2_INT2_SEL<<11) | (MW_INTXBAR28_ADC2_INT3_SEL<<12) | (MW_INTXBAR28_ADC2_INT4_SEL<<13) | (MW_INTXBAR28_ADC2_EVTINT_SEL<<14) | (MW_INTXBAR28_ADC3_INT1_SEL<<15) | (MW_INTXBAR28_ADC3_INT2_SEL<<16) | (MW_INTXBAR28_ADC3_INT3_SEL<<17) | (MW_INTXBAR28_ADC3_INT4_SEL<<18) | (MW_INTXBAR28_ADC3_EVTINT_SEL<<19) | (MW_INTXBAR28_ADC4_INT1_SEL<<20) | (MW_INTXBAR28_ADC4_INT2_SEL<<21) | (MW_INTXBAR28_ADC4_INT3_SEL<<22) | (MW_INTXBAR28_ADC4_INT4_SEL<<23) | (MW_INTXBAR28_ADC4_EVTINT_SEL<<24);
    group3_mask[28] = (MW_INTXBAR28_FSIRX0_INT1N_SEL<<0) | (MW_INTXBAR28_FSIRX0_INT2N_SEL<<1) | (MW_INTXBAR28_FSITX0_INT1N_SEL<<2) | (MW_INTXBAR28_FSITX0_INT2N_SEL<<3) | (MW_INTXBAR28_FSIRX1_INT1N_SEL<<4) | (MW_INTXBAR28_FSIRX1_INT2N_SEL<<5) | (MW_INTXBAR28_FSITX1_INT1N_SEL<<6) | (MW_INTXBAR28_FSITX1_INT2N_SEL<<7) | (MW_INTXBAR28_FSIRX2_INT1N_SEL<<8) | (MW_INTXBAR28_FSIRX2_INT2N_SEL<<9) | (MW_INTXBAR28_FSITX2_INT1N_SEL<<10) | (MW_INTXBAR28_FSITX2_INT2N_SEL<<11) | (MW_INTXBAR28_FSIRX3_INT1N_SEL<<12) | (MW_INTXBAR28_FSIRX3_INT2N_SEL<<13) | (MW_INTXBAR28_FSITX3_INT1N_SEL<<14) | (MW_INTXBAR28_FSITX3_INT2N_SEL<<15);
    group4_mask[28] = (MW_INTXBAR28_SD0_ERR_SEL<<0) | (MW_INTXBAR28_SD0_FILT0_DRINT_SEL<<1) | (MW_INTXBAR28_SD0_FILT1_DRINT_SEL<<2) | (MW_INTXBAR28_SD0_FILT2_DRINT_SEL<<3) | (MW_INTXBAR28_SD0_FILT3_DRINT_SEL<<4) | (MW_INTXBAR28_SD1_ERR_SEL<<5) | (MW_INTXBAR28_SD1_FILT0_DRINT_SEL<<6) | (MW_INTXBAR28_SD1_FILT1_DRINT_SEL<<7) | (MW_INTXBAR28_SD1_FILT2_DRINT_SEL<<8) | (MW_INTXBAR28_SD1_FILT3_DRINT_SEL<<9);
    group5_mask[28] = (MW_INTXBAR28_ECAP0_INT_SEL<<0) | (MW_INTXBAR28_ECAP1_INT_SEL<<1) | (MW_INTXBAR28_ECAP2_INT_SEL<<2) | (MW_INTXBAR28_ECAP3_INT_SEL<<3) | (MW_INTXBAR28_ECAP4_INT_SEL<<4) | (MW_INTXBAR28_ECAP5_INT_SEL<<5) | (MW_INTXBAR28_ECAP6_INT_SEL<<6) | (MW_INTXBAR28_ECAP7_INT_SEL<<7) | (MW_INTXBAR28_ECAP8_INT_SEL<<8) | (MW_INTXBAR28_ECAP9_INT_SEL<<9);
    group6_mask[28] = (MW_INTXBAR28_EQEP0_INT_SEL<<0) | (MW_INTXBAR28_EQEP1_INT_SEL<<1) | (MW_INTXBAR28_EQEP2_INT_SEL<<2);
    group0_mask[29] = (MW_INTXBAR29_EPWM0_INT_SEL<<0) | (MW_INTXBAR29_EPWM1_INT_SEL<<1) | (MW_INTXBAR29_EPWM2_INT_SEL<<2) | (MW_INTXBAR29_EPWM3_INT_SEL<<3) | (MW_INTXBAR29_EPWM4_INT_SEL<<4) | (MW_INTXBAR29_EPWM5_INT_SEL<<5) | (MW_INTXBAR29_EPWM6_INT_SEL<<6) | (MW_INTXBAR29_EPWM7_INT_SEL<<7) | (MW_INTXBAR29_EPWM8_INT_SEL<<8) | (MW_INTXBAR29_EPWM9_INT_SEL<<9) | (MW_INTXBAR29_EPWM10_INT_SEL<<10) | (MW_INTXBAR29_EPWM11_INT_SEL<<11) | (MW_INTXBAR29_EPWM12_INT_SEL<<12) | (MW_INTXBAR29_EPWM13_INT_SEL<<13) | (MW_INTXBAR29_EPWM14_INT_SEL<<14) | (MW_INTXBAR29_EPWM15_INT_SEL<<15) | (MW_INTXBAR29_EPWM16_INT_SEL<<16) | (MW_INTXBAR29_EPWM17_INT_SEL<<17) | (MW_INTXBAR29_EPWM18_INT_SEL<<18) | (MW_INTXBAR29_EPWM19_INT_SEL<<19) | (MW_INTXBAR29_EPWM20_INT_SEL<<20) | (MW_INTXBAR29_EPWM21_INT_SEL<<21) | (MW_INTXBAR29_EPWM22_INT_SEL<<22) | (MW_INTXBAR29_EPWM23_INT_SEL<<23) | (MW_INTXBAR29_EPWM24_INT_SEL<<24) | (MW_INTXBAR29_EPWM25_INT_SEL<<25) | (MW_INTXBAR29_EPWM26_INT_SEL<<26) | (MW_INTXBAR29_EPWM27_INT_SEL<<27) | (MW_INTXBAR29_EPWM28_INT_SEL<<28) | (MW_INTXBAR29_EPWM29_INT_SEL<<29) | (MW_INTXBAR29_EPWM30_INT_SEL<<30) | (MW_INTXBAR29_EPWM31_INT_SEL<<31);
    group1_mask[29] = (MW_INTXBAR29_EPWM0_TZINT_SEL<<0) | (MW_INTXBAR29_EPWM1_TZINT_SEL<<1) | (MW_INTXBAR29_EPWM2_TZINT_SEL<<2) | (MW_INTXBAR29_EPWM3_TZINT_SEL<<3) | (MW_INTXBAR29_EPWM4_TZINT_SEL<<4) | (MW_INTXBAR29_EPWM5_TZINT_SEL<<5) | (MW_INTXBAR29_EPWM6_TZINT_SEL<<6) | (MW_INTXBAR29_EPWM7_TZINT_SEL<<7) | (MW_INTXBAR29_EPWM8_TZINT_SEL<<8) | (MW_INTXBAR29_EPWM9_TZINT_SEL<<9) | (MW_INTXBAR29_EPWM10_TZINT_SEL<<10) | (MW_INTXBAR29_EPWM11_TZINT_SEL<<11) | (MW_INTXBAR29_EPWM12_TZINT_SEL<<12) | (MW_INTXBAR29_EPWM13_TZINT_SEL<<13) | (MW_INTXBAR29_EPWM14_TZINT_SEL<<14) | (MW_INTXBAR29_EPWM15_TZINT_SEL<<15) | (MW_INTXBAR29_EPWM16_TZINT_SEL<<16) | (MW_INTXBAR29_EPWM17_TZINT_SEL<<17) | (MW_INTXBAR29_EPWM18_TZINT_SEL<<18) | (MW_INTXBAR29_EPWM19_TZINT_SEL<<19) | (MW_INTXBAR29_EPWM20_TZINT_SEL<<20) | (MW_INTXBAR29_EPWM21_TZINT_SEL<<21) | (MW_INTXBAR29_EPWM22_TZINT_SEL<<22) | (MW_INTXBAR29_EPWM23_TZINT_SEL<<23) | (MW_INTXBAR29_EPWM24_TZINT_SEL<<24) | (MW_INTXBAR29_EPWM25_TZINT_SEL<<25) | (MW_INTXBAR29_EPWM26_TZINT_SEL<<26) | (MW_INTXBAR29_EPWM27_TZINT_SEL<<27) | (MW_INTXBAR29_EPWM28_TZINT_SEL<<28) | (MW_INTXBAR29_EPWM29_TZINT_SEL<<29) | (MW_INTXBAR29_EPWM30_TZINT_SEL<<30) | (MW_INTXBAR29_EPWM31_TZINT_SEL<<31);
    group2_mask[29] = (MW_INTXBAR29_ADC0_INT1_SEL<<0) | (MW_INTXBAR29_ADC0_INT2_SEL<<1) | (MW_INTXBAR29_ADC0_INT3_SEL<<2) | (MW_INTXBAR29_ADC0_INT4_SEL<<3) | (MW_INTXBAR29_ADC0_EVTINT_SEL<<4) | (MW_INTXBAR29_ADC1_INT1_SEL<<5) | (MW_INTXBAR29_ADC1_INT2_SEL<<6) | (MW_INTXBAR29_ADC1_INT3_SEL<<7) | (MW_INTXBAR29_ADC1_INT4_SEL<<8) | (MW_INTXBAR29_ADC1_EVTINT_SEL<<9) | (MW_INTXBAR29_ADC2_INT1_SEL<<10) | (MW_INTXBAR29_ADC2_INT2_SEL<<11) | (MW_INTXBAR29_ADC2_INT3_SEL<<12) | (MW_INTXBAR29_ADC2_INT4_SEL<<13) | (MW_INTXBAR29_ADC2_EVTINT_SEL<<14) | (MW_INTXBAR29_ADC3_INT1_SEL<<15) | (MW_INTXBAR29_ADC3_INT2_SEL<<16) | (MW_INTXBAR29_ADC3_INT3_SEL<<17) | (MW_INTXBAR29_ADC3_INT4_SEL<<18) | (MW_INTXBAR29_ADC3_EVTINT_SEL<<19) | (MW_INTXBAR29_ADC4_INT1_SEL<<20) | (MW_INTXBAR29_ADC4_INT2_SEL<<21) | (MW_INTXBAR29_ADC4_INT3_SEL<<22) | (MW_INTXBAR29_ADC4_INT4_SEL<<23) | (MW_INTXBAR29_ADC4_EVTINT_SEL<<24);
    group3_mask[29] = (MW_INTXBAR29_FSIRX0_INT1N_SEL<<0) | (MW_INTXBAR29_FSIRX0_INT2N_SEL<<1) | (MW_INTXBAR29_FSITX0_INT1N_SEL<<2) | (MW_INTXBAR29_FSITX0_INT2N_SEL<<3) | (MW_INTXBAR29_FSIRX1_INT1N_SEL<<4) | (MW_INTXBAR29_FSIRX1_INT2N_SEL<<5) | (MW_INTXBAR29_FSITX1_INT1N_SEL<<6) | (MW_INTXBAR29_FSITX1_INT2N_SEL<<7) | (MW_INTXBAR29_FSIRX2_INT1N_SEL<<8) | (MW_INTXBAR29_FSIRX2_INT2N_SEL<<9) | (MW_INTXBAR29_FSITX2_INT1N_SEL<<10) | (MW_INTXBAR29_FSITX2_INT2N_SEL<<11) | (MW_INTXBAR29_FSIRX3_INT1N_SEL<<12) | (MW_INTXBAR29_FSIRX3_INT2N_SEL<<13) | (MW_INTXBAR29_FSITX3_INT1N_SEL<<14) | (MW_INTXBAR29_FSITX3_INT2N_SEL<<15);
    group4_mask[29] = (MW_INTXBAR29_SD0_ERR_SEL<<0) | (MW_INTXBAR29_SD0_FILT0_DRINT_SEL<<1) | (MW_INTXBAR29_SD0_FILT1_DRINT_SEL<<2) | (MW_INTXBAR29_SD0_FILT2_DRINT_SEL<<3) | (MW_INTXBAR29_SD0_FILT3_DRINT_SEL<<4) | (MW_INTXBAR29_SD1_ERR_SEL<<5) | (MW_INTXBAR29_SD1_FILT0_DRINT_SEL<<6) | (MW_INTXBAR29_SD1_FILT1_DRINT_SEL<<7) | (MW_INTXBAR29_SD1_FILT2_DRINT_SEL<<8) | (MW_INTXBAR29_SD1_FILT3_DRINT_SEL<<9);
    group5_mask[29] = (MW_INTXBAR29_ECAP0_INT_SEL<<0) | (MW_INTXBAR29_ECAP1_INT_SEL<<1) | (MW_INTXBAR29_ECAP2_INT_SEL<<2) | (MW_INTXBAR29_ECAP3_INT_SEL<<3) | (MW_INTXBAR29_ECAP4_INT_SEL<<4) | (MW_INTXBAR29_ECAP5_INT_SEL<<5) | (MW_INTXBAR29_ECAP6_INT_SEL<<6) | (MW_INTXBAR29_ECAP7_INT_SEL<<7) | (MW_INTXBAR29_ECAP8_INT_SEL<<8) | (MW_INTXBAR29_ECAP9_INT_SEL<<9);
