TexasInstruments/am26x-hsp/src/am263px_init.c
    group6_mask[29] = (MW_INTXBAR29_EQEP0_INT_SEL<<0) | (MW_INTXBAR29_EQEP1_INT_SEL<<1) | (MW_INTXBAR29_EQEP2_INT_SEL<<2);
    group0_mask[30] = (MW_INTXBAR30_EPWM0_INT_SEL<<0) | (MW_INTXBAR30_EPWM1_INT_SEL<<1) | (MW_INTXBAR30_EPWM2_INT_SEL<<2) | (MW_INTXBAR30_EPWM3_INT_SEL<<3) | (MW_INTXBAR30_EPWM4_INT_SEL<<4) | (MW_INTXBAR30_EPWM5_INT_SEL<<5) | (MW_INTXBAR30_EPWM6_INT_SEL<<6) | (MW_INTXBAR30_EPWM7_INT_SEL<<7) | (MW_INTXBAR30_EPWM8_INT_SEL<<8) | (MW_INTXBAR30_EPWM9_INT_SEL<<9) | (MW_INTXBAR30_EPWM10_INT_SEL<<10) | (MW_INTXBAR30_EPWM11_INT_SEL<<11) | (MW_INTXBAR30_EPWM12_INT_SEL<<12) | (MW_INTXBAR30_EPWM13_INT_SEL<<13) | (MW_INTXBAR30_EPWM14_INT_SEL<<14) | (MW_INTXBAR30_EPWM15_INT_SEL<<15) | (MW_INTXBAR30_EPWM16_INT_SEL<<16) | (MW_INTXBAR30_EPWM17_INT_SEL<<17) | (MW_INTXBAR30_EPWM18_INT_SEL<<18) | (MW_INTXBAR30_EPWM19_INT_SEL<<19) | (MW_INTXBAR30_EPWM20_INT_SEL<<20) | (MW_INTXBAR30_EPWM21_INT_SEL<<21) | (MW_INTXBAR30_EPWM22_INT_SEL<<22) | (MW_INTXBAR30_EPWM23_INT_SEL<<23) | (MW_INTXBAR30_EPWM24_INT_SEL<<24) | (MW_INTXBAR30_EPWM25_INT_SEL<<25) | (MW_INTXBAR30_EPWM26_INT_SEL<<26) | (MW_INTXBAR30_EPWM27_INT_SEL<<27) | (MW_INTXBAR30_EPWM28_INT_SEL<<28) | (MW_INTXBAR30_EPWM29_INT_SEL<<29) | (MW_INTXBAR30_EPWM30_INT_SEL<<30) | (MW_INTXBAR30_EPWM31_INT_SEL<<31);
    group1_mask[30] = (MW_INTXBAR30_EPWM0_TZINT_SEL<<0) | (MW_INTXBAR30_EPWM1_TZINT_SEL<<1) | (MW_INTXBAR30_EPWM2_TZINT_SEL<<2) | (MW_INTXBAR30_EPWM3_TZINT_SEL<<3) | (MW_INTXBAR30_EPWM4_TZINT_SEL<<4) | (MW_INTXBAR30_EPWM5_TZINT_SEL<<5) | (MW_INTXBAR30_EPWM6_TZINT_SEL<<6) | (MW_INTXBAR30_EPWM7_TZINT_SEL<<7) | (MW_INTXBAR30_EPWM8_TZINT_SEL<<8) | (MW_INTXBAR30_EPWM9_TZINT_SEL<<9) | (MW_INTXBAR30_EPWM10_TZINT_SEL<<10) | (MW_INTXBAR30_EPWM11_TZINT_SEL<<11) | (MW_INTXBAR30_EPWM12_TZINT_SEL<<12) | (MW_INTXBAR30_EPWM13_TZINT_SEL<<13) | (MW_INTXBAR30_EPWM14_TZINT_SEL<<14) | (MW_INTXBAR30_EPWM15_TZINT_SEL<<15) | (MW_INTXBAR30_EPWM16_TZINT_SEL<<16) | (MW_INTXBAR30_EPWM17_TZINT_SEL<<17) | (MW_INTXBAR30_EPWM18_TZINT_SEL<<18) | (MW_INTXBAR30_EPWM19_TZINT_SEL<<19) | (MW_INTXBAR30_EPWM20_TZINT_SEL<<20) | (MW_INTXBAR30_EPWM21_TZINT_SEL<<21) | (MW_INTXBAR30_EPWM22_TZINT_SEL<<22) | (MW_INTXBAR30_EPWM23_TZINT_SEL<<23) | (MW_INTXBAR30_EPWM24_TZINT_SEL<<24) | (MW_INTXBAR30_EPWM25_TZINT_SEL<<25) | (MW_INTXBAR30_EPWM26_TZINT_SEL<<26) | (MW_INTXBAR30_EPWM27_TZINT_SEL<<27) | (MW_INTXBAR30_EPWM28_TZINT_SEL<<28) | (MW_INTXBAR30_EPWM29_TZINT_SEL<<29) | (MW_INTXBAR30_EPWM30_TZINT_SEL<<30) | (MW_INTXBAR30_EPWM31_TZINT_SEL<<31);
    group2_mask[30] = (MW_INTXBAR30_ADC0_INT1_SEL<<0) | (MW_INTXBAR30_ADC0_INT2_SEL<<1) | (MW_INTXBAR30_ADC0_INT3_SEL<<2) | (MW_INTXBAR30_ADC0_INT4_SEL<<3) | (MW_INTXBAR30_ADC0_EVTINT_SEL<<4) | (MW_INTXBAR30_ADC1_INT1_SEL<<5) | (MW_INTXBAR30_ADC1_INT2_SEL<<6) | (MW_INTXBAR30_ADC1_INT3_SEL<<7) | (MW_INTXBAR30_ADC1_INT4_SEL<<8) | (MW_INTXBAR30_ADC1_EVTINT_SEL<<9) | (MW_INTXBAR30_ADC2_INT1_SEL<<10) | (MW_INTXBAR30_ADC2_INT2_SEL<<11) | (MW_INTXBAR30_ADC2_INT3_SEL<<12) | (MW_INTXBAR30_ADC2_INT4_SEL<<13) | (MW_INTXBAR30_ADC2_EVTINT_SEL<<14) | (MW_INTXBAR30_ADC3_INT1_SEL<<15) | (MW_INTXBAR30_ADC3_INT2_SEL<<16) | (MW_INTXBAR30_ADC3_INT3_SEL<<17) | (MW_INTXBAR30_ADC3_INT4_SEL<<18) | (MW_INTXBAR30_ADC3_EVTINT_SEL<<19) | (MW_INTXBAR30_ADC4_INT1_SEL<<20) | (MW_INTXBAR30_ADC4_INT2_SEL<<21) | (MW_INTXBAR30_ADC4_INT3_SEL<<22) | (MW_INTXBAR30_ADC4_INT4_SEL<<23) | (MW_INTXBAR30_ADC4_EVTINT_SEL<<24);
    group3_mask[30] = (MW_INTXBAR30_FSIRX0_INT1N_SEL<<0) | (MW_INTXBAR30_FSIRX0_INT2N_SEL<<1) | (MW_INTXBAR30_FSITX0_INT1N_SEL<<2) | (MW_INTXBAR30_FSITX0_INT2N_SEL<<3) | (MW_INTXBAR30_FSIRX1_INT1N_SEL<<4) | (MW_INTXBAR30_FSIRX1_INT2N_SEL<<5) | (MW_INTXBAR30_FSITX1_INT1N_SEL<<6) | (MW_INTXBAR30_FSITX1_INT2N_SEL<<7) | (MW_INTXBAR30_FSIRX2_INT1N_SEL<<8) | (MW_INTXBAR30_FSIRX2_INT2N_SEL<<9) | (MW_INTXBAR30_FSITX2_INT1N_SEL<<10) | (MW_INTXBAR30_FSITX2_INT2N_SEL<<11) | (MW_INTXBAR30_FSIRX3_INT1N_SEL<<12) | (MW_INTXBAR30_FSIRX3_INT2N_SEL<<13) | (MW_INTXBAR30_FSITX3_INT1N_SEL<<14) | (MW_INTXBAR30_FSITX3_INT2N_SEL<<15);
    group4_mask[30] = (MW_INTXBAR30_SD0_ERR_SEL<<0) | (MW_INTXBAR30_SD0_FILT0_DRINT_SEL<<1) | (MW_INTXBAR30_SD0_FILT1_DRINT_SEL<<2) | (MW_INTXBAR30_SD0_FILT2_DRINT_SEL<<3) | (MW_INTXBAR30_SD0_FILT3_DRINT_SEL<<4) | (MW_INTXBAR30_SD1_ERR_SEL<<5) | (MW_INTXBAR30_SD1_FILT0_DRINT_SEL<<6) | (MW_INTXBAR30_SD1_FILT1_DRINT_SEL<<7) | (MW_INTXBAR30_SD1_FILT2_DRINT_SEL<<8) | (MW_INTXBAR30_SD1_FILT3_DRINT_SEL<<9);
    group5_mask[30] = (MW_INTXBAR30_ECAP0_INT_SEL<<0) | (MW_INTXBAR30_ECAP1_INT_SEL<<1) | (MW_INTXBAR30_ECAP2_INT_SEL<<2) | (MW_INTXBAR30_ECAP3_INT_SEL<<3) | (MW_INTXBAR30_ECAP4_INT_SEL<<4) | (MW_INTXBAR30_ECAP5_INT_SEL<<5) | (MW_INTXBAR30_ECAP6_INT_SEL<<6) | (MW_INTXBAR30_ECAP7_INT_SEL<<7) | (MW_INTXBAR30_ECAP8_INT_SEL<<8) | (MW_INTXBAR30_ECAP9_INT_SEL<<9);
    group6_mask[30] = (MW_INTXBAR30_EQEP0_INT_SEL<<0) | (MW_INTXBAR30_EQEP1_INT_SEL<<1) | (MW_INTXBAR30_EQEP2_INT_SEL<<2);
    group0_mask[31] = (MW_INTXBAR31_EPWM0_INT_SEL<<0) | (MW_INTXBAR31_EPWM1_INT_SEL<<1) | (MW_INTXBAR31_EPWM2_INT_SEL<<2) | (MW_INTXBAR31_EPWM3_INT_SEL<<3) | (MW_INTXBAR31_EPWM4_INT_SEL<<4) | (MW_INTXBAR31_EPWM5_INT_SEL<<5) | (MW_INTXBAR31_EPWM6_INT_SEL<<6) | (MW_INTXBAR31_EPWM7_INT_SEL<<7) | (MW_INTXBAR31_EPWM8_INT_SEL<<8) | (MW_INTXBAR31_EPWM9_INT_SEL<<9) | (MW_INTXBAR31_EPWM10_INT_SEL<<10) | (MW_INTXBAR31_EPWM11_INT_SEL<<11) | (MW_INTXBAR31_EPWM12_INT_SEL<<12) | (MW_INTXBAR31_EPWM13_INT_SEL<<13) | (MW_INTXBAR31_EPWM14_INT_SEL<<14) | (MW_INTXBAR31_EPWM15_INT_SEL<<15) | (MW_INTXBAR31_EPWM16_INT_SEL<<16) | (MW_INTXBAR31_EPWM17_INT_SEL<<17) | (MW_INTXBAR31_EPWM18_INT_SEL<<18) | (MW_INTXBAR31_EPWM19_INT_SEL<<19) | (MW_INTXBAR31_EPWM20_INT_SEL<<20) | (MW_INTXBAR31_EPWM21_INT_SEL<<21) | (MW_INTXBAR31_EPWM22_INT_SEL<<22) | (MW_INTXBAR31_EPWM23_INT_SEL<<23) | (MW_INTXBAR31_EPWM24_INT_SEL<<24) | (MW_INTXBAR31_EPWM25_INT_SEL<<25) | (MW_INTXBAR31_EPWM26_INT_SEL<<26) | (MW_INTXBAR31_EPWM27_INT_SEL<<27) | (MW_INTXBAR31_EPWM28_INT_SEL<<28) | (MW_INTXBAR31_EPWM29_INT_SEL<<29) | (MW_INTXBAR31_EPWM30_INT_SEL<<30) | (MW_INTXBAR31_EPWM31_INT_SEL<<31);
    group1_mask[31] = (MW_INTXBAR31_EPWM0_TZINT_SEL<<0) | (MW_INTXBAR31_EPWM1_TZINT_SEL<<1) | (MW_INTXBAR31_EPWM2_TZINT_SEL<<2) | (MW_INTXBAR31_EPWM3_TZINT_SEL<<3) | (MW_INTXBAR31_EPWM4_TZINT_SEL<<4) | (MW_INTXBAR31_EPWM5_TZINT_SEL<<5) | (MW_INTXBAR31_EPWM6_TZINT_SEL<<6) | (MW_INTXBAR31_EPWM7_TZINT_SEL<<7) | (MW_INTXBAR31_EPWM8_TZINT_SEL<<8) | (MW_INTXBAR31_EPWM9_TZINT_SEL<<9) | (MW_INTXBAR31_EPWM10_TZINT_SEL<<10) | (MW_INTXBAR31_EPWM11_TZINT_SEL<<11) | (MW_INTXBAR31_EPWM12_TZINT_SEL<<12) | (MW_INTXBAR31_EPWM13_TZINT_SEL<<13) | (MW_INTXBAR31_EPWM14_TZINT_SEL<<14) | (MW_INTXBAR31_EPWM15_TZINT_SEL<<15) | (MW_INTXBAR31_EPWM16_TZINT_SEL<<16) | (MW_INTXBAR31_EPWM17_TZINT_SEL<<17) | (MW_INTXBAR31_EPWM18_TZINT_SEL<<18) | (MW_INTXBAR31_EPWM19_TZINT_SEL<<19) | (MW_INTXBAR31_EPWM20_TZINT_SEL<<20) | (MW_INTXBAR31_EPWM21_TZINT_SEL<<21) | (MW_INTXBAR31_EPWM22_TZINT_SEL<<22) | (MW_INTXBAR31_EPWM23_TZINT_SEL<<23) | (MW_INTXBAR31_EPWM24_TZINT_SEL<<24) | (MW_INTXBAR31_EPWM25_TZINT_SEL<<25) | (MW_INTXBAR31_EPWM26_TZINT_SEL<<26) | (MW_INTXBAR31_EPWM27_TZINT_SEL<<27) | (MW_INTXBAR31_EPWM28_TZINT_SEL<<28) | (MW_INTXBAR31_EPWM29_TZINT_SEL<<29) | (MW_INTXBAR31_EPWM30_TZINT_SEL<<30) | (MW_INTXBAR31_EPWM31_TZINT_SEL<<31);
    group2_mask[31] = (MW_INTXBAR31_ADC0_INT1_SEL<<0) | (MW_INTXBAR31_ADC0_INT2_SEL<<1) | (MW_INTXBAR31_ADC0_INT3_SEL<<2) | (MW_INTXBAR31_ADC0_INT4_SEL<<3) | (MW_INTXBAR31_ADC0_EVTINT_SEL<<4) | (MW_INTXBAR31_ADC1_INT1_SEL<<5) | (MW_INTXBAR31_ADC1_INT2_SEL<<6) | (MW_INTXBAR31_ADC1_INT3_SEL<<7) | (MW_INTXBAR31_ADC1_INT4_SEL<<8) | (MW_INTXBAR31_ADC1_EVTINT_SEL<<9) | (MW_INTXBAR31_ADC2_INT1_SEL<<10) | (MW_INTXBAR31_ADC2_INT2_SEL<<11) | (MW_INTXBAR31_ADC2_INT3_SEL<<12) | (MW_INTXBAR31_ADC2_INT4_SEL<<13) | (MW_INTXBAR31_ADC2_EVTINT_SEL<<14) | (MW_INTXBAR31_ADC3_INT1_SEL<<15) | (MW_INTXBAR31_ADC3_INT2_SEL<<16) | (MW_INTXBAR31_ADC3_INT3_SEL<<17) | (MW_INTXBAR31_ADC3_INT4_SEL<<18) | (MW_INTXBAR31_ADC3_EVTINT_SEL<<19) | (MW_INTXBAR31_ADC4_INT1_SEL<<20) | (MW_INTXBAR31_ADC4_INT2_SEL<<21) | (MW_INTXBAR31_ADC4_INT3_SEL<<22) | (MW_INTXBAR31_ADC4_INT4_SEL<<23) | (MW_INTXBAR31_ADC4_EVTINT_SEL<<24);
    group3_mask[31] = (MW_INTXBAR31_FSIRX0_INT1N_SEL<<0) | (MW_INTXBAR31_FSIRX0_INT2N_SEL<<1) | (MW_INTXBAR31_FSITX0_INT1N_SEL<<2) | (MW_INTXBAR31_FSITX0_INT2N_SEL<<3) | (MW_INTXBAR31_FSIRX1_INT1N_SEL<<4) | (MW_INTXBAR31_FSIRX1_INT2N_SEL<<5) | (MW_INTXBAR31_FSITX1_INT1N_SEL<<6) | (MW_INTXBAR31_FSITX1_INT2N_SEL<<7) | (MW_INTXBAR31_FSIRX2_INT1N_SEL<<8) | (MW_INTXBAR31_FSIRX2_INT2N_SEL<<9) | (MW_INTXBAR31_FSITX2_INT1N_SEL<<10) | (MW_INTXBAR31_FSITX2_INT2N_SEL<<11) | (MW_INTXBAR31_FSIRX3_INT1N_SEL<<12) | (MW_INTXBAR31_FSIRX3_INT2N_SEL<<13) | (MW_INTXBAR31_FSITX3_INT1N_SEL<<14) | (MW_INTXBAR31_FSITX3_INT2N_SEL<<15);
    group4_mask[31] = (MW_INTXBAR31_SD0_ERR_SEL<<0) | (MW_INTXBAR31_SD0_FILT0_DRINT_SEL<<1) | (MW_INTXBAR31_SD0_FILT1_DRINT_SEL<<2) | (MW_INTXBAR31_SD0_FILT2_DRINT_SEL<<3) | (MW_INTXBAR31_SD0_FILT3_DRINT_SEL<<4) | (MW_INTXBAR31_SD1_ERR_SEL<<5) | (MW_INTXBAR31_SD1_FILT0_DRINT_SEL<<6) | (MW_INTXBAR31_SD1_FILT1_DRINT_SEL<<7) | (MW_INTXBAR31_SD1_FILT2_DRINT_SEL<<8) | (MW_INTXBAR31_SD1_FILT3_DRINT_SEL<<9);
    group5_mask[31] = (MW_INTXBAR31_ECAP0_INT_SEL<<0) | (MW_INTXBAR31_ECAP1_INT_SEL<<1) | (MW_INTXBAR31_ECAP2_INT_SEL<<2) | (MW_INTXBAR31_ECAP3_INT_SEL<<3) | (MW_INTXBAR31_ECAP4_INT_SEL<<4) | (MW_INTXBAR31_ECAP5_INT_SEL<<5) | (MW_INTXBAR31_ECAP6_INT_SEL<<6) | (MW_INTXBAR31_ECAP7_INT_SEL<<7) | (MW_INTXBAR31_ECAP8_INT_SEL<<8) | (MW_INTXBAR31_ECAP9_INT_SEL<<9);
    group6_mask[31] = (MW_INTXBAR31_EQEP0_INT_SEL<<0) | (MW_INTXBAR31_EQEP1_INT_SEL<<1) | (MW_INTXBAR31_EQEP2_INT_SEL<<2);

                                                                        
    uint8_t out;

    for( out = 0 ; out < 32 ; out++ )
    {
        SOC_xbarSelectInterruptXBarInputSource(CSL_CONTROLSS_INTXBAR_U_BASE, out, 
                                               group0_mask[out], group1_mask[out], 
                                               group2_mask[out], group3_mask[out], 
                                               group4_mask[out], group5_mask[out], 
                                               group6_mask[out]);
        
