TexasInstruments/am26x-hsp/src/am263px_init.c
    }
}

void Drivers_gpioIntXbarOpen()
{
    uint8_t out;
    uint8_t output_val =0;
    for(out = 0; out < 30; out ++)
    {
        switch(out)
        {
        case 0:
            output_val = MW_GPIO_INT_XBAR0_OUTPUT_SEL;
            break;
        case 1:
            output_val = MW_GPIO_INT_XBAR1_OUTPUT_SEL;
            break;
        case 2:
            output_val = MW_GPIO_INT_XBAR2_OUTPUT_SEL;
            break;
        case 3:
            output_val = MW_GPIO_INT_XBAR3_OUTPUT_SEL;
            break;
        case 4:
            output_val = MW_GPIO_INT_XBAR_DMA0_OUTPUT_SEL;
            break;
        case 5:
            output_val = MW_GPIO_INT_XBAR_DMA1_OUTPUT_SEL;
            break;
        case 6:
            output_val = MW_GPIO_INT_XBAR_DMA2_OUTPUT_SEL;
            break;
        case 7:
            output_val = MW_GPIO_INT_XBAR_DMA3_OUTPUT_SEL;
            break;
        case 8:
            output_val = MW_GPIO_INT_XBAR_SOC_TIMESYNC10_OUTPUT_SEL;
            break;
        case 9:
            output_val = MW_GPIO_INT_XBAR_SOC_TIMESYNC11_OUTPUT_SEL;
            break;
        case 10:
            output_val = MW_GPIO_INT_XBAR_SOC_TIMESYNC12_OUTPUT_SEL;
            break;
        case 11:
            output_val = MW_GPIO_INT_XBAR_SOC_TIMESYNC13_OUTPUT_SEL;
            break;
        case 12:
            output_val = MW_GPIO_INT_XBAR_SOC_TIMESYNC14_OUTPUT_SEL;
            break;
        case 13:
            output_val = MW_GPIO_INT_XBAR_SOC_TIMESYNC15_OUTPUT_SEL;
            break;
        case 14:
            output_val = MW_GPIO_INT_XBAR_VIM_MODULE00_SEL;
            break;
        case 15:
            output_val = MW_GPIO_INT_XBAR_VIM_MODULE01_SEL;
            break;
        case 16:
            output_val = MW_GPIO_INT_XBAR_VIM_MODULE02_SEL;
            break;
        case 17:
            output_val = MW_GPIO_INT_XBAR_VIM_MODULE03_SEL;
            break;
        case 18:
            output_val = MW_GPIO_INT_XBAR_VIM_MODULE10_SEL;
            break;
        case 19:
            output_val = MW_GPIO_INT_XBAR_VIM_MODULE11_SEL;
            break;
        case 20:
            output_val = MW_GPIO_INT_XBAR_VIM_MODULE12_SEL;
            break;
        case 21:
            output_val = MW_GPIO_INT_XBAR_VIM_MODULE13_SEL;
            break;
        case 22:
            output_val = MW_GPIO_INT_XBAR_VIM_MODULE20_SEL;
            break;
        case 23:
            output_val = MW_GPIO_INT_XBAR_VIM_MODULE21_SEL;
            break;
        case 24:
            output_val = MW_GPIO_INT_XBAR_VIM_MODULE22_SEL;
            break;
        case 25:
            output_val = MW_GPIO_INT_XBAR_VIM_MODULE23_SEL;
            break;
        case 26:
            output_val = MW_GPIO_INT_XBAR_VIM_MODULE30_SEL;
            break;
        case 27:
            output_val = MW_GPIO_INT_XBAR_VIM_MODULE31_SEL;
            break;
        case 28:
            output_val = MW_GPIO_INT_XBAR_VIM_MODULE32_SEL;
            break;
        case 29:
            output_val = MW_GPIO_INT_XBAR_VIM_MODULE33_SEL;
            break;
        default:
            output_val = 0;
            break;
        }

        SOC_xbarSelectGpioIntrXbarInputSource(CSL_GPIO_INTR_XBAR_U_BASE, out, output_val);
    }
}
void Drivers_inputXbarOpen(void)
{
    uint32_t InputXBAR_mask[32];

    InputXBAR_mask[0] = MW_INPUT_XBAR0_SEL;
    InputXBAR_mask[1] = MW_INPUT_XBAR1_SEL;
    InputXBAR_mask[2] = MW_INPUT_XBAR2_SEL;
    InputXBAR_mask[3] = MW_INPUT_XBAR3_SEL;
    InputXBAR_mask[4] = MW_INPUT_XBAR4_SEL;
    InputXBAR_mask[5] = MW_INPUT_XBAR5_SEL;
    InputXBAR_mask[6] = MW_INPUT_XBAR6_SEL;
    InputXBAR_mask[7] = MW_INPUT_XBAR7_SEL;
    InputXBAR_mask[8] = MW_INPUT_XBAR8_SEL;
    InputXBAR_mask[9] = MW_INPUT_XBAR9_SEL;
    InputXBAR_mask[10] = MW_INPUT_XBAR10_SEL;
    InputXBAR_mask[11] = MW_INPUT_XBAR11_SEL;
    InputXBAR_mask[12] = MW_INPUT_XBAR12_SEL;
    InputXBAR_mask[13] = MW_INPUT_XBAR13_SEL;
    InputXBAR_mask[14] = MW_INPUT_XBAR14_SEL;
    InputXBAR_mask[15] = MW_INPUT_XBAR15_SEL;
    InputXBAR_mask[16] = MW_INPUT_XBAR16_SEL;
    InputXBAR_mask[17] = MW_INPUT_XBAR17_SEL;
    InputXBAR_mask[18] = MW_INPUT_XBAR18_SEL;
    InputXBAR_mask[19] = MW_INPUT_XBAR19_SEL;
    InputXBAR_mask[20] = MW_INPUT_XBAR20_SEL;
    InputXBAR_mask[21] = MW_INPUT_XBAR21_SEL;
    InputXBAR_mask[22] = MW_INPUT_XBAR22_SEL;
    InputXBAR_mask[23] = MW_INPUT_XBAR23_SEL;
    InputXBAR_mask[24] = MW_INPUT_XBAR24_SEL;
    InputXBAR_mask[25] = MW_INPUT_XBAR25_SEL;
    InputXBAR_mask[26] = MW_INPUT_XBAR26_SEL;
    InputXBAR_mask[27] = MW_INPUT_XBAR27_SEL;
    InputXBAR_mask[28] = MW_INPUT_XBAR28_SEL;
    InputXBAR_mask[29] = MW_INPUT_XBAR29_SEL;
    InputXBAR_mask[30] = MW_INPUT_XBAR30_SEL;
    InputXBAR_mask[31] = MW_INPUT_XBAR31_SEL;
  
    for(int i = 0; i < 32; i++)
    {
        if(InputXBAR_mask[i] < 144)
        {
            SOC_xbarSelectInputXBarInputSource(CSL_CONTROLSS_INPUTXBAR_U_BASE, i, 0, InputXBAR_mask[i], 0);
        }
        else
        {
            SOC_xbarSelectInputXBarInputSource(CSL_CONTROLSS_INPUTXBAR_U_BASE, i, 1, 0, InputXBAR_mask[i]-144); 
        }
    }
}

void Drivers_EPWMXbarOpen()
{
    uint32_t group0_epwmxbar[30];
    uint32_t group1_epwmxbar[30];
    uint32_t group2_epwmxbar[30];
    uint32_t group3_epwmxbar[30];
    uint32_t group4_epwmxbar[30];
    uint32_t group5_epwmxbar[30];
    uint32_t group6_epwmxbar[30];
    uint32_t group7_epwmxbar[30];
    uint32_t group8_epwmxbar[30];
    uint32_t latch;

    group0_epwmxbar[0] = (MW_EPWMXBAR0_CMPSSA0_CTRIPL_SEL << 0) | (MW_EPWMXBAR0_CMPSSA0_CTRIPH_SEL << 1) | (MW_EPWMXBAR0_CMPSSA1_CTRIPL_SEL << 2) | (MW_EPWMXBAR0_CMPSSA1_CTRIPH_SEL << 3) | (MW_EPWMXBAR0_CMPSSA2_CTRIPL_SEL << 4) | (MW_EPWMXBAR0_CMPSSA2_CTRIPH_SEL << 5) | (MW_EPWMXBAR0_CMPSSA3_CTRIPL_SEL << 6) | (MW_EPWMXBAR0_CMPSSA3_CTRIPH_SEL << 7) | (MW_EPWMXBAR0_CMPSSA4_CTRIPL_SEL << 8) | (MW_EPWMXBAR0_CMPSSA4_CTRIPH_SEL << 9) | (MW_EPWMXBAR0_CMPSSA5_CTRIPL_SEL << 10) | (MW_EPWMXBAR0_CMPSSA5_CTRIPH_SEL << 11) | (MW_EPWMXBAR0_CMPSSA6_CTRIPL_SEL << 12) | (MW_EPWMXBAR0_CMPSSA6_CTRIPH_SEL << 13) | (MW_EPWMXBAR0_CMPSSA7_CTRIPL_SEL << 14) | (MW_EPWMXBAR0_CMPSSA7_CTRIPH_SEL << 15) | (MW_EPWMXBAR0_CMPSSA8_CTRIPL_SEL << 16) | (MW_EPWMXBAR0_CMPSSA8_CTRIPH_SEL << 17) | (MW_EPWMXBAR0_CMPSSA9_CTRIPL_SEL << 18) | (MW_EPWMXBAR0_CMPSSA9_CTRIPH_SEL << 19);
    group1_epwmxbar[0] = (MW_EPWMXBAR0_CMPSSB0_CTRIPL_SEL << 0) | (MW_EPWMXBAR0_CMPSSB0_CTRIPH_SEL << 1) | (MW_EPWMXBAR0_CMPSSB1_CTRIPL_SEL << 2) | (MW_EPWMXBAR0_CMPSSB1_CTRIPH_SEL << 3) | (MW_EPWMXBAR0_CMPSSB2_CTRIPL_SEL << 4) | (MW_EPWMXBAR0_CMPSSB2_CTRIPH_SEL << 5) | (MW_EPWMXBAR0_CMPSSB3_CTRIPL_SEL << 6) | (MW_EPWMXBAR0_CMPSSB3_CTRIPH_SEL << 7) | (MW_EPWMXBAR0_CMPSSB4_CTRIPL_SEL << 8) | (MW_EPWMXBAR0_CMPSSB4_CTRIPH_SEL << 9) | (MW_EPWMXBAR0_CMPSSB5_CTRIPL_SEL << 10) | (MW_EPWMXBAR0_CMPSSB5_CTRIPH_SEL << 11) | (MW_EPWMXBAR0_CMPSSB6_CTRIPL_SEL << 12) | (MW_EPWMXBAR0_CMPSSB6_CTRIPH_SEL << 13) | (MW_EPWMXBAR0_CMPSSB7_CTRIPL_SEL << 14) | (MW_EPWMXBAR0_CMPSSB7_CTRIPH_SEL << 15) | (MW_EPWMXBAR0_CMPSSB8_CTRIPL_SEL << 16) | (MW_EPWMXBAR0_CMPSSB8_CTRIPH_SEL << 17) | (MW_EPWMXBAR0_CMPSSB9_CTRIPL_SEL << 18) | (MW_EPWMXBAR0_CMPSSB9_CTRIPH_SEL << 19);
    group2_epwmxbar[0] = (MW_EPWMXBAR0_SD0_FILT0_CEVT1_SEL << 0) | (MW_EPWMXBAR0_SD0_FILT0_CEVT2_SEL << 1) | (MW_EPWMXBAR0_SD0_FILT0_CMPHZ_SEL << 2) | (MW_EPWMXBAR0_SD0_FILT1_CEVT1_SEL << 3) | (MW_EPWMXBAR0_SD0_FILT1_CEVT2_SEL << 4) | (MW_EPWMXBAR0_SD0_FILT1_CMPHZ_SEL << 5) | (MW_EPWMXBAR0_SD0_FILT2_CEVT1_SEL << 6) | (MW_EPWMXBAR0_SD0_FILT2_CEVT2_SEL << 7) | (MW_EPWMXBAR0_SD0_FILT2_CMPHZ_SEL << 8) | (MW_EPWMXBAR0_SD0_FILT3_CEVT1_SEL << 9) | (MW_EPWMXBAR0_SD0_FILT3_CEVT2_SEL << 10) | (MW_EPWMXBAR0_SD0_FILT3_CMPHZ_SEL << 11) | (MW_EPWMXBAR0_SD1_FILT0_CEVT1_SEL << 12) | (MW_EPWMXBAR0_SD1_FILT0_CEVT2_SEL << 13) | (MW_EPWMXBAR0_SD1_FILT0_CMPHZ_SEL << 14) | (MW_EPWMXBAR0_SD1_FILT1_CEVT1_SEL << 15) | (MW_EPWMXBAR0_SD1_FILT1_CEVT2_SEL << 16) | (MW_EPWMXBAR0_SD1_FILT1_CMPHZ_SEL << 17) | (MW_EPWMXBAR0_SD1_FILT2_CEVT1_SEL << 18) | (MW_EPWMXBAR0_SD1_FILT2_CEVT2_SEL << 19) | (MW_EPWMXBAR0_SD1_FILT2_CMPHZ_SEL << 20) | (MW_EPWMXBAR0_SD1_FILT3_CEVT1_SEL << 21) | (MW_EPWMXBAR0_SD1_FILT3_CEVT2_SEL << 22) | (MW_EPWMXBAR0_SD1_FILT3_CMPHZ_SEL << 23);
    group3_epwmxbar[0] = (MW_EPWMXBAR0_ADC0_EVT1_SEL << 0) | (MW_EPWMXBAR0_ADC0_EVT2_SEL << 1) | (MW_EPWMXBAR0_ADC0_EVT3_SEL << 2) | (MW_EPWMXBAR0_ADC0_EVT4_SEL << 3) | (MW_EPWMXBAR0_ADC1_EVT1_SEL << 4) | (MW_EPWMXBAR0_ADC1_EVT2_SEL << 5) | (MW_EPWMXBAR0_ADC1_EVT3_SEL << 6) | (MW_EPWMXBAR0_ADC1_EVT4_SEL << 7) | (MW_EPWMXBAR0_ADC2_EVT1_SEL << 8) | (MW_EPWMXBAR0_ADC2_EVT2_SEL << 9) | (MW_EPWMXBAR0_ADC2_EVT3_SEL << 10) | (MW_EPWMXBAR0_ADC2_EVT4_SEL << 11) | (MW_EPWMXBAR0_ADC3_EVT1_SEL << 12) | (MW_EPWMXBAR0_ADC3_EVT2_SEL << 13) | (MW_EPWMXBAR0_ADC3_EVT3_SEL << 14) | (MW_EPWMXBAR0_ADC3_EVT4_SEL << 15) | (MW_EPWMXBAR0_ADC4_EVT1_SEL << 16) | (MW_EPWMXBAR0_ADC4_EVT2_SEL << 17) | (MW_EPWMXBAR0_ADC4_EVT3_SEL << 18) | (MW_EPWMXBAR0_ADC4_EVT4_SEL << 19);
    // if((MW_EPWMXBAR0_GPIO0_SEL == 1) | (MW_EPWMXBAR0_GPIO1_SEL == 1) | (MW_EPWMXBAR0_GPIO2_SEL == 1) | (MW_EPWMXBAR0_GPIO3_SEL == 1) | (MW_EPWMXBAR0_GPIO4_SEL == 1) | (MW_EPWMXBAR0_GPIO5_SEL == 1) | (MW_EPWMXBAR0_GPIO6_SEL == 1) | (MW_EPWMXBAR0_GPIO7_SEL == 1) | (MW_EPWMXBAR0_GPIO8_SEL == 1) | (MW_EPWMXBAR0_GPIO9_SEL == 1) | (MW_EPWMXBAR0_GPIO10_SEL == 1) | (MW_EPWMXBAR0_GPIO11_SEL == 1) | (MW_EPWMXBAR0_GPIO12_SEL == 1) | (MW_EPWMXBAR0_GPIO13_SEL == 1) | (MW_EPWMXBAR0_GPIO14_SEL == 1) | (MW_EPWMXBAR0_GPIO15_SEL == 1) | (MW_EPWMXBAR0_GPIO16_SEL == 1) | (MW_EPWMXBAR0_GPIO17_SEL == 1) | (MW_EPWMXBAR0_GPIO18_SEL == 1) | (MW_EPWMXBAR0_GPIO19_SEL == 1) | (MW_EPWMXBAR0_GPIO20_SEL == 1) | (MW_EPWMXBAR0_GPIO21_SEL == 1) | (MW_EPWMXBAR0_GPIO22_SEL == 1) | (MW_EPWMXBAR0_GPIO23_SEL == 1) | (MW_EPWMXBAR0_GPIO24_SEL == 1) | (MW_EPWMXBAR0_GPIO25_SEL == 1) | (MW_EPWMXBAR0_GPIO26_SEL == 1) | (MW_EPWMXBAR0_GPIO27_SEL == 1) | (MW_EPWMXBAR0_GPIO28_SEL == 1) | (MW_EPWMXBAR0_GPIO29_SEL == 1) | (MW_EPWMXBAR0_GPIO30_SEL == 1) | (MW_EPWMXBAR0_GPIO31_SEL == 1) | (MW_EPWMXBAR0_GPIO32_SEL == 1) | (MW_EPWMXBAR0_GPIO33_SEL == 1) | (MW_EPWMXBAR0_GPIO34_SEL == 1) | (MW_EPWMXBAR0_GPIO35_SEL == 1) | (MW_EPWMXBAR0_GPIO36_SEL == 1) | (MW_EPWMXBAR0_GPIO37_SEL == 1) | (MW_EPWMXBAR0_GPIO38_SEL == 1) | (MW_EPWMXBAR0_GPIO39_SEL == 1) | (MW_EPWMXBAR0_GPIO40_SEL == 1) | (MW_EPWMXBAR0_GPIO41_SEL == 1) | (MW_EPWMXBAR0_GPIO42_SEL == 1) | (MW_EPWMXBAR0_GPIO43_SEL == 1) | (MW_EPWMXBAR0_GPIO44_SEL == 1) | (MW_EPWMXBAR0_GPIO45_SEL == 1) | (MW_EPWMXBAR0_GPIO46_SEL == 1) | (MW_EPWMXBAR0_GPIO47_SEL == 1)| (MW_EPWMXBAR0_GPIO48_SEL == 1) | (MW_EPWMXBAR0_GPIO49_SEL == 1) | (MW_EPWMXBAR0_GPIO50_SEL == 1) | (MW_EPWMXBAR0_GPIO51_SEL == 1) | (MW_EPWMXBAR0_GPIO52_SEL == 1) | (MW_EPWMXBAR0_GPIO53_SEL == 1) | (MW_EPWMXBAR0_GPIO54_SEL == 1) | (MW_EPWMXBAR0_GPIO55_SEL == 1) | (MW_EPWMXBAR0_GPIO56_SEL == 1) | (MW_EPWMXBAR0_GPIO57_SEL == 1)| (MW_EPWMXBAR0_GPIO58_SEL == 1) | (MW_EPWMXBAR0_GPIO59_SEL == 1) | (MW_EPWMXBAR0_GPIO60_SEL == 1) | (MW_EPWMXBAR0_GPIO61_SEL == 1) | (MW_EPWMXBAR0_GPIO62_SEL == 1) | (MW_EPWMXBAR0_GPIO63_SEL == 1) | (MW_EPWMXBAR0_GPIO64_SEL == 1) | (MW_EPWMXBAR0_GPIO65_SEL == 1) | (MW_EPWMXBAR0_GPIO66_SEL == 1) | (MW_EPWMXBAR0_GPIO67_SEL == 1) | (MW_EPWMXBAR0_GPIO68_SEL == 1) | (MW_EPWMXBAR0_GPIO69_SEL == 1) | (MW_EPWMXBAR0_GPIO70_SEL == 1) | (MW_EPWMXBAR0_GPIO71_SEL == 1) | (MW_EPWMXBAR0_GPIO72_SEL == 1) | (MW_EPWMXBAR0_GPIO73_SEL == 1) | (MW_EPWMXBAR0_GPIO74_SEL == 1) | (MW_EPWMXBAR0_GPIO75_SEL == 1) | (MW_EPWMXBAR0_GPIO76_SEL == 1) | (MW_EPWMXBAR0_GPIO77_SEL == 1) | (MW_EPWMXBAR0_GPIO78_SEL == 1) | (MW_EPWMXBAR0_GPIO79_SEL == 1) | (MW_EPWMXBAR0_GPIO80_SEL == 1) | (MW_EPWMXBAR0_GPIO81_SEL == 1) | (MW_EPWMXBAR0_GPIO82_SEL == 1) | (MW_EPWMXBAR0_GPIO83_SEL == 1) | (MW_EPWMXBAR0_GPIO84_SEL == 1) | (MW_EPWMXBAR0_GPIO85_SEL == 1) | (MW_EPWMXBAR0_GPIO86_SEL == 1) | (MW_EPWMXBAR0_GPIO87_SEL == 1) | (MW_EPWMXBAR0_GPIO88_SEL == 1) | (MW_EPWMXBAR0_GPIO89_SEL == 1) | (MW_EPWMXBAR0_GPIO90_SEL == 1) | (MW_EPWMXBAR0_GPIO91_SEL == 1) | (MW_EPWMXBAR0_GPIO92_SEL == 1) | (MW_EPWMXBAR0_GPIO93_SEL == 1) | (MW_EPWMXBAR0_GPIO94_SEL == 1) | (MW_EPWMXBAR0_GPIO95_SEL == 1) | (MW_EPWMXBAR0_GPIO96_SEL == 1) | (MW_EPWMXBAR0_GPIO97_SEL == 1) | (MW_EPWMXBAR0_GPIO98_SEL == 1) | (MW_EPWMXBAR0_GPIO99_SEL == 1) | (MW_EPWMXBAR0_GPIO100_SEL == 1) | (MW_EPWMXBAR0_GPIO101_SEL == 1) | (MW_EPWMXBAR0_GPIO102_SEL == 1) | (MW_EPWMXBAR0_GPIO103_SEL == 1) | (MW_EPWMXBAR0_GPIO104_SEL == 1) | (MW_EPWMXBAR0_GPIO105_SEL == 1) | (MW_EPWMXBAR0_GPIO106_SEL == 1) | (MW_EPWMXBAR0_GPIO107_SEL == 1) | (MW_EPWMXBAR0_GPIO108_SEL == 1) | (MW_EPWMXBAR0_GPIO109_SEL == 1) | (MW_EPWMXBAR0_GPIO110_SEL == 1) | (MW_EPWMXBAR0_GPIO111_SEL == 1) | (MW_EPWMXBAR0_GPIO112_SEL == 1) | (MW_EPWMXBAR0_GPIO113_SEL == 1) | (MW_EPWMXBAR0_GPIO114_SEL == 1) | (MW_EPWMXBAR0_GPIO115_SEL == 1) | (MW_EPWMXBAR0_GPIO116_SEL == 1) | (MW_EPWMXBAR0_GPIO117_SEL == 1) | (MW_EPWMXBAR0_GPIO118_SEL == 1) | (MW_EPWMXBAR0_GPIO119_SEL == 1) | (MW_EPWMXBAR0_GPIO120_SEL == 1) | (MW_EPWMXBAR0_GPIO121_SEL == 1) | (MW_EPWMXBAR0_GPIO122_SEL == 1) | (MW_EPWMXBAR0_GPIO123_SEL == 1) | (MW_EPWMXBAR0_GPIO124_SEL == 1) | (MW_EPWMXBAR0_GPIO125_SEL == 1) | (MW_EPWMXBAR0_GPIO126_SEL == 1) | (MW_EPWMXBAR0_GPIO127_SEL == 1) | (MW_EPWMXBAR0_GPIO128_SEL == 1) | (MW_EPWMXBAR0_GPIO129_SEL == 1) | (MW_EPWMXBAR0_GPIO130_SEL == 1) | (MW_EPWMXBAR0_GPIO131_SEL == 1) | (MW_EPWMXBAR0_GPIO132_SEL == 1) | (MW_EPWMXBAR0_GPIO133_SEL == 1) | (MW_EPWMXBAR0_GPIO134_SEL == 1) | (MW_EPWMXBAR0_GPIO135_SEL == 1) | (MW_EPWMXBAR0_GPIO136_SEL == 1) | (MW_EPWMXBAR0_GPIO137_SEL == 1) | (MW_EPWMXBAR0_GPIO139_SEL == 1) | (MW_EPWMXBAR0_GPIO140_SEL == 1) | (MW_EPWMXBAR0_GPIO141_SEL == 1) | (MW_EPWMXBAR0_GPIO142_SEL == 1) | (MW_EPWMXBAR0_GPIO143_SEL == 1) | (MW_EPWMXBAR0_ICSSGPO0_PORT0_SEL == 1) | (MW_EPWMXBAR0_ICSSGPO1_PORT0_SEL == 1) | (MW_EPWMXBAR0_ICSSGPO2_PORT0_SEL == 1) | (MW_EPWMXBAR0_ICSSGPO3_PORT0_SEL == 1) | (MW_EPWMXBAR0_ICSSGPO4_PORT0_SEL == 1) | (MW_EPWMXBAR0_ICSSGPO5_PORT0_SEL == 1) | (MW_EPWMXBAR0_ICSSGPO6_PORT0_SEL == 1) | (MW_EPWMXBAR0_ICSSGPO7_PORT0_SEL == 1) | (MW_EPWMXBAR0_ICSSGPO8_PORT0_SEL == 1) | (MW_EPWMXBAR0_ICSSGPO9_PORT0_SEL == 1) | (MW_EPWMXBAR0_ICSSGPO10_PORT0_SEL == 1) | (MW_EPWMXBAR0_ICSSGPO11_PORT0_SEL == 1) | (MW_EPWMXBAR0_ICSSGPO12_PORT0_SEL == 1) | (MW_EPWMXBAR0_ICSSGPO13_PORT0_SEL == 1) | (MW_EPWMXBAR0_ICSSGPO14_PORT0_SEL == 1) | (MW_EPWMXBAR0_ICSSGPO15_PORT0_SEL == 1) | (MW_EPWMXBAR0_ICSSGPO0_PORT1_SEL == 1) | (MW_EPWMXBAR0_ICSSGPO1_PORT1_SEL == 1) | (MW_EPWMXBAR0_ICSSGPO2_PORT1_SEL == 1) | (MW_EPWMXBAR0_ICSSGPO3_PORT1_SEL == 1) | (MW_EPWMXBAR0_ICSSGPO4_PORT1_SEL == 1) | (MW_EPWMXBAR0_ICSSGPO5_PORT1_SEL == 1) | (MW_EPWMXBAR0_ICSSGPO6_PORT1_SEL == 1) | (MW_EPWMXBAR0_ICSSGPO7_PORT1_SEL == 1) | (MW_EPWMXBAR0_ICSSGPO8_PORT1_SEL == 1) | (MW_EPWMXBAR0_ICSSGPO9_PORT1_SEL == 1) | (MW_EPWMXBAR0_ICSSGPO10_PORT1_SEL == 1) | (MW_EPWMXBAR0_ICSSGPO11_PORT1_SEL == 1) | (MW_EPWMXBAR0_ICSSGPO12_PORT1_SEL == 1) | (MW_EPWMXBAR0_ICSSGPO13_PORT1_SEL == 1) | (MW_EPWMXBAR0_ICSSGPO14_PORT1_SEL == 1) | (MW_EPWMXBAR0_ICSSGPO15_PORT1_SEL == 1))
    //     group4_epwmxbar[0] = EPWM_XBAR_1;
    // else
        group4_epwmxbar[0] = 0;
    group5_epwmxbar[0] = (MW_EPWMXBAR0_EPWM0_TRIPOUT_SEL << 0) | (MW_EPWMXBAR0_EPWM1_TRIPOUT_SEL << 1) | (MW_EPWMXBAR0_EPWM2_TRIPOUT_SEL << 2) | (MW_EPWMXBAR0_EPWM3_TRIPOUT_SEL << 3) | (MW_EPWMXBAR0_EPWM4_TRIPOUT_SEL << 4) | (MW_EPWMXBAR0_EPWM5_TRIPOUT_SEL << 5) | (MW_EPWMXBAR0_EPWM6_TRIPOUT_SEL << 6) | (MW_EPWMXBAR0_EPWM7_TRIPOUT_SEL << 7) | (MW_EPWMXBAR0_EPWM8_TRIPOUT_SEL << 8) | (MW_EPWMXBAR0_EPWM9_TRIPOUT_SEL << 9) | (MW_EPWMXBAR0_EPWM10_TRIPOUT_SEL << 10) | (MW_EPWMXBAR0_EPWM11_TRIPOUT_SEL << 11) | (MW_EPWMXBAR0_EPWM12_TRIPOUT_SEL << 12) | (MW_EPWMXBAR0_EPWM13_TRIPOUT_SEL << 13) | (MW_EPWMXBAR0_EPWM14_TRIPOUT_SEL << 14) | (MW_EPWMXBAR0_EPWM15_TRIPOUT_SEL << 15) | (MW_EPWMXBAR0_EPWM16_TRIPOUT_SEL << 16) | (MW_EPWMXBAR0_EPWM17_TRIPOUT_SEL << 17) | (MW_EPWMXBAR0_EPWM18_TRIPOUT_SEL << 18) | (MW_EPWMXBAR0_EPWM19_TRIPOUT_SEL << 19) | (MW_EPWMXBAR0_EPWM20_TRIPOUT_SEL << 20) | (MW_EPWMXBAR0_EPWM21_TRIPOUT_SEL << 21) | (MW_EPWMXBAR0_EPWM22_TRIPOUT_SEL << 22) | (MW_EPWMXBAR0_EPWM23_TRIPOUT_SEL << 23) | (MW_EPWMXBAR0_EPWM24_TRIPOUT_SEL << 24) | (MW_EPWMXBAR0_EPWM25_TRIPOUT_SEL << 25) | (MW_EPWMXBAR0_EPWM26_TRIPOUT_SEL << 26) | (MW_EPWMXBAR0_EPWM27_TRIPOUT_SEL << 27) | (MW_EPWMXBAR0_EPWM28_TRIPOUT_SEL << 28) | (MW_EPWMXBAR0_EPWM29_TRIPOUT_SEL << 29) | (MW_EPWMXBAR0_EPWM30_TRIPOUT_SEL << 30) | (MW_EPWMXBAR0_EPWM31_TRIPOUT_SEL << 31);
    group6_epwmxbar[0] = (MW_EPWMXBAR0_DEL0_TRIP_SEL << 0) | (MW_EPWMXBAR0_DEL1_TRIP_SEL << 1) | (MW_EPWMXBAR0_DEL2_TRIP_SEL << 2) | (MW_EPWMXBAR0_DEL3_TRIP_SEL << 3) | (MW_EPWMXBAR0_DEL4_TRIP_SEL << 4) | (MW_EPWMXBAR0_DEL5_TRIP_SEL << 5) | (MW_EPWMXBAR0_DEL6_TRIP_SEL << 6) | (MW_EPWMXBAR0_DEL7_TRIP_SEL << 7) | (MW_EPWMXBAR0_DEL8_TRIP_SEL << 8) | (MW_EPWMXBAR0_DEL9_TRIP_SEL << 9) | (MW_EPWMXBAR0_DEL10_TRIP_SEL << 10) | (MW_EPWMXBAR0_DEL11_TRIP_SEL << 11) | (MW_EPWMXBAR0_DEL12_TRIP_SEL << 12) | (MW_EPWMXBAR0_DEL13_TRIP_SEL << 13) | (MW_EPWMXBAR0_DEL14_TRIP_SEL << 14) | (MW_EPWMXBAR0_DEL15_TRIP_SEL << 15) | (MW_EPWMXBAR0_DEL16_TRIP_SEL << 16) | (MW_EPWMXBAR0_DEL17_TRIP_SEL << 17) | (MW_EPWMXBAR0_DEL18_TRIP_SEL << 18) | (MW_EPWMXBAR0_DEL19_TRIP_SEL << 19) | (MW_EPWMXBAR0_DEL20_TRIP_SEL << 20) | (MW_EPWMXBAR0_DEL21_TRIP_SEL << 21) | (MW_EPWMXBAR0_DEL22_TRIP_SEL << 22) | (MW_EPWMXBAR0_DEL23_TRIP_SEL << 23) | (MW_EPWMXBAR0_DEL24_TRIP_SEL << 24) | (MW_EPWMXBAR0_DEL25_TRIP_SEL << 25) | (MW_EPWMXBAR0_DEL26_TRIP_SEL << 26) | (MW_EPWMXBAR0_DEL27_TRIP_SEL << 27) | (MW_EPWMXBAR0_DEL28_TRIP_SEL << 28) | (MW_EPWMXBAR0_DEL29_TRIP_SEL << 29) | (MW_EPWMXBAR0_DEL30_TRIP_SEL << 30) | (MW_EPWMXBAR0_DEL31_TRIP_SEL << 31);
    group7_epwmxbar[0] = (MW_EPWMXBAR0_DEL0_ACTIVE_SEL << 0) | (MW_EPWMXBAR0_DEL1_ACTIVE_SEL << 1) | (MW_EPWMXBAR0_DEL2_ACTIVE_SEL << 2) | (MW_EPWMXBAR0_DEL3_ACTIVE_SEL << 3) | (MW_EPWMXBAR0_DEL4_ACTIVE_SEL << 4) | (MW_EPWMXBAR0_DEL5_ACTIVE_SEL << 5) | (MW_EPWMXBAR0_DEL6_ACTIVE_SEL << 6) | (MW_EPWMXBAR0_DEL7_ACTIVE_SEL << 7) | (MW_EPWMXBAR0_DEL8_ACTIVE_SEL << 8) | (MW_EPWMXBAR0_DEL9_ACTIVE_SEL << 9) | (MW_EPWMXBAR0_DEL10_ACTIVE_SEL << 10) | (MW_EPWMXBAR0_DEL11_ACTIVE_SEL << 11) | (MW_EPWMXBAR0_DEL12_ACTIVE_SEL << 12) | (MW_EPWMXBAR0_DEL13_ACTIVE_SEL << 13) | (MW_EPWMXBAR0_DEL14_ACTIVE_SEL << 14) | (MW_EPWMXBAR0_DEL15_ACTIVE_SEL << 15) | (MW_EPWMXBAR0_DEL16_ACTIVE_SEL << 16) | (MW_EPWMXBAR0_DEL17_ACTIVE_SEL << 17) | (MW_EPWMXBAR0_DEL18_ACTIVE_SEL << 18) | (MW_EPWMXBAR0_DEL19_ACTIVE_SEL << 19) | (MW_EPWMXBAR0_DEL20_ACTIVE_SEL << 20) | (MW_EPWMXBAR0_DEL21_ACTIVE_SEL << 21) | (MW_EPWMXBAR0_DEL22_ACTIVE_SEL << 22) | (MW_EPWMXBAR0_DEL23_ACTIVE_SEL << 23) | (MW_EPWMXBAR0_DEL24_ACTIVE_SEL << 24) | (MW_EPWMXBAR0_DEL25_ACTIVE_SEL << 25) | (MW_EPWMXBAR0_DEL26_ACTIVE_SEL << 26) | (MW_EPWMXBAR0_DEL27_ACTIVE_SEL << 27) | (MW_EPWMXBAR0_DEL28_ACTIVE_SEL << 28) | (MW_EPWMXBAR0_DEL29_ACTIVE_SEL << 29) | (MW_EPWMXBAR0_DEL30_ACTIVE_SEL << 30) | (MW_EPWMXBAR0_DEL31_ACTIVE_SEL << 31);
    group8_epwmxbar[0] = (MW_EPWMXBAR0_EQEP0_ERR_SEL << 0) | (MW_EPWMXBAR0_EQEP1_ERR_SEL << 1) | (MW_EPWMXBAR0_EQEP2_ERR_SEL << 2) | (MW_EPWMXBAR0_FSIRX0_RX_TRIG0_SEL << 3) | (MW_EPWMXBAR0_FSIRX0_RX_TRIG1_SEL << 4) | (MW_EPWMXBAR0_FSIRX0_RX_TRIG2_SEL << 5) | (MW_EPWMXBAR0_FSIRX0_RX_TRIG3_SEL << 6) | (MW_EPWMXBAR0_FSIRX1_RX_TRIG0_SEL << 7) | (MW_EPWMXBAR0_FSIRX1_RX_TRIG1_SEL << 8) | (MW_EPWMXBAR0_FSIRX1_RX_TRIG2_SEL << 9) | (MW_EPWMXBAR0_FSIRX1_RX_TRIG3_SEL << 10) | (MW_EPWMXBAR0_FSIRX2_RX_TRIG0_SEL << 11) | (MW_EPWMXBAR0_FSIRX2_RX_TRIG1_SEL << 12) | (MW_EPWMXBAR0_FSIRX2_RX_TRIG2_SEL << 13) | (MW_EPWMXBAR0_FSIRX2_RX_TRIG3_SEL << 14) | (MW_EPWMXBAR0_FSIRX3_RX_TRIG0_SEL << 15) | (MW_EPWMXBAR0_FSIRX3_RX_TRIG1_SEL << 16) | (MW_EPWMXBAR0_FSIRX3_RX_TRIG2_SEL << 17) | (MW_EPWMXBAR0_FSIRX3_RX_TRIG3_SEL << 18) | (MW_EPWMXBAR0_ECAP0_TRIPOUT_SEL << 19) | (MW_EPWMXBAR0_ECAP1_TRIPOUT_SEL << 20) | (MW_EPWMXBAR0_ECAP2_TRIPOUT_SEL << 21) | (MW_EPWMXBAR0_ECAP3_TRIPOUT_SEL << 22) | (MW_EPWMXBAR0_ECAP4_TRIPOUT_SEL << 23) | (MW_EPWMXBAR0_ECAP5_TRIPOUT_SEL << 24) | (MW_EPWMXBAR0_ECAP6_TRIPOUT_SEL << 25) | (MW_EPWMXBAR0_ECAP7_TRIPOUT_SEL << 26) | (MW_EPWMXBAR0_ECAP8_TRIPOUT_SEL << 27) | (MW_EPWMXBAR0_ECAP9_TRIPOUT_SEL << 28);
    group0_epwmxbar[1] = (MW_EPWMXBAR1_CMPSSA0_CTRIPL_SEL << 0) | (MW_EPWMXBAR1_CMPSSA0_CTRIPH_SEL << 1) | (MW_EPWMXBAR1_CMPSSA1_CTRIPL_SEL << 2) | (MW_EPWMXBAR1_CMPSSA1_CTRIPH_SEL << 3) | (MW_EPWMXBAR1_CMPSSA2_CTRIPL_SEL << 4) | (MW_EPWMXBAR1_CMPSSA2_CTRIPH_SEL << 5) | (MW_EPWMXBAR1_CMPSSA3_CTRIPL_SEL << 6) | (MW_EPWMXBAR1_CMPSSA3_CTRIPH_SEL << 7) | (MW_EPWMXBAR1_CMPSSA4_CTRIPL_SEL << 8) | (MW_EPWMXBAR1_CMPSSA4_CTRIPH_SEL << 9) | (MW_EPWMXBAR1_CMPSSA5_CTRIPL_SEL << 10) | (MW_EPWMXBAR1_CMPSSA5_CTRIPH_SEL << 11) | (MW_EPWMXBAR1_CMPSSA6_CTRIPL_SEL << 12) | (MW_EPWMXBAR1_CMPSSA6_CTRIPH_SEL << 13) | (MW_EPWMXBAR1_CMPSSA7_CTRIPL_SEL << 14) | (MW_EPWMXBAR1_CMPSSA7_CTRIPH_SEL << 15) | (MW_EPWMXBAR1_CMPSSA8_CTRIPL_SEL << 16) | (MW_EPWMXBAR1_CMPSSA8_CTRIPH_SEL << 17) | (MW_EPWMXBAR1_CMPSSA9_CTRIPL_SEL << 18) | (MW_EPWMXBAR1_CMPSSA9_CTRIPH_SEL << 19);
    group1_epwmxbar[1] = (MW_EPWMXBAR1_CMPSSB0_CTRIPL_SEL << 0) | (MW_EPWMXBAR1_CMPSSB0_CTRIPH_SEL << 1) | (MW_EPWMXBAR1_CMPSSB1_CTRIPL_SEL << 2) | (MW_EPWMXBAR1_CMPSSB1_CTRIPH_SEL << 3) | (MW_EPWMXBAR1_CMPSSB2_CTRIPL_SEL << 4) | (MW_EPWMXBAR1_CMPSSB2_CTRIPH_SEL << 5) | (MW_EPWMXBAR1_CMPSSB3_CTRIPL_SEL << 6) | (MW_EPWMXBAR1_CMPSSB3_CTRIPH_SEL << 7) | (MW_EPWMXBAR1_CMPSSB4_CTRIPL_SEL << 8) | (MW_EPWMXBAR1_CMPSSB4_CTRIPH_SEL << 9) | (MW_EPWMXBAR1_CMPSSB5_CTRIPL_SEL << 10) | (MW_EPWMXBAR1_CMPSSB5_CTRIPH_SEL << 11) | (MW_EPWMXBAR1_CMPSSB6_CTRIPL_SEL << 12) | (MW_EPWMXBAR1_CMPSSB6_CTRIPH_SEL << 13) | (MW_EPWMXBAR1_CMPSSB7_CTRIPL_SEL << 14) | (MW_EPWMXBAR1_CMPSSB7_CTRIPH_SEL << 15) | (MW_EPWMXBAR1_CMPSSB8_CTRIPL_SEL << 16) | (MW_EPWMXBAR1_CMPSSB8_CTRIPH_SEL << 17) | (MW_EPWMXBAR1_CMPSSB9_CTRIPL_SEL << 18) | (MW_EPWMXBAR1_CMPSSB9_CTRIPH_SEL << 19);
    group2_epwmxbar[1] = (MW_EPWMXBAR1_SD0_FILT0_CEVT1_SEL << 0) | (MW_EPWMXBAR1_SD0_FILT0_CEVT2_SEL << 1) | (MW_EPWMXBAR1_SD0_FILT0_CMPHZ_SEL << 2) | (MW_EPWMXBAR1_SD0_FILT1_CEVT1_SEL << 3) | (MW_EPWMXBAR1_SD0_FILT1_CEVT2_SEL << 4) | (MW_EPWMXBAR1_SD0_FILT1_CMPHZ_SEL << 5) | (MW_EPWMXBAR1_SD0_FILT2_CEVT1_SEL << 6) | (MW_EPWMXBAR1_SD0_FILT2_CEVT2_SEL << 7) | (MW_EPWMXBAR1_SD0_FILT2_CMPHZ_SEL << 8) | (MW_EPWMXBAR1_SD0_FILT3_CEVT1_SEL << 9) | (MW_EPWMXBAR1_SD0_FILT3_CEVT2_SEL << 10) | (MW_EPWMXBAR1_SD0_FILT3_CMPHZ_SEL << 11) | (MW_EPWMXBAR1_SD1_FILT0_CEVT1_SEL << 12) | (MW_EPWMXBAR1_SD1_FILT0_CEVT2_SEL << 13) | (MW_EPWMXBAR1_SD1_FILT0_CMPHZ_SEL << 14) | (MW_EPWMXBAR1_SD1_FILT1_CEVT1_SEL << 15) | (MW_EPWMXBAR1_SD1_FILT1_CEVT2_SEL << 16) | (MW_EPWMXBAR1_SD1_FILT1_CMPHZ_SEL << 17) | (MW_EPWMXBAR1_SD1_FILT2_CEVT1_SEL << 18) | (MW_EPWMXBAR1_SD1_FILT2_CEVT2_SEL << 19) | (MW_EPWMXBAR1_SD1_FILT2_CMPHZ_SEL << 20) | (MW_EPWMXBAR1_SD1_FILT3_CEVT1_SEL << 21) | (MW_EPWMXBAR1_SD1_FILT3_CEVT2_SEL << 22) | (MW_EPWMXBAR1_SD1_FILT3_CMPHZ_SEL << 23);
    group3_epwmxbar[1] = (MW_EPWMXBAR1_ADC0_EVT1_SEL << 0) | (MW_EPWMXBAR1_ADC0_EVT2_SEL << 1) | (MW_EPWMXBAR1_ADC0_EVT3_SEL << 2) | (MW_EPWMXBAR1_ADC0_EVT4_SEL << 3) | (MW_EPWMXBAR1_ADC1_EVT1_SEL << 4) | (MW_EPWMXBAR1_ADC1_EVT2_SEL << 5) | (MW_EPWMXBAR1_ADC1_EVT3_SEL << 6) | (MW_EPWMXBAR1_ADC1_EVT4_SEL << 7) | (MW_EPWMXBAR1_ADC2_EVT1_SEL << 8) | (MW_EPWMXBAR1_ADC2_EVT2_SEL << 9) | (MW_EPWMXBAR1_ADC2_EVT3_SEL << 10) | (MW_EPWMXBAR1_ADC2_EVT4_SEL << 11) | (MW_EPWMXBAR1_ADC3_EVT1_SEL << 12) | (MW_EPWMXBAR1_ADC3_EVT2_SEL << 13) | (MW_EPWMXBAR1_ADC3_EVT3_SEL << 14) | (MW_EPWMXBAR1_ADC3_EVT4_SEL << 15) | (MW_EPWMXBAR1_ADC4_EVT1_SEL << 16) | (MW_EPWMXBAR1_ADC4_EVT2_SEL << 17) | (MW_EPWMXBAR1_ADC4_EVT3_SEL << 18) | (MW_EPWMXBAR1_ADC4_EVT4_SEL << 19);
