TexasInstruments/am26x-hsp/src/am263px_init.c
    // if(MW_EPWMXBAR1_GPIO0_SEL == 1 | MW_EPWMXBAR1_GPIO1_SEL == 1 | MW_EPWMXBAR1_GPIO2_SEL == 1 | MW_EPWMXBAR1_GPIO3_SEL == 1 | MW_EPWMXBAR1_GPIO4_SEL == 1 | MW_EPWMXBAR1_GPIO5_SEL == 1 | MW_EPWMXBAR1_GPIO6_SEL == 1 | MW_EPWMXBAR1_GPIO7_SEL == 1| MW_EPWMXBAR1_GPIO8_SEL == 1 | MW_EPWMXBAR1_GPIO9_SEL == 1 | MW_EPWMXBAR1_GPIO10_SEL == 1| MW_EPWMXBAR1_GPIO11_SEL == 1| MW_EPWMXBAR1_GPIO12_SEL == 1 | MW_EPWMXBAR1_GPIO13_SEL == 1 | MW_EPWMXBAR1_GPIO14_SEL == 1 | MW_EPWMXBAR1_GPIO15_SEL == 1 | MW_EPWMXBAR1_GPIO16_SEL == 1 | MW_EPWMXBAR1_GPIO17_SEL == 1 | MW_EPWMXBAR1_GPIO18_SEL == 1 | MW_EPWMXBAR1_GPIO19_SEL == 1 | MW_EPWMXBAR1_GPIO20_SEL == 1 | MW_EPWMXBAR1_GPIO21_SEL == 1 | MW_EPWMXBAR1_GPIO22_SEL == 1 | MW_EPWMXBAR1_GPIO23_SEL == 1 | MW_EPWMXBAR1_GPIO24_SEL == 1 | MW_EPWMXBAR1_GPIO25_SEL == 1 | MW_EPWMXBAR1_GPIO26_SEL == 1 | MW_EPWMXBAR1_GPIO27_SEL == 1 | MW_EPWMXBAR1_GPIO28_SEL == 1 | MW_EPWMXBAR1_GPIO29_SEL == 1 | MW_EPWMXBAR1_GPIO30_SEL == 1 | MW_EPWMXBAR1_GPIO31_SEL == 1 | MW_EPWMXBAR1_GPIO32_SEL == 1 | MW_EPWMXBAR1_GPIO33_SEL == 1 | MW_EPWMXBAR1_GPIO34_SEL == 1 | MW_EPWMXBAR1_GPIO35_SEL == 1 | MW_EPWMXBAR1_GPIO36_SEL == 1 | MW_EPWMXBAR1_GPIO37_SEL == 1 | MW_EPWMXBAR1_GPIO38_SEL == 1 | MW_EPWMXBAR1_GPIO39_SEL == 1 | MW_EPWMXBAR1_GPIO40_SEL == 1 | MW_EPWMXBAR1_GPIO41_SEL == 1 | MW_EPWMXBAR1_GPIO42_SEL == 1 | MW_EPWMXBAR1_GPIO43_SEL == 1 | MW_EPWMXBAR1_GPIO44_SEL == 1 | | MW_EPWMXBAR1_GPIO45_SEL == 1 | MW_EPWMXBAR1_GPIO46_SEL == 1 | MW_EPWMXBAR1_GPIO47_SEL == 1| MW_EPWMXBAR1_GPIO48_SEL == 1 | MW_EPWMXBAR1_GPIO49_SEL == 1 | MW_EPWMXBAR1_GPIO50_SEL == 1 | MW_EPWMXBAR1_GPIO51_SEL == 1 | MW_EPWMXBAR1_GPIO52_SEL == 1 | MW_EPWMXBAR1_GPIO53_SEL == 1 | MW_EPWMXBAR1_GPIO54_SEL == 1 | MW_EPWMXBAR1_GPIO55_SEL == 1 | MW_EPWMXBAR1_GPIO56_SEL == 1 | MW_EPWMXBAR1_GPIO57_SEL == 1| MW_EPWMXBAR1_GPIO58_SEL == 1 | MW_EPWMXBAR1_GPIO59_SEL == 1 | MW_EPWMXBAR1_GPIO60_SEL == 1 | MW_EPWMXBAR1_GPIO61_SEL == 1 | MW_EPWMXBAR1_GPIO62_SEL == 1 | MW_EPWMXBAR1_GPIO63_SEL == 1 | MW_EPWMXBAR1_GPIO64_SEL == 1 | | MW_EPWMXBAR1_GPIO59_SEL == 1 | MW_EPWMXBAR1_GPIO60_SEL == 1 | MW_EPWMXBAR1_GPIO61_SEL == 1 | MW_EPWMXBAR1_GPIO62_SEL == 1 | MW_EPWMXBAR1_GPIO63_SEL == 1 | MW_EPWMXBAR1_GPIO64_SEL == 1 | MW_EPWMXBAR1_GPIO65_SEL == 1 | MW_EPWMXBAR1_GPIO66_SEL == 1 | MW_EPWMXBAR1_GPIO67_SEL == 1 | MW_EPWMXBAR1_GPIO68_SEL == 1 | MW_EPWMXBAR1_GPIO69_SEL == 1 | MW_EPWMXBAR1_GPIO70_SEL == 1 | MW_EPWMXBAR1_GPIO71_SEL == 1 | MW_EPWMXBAR1_GPIO72_SEL == 1 | MW_EPWMXBAR1_GPIO73_SEL == 1 | MW_EPWMXBAR1_GPIO74_SEL == 1 | MW_EPWMXBAR1_GPIO75_SEL == 1 | MW_EPWMXBAR1_GPIO76_SEL == 1 | MW_EPWMXBAR1_GPIO77_SEL == 1 | MW_EPWMXBAR1_GPIO78_SEL == 1 | | MW_EPWMXBAR1_GPIO80_SEL == 1 | MW_EPWMXBAR1_GPIO81_SEL == 1 | MW_EPWMXBAR1_GPIO82_SEL == 1 | MW_EPWMXBAR1_GPIO83_SEL == 1 | MW_EPWMXBAR1_GPIO84_SEL == 1 | MW_EPWMXBAR1_GPIO85_SEL == 1 | MW_EPWMXBAR1_GPIO86_SEL == 1 | MW_EPWMXBAR1_GPIO87_SEL == 1 | MW_EPWMXBAR1_GPIO88_SEL == 1 | MW_EPWMXBAR1_GPIO89_SEL == 1 | MW_EPWMXBAR1_GPIO90_SEL == 1 | MW_EPWMXBAR1_GPIO91_SEL == 1 | MW_EPWMXBAR1_GPIO92_SEL == 1 | MW_EPWMXBAR1_GPIO93_SEL == 1 | MW_EPWMXBAR1_GPIO94_SEL == 1 | MW_EPWMXBAR1_GPIO95_SEL == 1 | MW_EPWMXBAR1_GPIO96_SEL == 1 | MW_EPWMXBAR1_GPIO97_SEL == 1 | MW_EPWMXBAR1_GPIO98_SEL == 1 | MW_EPWMXBAR1_GPIO99_SEL == 1 | MW_EPWMXBAR1_GPIO100_SEL == 1 | MW_EPWMXBAR1_GPIO101_SEL == 1 | MW_EPWMXBAR1_GPIO102_SEL == 1 | MW_EPWMXBAR1_GPIO103_SEL == 1 | MW_EPWMXBAR1_GPIO104_SEL == 1 | MW_EPWMXBAR1_GPIO105_SEL == 1 | MW_EPWMXBAR1_GPIO106_SEL == 1 | MW_EPWMXBAR1_GPIO107_SEL == 1 | | MW_EPWMXBAR1_GPIO108_SEL == 1 | MW_EPWMXBAR1_GPIO109_SEL == 1| MW_EPWMXBAR1_GPIO110_SEL == 1 | MW_EPWMXBAR1_GPIO111_SEL == 1 | MW_EPWMXBAR1_GPIO112_SEL == 1 | MW_EPWMXBAR1_GPIO113_SEL == 1 | MW_EPWMXBAR1_GPIO114_SEL == 1 | MW_EPWMXBAR1_GPIO115_SEL == 1 | MW_EPWMXBAR1_GPIO116_SEL == 1 | MW_EPWMXBAR1_GPIO117_SEL == 1 | MW_EPWMXBAR1_GPIO118_SEL == 1 | MW_EPWMXBAR1_GPIO119_SEL == 1 | MW_EPWMXBAR1_GPIO120_SEL == 1 | MW_EPWMXBAR1_GPIO121_SEL == 1 | MW_EPWMXBAR1_GPIO122_SEL == 1 | MW_EPWMXBAR1_GPIO123_SEL == 1 | MW_EPWMXBAR1_GPIO124_SEL == 1 | MW_EPWMXBAR1_GPIO125_SEL == 1 | MW_EPWMXBAR1_GPIO126_SEL == 1 | MW_EPWMXBAR1_GPIO127_SEL == 1 | MW_EPWMXBAR1_GPIO128_SEL == 1 | MW_EPWMXBAR1_GPIO129_SEL == 1 | MW_EPWMXBAR1_GPIO130_SEL == 1 | MW_EPWMXBAR1_GPIO131_SEL == 1 | MW_EPWMXBAR1_GPIO132_SEL == 1 | MW_EPWMXBAR1_GPIO133_SEL == 1 | MW_EPWMXBAR1_GPIO134_SEL == 1 | MW_EPWMXBAR1_GPIO135_SEL == 1 | MW_EPWMXBAR1_GPIO136_SEL == 1 | MW_EPWMXBAR1_GPIO137_SEL == 1 | MW_EPWMXBAR1_GPIO139_SEL == 1 | MW_EPWMXBAR1_GPIO140_SEL == 1 | MW_EPWMXBAR1_GPIO141_SEL == 1 | MW_EPWMXBAR1_GPIO142_SEL == 1 | MW_EPWMXBAR1_GPIO143_SEL == 1 | MW_EPWMXBAR1_ICSSGPO0_PORT0_SEL == 1 | MW_EPWMXBAR1_ICSSGPO1_PORT0_SEL == 1 | MW_EPWMXBAR1_ICSSGPO2_PORT0_SEL == 1 | MW_EPWMXBAR1_ICSSGPO3_PORT0_SEL == 1 | MW_EPWMXBAR1_ICSSGPO4_PORT0_SEL == 1 | MW_EPWMXBAR1_ICSSGPO5_PORT0_SEL == 1 | MW_EPWMXBAR1_ICSSGPO6_PORT0_SEL == 1 | MW_EPWMXBAR1_ICSSGPO7_PORT0_SEL == 1 | MW_EPWMXBAR1_ICSSGPO8_PORT0_SEL == 1 | MW_EPWMXBAR1_ICSSGPO9_PORT0_SEL == 1 | MW_EPWMXBAR1_ICSSGPO10_PORT0_SEL == 1 | MW_EPWMXBAR1_ICSSGPO11_PORT0_SEL == 1 | MW_EPWMXBAR1_ICSSGPO12_PORT0_SEL == 1 | MW_EPWMXBAR1_ICSSGPO13_PORT0_SEL == 1 | MW_EPWMXBAR1_ICSSGPO14_PORT0_SEL == 1 | MW_EPWMXBAR1_ICSSGPO15_PORT0_SEL == 1 | MW_EPWMXBAR1_ICSSGPO0_PORT1_SEL == 1 | MW_EPWMXBAR1_ICSSGPO1_PORT1_SEL == 1 | MW_EPWMXBAR1_ICSSGPO2_PORT1_SEL == 1 | MW_EPWMXBAR1_ICSSGPO3_PORT1_SEL == 1 | MW_EPWMXBAR1_ICSSGPO4_PORT1_SEL == 1 | MW_EPWMXBAR1_ICSSGPO5_PORT1_SEL == 1 | MW_EPWMXBAR1_ICSSGPO6_PORT1_SEL == 1 | MW_EPWMXBAR1_ICSSGPO7_PORT1_SEL == 1 | MW_EPWMXBAR1_ICSSGPO8_PORT1_SEL == 1 | MW_EPWMXBAR1_ICSSGPO9_PORT1_SEL == 1 | MW_EPWMXBAR1_ICSSGPO10_PORT1_SEL == 1 | MW_EPWMXBAR1_ICSSGPO11_PORT1_SEL == 1 | MW_EPWMXBAR1_ICSSGPO12_PORT1_SEL == 1 | MW_EPWMXBAR1_ICSSGPO13_PORT1_SEL == 1 | MW_EPWMXBAR1_ICSSGPO14_PORT1_SEL == 1 | MW_EPWMXBAR1_ICSSGPO15_PORT1_SEL == 1)
    //     group4_epwmxbar[1] = EPWM_XBAR_1;
    // else
        group4_epwmxbar[1] = 0;
    group5_epwmxbar[1] = (MW_EPWMXBAR1_EPWM0_TRIPOUT_SEL << 0) | (MW_EPWMXBAR1_EPWM1_TRIPOUT_SEL << 1) | (MW_EPWMXBAR1_EPWM2_TRIPOUT_SEL << 2) | (MW_EPWMXBAR1_EPWM3_TRIPOUT_SEL << 3) | (MW_EPWMXBAR1_EPWM4_TRIPOUT_SEL << 4) | (MW_EPWMXBAR1_EPWM5_TRIPOUT_SEL << 5) | (MW_EPWMXBAR1_EPWM6_TRIPOUT_SEL << 6) | (MW_EPWMXBAR1_EPWM7_TRIPOUT_SEL << 7) | (MW_EPWMXBAR1_EPWM8_TRIPOUT_SEL << 8) | (MW_EPWMXBAR1_EPWM9_TRIPOUT_SEL << 9) | (MW_EPWMXBAR1_EPWM10_TRIPOUT_SEL << 10) | (MW_EPWMXBAR1_EPWM11_TRIPOUT_SEL << 11) | (MW_EPWMXBAR1_EPWM12_TRIPOUT_SEL << 12) | (MW_EPWMXBAR1_EPWM13_TRIPOUT_SEL << 13) | (MW_EPWMXBAR1_EPWM14_TRIPOUT_SEL << 14) | (MW_EPWMXBAR1_EPWM15_TRIPOUT_SEL << 15) | (MW_EPWMXBAR1_EPWM16_TRIPOUT_SEL << 16) | (MW_EPWMXBAR1_EPWM17_TRIPOUT_SEL << 17) | (MW_EPWMXBAR1_EPWM18_TRIPOUT_SEL << 18) | (MW_EPWMXBAR1_EPWM19_TRIPOUT_SEL << 19) | (MW_EPWMXBAR1_EPWM20_TRIPOUT_SEL << 20) | (MW_EPWMXBAR1_EPWM21_TRIPOUT_SEL << 21) | (MW_EPWMXBAR1_EPWM22_TRIPOUT_SEL << 22) | (MW_EPWMXBAR1_EPWM23_TRIPOUT_SEL << 23) | (MW_EPWMXBAR1_EPWM24_TRIPOUT_SEL << 24) | (MW_EPWMXBAR1_EPWM25_TRIPOUT_SEL << 25) | (MW_EPWMXBAR1_EPWM26_TRIPOUT_SEL << 26) | (MW_EPWMXBAR1_EPWM27_TRIPOUT_SEL << 27) | (MW_EPWMXBAR1_EPWM28_TRIPOUT_SEL << 28) | (MW_EPWMXBAR1_EPWM29_TRIPOUT_SEL << 29) | (MW_EPWMXBAR1_EPWM30_TRIPOUT_SEL << 30) | (MW_EPWMXBAR1_EPWM31_TRIPOUT_SEL << 31);
    group6_epwmxbar[1] = (MW_EPWMXBAR1_DEL0_TRIP_SEL << 0) | (MW_EPWMXBAR1_DEL1_TRIP_SEL << 1) | (MW_EPWMXBAR1_DEL2_TRIP_SEL << 2) | (MW_EPWMXBAR1_DEL3_TRIP_SEL << 3) | (MW_EPWMXBAR1_DEL4_TRIP_SEL << 4) | (MW_EPWMXBAR1_DEL5_TRIP_SEL << 5) | (MW_EPWMXBAR1_DEL6_TRIP_SEL << 6) | (MW_EPWMXBAR1_DEL7_TRIP_SEL << 7) | (MW_EPWMXBAR1_DEL8_TRIP_SEL << 8) | (MW_EPWMXBAR1_DEL9_TRIP_SEL << 9) | (MW_EPWMXBAR1_DEL10_TRIP_SEL << 10) | (MW_EPWMXBAR1_DEL11_TRIP_SEL << 11) | (MW_EPWMXBAR1_DEL12_TRIP_SEL << 12) | (MW_EPWMXBAR1_DEL13_TRIP_SEL << 13) | (MW_EPWMXBAR1_DEL14_TRIP_SEL << 14) | (MW_EPWMXBAR1_DEL15_TRIP_SEL << 15) | (MW_EPWMXBAR1_DEL16_TRIP_SEL << 16) | (MW_EPWMXBAR1_DEL17_TRIP_SEL << 17) | (MW_EPWMXBAR1_DEL18_TRIP_SEL << 18) | (MW_EPWMXBAR1_DEL19_TRIP_SEL << 19) | (MW_EPWMXBAR1_DEL20_TRIP_SEL << 20) | (MW_EPWMXBAR1_DEL21_TRIP_SEL << 21) | (MW_EPWMXBAR1_DEL22_TRIP_SEL << 22) | (MW_EPWMXBAR1_DEL23_TRIP_SEL << 23) | (MW_EPWMXBAR1_DEL24_TRIP_SEL << 24) | (MW_EPWMXBAR1_DEL25_TRIP_SEL << 25) | (MW_EPWMXBAR1_DEL26_TRIP_SEL << 26) | (MW_EPWMXBAR1_DEL27_TRIP_SEL << 27) | (MW_EPWMXBAR1_DEL28_TRIP_SEL << 28) | (MW_EPWMXBAR1_DEL29_TRIP_SEL << 29) | (MW_EPWMXBAR1_DEL30_TRIP_SEL << 30) | (MW_EPWMXBAR1_DEL31_TRIP_SEL << 31);
    group7_epwmxbar[1] = (MW_EPWMXBAR1_DEL0_ACTIVE_SEL << 0) | (MW_EPWMXBAR1_DEL1_ACTIVE_SEL << 1) | (MW_EPWMXBAR1_DEL2_ACTIVE_SEL << 2) | (MW_EPWMXBAR1_DEL3_ACTIVE_SEL << 3) | (MW_EPWMXBAR1_DEL4_ACTIVE_SEL << 4) | (MW_EPWMXBAR1_DEL5_ACTIVE_SEL << 5) | (MW_EPWMXBAR1_DEL6_ACTIVE_SEL << 6) | (MW_EPWMXBAR1_DEL7_ACTIVE_SEL << 7) | (MW_EPWMXBAR1_DEL8_ACTIVE_SEL << 8) | (MW_EPWMXBAR1_DEL9_ACTIVE_SEL << 9) | (MW_EPWMXBAR1_DEL10_ACTIVE_SEL << 10) | (MW_EPWMXBAR1_DEL11_ACTIVE_SEL << 11) | (MW_EPWMXBAR1_DEL12_ACTIVE_SEL << 12) | (MW_EPWMXBAR1_DEL13_ACTIVE_SEL << 13) | (MW_EPWMXBAR1_DEL14_ACTIVE_SEL << 14) | (MW_EPWMXBAR1_DEL15_ACTIVE_SEL << 15) | (MW_EPWMXBAR1_DEL16_ACTIVE_SEL << 16) | (MW_EPWMXBAR1_DEL17_ACTIVE_SEL << 17) | (MW_EPWMXBAR1_DEL18_ACTIVE_SEL << 18) | (MW_EPWMXBAR1_DEL19_ACTIVE_SEL << 19) | (MW_EPWMXBAR1_DEL20_ACTIVE_SEL << 20) | (MW_EPWMXBAR1_DEL21_ACTIVE_SEL << 21) | (MW_EPWMXBAR1_DEL22_ACTIVE_SEL << 22) | (MW_EPWMXBAR1_DEL23_ACTIVE_SEL << 23) | (MW_EPWMXBAR1_DEL24_ACTIVE_SEL << 24) | (MW_EPWMXBAR1_DEL25_ACTIVE_SEL << 25) | (MW_EPWMXBAR1_DEL26_ACTIVE_SEL << 26) | (MW_EPWMXBAR1_DEL27_ACTIVE_SEL << 27) | (MW_EPWMXBAR1_DEL28_ACTIVE_SEL << 28) | (MW_EPWMXBAR1_DEL29_ACTIVE_SEL << 29) | (MW_EPWMXBAR1_DEL30_ACTIVE_SEL << 30) | (MW_EPWMXBAR1_DEL31_ACTIVE_SEL << 31);
    group8_epwmxbar[1] = (MW_EPWMXBAR1_EQEP0_ERR_SEL << 0) | (MW_EPWMXBAR1_EQEP1_ERR_SEL << 1) | (MW_EPWMXBAR1_EQEP2_ERR_SEL << 2) | (MW_EPWMXBAR1_FSIRX0_RX_TRIG0_SEL << 3) | (MW_EPWMXBAR1_FSIRX0_RX_TRIG1_SEL << 4) | (MW_EPWMXBAR1_FSIRX0_RX_TRIG2_SEL << 5) | (MW_EPWMXBAR1_FSIRX0_RX_TRIG3_SEL << 6) | (MW_EPWMXBAR1_FSIRX1_RX_TRIG0_SEL << 7) | (MW_EPWMXBAR1_FSIRX1_RX_TRIG1_SEL << 8) | (MW_EPWMXBAR1_FSIRX1_RX_TRIG2_SEL << 9) | (MW_EPWMXBAR1_FSIRX1_RX_TRIG3_SEL << 10) | (MW_EPWMXBAR1_FSIRX2_RX_TRIG0_SEL << 11) | (MW_EPWMXBAR1_FSIRX2_RX_TRIG1_SEL << 12) | (MW_EPWMXBAR1_FSIRX2_RX_TRIG2_SEL << 13) | (MW_EPWMXBAR1_FSIRX2_RX_TRIG3_SEL << 14) | (MW_EPWMXBAR1_FSIRX3_RX_TRIG0_SEL << 15) | (MW_EPWMXBAR1_FSIRX3_RX_TRIG1_SEL << 16) | (MW_EPWMXBAR1_FSIRX3_RX_TRIG2_SEL << 17) | (MW_EPWMXBAR1_FSIRX3_RX_TRIG3_SEL << 18) | (MW_EPWMXBAR1_ECAP0_TRIPOUT_SEL << 19) | (MW_EPWMXBAR1_ECAP1_TRIPOUT_SEL << 20) | (MW_EPWMXBAR1_ECAP2_TRIPOUT_SEL << 21) | (MW_EPWMXBAR1_ECAP3_TRIPOUT_SEL << 22) | (MW_EPWMXBAR1_ECAP4_TRIPOUT_SEL << 23) | (MW_EPWMXBAR1_ECAP5_TRIPOUT_SEL << 24) | (MW_EPWMXBAR1_ECAP6_TRIPOUT_SEL << 25) | (MW_EPWMXBAR1_ECAP7_TRIPOUT_SEL << 26) | (MW_EPWMXBAR1_ECAP8_TRIPOUT_SEL << 27) | (MW_EPWMXBAR1_ECAP9_TRIPOUT_SEL << 28);
    group0_epwmxbar[2] = (MW_EPWMXBAR2_CMPSSA0_CTRIPL_SEL << 0) | (MW_EPWMXBAR2_CMPSSA0_CTRIPH_SEL << 1) | (MW_EPWMXBAR2_CMPSSA1_CTRIPL_SEL << 2) | (MW_EPWMXBAR2_CMPSSA1_CTRIPH_SEL << 3) | (MW_EPWMXBAR2_CMPSSA2_CTRIPL_SEL << 4) | (MW_EPWMXBAR2_CMPSSA2_CTRIPH_SEL << 5) | (MW_EPWMXBAR2_CMPSSA3_CTRIPL_SEL << 6) | (MW_EPWMXBAR2_CMPSSA3_CTRIPH_SEL << 7) | (MW_EPWMXBAR2_CMPSSA4_CTRIPL_SEL << 8) | (MW_EPWMXBAR2_CMPSSA4_CTRIPH_SEL << 9) | (MW_EPWMXBAR2_CMPSSA5_CTRIPL_SEL << 10) | (MW_EPWMXBAR2_CMPSSA5_CTRIPH_SEL << 11) | (MW_EPWMXBAR2_CMPSSA6_CTRIPL_SEL << 12) | (MW_EPWMXBAR2_CMPSSA6_CTRIPH_SEL << 13) | (MW_EPWMXBAR2_CMPSSA7_CTRIPL_SEL << 14) | (MW_EPWMXBAR2_CMPSSA7_CTRIPH_SEL << 15) | (MW_EPWMXBAR2_CMPSSA8_CTRIPL_SEL << 16) | (MW_EPWMXBAR2_CMPSSA8_CTRIPH_SEL << 17) | (MW_EPWMXBAR2_CMPSSA9_CTRIPL_SEL << 18) | (MW_EPWMXBAR2_CMPSSA9_CTRIPH_SEL << 19);
    group1_epwmxbar[2] = (MW_EPWMXBAR2_CMPSSB0_CTRIPL_SEL << 0) | (MW_EPWMXBAR2_CMPSSB0_CTRIPH_SEL << 1) | (MW_EPWMXBAR2_CMPSSB1_CTRIPL_SEL << 2) | (MW_EPWMXBAR2_CMPSSB1_CTRIPH_SEL << 3) | (MW_EPWMXBAR2_CMPSSB2_CTRIPL_SEL << 4) | (MW_EPWMXBAR2_CMPSSB2_CTRIPH_SEL << 5) | (MW_EPWMXBAR2_CMPSSB3_CTRIPL_SEL << 6) | (MW_EPWMXBAR2_CMPSSB3_CTRIPH_SEL << 7) | (MW_EPWMXBAR2_CMPSSB4_CTRIPL_SEL << 8) | (MW_EPWMXBAR2_CMPSSB4_CTRIPH_SEL << 9) | (MW_EPWMXBAR2_CMPSSB5_CTRIPL_SEL << 10) | (MW_EPWMXBAR2_CMPSSB5_CTRIPH_SEL << 11) | (MW_EPWMXBAR2_CMPSSB6_CTRIPL_SEL << 12) | (MW_EPWMXBAR2_CMPSSB6_CTRIPH_SEL << 13) | (MW_EPWMXBAR2_CMPSSB7_CTRIPL_SEL << 14) | (MW_EPWMXBAR2_CMPSSB7_CTRIPH_SEL << 15) | (MW_EPWMXBAR2_CMPSSB8_CTRIPL_SEL << 16) | (MW_EPWMXBAR2_CMPSSB8_CTRIPH_SEL << 17) | (MW_EPWMXBAR2_CMPSSB9_CTRIPL_SEL << 18) | (MW_EPWMXBAR2_CMPSSB9_CTRIPH_SEL << 19);
    group2_epwmxbar[2] = (MW_EPWMXBAR2_SD0_FILT0_CEVT1_SEL << 0) | (MW_EPWMXBAR2_SD0_FILT0_CEVT2_SEL << 1) | (MW_EPWMXBAR2_SD0_FILT0_CMPHZ_SEL << 2) | (MW_EPWMXBAR2_SD0_FILT1_CEVT1_SEL << 3) | (MW_EPWMXBAR2_SD0_FILT1_CEVT2_SEL << 4) | (MW_EPWMXBAR2_SD0_FILT1_CMPHZ_SEL << 5) | (MW_EPWMXBAR2_SD0_FILT2_CEVT1_SEL << 6) | (MW_EPWMXBAR2_SD0_FILT2_CEVT2_SEL << 7) | (MW_EPWMXBAR2_SD0_FILT2_CMPHZ_SEL << 8) | (MW_EPWMXBAR2_SD0_FILT3_CEVT1_SEL << 9) | (MW_EPWMXBAR2_SD0_FILT3_CEVT2_SEL << 10) | (MW_EPWMXBAR2_SD0_FILT3_CMPHZ_SEL << 11) | (MW_EPWMXBAR2_SD1_FILT0_CEVT1_SEL << 12) | (MW_EPWMXBAR2_SD1_FILT0_CEVT2_SEL << 13) | (MW_EPWMXBAR2_SD1_FILT0_CMPHZ_SEL << 14) | (MW_EPWMXBAR2_SD1_FILT1_CEVT1_SEL << 15) | (MW_EPWMXBAR2_SD1_FILT1_CEVT2_SEL << 16) | (MW_EPWMXBAR2_SD1_FILT1_CMPHZ_SEL << 17) | (MW_EPWMXBAR2_SD1_FILT2_CEVT1_SEL << 18) | (MW_EPWMXBAR2_SD1_FILT2_CEVT2_SEL << 19) | (MW_EPWMXBAR2_SD1_FILT2_CMPHZ_SEL << 20) | (MW_EPWMXBAR2_SD1_FILT3_CEVT1_SEL << 21) | (MW_EPWMXBAR2_SD1_FILT3_CEVT2_SEL << 22) | (MW_EPWMXBAR2_SD1_FILT3_CMPHZ_SEL << 23);
    group3_epwmxbar[2] = (MW_EPWMXBAR2_ADC0_EVT1_SEL << 0) | (MW_EPWMXBAR2_ADC0_EVT2_SEL << 1) | (MW_EPWMXBAR2_ADC0_EVT3_SEL << 2) | (MW_EPWMXBAR2_ADC0_EVT4_SEL << 3) | (MW_EPWMXBAR2_ADC1_EVT1_SEL << 4) | (MW_EPWMXBAR2_ADC1_EVT2_SEL << 5) | (MW_EPWMXBAR2_ADC1_EVT3_SEL << 6) | (MW_EPWMXBAR2_ADC1_EVT4_SEL << 7) | (MW_EPWMXBAR2_ADC2_EVT1_SEL << 8) | (MW_EPWMXBAR2_ADC2_EVT2_SEL << 9) | (MW_EPWMXBAR2_ADC2_EVT3_SEL << 10) | (MW_EPWMXBAR2_ADC2_EVT4_SEL << 11) | (MW_EPWMXBAR2_ADC3_EVT1_SEL << 12) | (MW_EPWMXBAR2_ADC3_EVT2_SEL << 13) | (MW_EPWMXBAR2_ADC3_EVT3_SEL << 14) | (MW_EPWMXBAR2_ADC3_EVT4_SEL << 15) | (MW_EPWMXBAR2_ADC4_EVT1_SEL << 16) | (MW_EPWMXBAR2_ADC4_EVT2_SEL << 17) | (MW_EPWMXBAR2_ADC4_EVT3_SEL << 18) | (MW_EPWMXBAR2_ADC4_EVT4_SEL << 19);
    // if(MW_EPWMXBAR2_GPIO0_SEL == 1 | MW_EPWMXBAR2_GPIO1_SEL == 1 | MW_EPWMXBAR2_GPIO2_SEL == 1 | MW_EPWMXBAR2_GPIO3_SEL == 1 | MW_EPWMXBAR2_GPIO4_SEL == 1 | MW_EPWMXBAR2_GPIO5_SEL == 1 | MW_EPWMXBAR2_GPIO6_SEL == 1 | MW_EPWMXBAR2_GPIO7_SEL == 1| MW_EPWMXBAR2_GPIO8_SEL == 1 | MW_EPWMXBAR2_GPIO9_SEL == 1 | MW_EPWMXBAR2_GPIO10_SEL == 1| MW_EPWMXBAR2_GPIO11_SEL == 1| MW_EPWMXBAR2_GPIO12_SEL == 1 | MW_EPWMXBAR2_GPIO13_SEL == 1 | MW_EPWMXBAR2_GPIO14_SEL == 1 | MW_EPWMXBAR2_GPIO15_SEL == 1 | MW_EPWMXBAR2_GPIO16_SEL == 1 | MW_EPWMXBAR2_GPIO17_SEL == 1 | MW_EPWMXBAR2_GPIO18_SEL == 1 | MW_EPWMXBAR2_GPIO19_SEL == 1 | MW_EPWMXBAR2_GPIO20_SEL == 1 | MW_EPWMXBAR2_GPIO21_SEL == 1 | MW_EPWMXBAR2_GPIO22_SEL == 1 | MW_EPWMXBAR2_GPIO23_SEL == 1 | MW_EPWMXBAR2_GPIO24_SEL == 1 | MW_EPWMXBAR2_GPIO25_SEL == 1 | MW_EPWMXBAR2_GPIO26_SEL == 1 | MW_EPWMXBAR2_GPIO27_SEL == 1 | MW_EPWMXBAR2_GPIO28_SEL == 1 | MW_EPWMXBAR2_GPIO29_SEL == 1 | MW_EPWMXBAR2_GPIO30_SEL == 1 | MW_EPWMXBAR2_GPIO31_SEL == 1 | MW_EPWMXBAR2_GPIO32_SEL == 1 | MW_EPWMXBAR2_GPIO33_SEL == 1 | MW_EPWMXBAR2_GPIO34_SEL == 1 | MW_EPWMXBAR2_GPIO35_SEL == 1 | MW_EPWMXBAR2_GPIO36_SEL == 1 | MW_EPWMXBAR2_GPIO37_SEL == 1 | MW_EPWMXBAR2_GPIO38_SEL == 1 | MW_EPWMXBAR2_GPIO39_SEL == 1 | MW_EPWMXBAR2_GPIO40_SEL == 1 | MW_EPWMXBAR2_GPIO41_SEL == 1 | MW_EPWMXBAR2_GPIO42_SEL == 1 | MW_EPWMXBAR2_GPIO43_SEL == 1 | MW_EPWMXBAR2_GPIO44_SEL == 1 | | MW_EPWMXBAR2_GPIO45_SEL == 1 | MW_EPWMXBAR2_GPIO46_SEL == 1 | MW_EPWMXBAR2_GPIO47_SEL == 1| MW_EPWMXBAR2_GPIO48_SEL == 1 | MW_EPWMXBAR2_GPIO49_SEL == 1 | MW_EPWMXBAR2_GPIO50_SEL == 1 | MW_EPWMXBAR2_GPIO51_SEL == 1 | MW_EPWMXBAR2_GPIO52_SEL == 1 | MW_EPWMXBAR2_GPIO53_SEL == 1 | MW_EPWMXBAR2_GPIO54_SEL == 1 | MW_EPWMXBAR2_GPIO55_SEL == 1 | MW_EPWMXBAR2_GPIO56_SEL == 1 | MW_EPWMXBAR2_GPIO57_SEL == 1| MW_EPWMXBAR2_GPIO58_SEL == 1 | MW_EPWMXBAR2_GPIO59_SEL == 1 | MW_EPWMXBAR2_GPIO60_SEL == 1 | MW_EPWMXBAR2_GPIO61_SEL == 1 | MW_EPWMXBAR2_GPIO62_SEL == 1 | MW_EPWMXBAR2_GPIO63_SEL == 1 | MW_EPWMXBAR2_GPIO64_SEL == 1 | | MW_EPWMXBAR2_GPIO59_SEL == 1 | MW_EPWMXBAR2_GPIO60_SEL == 1 | MW_EPWMXBAR2_GPIO61_SEL == 1 | MW_EPWMXBAR2_GPIO62_SEL == 1 | MW_EPWMXBAR2_GPIO63_SEL == 1 | MW_EPWMXBAR2_GPIO64_SEL == 1 | MW_EPWMXBAR2_GPIO65_SEL == 1 | MW_EPWMXBAR2_GPIO66_SEL == 1 | MW_EPWMXBAR2_GPIO67_SEL == 1 | MW_EPWMXBAR2_GPIO68_SEL == 1 | MW_EPWMXBAR2_GPIO69_SEL == 1 | MW_EPWMXBAR2_GPIO70_SEL == 1 | MW_EPWMXBAR2_GPIO71_SEL == 1 | MW_EPWMXBAR2_GPIO72_SEL == 1 | MW_EPWMXBAR2_GPIO73_SEL == 1 | MW_EPWMXBAR2_GPIO74_SEL == 1 | MW_EPWMXBAR2_GPIO75_SEL == 1 | MW_EPWMXBAR2_GPIO76_SEL == 1 | MW_EPWMXBAR2_GPIO77_SEL == 1 | MW_EPWMXBAR2_GPIO78_SEL == 1 | | MW_EPWMXBAR2_GPIO80_SEL == 1 | MW_EPWMXBAR2_GPIO81_SEL == 1 | MW_EPWMXBAR2_GPIO82_SEL == 1 | MW_EPWMXBAR2_GPIO83_SEL == 1 | MW_EPWMXBAR2_GPIO84_SEL == 1 | MW_EPWMXBAR2_GPIO85_SEL == 1 | MW_EPWMXBAR2_GPIO86_SEL == 1 | MW_EPWMXBAR2_GPIO87_SEL == 1 | MW_EPWMXBAR2_GPIO88_SEL == 1 | MW_EPWMXBAR2_GPIO89_SEL == 1 | MW_EPWMXBAR2_GPIO90_SEL == 1 | MW_EPWMXBAR2_GPIO91_SEL == 1 | MW_EPWMXBAR2_GPIO92_SEL == 1 | MW_EPWMXBAR2_GPIO93_SEL == 1 | MW_EPWMXBAR2_GPIO94_SEL == 1 | MW_EPWMXBAR2_GPIO95_SEL == 1 | MW_EPWMXBAR2_GPIO96_SEL == 1 | MW_EPWMXBAR2_GPIO97_SEL == 1 | MW_EPWMXBAR2_GPIO98_SEL == 1 | MW_EPWMXBAR2_GPIO99_SEL == 1 | MW_EPWMXBAR2_GPIO100_SEL == 1 | MW_EPWMXBAR2_GPIO101_SEL == 1 | MW_EPWMXBAR2_GPIO102_SEL == 1 | MW_EPWMXBAR2_GPIO103_SEL == 1 | MW_EPWMXBAR2_GPIO104_SEL == 1 | MW_EPWMXBAR2_GPIO105_SEL == 1 | MW_EPWMXBAR2_GPIO106_SEL == 1 | MW_EPWMXBAR2_GPIO107_SEL == 1 | | MW_EPWMXBAR2_GPIO108_SEL == 1 | MW_EPWMXBAR2_GPIO109_SEL == 1| MW_EPWMXBAR2_GPIO110_SEL == 1 | MW_EPWMXBAR2_GPIO111_SEL == 1 | MW_EPWMXBAR2_GPIO112_SEL == 1 | MW_EPWMXBAR2_GPIO113_SEL == 1 | MW_EPWMXBAR2_GPIO114_SEL == 1 | MW_EPWMXBAR2_GPIO115_SEL == 1 | MW_EPWMXBAR2_GPIO116_SEL == 1 | MW_EPWMXBAR2_GPIO117_SEL == 1 | MW_EPWMXBAR2_GPIO118_SEL == 1 | MW_EPWMXBAR2_GPIO119_SEL == 1 | MW_EPWMXBAR2_GPIO120_SEL == 1 | MW_EPWMXBAR2_GPIO121_SEL == 1 | MW_EPWMXBAR2_GPIO122_SEL == 1 | MW_EPWMXBAR2_GPIO123_SEL == 1 | MW_EPWMXBAR2_GPIO124_SEL == 1 | MW_EPWMXBAR2_GPIO125_SEL == 1 | MW_EPWMXBAR2_GPIO126_SEL == 1 | MW_EPWMXBAR2_GPIO127_SEL == 1 | MW_EPWMXBAR2_GPIO128_SEL == 1 | MW_EPWMXBAR2_GPIO129_SEL == 1 | MW_EPWMXBAR2_GPIO130_SEL == 1 | MW_EPWMXBAR2_GPIO131_SEL == 1 | MW_EPWMXBAR2_GPIO132_SEL == 1 | MW_EPWMXBAR2_GPIO133_SEL == 1 | MW_EPWMXBAR2_GPIO134_SEL == 1 | MW_EPWMXBAR2_GPIO135_SEL == 1 | MW_EPWMXBAR2_GPIO136_SEL == 1 | MW_EPWMXBAR2_GPIO137_SEL == 1 | MW_EPWMXBAR2_GPIO139_SEL == 1 | MW_EPWMXBAR2_GPIO140_SEL == 1 | MW_EPWMXBAR2_GPIO141_SEL == 1 | MW_EPWMXBAR2_GPIO142_SEL == 1 | MW_EPWMXBAR2_GPIO143_SEL == 1 | MW_EPWMXBAR2_ICSSGPO0_PORT0_SEL == 1 | MW_EPWMXBAR2_ICSSGPO1_PORT0_SEL == 1 | MW_EPWMXBAR2_ICSSGPO2_PORT0_SEL == 1 | MW_EPWMXBAR2_ICSSGPO3_PORT0_SEL == 1 | MW_EPWMXBAR2_ICSSGPO4_PORT0_SEL == 1 | MW_EPWMXBAR2_ICSSGPO5_PORT0_SEL == 1 | MW_EPWMXBAR2_ICSSGPO6_PORT0_SEL == 1 | MW_EPWMXBAR2_ICSSGPO7_PORT0_SEL == 1 | MW_EPWMXBAR2_ICSSGPO8_PORT0_SEL == 1 | MW_EPWMXBAR2_ICSSGPO9_PORT0_SEL == 1 | MW_EPWMXBAR2_ICSSGPO10_PORT0_SEL == 1 | MW_EPWMXBAR2_ICSSGPO11_PORT0_SEL == 1 | MW_EPWMXBAR2_ICSSGPO12_PORT0_SEL == 1 | MW_EPWMXBAR2_ICSSGPO13_PORT0_SEL == 1 | MW_EPWMXBAR2_ICSSGPO14_PORT0_SEL == 1 | MW_EPWMXBAR2_ICSSGPO15_PORT0_SEL == 1 | MW_EPWMXBAR2_ICSSGPO0_PORT1_SEL == 1 | MW_EPWMXBAR2_ICSSGPO1_PORT1_SEL == 1 | MW_EPWMXBAR2_ICSSGPO2_PORT1_SEL == 1 | MW_EPWMXBAR2_ICSSGPO3_PORT1_SEL == 1 | MW_EPWMXBAR2_ICSSGPO4_PORT1_SEL == 1 | MW_EPWMXBAR2_ICSSGPO5_PORT1_SEL == 1 | MW_EPWMXBAR2_ICSSGPO6_PORT1_SEL == 1 | MW_EPWMXBAR2_ICSSGPO7_PORT1_SEL == 1 | MW_EPWMXBAR2_ICSSGPO8_PORT1_SEL == 1 | MW_EPWMXBAR2_ICSSGPO9_PORT1_SEL == 1 | MW_EPWMXBAR2_ICSSGPO10_PORT1_SEL == 1 | MW_EPWMXBAR2_ICSSGPO11_PORT1_SEL == 1 | MW_EPWMXBAR2_ICSSGPO12_PORT1_SEL == 1 | MW_EPWMXBAR2_ICSSGPO13_PORT1_SEL == 1 | MW_EPWMXBAR2_ICSSGPO14_PORT1_SEL == 1 | MW_EPWMXBAR2_ICSSGPO15_PORT1_SEL == 1)
    //     group4_epwmxbar[2] = EPWM_XBAR_2;
    // else
        group4_epwmxbar[2] = 0;
    group5_epwmxbar[2] = (MW_EPWMXBAR2_EPWM0_TRIPOUT_SEL << 0) | (MW_EPWMXBAR2_EPWM1_TRIPOUT_SEL << 1) | (MW_EPWMXBAR2_EPWM2_TRIPOUT_SEL << 2) | (MW_EPWMXBAR2_EPWM3_TRIPOUT_SEL << 3) | (MW_EPWMXBAR2_EPWM4_TRIPOUT_SEL << 4) | (MW_EPWMXBAR2_EPWM5_TRIPOUT_SEL << 5) | (MW_EPWMXBAR2_EPWM6_TRIPOUT_SEL << 6) | (MW_EPWMXBAR2_EPWM7_TRIPOUT_SEL << 7) | (MW_EPWMXBAR2_EPWM8_TRIPOUT_SEL << 8) | (MW_EPWMXBAR2_EPWM9_TRIPOUT_SEL << 9) | (MW_EPWMXBAR2_EPWM10_TRIPOUT_SEL << 10) | (MW_EPWMXBAR2_EPWM11_TRIPOUT_SEL << 11) | (MW_EPWMXBAR2_EPWM12_TRIPOUT_SEL << 12) | (MW_EPWMXBAR2_EPWM13_TRIPOUT_SEL << 13) | (MW_EPWMXBAR2_EPWM14_TRIPOUT_SEL << 14) | (MW_EPWMXBAR2_EPWM15_TRIPOUT_SEL << 15) | (MW_EPWMXBAR2_EPWM16_TRIPOUT_SEL << 16) | (MW_EPWMXBAR2_EPWM17_TRIPOUT_SEL << 17) | (MW_EPWMXBAR2_EPWM18_TRIPOUT_SEL << 18) | (MW_EPWMXBAR2_EPWM19_TRIPOUT_SEL << 19) | (MW_EPWMXBAR2_EPWM20_TRIPOUT_SEL << 20) | (MW_EPWMXBAR2_EPWM21_TRIPOUT_SEL << 21) | (MW_EPWMXBAR2_EPWM22_TRIPOUT_SEL << 22) | (MW_EPWMXBAR2_EPWM23_TRIPOUT_SEL << 23) | (MW_EPWMXBAR2_EPWM24_TRIPOUT_SEL << 24) | (MW_EPWMXBAR2_EPWM25_TRIPOUT_SEL << 25) | (MW_EPWMXBAR2_EPWM26_TRIPOUT_SEL << 26) | (MW_EPWMXBAR2_EPWM27_TRIPOUT_SEL << 27) | (MW_EPWMXBAR2_EPWM28_TRIPOUT_SEL << 28) | (MW_EPWMXBAR2_EPWM29_TRIPOUT_SEL << 29) | (MW_EPWMXBAR2_EPWM30_TRIPOUT_SEL << 30) | (MW_EPWMXBAR2_EPWM31_TRIPOUT_SEL << 31);
    group6_epwmxbar[2] = (MW_EPWMXBAR2_DEL0_TRIP_SEL << 0) | (MW_EPWMXBAR2_DEL1_TRIP_SEL << 1) | (MW_EPWMXBAR2_DEL2_TRIP_SEL << 2) | (MW_EPWMXBAR2_DEL3_TRIP_SEL << 3) | (MW_EPWMXBAR2_DEL4_TRIP_SEL << 4) | (MW_EPWMXBAR2_DEL5_TRIP_SEL << 5) | (MW_EPWMXBAR2_DEL6_TRIP_SEL << 6) | (MW_EPWMXBAR2_DEL7_TRIP_SEL << 7) | (MW_EPWMXBAR2_DEL8_TRIP_SEL << 8) | (MW_EPWMXBAR2_DEL9_TRIP_SEL << 9) | (MW_EPWMXBAR2_DEL10_TRIP_SEL << 10) | (MW_EPWMXBAR2_DEL11_TRIP_SEL << 11) | (MW_EPWMXBAR2_DEL12_TRIP_SEL << 12) | (MW_EPWMXBAR2_DEL13_TRIP_SEL << 13) | (MW_EPWMXBAR2_DEL14_TRIP_SEL << 14) | (MW_EPWMXBAR2_DEL15_TRIP_SEL << 15) | (MW_EPWMXBAR2_DEL16_TRIP_SEL << 16) | (MW_EPWMXBAR2_DEL17_TRIP_SEL << 17) | (MW_EPWMXBAR2_DEL18_TRIP_SEL << 18) | (MW_EPWMXBAR2_DEL19_TRIP_SEL << 19) | (MW_EPWMXBAR2_DEL20_TRIP_SEL << 20) | (MW_EPWMXBAR2_DEL21_TRIP_SEL << 21) | (MW_EPWMXBAR2_DEL22_TRIP_SEL << 22) | (MW_EPWMXBAR2_DEL23_TRIP_SEL << 23) | (MW_EPWMXBAR2_DEL24_TRIP_SEL << 24) | (MW_EPWMXBAR2_DEL25_TRIP_SEL << 25) | (MW_EPWMXBAR2_DEL26_TRIP_SEL << 26) | (MW_EPWMXBAR2_DEL27_TRIP_SEL << 27) | (MW_EPWMXBAR2_DEL28_TRIP_SEL << 28) | (MW_EPWMXBAR2_DEL29_TRIP_SEL << 29) | (MW_EPWMXBAR2_DEL30_TRIP_SEL << 30) | (MW_EPWMXBAR2_DEL31_TRIP_SEL << 31);
