TexasInstruments/am26x-hsp/src/am263px_init.c
    group7_epwmxbar[2] = (MW_EPWMXBAR2_DEL0_ACTIVE_SEL << 0) | (MW_EPWMXBAR2_DEL1_ACTIVE_SEL << 1) | (MW_EPWMXBAR2_DEL2_ACTIVE_SEL << 2) | (MW_EPWMXBAR2_DEL3_ACTIVE_SEL << 3) | (MW_EPWMXBAR2_DEL4_ACTIVE_SEL << 4) | (MW_EPWMXBAR2_DEL5_ACTIVE_SEL << 5) | (MW_EPWMXBAR2_DEL6_ACTIVE_SEL << 6) | (MW_EPWMXBAR2_DEL7_ACTIVE_SEL << 7) | (MW_EPWMXBAR2_DEL8_ACTIVE_SEL << 8) | (MW_EPWMXBAR2_DEL9_ACTIVE_SEL << 9) | (MW_EPWMXBAR2_DEL10_ACTIVE_SEL << 10) | (MW_EPWMXBAR2_DEL11_ACTIVE_SEL << 11) | (MW_EPWMXBAR2_DEL12_ACTIVE_SEL << 12) | (MW_EPWMXBAR2_DEL13_ACTIVE_SEL << 13) | (MW_EPWMXBAR2_DEL14_ACTIVE_SEL << 14) | (MW_EPWMXBAR2_DEL15_ACTIVE_SEL << 15) | (MW_EPWMXBAR2_DEL16_ACTIVE_SEL << 16) | (MW_EPWMXBAR2_DEL17_ACTIVE_SEL << 17) | (MW_EPWMXBAR2_DEL18_ACTIVE_SEL << 18) | (MW_EPWMXBAR2_DEL19_ACTIVE_SEL << 19) | (MW_EPWMXBAR2_DEL20_ACTIVE_SEL << 20) | (MW_EPWMXBAR2_DEL21_ACTIVE_SEL << 21) | (MW_EPWMXBAR2_DEL22_ACTIVE_SEL << 22) | (MW_EPWMXBAR2_DEL23_ACTIVE_SEL << 23) | (MW_EPWMXBAR2_DEL24_ACTIVE_SEL << 24) | (MW_EPWMXBAR2_DEL25_ACTIVE_SEL << 25) | (MW_EPWMXBAR2_DEL26_ACTIVE_SEL << 26) | (MW_EPWMXBAR2_DEL27_ACTIVE_SEL << 27) | (MW_EPWMXBAR2_DEL28_ACTIVE_SEL << 28) | (MW_EPWMXBAR2_DEL29_ACTIVE_SEL << 29) | (MW_EPWMXBAR2_DEL30_ACTIVE_SEL << 30) | (MW_EPWMXBAR2_DEL31_ACTIVE_SEL << 31);
    group8_epwmxbar[2] = (MW_EPWMXBAR2_EQEP0_ERR_SEL << 0) | (MW_EPWMXBAR2_EQEP1_ERR_SEL << 1) | (MW_EPWMXBAR2_EQEP2_ERR_SEL << 2) | (MW_EPWMXBAR2_FSIRX0_RX_TRIG0_SEL << 3) | (MW_EPWMXBAR2_FSIRX0_RX_TRIG1_SEL << 4) | (MW_EPWMXBAR2_FSIRX0_RX_TRIG2_SEL << 5) | (MW_EPWMXBAR2_FSIRX0_RX_TRIG3_SEL << 6) | (MW_EPWMXBAR2_FSIRX1_RX_TRIG0_SEL << 7) | (MW_EPWMXBAR2_FSIRX1_RX_TRIG1_SEL << 8) | (MW_EPWMXBAR2_FSIRX1_RX_TRIG2_SEL << 9) | (MW_EPWMXBAR2_FSIRX1_RX_TRIG3_SEL << 10) | (MW_EPWMXBAR2_FSIRX2_RX_TRIG0_SEL << 11) | (MW_EPWMXBAR2_FSIRX2_RX_TRIG1_SEL << 12) | (MW_EPWMXBAR2_FSIRX2_RX_TRIG2_SEL << 13) | (MW_EPWMXBAR2_FSIRX2_RX_TRIG3_SEL << 14) | (MW_EPWMXBAR2_FSIRX3_RX_TRIG0_SEL << 15) | (MW_EPWMXBAR2_FSIRX3_RX_TRIG1_SEL << 16) | (MW_EPWMXBAR2_FSIRX3_RX_TRIG2_SEL << 17) | (MW_EPWMXBAR2_FSIRX3_RX_TRIG3_SEL << 18) | (MW_EPWMXBAR2_ECAP0_TRIPOUT_SEL << 19) | (MW_EPWMXBAR2_ECAP1_TRIPOUT_SEL << 20) | (MW_EPWMXBAR2_ECAP2_TRIPOUT_SEL << 21) | (MW_EPWMXBAR2_ECAP3_TRIPOUT_SEL << 22) | (MW_EPWMXBAR2_ECAP4_TRIPOUT_SEL << 23) | (MW_EPWMXBAR2_ECAP5_TRIPOUT_SEL << 24) | (MW_EPWMXBAR2_ECAP6_TRIPOUT_SEL << 25) | (MW_EPWMXBAR2_ECAP7_TRIPOUT_SEL << 26) | (MW_EPWMXBAR2_ECAP8_TRIPOUT_SEL << 27) | (MW_EPWMXBAR2_ECAP9_TRIPOUT_SEL << 28);
    group0_epwmxbar[3] = (MW_EPWMXBAR3_CMPSSA0_CTRIPL_SEL << 0) | (MW_EPWMXBAR3_CMPSSA0_CTRIPH_SEL << 1) | (MW_EPWMXBAR3_CMPSSA1_CTRIPL_SEL << 2) | (MW_EPWMXBAR3_CMPSSA1_CTRIPH_SEL << 3) | (MW_EPWMXBAR3_CMPSSA2_CTRIPL_SEL << 4) | (MW_EPWMXBAR3_CMPSSA2_CTRIPH_SEL << 5) | (MW_EPWMXBAR3_CMPSSA3_CTRIPL_SEL << 6) | (MW_EPWMXBAR3_CMPSSA3_CTRIPH_SEL << 7) | (MW_EPWMXBAR3_CMPSSA4_CTRIPL_SEL << 8) | (MW_EPWMXBAR3_CMPSSA4_CTRIPH_SEL << 9) | (MW_EPWMXBAR3_CMPSSA5_CTRIPL_SEL << 10) | (MW_EPWMXBAR3_CMPSSA5_CTRIPH_SEL << 11) | (MW_EPWMXBAR3_CMPSSA6_CTRIPL_SEL << 12) | (MW_EPWMXBAR3_CMPSSA6_CTRIPH_SEL << 13) | (MW_EPWMXBAR3_CMPSSA7_CTRIPL_SEL << 14) | (MW_EPWMXBAR3_CMPSSA7_CTRIPH_SEL << 15) | (MW_EPWMXBAR3_CMPSSA8_CTRIPL_SEL << 16) | (MW_EPWMXBAR3_CMPSSA8_CTRIPH_SEL << 17) | (MW_EPWMXBAR3_CMPSSA9_CTRIPL_SEL << 18) | (MW_EPWMXBAR3_CMPSSA9_CTRIPH_SEL << 19);
    group1_epwmxbar[3] = (MW_EPWMXBAR3_CMPSSB0_CTRIPL_SEL << 0) | (MW_EPWMXBAR3_CMPSSB0_CTRIPH_SEL << 1) | (MW_EPWMXBAR3_CMPSSB1_CTRIPL_SEL << 2) | (MW_EPWMXBAR3_CMPSSB1_CTRIPH_SEL << 3) | (MW_EPWMXBAR3_CMPSSB2_CTRIPL_SEL << 4) | (MW_EPWMXBAR3_CMPSSB2_CTRIPH_SEL << 5) | (MW_EPWMXBAR3_CMPSSB3_CTRIPL_SEL << 6) | (MW_EPWMXBAR3_CMPSSB3_CTRIPH_SEL << 7) | (MW_EPWMXBAR3_CMPSSB4_CTRIPL_SEL << 8) | (MW_EPWMXBAR3_CMPSSB4_CTRIPH_SEL << 9) | (MW_EPWMXBAR3_CMPSSB5_CTRIPL_SEL << 10) | (MW_EPWMXBAR3_CMPSSB5_CTRIPH_SEL << 11) | (MW_EPWMXBAR3_CMPSSB6_CTRIPL_SEL << 12) | (MW_EPWMXBAR3_CMPSSB6_CTRIPH_SEL << 13) | (MW_EPWMXBAR3_CMPSSB7_CTRIPL_SEL << 14) | (MW_EPWMXBAR3_CMPSSB7_CTRIPH_SEL << 15) | (MW_EPWMXBAR3_CMPSSB8_CTRIPL_SEL << 16) | (MW_EPWMXBAR3_CMPSSB8_CTRIPH_SEL << 17) | (MW_EPWMXBAR3_CMPSSB9_CTRIPL_SEL << 18) | (MW_EPWMXBAR3_CMPSSB9_CTRIPH_SEL << 19);
    group2_epwmxbar[3] = (MW_EPWMXBAR3_SD0_FILT0_CEVT1_SEL << 0) | (MW_EPWMXBAR3_SD0_FILT0_CEVT2_SEL << 1) | (MW_EPWMXBAR3_SD0_FILT0_CMPHZ_SEL << 2) | (MW_EPWMXBAR3_SD0_FILT1_CEVT1_SEL << 3) | (MW_EPWMXBAR3_SD0_FILT1_CEVT2_SEL << 4) | (MW_EPWMXBAR3_SD0_FILT1_CMPHZ_SEL << 5) | (MW_EPWMXBAR3_SD0_FILT2_CEVT1_SEL << 6) | (MW_EPWMXBAR3_SD0_FILT2_CEVT2_SEL << 7) | (MW_EPWMXBAR3_SD0_FILT2_CMPHZ_SEL << 8) | (MW_EPWMXBAR3_SD0_FILT3_CEVT1_SEL << 9) | (MW_EPWMXBAR3_SD0_FILT3_CEVT2_SEL << 10) | (MW_EPWMXBAR3_SD0_FILT3_CMPHZ_SEL << 11) | (MW_EPWMXBAR3_SD1_FILT0_CEVT1_SEL << 12) | (MW_EPWMXBAR3_SD1_FILT0_CEVT2_SEL << 13) | (MW_EPWMXBAR3_SD1_FILT0_CMPHZ_SEL << 14) | (MW_EPWMXBAR3_SD1_FILT1_CEVT1_SEL << 15) | (MW_EPWMXBAR3_SD1_FILT1_CEVT2_SEL << 16) | (MW_EPWMXBAR3_SD1_FILT1_CMPHZ_SEL << 17) | (MW_EPWMXBAR3_SD1_FILT2_CEVT1_SEL << 18) | (MW_EPWMXBAR3_SD1_FILT2_CEVT2_SEL << 19) | (MW_EPWMXBAR3_SD1_FILT2_CMPHZ_SEL << 20) | (MW_EPWMXBAR3_SD1_FILT3_CEVT1_SEL << 21) | (MW_EPWMXBAR3_SD1_FILT3_CEVT2_SEL << 22) | (MW_EPWMXBAR3_SD1_FILT3_CMPHZ_SEL << 23);
    group3_epwmxbar[3] = (MW_EPWMXBAR3_ADC0_EVT1_SEL << 0) | (MW_EPWMXBAR3_ADC0_EVT2_SEL << 1) | (MW_EPWMXBAR3_ADC0_EVT3_SEL << 2) | (MW_EPWMXBAR3_ADC0_EVT4_SEL << 3) | (MW_EPWMXBAR3_ADC1_EVT1_SEL << 4) | (MW_EPWMXBAR3_ADC1_EVT2_SEL << 5) | (MW_EPWMXBAR3_ADC1_EVT3_SEL << 6) | (MW_EPWMXBAR3_ADC1_EVT4_SEL << 7) | (MW_EPWMXBAR3_ADC2_EVT1_SEL << 8) | (MW_EPWMXBAR3_ADC2_EVT2_SEL << 9) | (MW_EPWMXBAR3_ADC2_EVT3_SEL << 10) | (MW_EPWMXBAR3_ADC2_EVT4_SEL << 11) | (MW_EPWMXBAR3_ADC3_EVT1_SEL << 12) | (MW_EPWMXBAR3_ADC3_EVT2_SEL << 13) | (MW_EPWMXBAR3_ADC3_EVT3_SEL << 14) | (MW_EPWMXBAR3_ADC3_EVT4_SEL << 15) | (MW_EPWMXBAR3_ADC4_EVT1_SEL << 16) | (MW_EPWMXBAR3_ADC4_EVT2_SEL << 17) | (MW_EPWMXBAR3_ADC4_EVT3_SEL << 18) | (MW_EPWMXBAR3_ADC4_EVT4_SEL << 19);
    // if(MW_EPWMXBAR3_GPIO0_SEL == 1 | MW_EPWMXBAR3_GPIO1_SEL == 1 | MW_EPWMXBAR3_GPIO2_SEL == 1 | MW_EPWMXBAR3_GPIO3_SEL == 1 | MW_EPWMXBAR3_GPIO4_SEL == 1 | MW_EPWMXBAR3_GPIO5_SEL == 1 | MW_EPWMXBAR3_GPIO6_SEL == 1 | MW_EPWMXBAR3_GPIO7_SEL == 1| MW_EPWMXBAR3_GPIO8_SEL == 1 | MW_EPWMXBAR3_GPIO9_SEL == 1 | MW_EPWMXBAR3_GPIO10_SEL == 1| MW_EPWMXBAR3_GPIO11_SEL == 1| MW_EPWMXBAR3_GPIO12_SEL == 1 | MW_EPWMXBAR3_GPIO13_SEL == 1 | MW_EPWMXBAR3_GPIO14_SEL == 1 | MW_EPWMXBAR3_GPIO15_SEL == 1 | MW_EPWMXBAR3_GPIO16_SEL == 1 | MW_EPWMXBAR3_GPIO17_SEL == 1 | MW_EPWMXBAR3_GPIO18_SEL == 1 | MW_EPWMXBAR3_GPIO19_SEL == 1 | MW_EPWMXBAR3_GPIO20_SEL == 1 | MW_EPWMXBAR3_GPIO21_SEL == 1 | MW_EPWMXBAR3_GPIO22_SEL == 1 | MW_EPWMXBAR3_GPIO23_SEL == 1 | MW_EPWMXBAR3_GPIO24_SEL == 1 | MW_EPWMXBAR3_GPIO25_SEL == 1 | MW_EPWMXBAR3_GPIO26_SEL == 1 | MW_EPWMXBAR3_GPIO27_SEL == 1 | MW_EPWMXBAR3_GPIO28_SEL == 1 | MW_EPWMXBAR3_GPIO29_SEL == 1 | MW_EPWMXBAR3_GPIO30_SEL == 1 | MW_EPWMXBAR3_GPIO31_SEL == 1 | MW_EPWMXBAR3_GPIO32_SEL == 1 | MW_EPWMXBAR3_GPIO33_SEL == 1 | MW_EPWMXBAR3_GPIO34_SEL == 1 | MW_EPWMXBAR3_GPIO35_SEL == 1 | MW_EPWMXBAR3_GPIO36_SEL == 1 | MW_EPWMXBAR3_GPIO37_SEL == 1 | MW_EPWMXBAR3_GPIO38_SEL == 1 | MW_EPWMXBAR3_GPIO39_SEL == 1 | MW_EPWMXBAR3_GPIO40_SEL == 1 | MW_EPWMXBAR3_GPIO41_SEL == 1 | MW_EPWMXBAR3_GPIO42_SEL == 1 | MW_EPWMXBAR3_GPIO43_SEL == 1 | MW_EPWMXBAR3_GPIO44_SEL == 1 | | MW_EPWMXBAR3_GPIO45_SEL == 1 | MW_EPWMXBAR3_GPIO46_SEL == 1 | MW_EPWMXBAR3_GPIO47_SEL == 1| MW_EPWMXBAR3_GPIO48_SEL == 1 | MW_EPWMXBAR3_GPIO49_SEL == 1 | MW_EPWMXBAR3_GPIO50_SEL == 1 | MW_EPWMXBAR3_GPIO51_SEL == 1 | MW_EPWMXBAR3_GPIO52_SEL == 1 | MW_EPWMXBAR3_GPIO53_SEL == 1 | MW_EPWMXBAR3_GPIO54_SEL == 1 | MW_EPWMXBAR3_GPIO55_SEL == 1 | MW_EPWMXBAR3_GPIO56_SEL == 1 | MW_EPWMXBAR3_GPIO57_SEL == 1| MW_EPWMXBAR3_GPIO58_SEL == 1 | MW_EPWMXBAR3_GPIO59_SEL == 1 | MW_EPWMXBAR3_GPIO60_SEL == 1 | MW_EPWMXBAR3_GPIO61_SEL == 1 | MW_EPWMXBAR3_GPIO62_SEL == 1 | MW_EPWMXBAR3_GPIO63_SEL == 1 | MW_EPWMXBAR3_GPIO64_SEL == 1 | | MW_EPWMXBAR3_GPIO59_SEL == 1 | MW_EPWMXBAR3_GPIO60_SEL == 1 | MW_EPWMXBAR3_GPIO61_SEL == 1 | MW_EPWMXBAR3_GPIO62_SEL == 1 | MW_EPWMXBAR3_GPIO63_SEL == 1 | MW_EPWMXBAR3_GPIO64_SEL == 1 | MW_EPWMXBAR3_GPIO65_SEL == 1 | MW_EPWMXBAR3_GPIO66_SEL == 1 | MW_EPWMXBAR3_GPIO67_SEL == 1 | MW_EPWMXBAR3_GPIO68_SEL == 1 | MW_EPWMXBAR3_GPIO69_SEL == 1 | MW_EPWMXBAR3_GPIO70_SEL == 1 | MW_EPWMXBAR3_GPIO71_SEL == 1 | MW_EPWMXBAR3_GPIO72_SEL == 1 | MW_EPWMXBAR3_GPIO73_SEL == 1 | MW_EPWMXBAR3_GPIO74_SEL == 1 | MW_EPWMXBAR3_GPIO75_SEL == 1 | MW_EPWMXBAR3_GPIO76_SEL == 1 | MW_EPWMXBAR3_GPIO77_SEL == 1 | MW_EPWMXBAR3_GPIO78_SEL == 1 | | MW_EPWMXBAR3_GPIO80_SEL == 1 | MW_EPWMXBAR3_GPIO81_SEL == 1 | MW_EPWMXBAR3_GPIO82_SEL == 1 | MW_EPWMXBAR3_GPIO83_SEL == 1 | MW_EPWMXBAR3_GPIO84_SEL == 1 | MW_EPWMXBAR3_GPIO85_SEL == 1 | MW_EPWMXBAR3_GPIO86_SEL == 1 | MW_EPWMXBAR3_GPIO87_SEL == 1 | MW_EPWMXBAR3_GPIO88_SEL == 1 | MW_EPWMXBAR3_GPIO89_SEL == 1 | MW_EPWMXBAR3_GPIO90_SEL == 1 | MW_EPWMXBAR3_GPIO91_SEL == 1 | MW_EPWMXBAR3_GPIO92_SEL == 1 | MW_EPWMXBAR3_GPIO93_SEL == 1 | MW_EPWMXBAR3_GPIO94_SEL == 1 | MW_EPWMXBAR3_GPIO95_SEL == 1 | MW_EPWMXBAR3_GPIO96_SEL == 1 | MW_EPWMXBAR3_GPIO97_SEL == 1 | MW_EPWMXBAR3_GPIO98_SEL == 1 | MW_EPWMXBAR3_GPIO99_SEL == 1 | MW_EPWMXBAR3_GPIO100_SEL == 1 | MW_EPWMXBAR3_GPIO101_SEL == 1 | MW_EPWMXBAR3_GPIO102_SEL == 1 | MW_EPWMXBAR3_GPIO103_SEL == 1 | MW_EPWMXBAR3_GPIO104_SEL == 1 | MW_EPWMXBAR3_GPIO105_SEL == 1 | MW_EPWMXBAR3_GPIO106_SEL == 1 | MW_EPWMXBAR3_GPIO107_SEL == 1 | | MW_EPWMXBAR3_GPIO108_SEL == 1 | MW_EPWMXBAR3_GPIO109_SEL == 1| MW_EPWMXBAR3_GPIO110_SEL == 1 | MW_EPWMXBAR3_GPIO111_SEL == 1 | MW_EPWMXBAR3_GPIO112_SEL == 1 | MW_EPWMXBAR3_GPIO113_SEL == 1 | MW_EPWMXBAR3_GPIO114_SEL == 1 | MW_EPWMXBAR3_GPIO115_SEL == 1 | MW_EPWMXBAR3_GPIO116_SEL == 1 | MW_EPWMXBAR3_GPIO117_SEL == 1 | MW_EPWMXBAR3_GPIO118_SEL == 1 | MW_EPWMXBAR3_GPIO119_SEL == 1 | MW_EPWMXBAR3_GPIO120_SEL == 1 | MW_EPWMXBAR3_GPIO121_SEL == 1 | MW_EPWMXBAR3_GPIO122_SEL == 1 | MW_EPWMXBAR3_GPIO123_SEL == 1 | MW_EPWMXBAR3_GPIO124_SEL == 1 | MW_EPWMXBAR3_GPIO125_SEL == 1 | MW_EPWMXBAR3_GPIO126_SEL == 1 | MW_EPWMXBAR3_GPIO127_SEL == 1 | MW_EPWMXBAR3_GPIO128_SEL == 1 | MW_EPWMXBAR3_GPIO129_SEL == 1 | MW_EPWMXBAR3_GPIO130_SEL == 1 | MW_EPWMXBAR3_GPIO131_SEL == 1 | MW_EPWMXBAR3_GPIO132_SEL == 1 | MW_EPWMXBAR3_GPIO133_SEL == 1 | MW_EPWMXBAR3_GPIO134_SEL == 1 | MW_EPWMXBAR3_GPIO135_SEL == 1 | MW_EPWMXBAR3_GPIO136_SEL == 1 | MW_EPWMXBAR3_GPIO137_SEL == 1 | MW_EPWMXBAR3_GPIO139_SEL == 1 | MW_EPWMXBAR3_GPIO140_SEL == 1 | MW_EPWMXBAR3_GPIO141_SEL == 1 | MW_EPWMXBAR3_GPIO142_SEL == 1 | MW_EPWMXBAR3_GPIO143_SEL == 1 | MW_EPWMXBAR3_ICSSGPO0_PORT0_SEL == 1 | MW_EPWMXBAR3_ICSSGPO1_PORT0_SEL == 1 | MW_EPWMXBAR3_ICSSGPO2_PORT0_SEL == 1 | MW_EPWMXBAR3_ICSSGPO3_PORT0_SEL == 1 | MW_EPWMXBAR3_ICSSGPO4_PORT0_SEL == 1 | MW_EPWMXBAR3_ICSSGPO5_PORT0_SEL == 1 | MW_EPWMXBAR3_ICSSGPO6_PORT0_SEL == 1 | MW_EPWMXBAR3_ICSSGPO7_PORT0_SEL == 1 | MW_EPWMXBAR3_ICSSGPO8_PORT0_SEL == 1 | MW_EPWMXBAR3_ICSSGPO9_PORT0_SEL == 1 | MW_EPWMXBAR3_ICSSGPO10_PORT0_SEL == 1 | MW_EPWMXBAR3_ICSSGPO11_PORT0_SEL == 1 | MW_EPWMXBAR3_ICSSGPO12_PORT0_SEL == 1 | MW_EPWMXBAR3_ICSSGPO13_PORT0_SEL == 1 | MW_EPWMXBAR3_ICSSGPO14_PORT0_SEL == 1 | MW_EPWMXBAR3_ICSSGPO15_PORT0_SEL == 1 | MW_EPWMXBAR3_ICSSGPO0_PORT1_SEL == 1 | MW_EPWMXBAR3_ICSSGPO1_PORT1_SEL == 1 | MW_EPWMXBAR3_ICSSGPO2_PORT1_SEL == 1 | MW_EPWMXBAR3_ICSSGPO3_PORT1_SEL == 1 | MW_EPWMXBAR3_ICSSGPO4_PORT1_SEL == 1 | MW_EPWMXBAR3_ICSSGPO5_PORT1_SEL == 1 | MW_EPWMXBAR3_ICSSGPO6_PORT1_SEL == 1 | MW_EPWMXBAR3_ICSSGPO7_PORT1_SEL == 1 | MW_EPWMXBAR3_ICSSGPO8_PORT1_SEL == 1 | MW_EPWMXBAR3_ICSSGPO9_PORT1_SEL == 1 | MW_EPWMXBAR3_ICSSGPO10_PORT1_SEL == 1 | MW_EPWMXBAR3_ICSSGPO11_PORT1_SEL == 1 | MW_EPWMXBAR3_ICSSGPO12_PORT1_SEL == 1 | MW_EPWMXBAR3_ICSSGPO13_PORT1_SEL == 1 | MW_EPWMXBAR3_ICSSGPO14_PORT1_SEL == 1 | MW_EPWMXBAR3_ICSSGPO15_PORT1_SEL == 1)
    //     group4_epwmxbar[3] = EPWM_XBAR_3;
    // else
        group4_epwmxbar[3] = 0;
    group5_epwmxbar[3] = (MW_EPWMXBAR3_EPWM0_TRIPOUT_SEL << 0) | (MW_EPWMXBAR3_EPWM1_TRIPOUT_SEL << 1) | (MW_EPWMXBAR3_EPWM2_TRIPOUT_SEL << 2) | (MW_EPWMXBAR3_EPWM3_TRIPOUT_SEL << 3) | (MW_EPWMXBAR3_EPWM4_TRIPOUT_SEL << 4) | (MW_EPWMXBAR3_EPWM5_TRIPOUT_SEL << 5) | (MW_EPWMXBAR3_EPWM6_TRIPOUT_SEL << 6) | (MW_EPWMXBAR3_EPWM7_TRIPOUT_SEL << 7) | (MW_EPWMXBAR3_EPWM8_TRIPOUT_SEL << 8) | (MW_EPWMXBAR3_EPWM9_TRIPOUT_SEL << 9) | (MW_EPWMXBAR3_EPWM10_TRIPOUT_SEL << 10) | (MW_EPWMXBAR3_EPWM11_TRIPOUT_SEL << 11) | (MW_EPWMXBAR3_EPWM12_TRIPOUT_SEL << 12) | (MW_EPWMXBAR3_EPWM13_TRIPOUT_SEL << 13) | (MW_EPWMXBAR3_EPWM14_TRIPOUT_SEL << 14) | (MW_EPWMXBAR3_EPWM15_TRIPOUT_SEL << 15) | (MW_EPWMXBAR3_EPWM16_TRIPOUT_SEL << 16) | (MW_EPWMXBAR3_EPWM17_TRIPOUT_SEL << 17) | (MW_EPWMXBAR3_EPWM18_TRIPOUT_SEL << 18) | (MW_EPWMXBAR3_EPWM19_TRIPOUT_SEL << 19) | (MW_EPWMXBAR3_EPWM20_TRIPOUT_SEL << 20) | (MW_EPWMXBAR3_EPWM21_TRIPOUT_SEL << 21) | (MW_EPWMXBAR3_EPWM22_TRIPOUT_SEL << 22) | (MW_EPWMXBAR3_EPWM23_TRIPOUT_SEL << 23) | (MW_EPWMXBAR3_EPWM24_TRIPOUT_SEL << 24) | (MW_EPWMXBAR3_EPWM25_TRIPOUT_SEL << 25) | (MW_EPWMXBAR3_EPWM26_TRIPOUT_SEL << 26) | (MW_EPWMXBAR3_EPWM27_TRIPOUT_SEL << 27) | (MW_EPWMXBAR3_EPWM28_TRIPOUT_SEL << 28) | (MW_EPWMXBAR3_EPWM29_TRIPOUT_SEL << 29) | (MW_EPWMXBAR3_EPWM30_TRIPOUT_SEL << 30) | (MW_EPWMXBAR3_EPWM31_TRIPOUT_SEL << 31);
    group6_epwmxbar[3] = (MW_EPWMXBAR3_DEL0_TRIP_SEL << 0) | (MW_EPWMXBAR3_DEL1_TRIP_SEL << 1) | (MW_EPWMXBAR3_DEL2_TRIP_SEL << 2) | (MW_EPWMXBAR3_DEL3_TRIP_SEL << 3) | (MW_EPWMXBAR3_DEL4_TRIP_SEL << 4) | (MW_EPWMXBAR3_DEL5_TRIP_SEL << 5) | (MW_EPWMXBAR3_DEL6_TRIP_SEL << 6) | (MW_EPWMXBAR3_DEL7_TRIP_SEL << 7) | (MW_EPWMXBAR3_DEL8_TRIP_SEL << 8) | (MW_EPWMXBAR3_DEL9_TRIP_SEL << 9) | (MW_EPWMXBAR3_DEL10_TRIP_SEL << 10) | (MW_EPWMXBAR3_DEL11_TRIP_SEL << 11) | (MW_EPWMXBAR3_DEL12_TRIP_SEL << 12) | (MW_EPWMXBAR3_DEL13_TRIP_SEL << 13) | (MW_EPWMXBAR3_DEL14_TRIP_SEL << 14) | (MW_EPWMXBAR3_DEL15_TRIP_SEL << 15) | (MW_EPWMXBAR3_DEL16_TRIP_SEL << 16) | (MW_EPWMXBAR3_DEL17_TRIP_SEL << 17) | (MW_EPWMXBAR3_DEL18_TRIP_SEL << 18) | (MW_EPWMXBAR3_DEL19_TRIP_SEL << 19) | (MW_EPWMXBAR3_DEL20_TRIP_SEL << 20) | (MW_EPWMXBAR3_DEL21_TRIP_SEL << 21) | (MW_EPWMXBAR3_DEL22_TRIP_SEL << 22) | (MW_EPWMXBAR3_DEL23_TRIP_SEL << 23) | (MW_EPWMXBAR3_DEL24_TRIP_SEL << 24) | (MW_EPWMXBAR3_DEL25_TRIP_SEL << 25) | (MW_EPWMXBAR3_DEL26_TRIP_SEL << 26) | (MW_EPWMXBAR3_DEL27_TRIP_SEL << 27) | (MW_EPWMXBAR3_DEL28_TRIP_SEL << 28) | (MW_EPWMXBAR3_DEL29_TRIP_SEL << 29) | (MW_EPWMXBAR3_DEL30_TRIP_SEL << 30) | (MW_EPWMXBAR3_DEL31_TRIP_SEL << 31);
    group7_epwmxbar[3] = (MW_EPWMXBAR3_DEL0_ACTIVE_SEL << 0) | (MW_EPWMXBAR3_DEL1_ACTIVE_SEL << 1) | (MW_EPWMXBAR3_DEL2_ACTIVE_SEL << 2) | (MW_EPWMXBAR3_DEL3_ACTIVE_SEL << 3) | (MW_EPWMXBAR3_DEL4_ACTIVE_SEL << 4) | (MW_EPWMXBAR3_DEL5_ACTIVE_SEL << 5) | (MW_EPWMXBAR3_DEL6_ACTIVE_SEL << 6) | (MW_EPWMXBAR3_DEL7_ACTIVE_SEL << 7) | (MW_EPWMXBAR3_DEL8_ACTIVE_SEL << 8) | (MW_EPWMXBAR3_DEL9_ACTIVE_SEL << 9) | (MW_EPWMXBAR3_DEL10_ACTIVE_SEL << 10) | (MW_EPWMXBAR3_DEL11_ACTIVE_SEL << 11) | (MW_EPWMXBAR3_DEL12_ACTIVE_SEL << 12) | (MW_EPWMXBAR3_DEL13_ACTIVE_SEL << 13) | (MW_EPWMXBAR3_DEL14_ACTIVE_SEL << 14) | (MW_EPWMXBAR3_DEL15_ACTIVE_SEL << 15) | (MW_EPWMXBAR3_DEL16_ACTIVE_SEL << 16) | (MW_EPWMXBAR3_DEL17_ACTIVE_SEL << 17) | (MW_EPWMXBAR3_DEL18_ACTIVE_SEL << 18) | (MW_EPWMXBAR3_DEL19_ACTIVE_SEL << 19) | (MW_EPWMXBAR3_DEL20_ACTIVE_SEL << 20) | (MW_EPWMXBAR3_DEL21_ACTIVE_SEL << 21) | (MW_EPWMXBAR3_DEL22_ACTIVE_SEL << 22) | (MW_EPWMXBAR3_DEL23_ACTIVE_SEL << 23) | (MW_EPWMXBAR3_DEL24_ACTIVE_SEL << 24) | (MW_EPWMXBAR3_DEL25_ACTIVE_SEL << 25) | (MW_EPWMXBAR3_DEL26_ACTIVE_SEL << 26) | (MW_EPWMXBAR3_DEL27_ACTIVE_SEL << 27) | (MW_EPWMXBAR3_DEL28_ACTIVE_SEL << 28) | (MW_EPWMXBAR3_DEL29_ACTIVE_SEL << 29) | (MW_EPWMXBAR3_DEL30_ACTIVE_SEL << 30) | (MW_EPWMXBAR3_DEL31_ACTIVE_SEL << 31);
    group8_epwmxbar[3] = (MW_EPWMXBAR3_EQEP0_ERR_SEL << 0) | (MW_EPWMXBAR3_EQEP1_ERR_SEL << 1) | (MW_EPWMXBAR3_EQEP2_ERR_SEL << 2) | (MW_EPWMXBAR3_FSIRX0_RX_TRIG0_SEL << 3) | (MW_EPWMXBAR3_FSIRX0_RX_TRIG1_SEL << 4) | (MW_EPWMXBAR3_FSIRX0_RX_TRIG2_SEL << 5) | (MW_EPWMXBAR3_FSIRX0_RX_TRIG3_SEL << 6) | (MW_EPWMXBAR3_FSIRX1_RX_TRIG0_SEL << 7) | (MW_EPWMXBAR3_FSIRX1_RX_TRIG1_SEL << 8) | (MW_EPWMXBAR3_FSIRX1_RX_TRIG2_SEL << 9) | (MW_EPWMXBAR3_FSIRX1_RX_TRIG3_SEL << 10) | (MW_EPWMXBAR3_FSIRX2_RX_TRIG0_SEL << 11) | (MW_EPWMXBAR3_FSIRX2_RX_TRIG1_SEL << 12) | (MW_EPWMXBAR3_FSIRX2_RX_TRIG2_SEL << 13) | (MW_EPWMXBAR3_FSIRX2_RX_TRIG3_SEL << 14) | (MW_EPWMXBAR3_FSIRX3_RX_TRIG0_SEL << 15) | (MW_EPWMXBAR3_FSIRX3_RX_TRIG1_SEL << 16) | (MW_EPWMXBAR3_FSIRX3_RX_TRIG2_SEL << 17) | (MW_EPWMXBAR3_FSIRX3_RX_TRIG3_SEL << 18) | (MW_EPWMXBAR3_ECAP0_TRIPOUT_SEL << 19) | (MW_EPWMXBAR3_ECAP1_TRIPOUT_SEL << 20) | (MW_EPWMXBAR3_ECAP2_TRIPOUT_SEL << 21) | (MW_EPWMXBAR3_ECAP3_TRIPOUT_SEL << 22) | (MW_EPWMXBAR3_ECAP4_TRIPOUT_SEL << 23) | (MW_EPWMXBAR3_ECAP5_TRIPOUT_SEL << 24) | (MW_EPWMXBAR3_ECAP6_TRIPOUT_SEL << 25) | (MW_EPWMXBAR3_ECAP7_TRIPOUT_SEL << 26) | (MW_EPWMXBAR3_ECAP8_TRIPOUT_SEL << 27) | (MW_EPWMXBAR3_ECAP9_TRIPOUT_SEL << 28);
    group0_epwmxbar[4] = (MW_EPWMXBAR4_CMPSSA0_CTRIPL_SEL << 0) | (MW_EPWMXBAR4_CMPSSA0_CTRIPH_SEL << 1) | (MW_EPWMXBAR4_CMPSSA1_CTRIPL_SEL << 2) | (MW_EPWMXBAR4_CMPSSA1_CTRIPH_SEL << 3) | (MW_EPWMXBAR4_CMPSSA2_CTRIPL_SEL << 4) | (MW_EPWMXBAR4_CMPSSA2_CTRIPH_SEL << 5) | (MW_EPWMXBAR4_CMPSSA3_CTRIPL_SEL << 6) | (MW_EPWMXBAR4_CMPSSA3_CTRIPH_SEL << 7) | (MW_EPWMXBAR4_CMPSSA4_CTRIPL_SEL << 8) | (MW_EPWMXBAR4_CMPSSA4_CTRIPH_SEL << 9) | (MW_EPWMXBAR4_CMPSSA5_CTRIPL_SEL << 10) | (MW_EPWMXBAR4_CMPSSA5_CTRIPH_SEL << 11) | (MW_EPWMXBAR4_CMPSSA6_CTRIPL_SEL << 12) | (MW_EPWMXBAR4_CMPSSA6_CTRIPH_SEL << 13) | (MW_EPWMXBAR4_CMPSSA7_CTRIPL_SEL << 14) | (MW_EPWMXBAR4_CMPSSA7_CTRIPH_SEL << 15) | (MW_EPWMXBAR4_CMPSSA8_CTRIPL_SEL << 16) | (MW_EPWMXBAR4_CMPSSA8_CTRIPH_SEL << 17) | (MW_EPWMXBAR4_CMPSSA9_CTRIPL_SEL << 18) | (MW_EPWMXBAR4_CMPSSA9_CTRIPH_SEL << 19);
    group1_epwmxbar[4] = (MW_EPWMXBAR4_CMPSSB0_CTRIPL_SEL << 0) | (MW_EPWMXBAR4_CMPSSB0_CTRIPH_SEL << 1) | (MW_EPWMXBAR4_CMPSSB1_CTRIPL_SEL << 2) | (MW_EPWMXBAR4_CMPSSB1_CTRIPH_SEL << 3) | (MW_EPWMXBAR4_CMPSSB2_CTRIPL_SEL << 4) | (MW_EPWMXBAR4_CMPSSB2_CTRIPH_SEL << 5) | (MW_EPWMXBAR4_CMPSSB3_CTRIPL_SEL << 6) | (MW_EPWMXBAR4_CMPSSB3_CTRIPH_SEL << 7) | (MW_EPWMXBAR4_CMPSSB4_CTRIPL_SEL << 8) | (MW_EPWMXBAR4_CMPSSB4_CTRIPH_SEL << 9) | (MW_EPWMXBAR4_CMPSSB5_CTRIPL_SEL << 10) | (MW_EPWMXBAR4_CMPSSB5_CTRIPH_SEL << 11) | (MW_EPWMXBAR4_CMPSSB6_CTRIPL_SEL << 12) | (MW_EPWMXBAR4_CMPSSB6_CTRIPH_SEL << 13) | (MW_EPWMXBAR4_CMPSSB7_CTRIPL_SEL << 14) | (MW_EPWMXBAR4_CMPSSB7_CTRIPH_SEL << 15) | (MW_EPWMXBAR4_CMPSSB8_CTRIPL_SEL << 16) | (MW_EPWMXBAR4_CMPSSB8_CTRIPH_SEL << 17) | (MW_EPWMXBAR4_CMPSSB9_CTRIPL_SEL << 18) | (MW_EPWMXBAR4_CMPSSB9_CTRIPH_SEL << 19);
    group2_epwmxbar[4] = (MW_EPWMXBAR4_SD0_FILT0_CEVT1_SEL << 0) | (MW_EPWMXBAR4_SD0_FILT0_CEVT2_SEL << 1) | (MW_EPWMXBAR4_SD0_FILT0_CMPHZ_SEL << 2) | (MW_EPWMXBAR4_SD0_FILT1_CEVT1_SEL << 3) | (MW_EPWMXBAR4_SD0_FILT1_CEVT2_SEL << 4) | (MW_EPWMXBAR4_SD0_FILT1_CMPHZ_SEL << 5) | (MW_EPWMXBAR4_SD0_FILT2_CEVT1_SEL << 6) | (MW_EPWMXBAR4_SD0_FILT2_CEVT2_SEL << 7) | (MW_EPWMXBAR4_SD0_FILT2_CMPHZ_SEL << 8) | (MW_EPWMXBAR4_SD0_FILT3_CEVT1_SEL << 9) | (MW_EPWMXBAR4_SD0_FILT3_CEVT2_SEL << 10) | (MW_EPWMXBAR4_SD0_FILT3_CMPHZ_SEL << 11) | (MW_EPWMXBAR4_SD1_FILT0_CEVT1_SEL << 12) | (MW_EPWMXBAR4_SD1_FILT0_CEVT2_SEL << 13) | (MW_EPWMXBAR4_SD1_FILT0_CMPHZ_SEL << 14) | (MW_EPWMXBAR4_SD1_FILT1_CEVT1_SEL << 15) | (MW_EPWMXBAR4_SD1_FILT1_CEVT2_SEL << 16) | (MW_EPWMXBAR4_SD1_FILT1_CMPHZ_SEL << 17) | (MW_EPWMXBAR4_SD1_FILT2_CEVT1_SEL << 18) | (MW_EPWMXBAR4_SD1_FILT2_CEVT2_SEL << 19) | (MW_EPWMXBAR4_SD1_FILT2_CMPHZ_SEL << 20) | (MW_EPWMXBAR4_SD1_FILT3_CEVT1_SEL << 21) | (MW_EPWMXBAR4_SD1_FILT3_CEVT2_SEL << 22) | (MW_EPWMXBAR4_SD1_FILT3_CMPHZ_SEL << 23);
    group3_epwmxbar[4] = (MW_EPWMXBAR4_ADC0_EVT1_SEL << 0) | (MW_EPWMXBAR4_ADC0_EVT2_SEL << 1) | (MW_EPWMXBAR4_ADC0_EVT3_SEL << 2) | (MW_EPWMXBAR4_ADC0_EVT4_SEL << 3) | (MW_EPWMXBAR4_ADC1_EVT1_SEL << 4) | (MW_EPWMXBAR4_ADC1_EVT2_SEL << 5) | (MW_EPWMXBAR4_ADC1_EVT3_SEL << 6) | (MW_EPWMXBAR4_ADC1_EVT4_SEL << 7) | (MW_EPWMXBAR4_ADC2_EVT1_SEL << 8) | (MW_EPWMXBAR4_ADC2_EVT2_SEL << 9) | (MW_EPWMXBAR4_ADC2_EVT3_SEL << 10) | (MW_EPWMXBAR4_ADC2_EVT4_SEL << 11) | (MW_EPWMXBAR4_ADC3_EVT1_SEL << 12) | (MW_EPWMXBAR4_ADC3_EVT2_SEL << 13) | (MW_EPWMXBAR4_ADC3_EVT3_SEL << 14) | (MW_EPWMXBAR4_ADC3_EVT4_SEL << 15) | (MW_EPWMXBAR4_ADC4_EVT1_SEL << 16) | (MW_EPWMXBAR4_ADC4_EVT2_SEL << 17) | (MW_EPWMXBAR4_ADC4_EVT3_SEL << 18) | (MW_EPWMXBAR4_ADC4_EVT4_SEL << 19);
