TexasInstruments/am26x-hsp/src/am263px_init.c
    // if(MW_EPWMXBAR4_GPIO0_SEL == 1 | MW_EPWMXBAR4_GPIO1_SEL == 1 | MW_EPWMXBAR4_GPIO2_SEL == 1 | MW_EPWMXBAR4_GPIO3_SEL == 1 | MW_EPWMXBAR4_GPIO4_SEL == 1 | MW_EPWMXBAR4_GPIO5_SEL == 1 | MW_EPWMXBAR4_GPIO6_SEL == 1 | MW_EPWMXBAR4_GPIO7_SEL == 1| MW_EPWMXBAR4_GPIO8_SEL == 1 | MW_EPWMXBAR4_GPIO9_SEL == 1 | MW_EPWMXBAR4_GPIO10_SEL == 1| MW_EPWMXBAR4_GPIO11_SEL == 1| MW_EPWMXBAR4_GPIO12_SEL == 1 | MW_EPWMXBAR4_GPIO13_SEL == 1 | MW_EPWMXBAR4_GPIO14_SEL == 1 | MW_EPWMXBAR4_GPIO15_SEL == 1 | MW_EPWMXBAR4_GPIO16_SEL == 1 | MW_EPWMXBAR4_GPIO17_SEL == 1 | MW_EPWMXBAR4_GPIO18_SEL == 1 | MW_EPWMXBAR4_GPIO19_SEL == 1 | MW_EPWMXBAR4_GPIO20_SEL == 1 | MW_EPWMXBAR4_GPIO21_SEL == 1 | MW_EPWMXBAR4_GPIO22_SEL == 1 | MW_EPWMXBAR4_GPIO23_SEL == 1 | MW_EPWMXBAR4_GPIO24_SEL == 1 | MW_EPWMXBAR4_GPIO25_SEL == 1 | MW_EPWMXBAR4_GPIO26_SEL == 1 | MW_EPWMXBAR4_GPIO27_SEL == 1 | MW_EPWMXBAR4_GPIO28_SEL == 1 | MW_EPWMXBAR4_GPIO29_SEL == 1 | MW_EPWMXBAR4_GPIO30_SEL == 1 | MW_EPWMXBAR4_GPIO31_SEL == 1 | MW_EPWMXBAR4_GPIO32_SEL == 1 | MW_EPWMXBAR4_GPIO33_SEL == 1 | MW_EPWMXBAR4_GPIO34_SEL == 1 | MW_EPWMXBAR4_GPIO35_SEL == 1 | MW_EPWMXBAR4_GPIO36_SEL == 1 | MW_EPWMXBAR4_GPIO37_SEL == 1 | MW_EPWMXBAR4_GPIO38_SEL == 1 | MW_EPWMXBAR4_GPIO39_SEL == 1 | MW_EPWMXBAR4_GPIO40_SEL == 1 | MW_EPWMXBAR4_GPIO41_SEL == 1 | MW_EPWMXBAR4_GPIO42_SEL == 1 | MW_EPWMXBAR4_GPIO43_SEL == 1 | MW_EPWMXBAR4_GPIO44_SEL == 1 | | MW_EPWMXBAR4_GPIO45_SEL == 1 | MW_EPWMXBAR4_GPIO46_SEL == 1 | MW_EPWMXBAR4_GPIO47_SEL == 1| MW_EPWMXBAR4_GPIO48_SEL == 1 | MW_EPWMXBAR4_GPIO49_SEL == 1 | MW_EPWMXBAR4_GPIO50_SEL == 1 | MW_EPWMXBAR4_GPIO51_SEL == 1 | MW_EPWMXBAR4_GPIO52_SEL == 1 | MW_EPWMXBAR4_GPIO53_SEL == 1 | MW_EPWMXBAR4_GPIO54_SEL == 1 | MW_EPWMXBAR4_GPIO55_SEL == 1 | MW_EPWMXBAR4_GPIO56_SEL == 1 | MW_EPWMXBAR4_GPIO57_SEL == 1| MW_EPWMXBAR4_GPIO58_SEL == 1 | MW_EPWMXBAR4_GPIO59_SEL == 1 | MW_EPWMXBAR4_GPIO60_SEL == 1 | MW_EPWMXBAR4_GPIO61_SEL == 1 | MW_EPWMXBAR4_GPIO62_SEL == 1 | MW_EPWMXBAR4_GPIO63_SEL == 1 | MW_EPWMXBAR4_GPIO64_SEL == 1 | | MW_EPWMXBAR4_GPIO59_SEL == 1 | MW_EPWMXBAR4_GPIO60_SEL == 1 | MW_EPWMXBAR4_GPIO61_SEL == 1 | MW_EPWMXBAR4_GPIO62_SEL == 1 | MW_EPWMXBAR4_GPIO63_SEL == 1 | MW_EPWMXBAR4_GPIO64_SEL == 1 | MW_EPWMXBAR4_GPIO65_SEL == 1 | MW_EPWMXBAR4_GPIO66_SEL == 1 | MW_EPWMXBAR4_GPIO67_SEL == 1 | MW_EPWMXBAR4_GPIO68_SEL == 1 | MW_EPWMXBAR4_GPIO69_SEL == 1 | MW_EPWMXBAR4_GPIO70_SEL == 1 | MW_EPWMXBAR4_GPIO71_SEL == 1 | MW_EPWMXBAR4_GPIO72_SEL == 1 | MW_EPWMXBAR4_GPIO73_SEL == 1 | MW_EPWMXBAR4_GPIO74_SEL == 1 | MW_EPWMXBAR4_GPIO75_SEL == 1 | MW_EPWMXBAR4_GPIO76_SEL == 1 | MW_EPWMXBAR4_GPIO77_SEL == 1 | MW_EPWMXBAR4_GPIO78_SEL == 1 | | MW_EPWMXBAR4_GPIO80_SEL == 1 | MW_EPWMXBAR4_GPIO81_SEL == 1 | MW_EPWMXBAR4_GPIO82_SEL == 1 | MW_EPWMXBAR4_GPIO83_SEL == 1 | MW_EPWMXBAR4_GPIO84_SEL == 1 | MW_EPWMXBAR4_GPIO85_SEL == 1 | MW_EPWMXBAR4_GPIO86_SEL == 1 | MW_EPWMXBAR4_GPIO87_SEL == 1 | MW_EPWMXBAR4_GPIO88_SEL == 1 | MW_EPWMXBAR4_GPIO89_SEL == 1 | MW_EPWMXBAR4_GPIO90_SEL == 1 | MW_EPWMXBAR4_GPIO91_SEL == 1 | MW_EPWMXBAR4_GPIO92_SEL == 1 | MW_EPWMXBAR4_GPIO93_SEL == 1 | MW_EPWMXBAR4_GPIO94_SEL == 1 | MW_EPWMXBAR4_GPIO95_SEL == 1 | MW_EPWMXBAR4_GPIO96_SEL == 1 | MW_EPWMXBAR4_GPIO97_SEL == 1 | MW_EPWMXBAR4_GPIO98_SEL == 1 | MW_EPWMXBAR4_GPIO99_SEL == 1 | MW_EPWMXBAR4_GPIO100_SEL == 1 | MW_EPWMXBAR4_GPIO101_SEL == 1 | MW_EPWMXBAR4_GPIO102_SEL == 1 | MW_EPWMXBAR4_GPIO103_SEL == 1 | MW_EPWMXBAR4_GPIO104_SEL == 1 | MW_EPWMXBAR4_GPIO105_SEL == 1 | MW_EPWMXBAR4_GPIO106_SEL == 1 | MW_EPWMXBAR4_GPIO107_SEL == 1 | | MW_EPWMXBAR4_GPIO108_SEL == 1 | MW_EPWMXBAR4_GPIO109_SEL == 1| MW_EPWMXBAR4_GPIO110_SEL == 1 | MW_EPWMXBAR4_GPIO111_SEL == 1 | MW_EPWMXBAR4_GPIO112_SEL == 1 | MW_EPWMXBAR4_GPIO113_SEL == 1 | MW_EPWMXBAR4_GPIO114_SEL == 1 | MW_EPWMXBAR4_GPIO115_SEL == 1 | MW_EPWMXBAR4_GPIO116_SEL == 1 | MW_EPWMXBAR4_GPIO117_SEL == 1 | MW_EPWMXBAR4_GPIO118_SEL == 1 | MW_EPWMXBAR4_GPIO119_SEL == 1 | MW_EPWMXBAR4_GPIO120_SEL == 1 | MW_EPWMXBAR4_GPIO121_SEL == 1 | MW_EPWMXBAR4_GPIO122_SEL == 1 | MW_EPWMXBAR4_GPIO123_SEL == 1 | MW_EPWMXBAR4_GPIO124_SEL == 1 | MW_EPWMXBAR4_GPIO125_SEL == 1 | MW_EPWMXBAR4_GPIO126_SEL == 1 | MW_EPWMXBAR4_GPIO127_SEL == 1 | MW_EPWMXBAR4_GPIO128_SEL == 1 | MW_EPWMXBAR4_GPIO129_SEL == 1 | MW_EPWMXBAR4_GPIO130_SEL == 1 | MW_EPWMXBAR4_GPIO131_SEL == 1 | MW_EPWMXBAR4_GPIO132_SEL == 1 | MW_EPWMXBAR4_GPIO133_SEL == 1 | MW_EPWMXBAR4_GPIO134_SEL == 1 | MW_EPWMXBAR4_GPIO135_SEL == 1 | MW_EPWMXBAR4_GPIO136_SEL == 1 | MW_EPWMXBAR4_GPIO137_SEL == 1 | MW_EPWMXBAR4_GPIO139_SEL == 1 | MW_EPWMXBAR4_GPIO140_SEL == 1 | MW_EPWMXBAR4_GPIO141_SEL == 1 | MW_EPWMXBAR4_GPIO142_SEL == 1 | MW_EPWMXBAR4_GPIO143_SEL == 1 | MW_EPWMXBAR4_ICSSGPO0_PORT0_SEL == 1 | MW_EPWMXBAR4_ICSSGPO1_PORT0_SEL == 1 | MW_EPWMXBAR4_ICSSGPO2_PORT0_SEL == 1 | MW_EPWMXBAR4_ICSSGPO3_PORT0_SEL == 1 | MW_EPWMXBAR4_ICSSGPO4_PORT0_SEL == 1 | MW_EPWMXBAR4_ICSSGPO5_PORT0_SEL == 1 | MW_EPWMXBAR4_ICSSGPO6_PORT0_SEL == 1 | MW_EPWMXBAR4_ICSSGPO7_PORT0_SEL == 1 | MW_EPWMXBAR4_ICSSGPO8_PORT0_SEL == 1 | MW_EPWMXBAR4_ICSSGPO9_PORT0_SEL == 1 | MW_EPWMXBAR4_ICSSGPO10_PORT0_SEL == 1 | MW_EPWMXBAR4_ICSSGPO11_PORT0_SEL == 1 | MW_EPWMXBAR4_ICSSGPO12_PORT0_SEL == 1 | MW_EPWMXBAR4_ICSSGPO13_PORT0_SEL == 1 | MW_EPWMXBAR4_ICSSGPO14_PORT0_SEL == 1 | MW_EPWMXBAR4_ICSSGPO15_PORT0_SEL == 1 | MW_EPWMXBAR4_ICSSGPO0_PORT1_SEL == 1 | MW_EPWMXBAR4_ICSSGPO1_PORT1_SEL == 1 | MW_EPWMXBAR4_ICSSGPO2_PORT1_SEL == 1 | MW_EPWMXBAR4_ICSSGPO3_PORT1_SEL == 1 | MW_EPWMXBAR4_ICSSGPO4_PORT1_SEL == 1 | MW_EPWMXBAR4_ICSSGPO5_PORT1_SEL == 1 | MW_EPWMXBAR4_ICSSGPO6_PORT1_SEL == 1 | MW_EPWMXBAR4_ICSSGPO7_PORT1_SEL == 1 | MW_EPWMXBAR4_ICSSGPO8_PORT1_SEL == 1 | MW_EPWMXBAR4_ICSSGPO9_PORT1_SEL == 1 | MW_EPWMXBAR4_ICSSGPO10_PORT1_SEL == 1 | MW_EPWMXBAR4_ICSSGPO11_PORT1_SEL == 1 | MW_EPWMXBAR4_ICSSGPO12_PORT1_SEL == 1 | MW_EPWMXBAR4_ICSSGPO13_PORT1_SEL == 1 | MW_EPWMXBAR4_ICSSGPO14_PORT1_SEL == 1 | MW_EPWMXBAR4_ICSSGPO15_PORT1_SEL == 1)
    //     group4_epwmxbar[4] = EPWM_XBAR_4;
    // else
        group4_epwmxbar[4] = 0;
    group5_epwmxbar[4] = (MW_EPWMXBAR4_EPWM0_TRIPOUT_SEL << 0) | (MW_EPWMXBAR4_EPWM1_TRIPOUT_SEL << 1) | (MW_EPWMXBAR4_EPWM2_TRIPOUT_SEL << 2) | (MW_EPWMXBAR4_EPWM3_TRIPOUT_SEL << 3) | (MW_EPWMXBAR4_EPWM4_TRIPOUT_SEL << 4) | (MW_EPWMXBAR4_EPWM5_TRIPOUT_SEL << 5) | (MW_EPWMXBAR4_EPWM6_TRIPOUT_SEL << 6) | (MW_EPWMXBAR4_EPWM7_TRIPOUT_SEL << 7) | (MW_EPWMXBAR4_EPWM8_TRIPOUT_SEL << 8) | (MW_EPWMXBAR4_EPWM9_TRIPOUT_SEL << 9) | (MW_EPWMXBAR4_EPWM10_TRIPOUT_SEL << 10) | (MW_EPWMXBAR4_EPWM11_TRIPOUT_SEL << 11) | (MW_EPWMXBAR4_EPWM12_TRIPOUT_SEL << 12) | (MW_EPWMXBAR4_EPWM13_TRIPOUT_SEL << 13) | (MW_EPWMXBAR4_EPWM14_TRIPOUT_SEL << 14) | (MW_EPWMXBAR4_EPWM15_TRIPOUT_SEL << 15) | (MW_EPWMXBAR4_EPWM16_TRIPOUT_SEL << 16) | (MW_EPWMXBAR4_EPWM17_TRIPOUT_SEL << 17) | (MW_EPWMXBAR4_EPWM18_TRIPOUT_SEL << 18) | (MW_EPWMXBAR4_EPWM19_TRIPOUT_SEL << 19) | (MW_EPWMXBAR4_EPWM20_TRIPOUT_SEL << 20) | (MW_EPWMXBAR4_EPWM21_TRIPOUT_SEL << 21) | (MW_EPWMXBAR4_EPWM22_TRIPOUT_SEL << 22) | (MW_EPWMXBAR4_EPWM23_TRIPOUT_SEL << 23) | (MW_EPWMXBAR4_EPWM24_TRIPOUT_SEL << 24) | (MW_EPWMXBAR4_EPWM25_TRIPOUT_SEL << 25) | (MW_EPWMXBAR4_EPWM26_TRIPOUT_SEL << 26) | (MW_EPWMXBAR4_EPWM27_TRIPOUT_SEL << 27) | (MW_EPWMXBAR4_EPWM28_TRIPOUT_SEL << 28) | (MW_EPWMXBAR4_EPWM29_TRIPOUT_SEL << 29) | (MW_EPWMXBAR4_EPWM30_TRIPOUT_SEL << 30) | (MW_EPWMXBAR4_EPWM31_TRIPOUT_SEL << 31);
    group6_epwmxbar[4] = (MW_EPWMXBAR4_DEL0_TRIP_SEL << 0) | (MW_EPWMXBAR4_DEL1_TRIP_SEL << 1) | (MW_EPWMXBAR4_DEL2_TRIP_SEL << 2) | (MW_EPWMXBAR4_DEL3_TRIP_SEL << 3) | (MW_EPWMXBAR4_DEL4_TRIP_SEL << 4) | (MW_EPWMXBAR4_DEL5_TRIP_SEL << 5) | (MW_EPWMXBAR4_DEL6_TRIP_SEL << 6) | (MW_EPWMXBAR4_DEL7_TRIP_SEL << 7) | (MW_EPWMXBAR4_DEL8_TRIP_SEL << 8) | (MW_EPWMXBAR4_DEL9_TRIP_SEL << 9) | (MW_EPWMXBAR4_DEL10_TRIP_SEL << 10) | (MW_EPWMXBAR4_DEL11_TRIP_SEL << 11) | (MW_EPWMXBAR4_DEL12_TRIP_SEL << 12) | (MW_EPWMXBAR4_DEL13_TRIP_SEL << 13) | (MW_EPWMXBAR4_DEL14_TRIP_SEL << 14) | (MW_EPWMXBAR4_DEL15_TRIP_SEL << 15) | (MW_EPWMXBAR4_DEL16_TRIP_SEL << 16) | (MW_EPWMXBAR4_DEL17_TRIP_SEL << 17) | (MW_EPWMXBAR4_DEL18_TRIP_SEL << 18) | (MW_EPWMXBAR4_DEL19_TRIP_SEL << 19) | (MW_EPWMXBAR4_DEL20_TRIP_SEL << 20) | (MW_EPWMXBAR4_DEL21_TRIP_SEL << 21) | (MW_EPWMXBAR4_DEL22_TRIP_SEL << 22) | (MW_EPWMXBAR4_DEL23_TRIP_SEL << 23) | (MW_EPWMXBAR4_DEL24_TRIP_SEL << 24) | (MW_EPWMXBAR4_DEL25_TRIP_SEL << 25) | (MW_EPWMXBAR4_DEL26_TRIP_SEL << 26) | (MW_EPWMXBAR4_DEL27_TRIP_SEL << 27) | (MW_EPWMXBAR4_DEL28_TRIP_SEL << 28) | (MW_EPWMXBAR4_DEL29_TRIP_SEL << 29) | (MW_EPWMXBAR4_DEL30_TRIP_SEL << 30) | (MW_EPWMXBAR4_DEL31_TRIP_SEL << 31);
    group7_epwmxbar[4] = (MW_EPWMXBAR4_DEL0_ACTIVE_SEL << 0) | (MW_EPWMXBAR4_DEL1_ACTIVE_SEL << 1) | (MW_EPWMXBAR4_DEL2_ACTIVE_SEL << 2) | (MW_EPWMXBAR4_DEL3_ACTIVE_SEL << 3) | (MW_EPWMXBAR4_DEL4_ACTIVE_SEL << 4) | (MW_EPWMXBAR4_DEL5_ACTIVE_SEL << 5) | (MW_EPWMXBAR4_DEL6_ACTIVE_SEL << 6) | (MW_EPWMXBAR4_DEL7_ACTIVE_SEL << 7) | (MW_EPWMXBAR4_DEL8_ACTIVE_SEL << 8) | (MW_EPWMXBAR4_DEL9_ACTIVE_SEL << 9) | (MW_EPWMXBAR4_DEL10_ACTIVE_SEL << 10) | (MW_EPWMXBAR4_DEL11_ACTIVE_SEL << 11) | (MW_EPWMXBAR4_DEL12_ACTIVE_SEL << 12) | (MW_EPWMXBAR4_DEL13_ACTIVE_SEL << 13) | (MW_EPWMXBAR4_DEL14_ACTIVE_SEL << 14) | (MW_EPWMXBAR4_DEL15_ACTIVE_SEL << 15) | (MW_EPWMXBAR4_DEL16_ACTIVE_SEL << 16) | (MW_EPWMXBAR4_DEL17_ACTIVE_SEL << 17) | (MW_EPWMXBAR4_DEL18_ACTIVE_SEL << 18) | (MW_EPWMXBAR4_DEL19_ACTIVE_SEL << 19) | (MW_EPWMXBAR4_DEL20_ACTIVE_SEL << 20) | (MW_EPWMXBAR4_DEL21_ACTIVE_SEL << 21) | (MW_EPWMXBAR4_DEL22_ACTIVE_SEL << 22) | (MW_EPWMXBAR4_DEL23_ACTIVE_SEL << 23) | (MW_EPWMXBAR4_DEL24_ACTIVE_SEL << 24) | (MW_EPWMXBAR4_DEL25_ACTIVE_SEL << 25) | (MW_EPWMXBAR4_DEL26_ACTIVE_SEL << 26) | (MW_EPWMXBAR4_DEL27_ACTIVE_SEL << 27) | (MW_EPWMXBAR4_DEL28_ACTIVE_SEL << 28) | (MW_EPWMXBAR4_DEL29_ACTIVE_SEL << 29) | (MW_EPWMXBAR4_DEL30_ACTIVE_SEL << 30) | (MW_EPWMXBAR4_DEL31_ACTIVE_SEL << 31);
    group8_epwmxbar[4] = (MW_EPWMXBAR4_EQEP0_ERR_SEL << 0) | (MW_EPWMXBAR4_EQEP1_ERR_SEL << 1) | (MW_EPWMXBAR4_EQEP2_ERR_SEL << 2) | (MW_EPWMXBAR4_FSIRX0_RX_TRIG0_SEL << 3) | (MW_EPWMXBAR4_FSIRX0_RX_TRIG1_SEL << 4) | (MW_EPWMXBAR4_FSIRX0_RX_TRIG2_SEL << 5) | (MW_EPWMXBAR4_FSIRX0_RX_TRIG3_SEL << 6) | (MW_EPWMXBAR4_FSIRX1_RX_TRIG0_SEL << 7) | (MW_EPWMXBAR4_FSIRX1_RX_TRIG1_SEL << 8) | (MW_EPWMXBAR4_FSIRX1_RX_TRIG2_SEL << 9) | (MW_EPWMXBAR4_FSIRX1_RX_TRIG3_SEL << 10) | (MW_EPWMXBAR4_FSIRX2_RX_TRIG0_SEL << 11) | (MW_EPWMXBAR4_FSIRX2_RX_TRIG1_SEL << 12) | (MW_EPWMXBAR4_FSIRX2_RX_TRIG2_SEL << 13) | (MW_EPWMXBAR4_FSIRX2_RX_TRIG3_SEL << 14) | (MW_EPWMXBAR4_FSIRX3_RX_TRIG0_SEL << 15) | (MW_EPWMXBAR4_FSIRX3_RX_TRIG1_SEL << 16) | (MW_EPWMXBAR4_FSIRX3_RX_TRIG2_SEL << 17) | (MW_EPWMXBAR4_FSIRX3_RX_TRIG3_SEL << 18) | (MW_EPWMXBAR4_ECAP0_TRIPOUT_SEL << 19) | (MW_EPWMXBAR4_ECAP1_TRIPOUT_SEL << 20) | (MW_EPWMXBAR4_ECAP2_TRIPOUT_SEL << 21) | (MW_EPWMXBAR4_ECAP3_TRIPOUT_SEL << 22) | (MW_EPWMXBAR4_ECAP4_TRIPOUT_SEL << 23) | (MW_EPWMXBAR4_ECAP5_TRIPOUT_SEL << 24) | (MW_EPWMXBAR4_ECAP6_TRIPOUT_SEL << 25) | (MW_EPWMXBAR4_ECAP7_TRIPOUT_SEL << 26) | (MW_EPWMXBAR4_ECAP8_TRIPOUT_SEL << 27) | (MW_EPWMXBAR4_ECAP9_TRIPOUT_SEL << 28);
    group0_epwmxbar[5] = (MW_EPWMXBAR5_CMPSSA0_CTRIPL_SEL << 0) | (MW_EPWMXBAR5_CMPSSA0_CTRIPH_SEL << 1) | (MW_EPWMXBAR5_CMPSSA1_CTRIPL_SEL << 2) | (MW_EPWMXBAR5_CMPSSA1_CTRIPH_SEL << 3) | (MW_EPWMXBAR5_CMPSSA2_CTRIPL_SEL << 4) | (MW_EPWMXBAR5_CMPSSA2_CTRIPH_SEL << 5) | (MW_EPWMXBAR5_CMPSSA3_CTRIPL_SEL << 6) | (MW_EPWMXBAR5_CMPSSA3_CTRIPH_SEL << 7) | (MW_EPWMXBAR5_CMPSSA4_CTRIPL_SEL << 8) | (MW_EPWMXBAR5_CMPSSA4_CTRIPH_SEL << 9) | (MW_EPWMXBAR5_CMPSSA5_CTRIPL_SEL << 10) | (MW_EPWMXBAR5_CMPSSA5_CTRIPH_SEL << 11) | (MW_EPWMXBAR5_CMPSSA6_CTRIPL_SEL << 12) | (MW_EPWMXBAR5_CMPSSA6_CTRIPH_SEL << 13) | (MW_EPWMXBAR5_CMPSSA7_CTRIPL_SEL << 14) | (MW_EPWMXBAR5_CMPSSA7_CTRIPH_SEL << 15) | (MW_EPWMXBAR5_CMPSSA8_CTRIPL_SEL << 16) | (MW_EPWMXBAR5_CMPSSA8_CTRIPH_SEL << 17) | (MW_EPWMXBAR5_CMPSSA9_CTRIPL_SEL << 18) | (MW_EPWMXBAR5_CMPSSA9_CTRIPH_SEL << 19);
    group1_epwmxbar[5] = (MW_EPWMXBAR5_CMPSSB0_CTRIPL_SEL << 0) | (MW_EPWMXBAR5_CMPSSB0_CTRIPH_SEL << 1) | (MW_EPWMXBAR5_CMPSSB1_CTRIPL_SEL << 2) | (MW_EPWMXBAR5_CMPSSB1_CTRIPH_SEL << 3) | (MW_EPWMXBAR5_CMPSSB2_CTRIPL_SEL << 4) | (MW_EPWMXBAR5_CMPSSB2_CTRIPH_SEL << 5) | (MW_EPWMXBAR5_CMPSSB3_CTRIPL_SEL << 6) | (MW_EPWMXBAR5_CMPSSB3_CTRIPH_SEL << 7) | (MW_EPWMXBAR5_CMPSSB4_CTRIPL_SEL << 8) | (MW_EPWMXBAR5_CMPSSB4_CTRIPH_SEL << 9) | (MW_EPWMXBAR5_CMPSSB5_CTRIPL_SEL << 10) | (MW_EPWMXBAR5_CMPSSB5_CTRIPH_SEL << 11) | (MW_EPWMXBAR5_CMPSSB6_CTRIPL_SEL << 12) | (MW_EPWMXBAR5_CMPSSB6_CTRIPH_SEL << 13) | (MW_EPWMXBAR5_CMPSSB7_CTRIPL_SEL << 14) | (MW_EPWMXBAR5_CMPSSB7_CTRIPH_SEL << 15) | (MW_EPWMXBAR5_CMPSSB8_CTRIPL_SEL << 16) | (MW_EPWMXBAR5_CMPSSB8_CTRIPH_SEL << 17) | (MW_EPWMXBAR5_CMPSSB9_CTRIPL_SEL << 18) | (MW_EPWMXBAR5_CMPSSB9_CTRIPH_SEL << 19);
    group2_epwmxbar[5] = (MW_EPWMXBAR5_SD0_FILT0_CEVT1_SEL << 0) | (MW_EPWMXBAR5_SD0_FILT0_CEVT2_SEL << 1) | (MW_EPWMXBAR5_SD0_FILT0_CMPHZ_SEL << 2) | (MW_EPWMXBAR5_SD0_FILT1_CEVT1_SEL << 3) | (MW_EPWMXBAR5_SD0_FILT1_CEVT2_SEL << 4) | (MW_EPWMXBAR5_SD0_FILT1_CMPHZ_SEL << 5) | (MW_EPWMXBAR5_SD0_FILT2_CEVT1_SEL << 6) | (MW_EPWMXBAR5_SD0_FILT2_CEVT2_SEL << 7) | (MW_EPWMXBAR5_SD0_FILT2_CMPHZ_SEL << 8) | (MW_EPWMXBAR5_SD0_FILT3_CEVT1_SEL << 9) | (MW_EPWMXBAR5_SD0_FILT3_CEVT2_SEL << 10) | (MW_EPWMXBAR5_SD0_FILT3_CMPHZ_SEL << 11) | (MW_EPWMXBAR5_SD1_FILT0_CEVT1_SEL << 12) | (MW_EPWMXBAR5_SD1_FILT0_CEVT2_SEL << 13) | (MW_EPWMXBAR5_SD1_FILT0_CMPHZ_SEL << 14) | (MW_EPWMXBAR5_SD1_FILT1_CEVT1_SEL << 15) | (MW_EPWMXBAR5_SD1_FILT1_CEVT2_SEL << 16) | (MW_EPWMXBAR5_SD1_FILT1_CMPHZ_SEL << 17) | (MW_EPWMXBAR5_SD1_FILT2_CEVT1_SEL << 18) | (MW_EPWMXBAR5_SD1_FILT2_CEVT2_SEL << 19) | (MW_EPWMXBAR5_SD1_FILT2_CMPHZ_SEL << 20) | (MW_EPWMXBAR5_SD1_FILT3_CEVT1_SEL << 21) | (MW_EPWMXBAR5_SD1_FILT3_CEVT2_SEL << 22) | (MW_EPWMXBAR5_SD1_FILT3_CMPHZ_SEL << 23);
    group3_epwmxbar[5] = (MW_EPWMXBAR5_ADC0_EVT1_SEL << 0) | (MW_EPWMXBAR5_ADC0_EVT2_SEL << 1) | (MW_EPWMXBAR5_ADC0_EVT3_SEL << 2) | (MW_EPWMXBAR5_ADC0_EVT4_SEL << 3) | (MW_EPWMXBAR5_ADC1_EVT1_SEL << 4) | (MW_EPWMXBAR5_ADC1_EVT2_SEL << 5) | (MW_EPWMXBAR5_ADC1_EVT3_SEL << 6) | (MW_EPWMXBAR5_ADC1_EVT4_SEL << 7) | (MW_EPWMXBAR5_ADC2_EVT1_SEL << 8) | (MW_EPWMXBAR5_ADC2_EVT2_SEL << 9) | (MW_EPWMXBAR5_ADC2_EVT3_SEL << 10) | (MW_EPWMXBAR5_ADC2_EVT4_SEL << 11) | (MW_EPWMXBAR5_ADC3_EVT1_SEL << 12) | (MW_EPWMXBAR5_ADC3_EVT2_SEL << 13) | (MW_EPWMXBAR5_ADC3_EVT3_SEL << 14) | (MW_EPWMXBAR5_ADC3_EVT4_SEL << 15) | (MW_EPWMXBAR5_ADC4_EVT1_SEL << 16) | (MW_EPWMXBAR5_ADC4_EVT2_SEL << 17) | (MW_EPWMXBAR5_ADC4_EVT3_SEL << 18) | (MW_EPWMXBAR5_ADC4_EVT4_SEL << 19);
    // if(MW_EPWMXBAR5_GPIO0_SEL == 1 | MW_EPWMXBAR5_GPIO1_SEL == 1 | MW_EPWMXBAR5_GPIO2_SEL == 1 | MW_EPWMXBAR5_GPIO3_SEL == 1 | MW_EPWMXBAR5_GPIO4_SEL == 1 | MW_EPWMXBAR5_GPIO5_SEL == 1 | MW_EPWMXBAR5_GPIO6_SEL == 1 | MW_EPWMXBAR5_GPIO7_SEL == 1| MW_EPWMXBAR5_GPIO8_SEL == 1 | MW_EPWMXBAR5_GPIO9_SEL == 1 | MW_EPWMXBAR5_GPIO10_SEL == 1| MW_EPWMXBAR5_GPIO11_SEL == 1| MW_EPWMXBAR5_GPIO12_SEL == 1 | MW_EPWMXBAR5_GPIO13_SEL == 1 | MW_EPWMXBAR5_GPIO14_SEL == 1 | MW_EPWMXBAR5_GPIO15_SEL == 1 | MW_EPWMXBAR5_GPIO16_SEL == 1 | MW_EPWMXBAR5_GPIO17_SEL == 1 | MW_EPWMXBAR5_GPIO18_SEL == 1 | MW_EPWMXBAR5_GPIO19_SEL == 1 | MW_EPWMXBAR5_GPIO20_SEL == 1 | MW_EPWMXBAR5_GPIO21_SEL == 1 | MW_EPWMXBAR5_GPIO22_SEL == 1 | MW_EPWMXBAR5_GPIO23_SEL == 1 | MW_EPWMXBAR5_GPIO24_SEL == 1 | MW_EPWMXBAR5_GPIO25_SEL == 1 | MW_EPWMXBAR5_GPIO26_SEL == 1 | MW_EPWMXBAR5_GPIO27_SEL == 1 | MW_EPWMXBAR5_GPIO28_SEL == 1 | MW_EPWMXBAR5_GPIO29_SEL == 1 | MW_EPWMXBAR5_GPIO30_SEL == 1 | MW_EPWMXBAR5_GPIO31_SEL == 1 | MW_EPWMXBAR5_GPIO32_SEL == 1 | MW_EPWMXBAR5_GPIO33_SEL == 1 | MW_EPWMXBAR5_GPIO34_SEL == 1 | MW_EPWMXBAR5_GPIO35_SEL == 1 | MW_EPWMXBAR5_GPIO36_SEL == 1 | MW_EPWMXBAR5_GPIO37_SEL == 1 | MW_EPWMXBAR5_GPIO38_SEL == 1 | MW_EPWMXBAR5_GPIO39_SEL == 1 | MW_EPWMXBAR5_GPIO40_SEL == 1 | MW_EPWMXBAR5_GPIO41_SEL == 1 | MW_EPWMXBAR5_GPIO42_SEL == 1 | MW_EPWMXBAR5_GPIO43_SEL == 1 | MW_EPWMXBAR5_GPIO44_SEL == 1 | | MW_EPWMXBAR5_GPIO45_SEL == 1 | MW_EPWMXBAR5_GPIO46_SEL == 1 | MW_EPWMXBAR5_GPIO47_SEL == 1| MW_EPWMXBAR5_GPIO48_SEL == 1 | MW_EPWMXBAR5_GPIO49_SEL == 1 | MW_EPWMXBAR5_GPIO50_SEL == 1 | MW_EPWMXBAR5_GPIO51_SEL == 1 | MW_EPWMXBAR5_GPIO52_SEL == 1 | MW_EPWMXBAR5_GPIO53_SEL == 1 | MW_EPWMXBAR5_GPIO54_SEL == 1 | MW_EPWMXBAR5_GPIO55_SEL == 1 | MW_EPWMXBAR5_GPIO56_SEL == 1 | MW_EPWMXBAR5_GPIO57_SEL == 1| MW_EPWMXBAR5_GPIO58_SEL == 1 | MW_EPWMXBAR5_GPIO59_SEL == 1 | MW_EPWMXBAR5_GPIO60_SEL == 1 | MW_EPWMXBAR5_GPIO61_SEL == 1 | MW_EPWMXBAR5_GPIO62_SEL == 1 | MW_EPWMXBAR5_GPIO63_SEL == 1 | MW_EPWMXBAR5_GPIO64_SEL == 1 | | MW_EPWMXBAR5_GPIO59_SEL == 1 | MW_EPWMXBAR5_GPIO60_SEL == 1 | MW_EPWMXBAR5_GPIO61_SEL == 1 | MW_EPWMXBAR5_GPIO62_SEL == 1 | MW_EPWMXBAR5_GPIO63_SEL == 1 | MW_EPWMXBAR5_GPIO64_SEL == 1 | MW_EPWMXBAR5_GPIO65_SEL == 1 | MW_EPWMXBAR5_GPIO66_SEL == 1 | MW_EPWMXBAR5_GPIO67_SEL == 1 | MW_EPWMXBAR5_GPIO68_SEL == 1 | MW_EPWMXBAR5_GPIO69_SEL == 1 | MW_EPWMXBAR5_GPIO70_SEL == 1 | MW_EPWMXBAR5_GPIO71_SEL == 1 | MW_EPWMXBAR5_GPIO72_SEL == 1 | MW_EPWMXBAR5_GPIO73_SEL == 1 | MW_EPWMXBAR5_GPIO74_SEL == 1 | MW_EPWMXBAR5_GPIO75_SEL == 1 | MW_EPWMXBAR5_GPIO76_SEL == 1 | MW_EPWMXBAR5_GPIO77_SEL == 1 | MW_EPWMXBAR5_GPIO78_SEL == 1 | | MW_EPWMXBAR5_GPIO80_SEL == 1 | MW_EPWMXBAR5_GPIO81_SEL == 1 | MW_EPWMXBAR5_GPIO82_SEL == 1 | MW_EPWMXBAR5_GPIO83_SEL == 1 | MW_EPWMXBAR5_GPIO84_SEL == 1 | MW_EPWMXBAR5_GPIO85_SEL == 1 | MW_EPWMXBAR5_GPIO86_SEL == 1 | MW_EPWMXBAR5_GPIO87_SEL == 1 | MW_EPWMXBAR5_GPIO88_SEL == 1 | MW_EPWMXBAR5_GPIO89_SEL == 1 | MW_EPWMXBAR5_GPIO90_SEL == 1 | MW_EPWMXBAR5_GPIO91_SEL == 1 | MW_EPWMXBAR5_GPIO92_SEL == 1 | MW_EPWMXBAR5_GPIO93_SEL == 1 | MW_EPWMXBAR5_GPIO94_SEL == 1 | MW_EPWMXBAR5_GPIO95_SEL == 1 | MW_EPWMXBAR5_GPIO96_SEL == 1 | MW_EPWMXBAR5_GPIO97_SEL == 1 | MW_EPWMXBAR5_GPIO98_SEL == 1 | MW_EPWMXBAR5_GPIO99_SEL == 1 | MW_EPWMXBAR5_GPIO100_SEL == 1 | MW_EPWMXBAR5_GPIO101_SEL == 1 | MW_EPWMXBAR5_GPIO102_SEL == 1 | MW_EPWMXBAR5_GPIO103_SEL == 1 | MW_EPWMXBAR5_GPIO104_SEL == 1 | MW_EPWMXBAR5_GPIO105_SEL == 1 | MW_EPWMXBAR5_GPIO106_SEL == 1 | MW_EPWMXBAR5_GPIO107_SEL == 1 | | MW_EPWMXBAR5_GPIO108_SEL == 1 | MW_EPWMXBAR5_GPIO109_SEL == 1| MW_EPWMXBAR5_GPIO110_SEL == 1 | MW_EPWMXBAR5_GPIO111_SEL == 1 | MW_EPWMXBAR5_GPIO112_SEL == 1 | MW_EPWMXBAR5_GPIO113_SEL == 1 | MW_EPWMXBAR5_GPIO114_SEL == 1 | MW_EPWMXBAR5_GPIO115_SEL == 1 | MW_EPWMXBAR5_GPIO116_SEL == 1 | MW_EPWMXBAR5_GPIO117_SEL == 1 | MW_EPWMXBAR5_GPIO118_SEL == 1 | MW_EPWMXBAR5_GPIO119_SEL == 1 | MW_EPWMXBAR5_GPIO120_SEL == 1 | MW_EPWMXBAR5_GPIO121_SEL == 1 | MW_EPWMXBAR5_GPIO122_SEL == 1 | MW_EPWMXBAR5_GPIO123_SEL == 1 | MW_EPWMXBAR5_GPIO124_SEL == 1 | MW_EPWMXBAR5_GPIO125_SEL == 1 | MW_EPWMXBAR5_GPIO126_SEL == 1 | MW_EPWMXBAR5_GPIO127_SEL == 1 | MW_EPWMXBAR5_GPIO128_SEL == 1 | MW_EPWMXBAR5_GPIO129_SEL == 1 | MW_EPWMXBAR5_GPIO130_SEL == 1 | MW_EPWMXBAR5_GPIO131_SEL == 1 | MW_EPWMXBAR5_GPIO132_SEL == 1 | MW_EPWMXBAR5_GPIO133_SEL == 1 | MW_EPWMXBAR5_GPIO134_SEL == 1 | MW_EPWMXBAR5_GPIO135_SEL == 1 | MW_EPWMXBAR5_GPIO136_SEL == 1 | MW_EPWMXBAR5_GPIO137_SEL == 1 | MW_EPWMXBAR5_GPIO139_SEL == 1 | MW_EPWMXBAR5_GPIO140_SEL == 1 | MW_EPWMXBAR5_GPIO141_SEL == 1 | MW_EPWMXBAR5_GPIO142_SEL == 1 | MW_EPWMXBAR5_GPIO143_SEL == 1 | MW_EPWMXBAR5_ICSSGPO0_PORT0_SEL == 1 | MW_EPWMXBAR5_ICSSGPO1_PORT0_SEL == 1 | MW_EPWMXBAR5_ICSSGPO2_PORT0_SEL == 1 | MW_EPWMXBAR5_ICSSGPO3_PORT0_SEL == 1 | MW_EPWMXBAR5_ICSSGPO4_PORT0_SEL == 1 | MW_EPWMXBAR5_ICSSGPO5_PORT0_SEL == 1 | MW_EPWMXBAR5_ICSSGPO6_PORT0_SEL == 1 | MW_EPWMXBAR5_ICSSGPO7_PORT0_SEL == 1 | MW_EPWMXBAR5_ICSSGPO8_PORT0_SEL == 1 | MW_EPWMXBAR5_ICSSGPO9_PORT0_SEL == 1 | MW_EPWMXBAR5_ICSSGPO10_PORT0_SEL == 1 | MW_EPWMXBAR5_ICSSGPO11_PORT0_SEL == 1 | MW_EPWMXBAR5_ICSSGPO12_PORT0_SEL == 1 | MW_EPWMXBAR5_ICSSGPO13_PORT0_SEL == 1 | MW_EPWMXBAR5_ICSSGPO14_PORT0_SEL == 1 | MW_EPWMXBAR5_ICSSGPO15_PORT0_SEL == 1 | MW_EPWMXBAR5_ICSSGPO0_PORT1_SEL == 1 | MW_EPWMXBAR5_ICSSGPO1_PORT1_SEL == 1 | MW_EPWMXBAR5_ICSSGPO2_PORT1_SEL == 1 | MW_EPWMXBAR5_ICSSGPO3_PORT1_SEL == 1 | MW_EPWMXBAR5_ICSSGPO4_PORT1_SEL == 1 | MW_EPWMXBAR5_ICSSGPO5_PORT1_SEL == 1 | MW_EPWMXBAR5_ICSSGPO6_PORT1_SEL == 1 | MW_EPWMXBAR5_ICSSGPO7_PORT1_SEL == 1 | MW_EPWMXBAR5_ICSSGPO8_PORT1_SEL == 1 | MW_EPWMXBAR5_ICSSGPO9_PORT1_SEL == 1 | MW_EPWMXBAR5_ICSSGPO10_PORT1_SEL == 1 | MW_EPWMXBAR5_ICSSGPO11_PORT1_SEL == 1 | MW_EPWMXBAR5_ICSSGPO12_PORT1_SEL == 1 | MW_EPWMXBAR5_ICSSGPO13_PORT1_SEL == 1 | MW_EPWMXBAR5_ICSSGPO14_PORT1_SEL == 1 | MW_EPWMXBAR5_ICSSGPO15_PORT1_SEL == 1)
    //     group4_epwmxbar[5] = EPWM_XBAR_5;
    // else
        group4_epwmxbar[5] = 0;
    group5_epwmxbar[5] = (MW_EPWMXBAR5_EPWM0_TRIPOUT_SEL << 0) | (MW_EPWMXBAR5_EPWM1_TRIPOUT_SEL << 1) | (MW_EPWMXBAR5_EPWM2_TRIPOUT_SEL << 2) | (MW_EPWMXBAR5_EPWM3_TRIPOUT_SEL << 3) | (MW_EPWMXBAR5_EPWM4_TRIPOUT_SEL << 4) | (MW_EPWMXBAR5_EPWM5_TRIPOUT_SEL << 5) | (MW_EPWMXBAR5_EPWM6_TRIPOUT_SEL << 6) | (MW_EPWMXBAR5_EPWM7_TRIPOUT_SEL << 7) | (MW_EPWMXBAR5_EPWM8_TRIPOUT_SEL << 8) | (MW_EPWMXBAR5_EPWM9_TRIPOUT_SEL << 9) | (MW_EPWMXBAR5_EPWM10_TRIPOUT_SEL << 10) | (MW_EPWMXBAR5_EPWM11_TRIPOUT_SEL << 11) | (MW_EPWMXBAR5_EPWM12_TRIPOUT_SEL << 12) | (MW_EPWMXBAR5_EPWM13_TRIPOUT_SEL << 13) | (MW_EPWMXBAR5_EPWM14_TRIPOUT_SEL << 14) | (MW_EPWMXBAR5_EPWM15_TRIPOUT_SEL << 15) | (MW_EPWMXBAR5_EPWM16_TRIPOUT_SEL << 16) | (MW_EPWMXBAR5_EPWM17_TRIPOUT_SEL << 17) | (MW_EPWMXBAR5_EPWM18_TRIPOUT_SEL << 18) | (MW_EPWMXBAR5_EPWM19_TRIPOUT_SEL << 19) | (MW_EPWMXBAR5_EPWM20_TRIPOUT_SEL << 20) | (MW_EPWMXBAR5_EPWM21_TRIPOUT_SEL << 21) | (MW_EPWMXBAR5_EPWM22_TRIPOUT_SEL << 22) | (MW_EPWMXBAR5_EPWM23_TRIPOUT_SEL << 23) | (MW_EPWMXBAR5_EPWM24_TRIPOUT_SEL << 24) | (MW_EPWMXBAR5_EPWM25_TRIPOUT_SEL << 25) | (MW_EPWMXBAR5_EPWM26_TRIPOUT_SEL << 26) | (MW_EPWMXBAR5_EPWM27_TRIPOUT_SEL << 27) | (MW_EPWMXBAR5_EPWM28_TRIPOUT_SEL << 28) | (MW_EPWMXBAR5_EPWM29_TRIPOUT_SEL << 29) | (MW_EPWMXBAR5_EPWM30_TRIPOUT_SEL << 30) | (MW_EPWMXBAR5_EPWM31_TRIPOUT_SEL << 31);
    group6_epwmxbar[5] = (MW_EPWMXBAR5_DEL0_TRIP_SEL << 0) | (MW_EPWMXBAR5_DEL1_TRIP_SEL << 1) | (MW_EPWMXBAR5_DEL2_TRIP_SEL << 2) | (MW_EPWMXBAR5_DEL3_TRIP_SEL << 3) | (MW_EPWMXBAR5_DEL4_TRIP_SEL << 4) | (MW_EPWMXBAR5_DEL5_TRIP_SEL << 5) | (MW_EPWMXBAR5_DEL6_TRIP_SEL << 6) | (MW_EPWMXBAR5_DEL7_TRIP_SEL << 7) | (MW_EPWMXBAR5_DEL8_TRIP_SEL << 8) | (MW_EPWMXBAR5_DEL9_TRIP_SEL << 9) | (MW_EPWMXBAR5_DEL10_TRIP_SEL << 10) | (MW_EPWMXBAR5_DEL11_TRIP_SEL << 11) | (MW_EPWMXBAR5_DEL12_TRIP_SEL << 12) | (MW_EPWMXBAR5_DEL13_TRIP_SEL << 13) | (MW_EPWMXBAR5_DEL14_TRIP_SEL << 14) | (MW_EPWMXBAR5_DEL15_TRIP_SEL << 15) | (MW_EPWMXBAR5_DEL16_TRIP_SEL << 16) | (MW_EPWMXBAR5_DEL17_TRIP_SEL << 17) | (MW_EPWMXBAR5_DEL18_TRIP_SEL << 18) | (MW_EPWMXBAR5_DEL19_TRIP_SEL << 19) | (MW_EPWMXBAR5_DEL20_TRIP_SEL << 20) | (MW_EPWMXBAR5_DEL21_TRIP_SEL << 21) | (MW_EPWMXBAR5_DEL22_TRIP_SEL << 22) | (MW_EPWMXBAR5_DEL23_TRIP_SEL << 23) | (MW_EPWMXBAR5_DEL24_TRIP_SEL << 24) | (MW_EPWMXBAR5_DEL25_TRIP_SEL << 25) | (MW_EPWMXBAR5_DEL26_TRIP_SEL << 26) | (MW_EPWMXBAR5_DEL27_TRIP_SEL << 27) | (MW_EPWMXBAR5_DEL28_TRIP_SEL << 28) | (MW_EPWMXBAR5_DEL29_TRIP_SEL << 29) | (MW_EPWMXBAR5_DEL30_TRIP_SEL << 30) | (MW_EPWMXBAR5_DEL31_TRIP_SEL << 31);
