TexasInstruments/am26x-hsp/src/am263px_init.c
    group7_epwmxbar[5] = (MW_EPWMXBAR5_DEL0_ACTIVE_SEL << 0) | (MW_EPWMXBAR5_DEL1_ACTIVE_SEL << 1) | (MW_EPWMXBAR5_DEL2_ACTIVE_SEL << 2) | (MW_EPWMXBAR5_DEL3_ACTIVE_SEL << 3) | (MW_EPWMXBAR5_DEL4_ACTIVE_SEL << 4) | (MW_EPWMXBAR5_DEL5_ACTIVE_SEL << 5) | (MW_EPWMXBAR5_DEL6_ACTIVE_SEL << 6) | (MW_EPWMXBAR5_DEL7_ACTIVE_SEL << 7) | (MW_EPWMXBAR5_DEL8_ACTIVE_SEL << 8) | (MW_EPWMXBAR5_DEL9_ACTIVE_SEL << 9) | (MW_EPWMXBAR5_DEL10_ACTIVE_SEL << 10) | (MW_EPWMXBAR5_DEL11_ACTIVE_SEL << 11) | (MW_EPWMXBAR5_DEL12_ACTIVE_SEL << 12) | (MW_EPWMXBAR5_DEL13_ACTIVE_SEL << 13) | (MW_EPWMXBAR5_DEL14_ACTIVE_SEL << 14) | (MW_EPWMXBAR5_DEL15_ACTIVE_SEL << 15) | (MW_EPWMXBAR5_DEL16_ACTIVE_SEL << 16) | (MW_EPWMXBAR5_DEL17_ACTIVE_SEL << 17) | (MW_EPWMXBAR5_DEL18_ACTIVE_SEL << 18) | (MW_EPWMXBAR5_DEL19_ACTIVE_SEL << 19) | (MW_EPWMXBAR5_DEL20_ACTIVE_SEL << 20) | (MW_EPWMXBAR5_DEL21_ACTIVE_SEL << 21) | (MW_EPWMXBAR5_DEL22_ACTIVE_SEL << 22) | (MW_EPWMXBAR5_DEL23_ACTIVE_SEL << 23) | (MW_EPWMXBAR5_DEL24_ACTIVE_SEL << 24) | (MW_EPWMXBAR5_DEL25_ACTIVE_SEL << 25) | (MW_EPWMXBAR5_DEL26_ACTIVE_SEL << 26) | (MW_EPWMXBAR5_DEL27_ACTIVE_SEL << 27) | (MW_EPWMXBAR5_DEL28_ACTIVE_SEL << 28) | (MW_EPWMXBAR5_DEL29_ACTIVE_SEL << 29) | (MW_EPWMXBAR5_DEL30_ACTIVE_SEL << 30) | (MW_EPWMXBAR5_DEL31_ACTIVE_SEL << 31);
    group8_epwmxbar[5] = (MW_EPWMXBAR5_EQEP0_ERR_SEL << 0) | (MW_EPWMXBAR5_EQEP1_ERR_SEL << 1) | (MW_EPWMXBAR5_EQEP2_ERR_SEL << 2) | (MW_EPWMXBAR5_FSIRX0_RX_TRIG0_SEL << 3) | (MW_EPWMXBAR5_FSIRX0_RX_TRIG1_SEL << 4) | (MW_EPWMXBAR5_FSIRX0_RX_TRIG2_SEL << 5) | (MW_EPWMXBAR5_FSIRX0_RX_TRIG3_SEL << 6) | (MW_EPWMXBAR5_FSIRX1_RX_TRIG0_SEL << 7) | (MW_EPWMXBAR5_FSIRX1_RX_TRIG1_SEL << 8) | (MW_EPWMXBAR5_FSIRX1_RX_TRIG2_SEL << 9) | (MW_EPWMXBAR5_FSIRX1_RX_TRIG3_SEL << 10) | (MW_EPWMXBAR5_FSIRX2_RX_TRIG0_SEL << 11) | (MW_EPWMXBAR5_FSIRX2_RX_TRIG1_SEL << 12) | (MW_EPWMXBAR5_FSIRX2_RX_TRIG2_SEL << 13) | (MW_EPWMXBAR5_FSIRX2_RX_TRIG3_SEL << 14) | (MW_EPWMXBAR5_FSIRX3_RX_TRIG0_SEL << 15) | (MW_EPWMXBAR5_FSIRX3_RX_TRIG1_SEL << 16) | (MW_EPWMXBAR5_FSIRX3_RX_TRIG2_SEL << 17) | (MW_EPWMXBAR5_FSIRX3_RX_TRIG3_SEL << 18) | (MW_EPWMXBAR5_ECAP0_TRIPOUT_SEL << 19) | (MW_EPWMXBAR5_ECAP1_TRIPOUT_SEL << 20) | (MW_EPWMXBAR5_ECAP2_TRIPOUT_SEL << 21) | (MW_EPWMXBAR5_ECAP3_TRIPOUT_SEL << 22) | (MW_EPWMXBAR5_ECAP4_TRIPOUT_SEL << 23) | (MW_EPWMXBAR5_ECAP5_TRIPOUT_SEL << 24) | (MW_EPWMXBAR5_ECAP6_TRIPOUT_SEL << 25) | (MW_EPWMXBAR5_ECAP7_TRIPOUT_SEL << 26) | (MW_EPWMXBAR5_ECAP8_TRIPOUT_SEL << 27) | (MW_EPWMXBAR5_ECAP9_TRIPOUT_SEL << 28);
    group0_epwmxbar[6] = (MW_EPWMXBAR6_CMPSSA0_CTRIPL_SEL << 0) | (MW_EPWMXBAR6_CMPSSA0_CTRIPH_SEL << 1) | (MW_EPWMXBAR6_CMPSSA1_CTRIPL_SEL << 2) | (MW_EPWMXBAR6_CMPSSA1_CTRIPH_SEL << 3) | (MW_EPWMXBAR6_CMPSSA2_CTRIPL_SEL << 4) | (MW_EPWMXBAR6_CMPSSA2_CTRIPH_SEL << 5) | (MW_EPWMXBAR6_CMPSSA3_CTRIPL_SEL << 6) | (MW_EPWMXBAR6_CMPSSA3_CTRIPH_SEL << 7) | (MW_EPWMXBAR6_CMPSSA4_CTRIPL_SEL << 8) | (MW_EPWMXBAR6_CMPSSA4_CTRIPH_SEL << 9) | (MW_EPWMXBAR6_CMPSSA5_CTRIPL_SEL << 10) | (MW_EPWMXBAR6_CMPSSA5_CTRIPH_SEL << 11) | (MW_EPWMXBAR6_CMPSSA6_CTRIPL_SEL << 12) | (MW_EPWMXBAR6_CMPSSA6_CTRIPH_SEL << 13) | (MW_EPWMXBAR6_CMPSSA7_CTRIPL_SEL << 14) | (MW_EPWMXBAR6_CMPSSA7_CTRIPH_SEL << 15) | (MW_EPWMXBAR6_CMPSSA8_CTRIPL_SEL << 16) | (MW_EPWMXBAR6_CMPSSA8_CTRIPH_SEL << 17) | (MW_EPWMXBAR6_CMPSSA9_CTRIPL_SEL << 18) | (MW_EPWMXBAR6_CMPSSA9_CTRIPH_SEL << 19);
    group1_epwmxbar[6] = (MW_EPWMXBAR6_CMPSSB0_CTRIPL_SEL << 0) | (MW_EPWMXBAR6_CMPSSB0_CTRIPH_SEL << 1) | (MW_EPWMXBAR6_CMPSSB1_CTRIPL_SEL << 2) | (MW_EPWMXBAR6_CMPSSB1_CTRIPH_SEL << 3) | (MW_EPWMXBAR6_CMPSSB2_CTRIPL_SEL << 4) | (MW_EPWMXBAR6_CMPSSB2_CTRIPH_SEL << 5) | (MW_EPWMXBAR6_CMPSSB3_CTRIPL_SEL << 6) | (MW_EPWMXBAR6_CMPSSB3_CTRIPH_SEL << 7) | (MW_EPWMXBAR6_CMPSSB4_CTRIPL_SEL << 8) | (MW_EPWMXBAR6_CMPSSB4_CTRIPH_SEL << 9) | (MW_EPWMXBAR6_CMPSSB5_CTRIPL_SEL << 10) | (MW_EPWMXBAR6_CMPSSB5_CTRIPH_SEL << 11) | (MW_EPWMXBAR6_CMPSSB6_CTRIPL_SEL << 12) | (MW_EPWMXBAR6_CMPSSB6_CTRIPH_SEL << 13) | (MW_EPWMXBAR6_CMPSSB7_CTRIPL_SEL << 14) | (MW_EPWMXBAR6_CMPSSB7_CTRIPH_SEL << 15) | (MW_EPWMXBAR6_CMPSSB8_CTRIPL_SEL << 16) | (MW_EPWMXBAR6_CMPSSB8_CTRIPH_SEL << 17) | (MW_EPWMXBAR6_CMPSSB9_CTRIPL_SEL << 18) | (MW_EPWMXBAR6_CMPSSB9_CTRIPH_SEL << 19);
    group2_epwmxbar[6] = (MW_EPWMXBAR6_SD0_FILT0_CEVT1_SEL << 0) | (MW_EPWMXBAR6_SD0_FILT0_CEVT2_SEL << 1) | (MW_EPWMXBAR6_SD0_FILT0_CMPHZ_SEL << 2) | (MW_EPWMXBAR6_SD0_FILT1_CEVT1_SEL << 3) | (MW_EPWMXBAR6_SD0_FILT1_CEVT2_SEL << 4) | (MW_EPWMXBAR6_SD0_FILT1_CMPHZ_SEL << 5) | (MW_EPWMXBAR6_SD0_FILT2_CEVT1_SEL << 6) | (MW_EPWMXBAR6_SD0_FILT2_CEVT2_SEL << 7) | (MW_EPWMXBAR6_SD0_FILT2_CMPHZ_SEL << 8) | (MW_EPWMXBAR6_SD0_FILT3_CEVT1_SEL << 9) | (MW_EPWMXBAR6_SD0_FILT3_CEVT2_SEL << 10) | (MW_EPWMXBAR6_SD0_FILT3_CMPHZ_SEL << 11) | (MW_EPWMXBAR6_SD1_FILT0_CEVT1_SEL << 12) | (MW_EPWMXBAR6_SD1_FILT0_CEVT2_SEL << 13) | (MW_EPWMXBAR6_SD1_FILT0_CMPHZ_SEL << 14) | (MW_EPWMXBAR6_SD1_FILT1_CEVT1_SEL << 15) | (MW_EPWMXBAR6_SD1_FILT1_CEVT2_SEL << 16) | (MW_EPWMXBAR6_SD1_FILT1_CMPHZ_SEL << 17) | (MW_EPWMXBAR6_SD1_FILT2_CEVT1_SEL << 18) | (MW_EPWMXBAR6_SD1_FILT2_CEVT2_SEL << 19) | (MW_EPWMXBAR6_SD1_FILT2_CMPHZ_SEL << 20) | (MW_EPWMXBAR6_SD1_FILT3_CEVT1_SEL << 21) | (MW_EPWMXBAR6_SD1_FILT3_CEVT2_SEL << 22) | (MW_EPWMXBAR6_SD1_FILT3_CMPHZ_SEL << 23);
    group3_epwmxbar[6] = (MW_EPWMXBAR6_ADC0_EVT1_SEL << 0) | (MW_EPWMXBAR6_ADC0_EVT2_SEL << 1) | (MW_EPWMXBAR6_ADC0_EVT3_SEL << 2) | (MW_EPWMXBAR6_ADC0_EVT4_SEL << 3) | (MW_EPWMXBAR6_ADC1_EVT1_SEL << 4) | (MW_EPWMXBAR6_ADC1_EVT2_SEL << 5) | (MW_EPWMXBAR6_ADC1_EVT3_SEL << 6) | (MW_EPWMXBAR6_ADC1_EVT4_SEL << 7) | (MW_EPWMXBAR6_ADC2_EVT1_SEL << 8) | (MW_EPWMXBAR6_ADC2_EVT2_SEL << 9) | (MW_EPWMXBAR6_ADC2_EVT3_SEL << 10) | (MW_EPWMXBAR6_ADC2_EVT4_SEL << 11) | (MW_EPWMXBAR6_ADC3_EVT1_SEL << 12) | (MW_EPWMXBAR6_ADC3_EVT2_SEL << 13) | (MW_EPWMXBAR6_ADC3_EVT3_SEL << 14) | (MW_EPWMXBAR6_ADC3_EVT4_SEL << 15) | (MW_EPWMXBAR6_ADC4_EVT1_SEL << 16) | (MW_EPWMXBAR6_ADC4_EVT2_SEL << 17) | (MW_EPWMXBAR6_ADC4_EVT3_SEL << 18) | (MW_EPWMXBAR6_ADC4_EVT4_SEL << 19);
    // if(MW_EPWMXBAR6_GPIO0_SEL == 1 | MW_EPWMXBAR6_GPIO1_SEL == 1 | MW_EPWMXBAR6_GPIO2_SEL == 1 | MW_EPWMXBAR6_GPIO3_SEL == 1 | MW_EPWMXBAR6_GPIO4_SEL == 1 | MW_EPWMXBAR6_GPIO5_SEL == 1 | MW_EPWMXBAR6_GPIO6_SEL == 1 | MW_EPWMXBAR6_GPIO7_SEL == 1| MW_EPWMXBAR6_GPIO8_SEL == 1 | MW_EPWMXBAR6_GPIO9_SEL == 1 | MW_EPWMXBAR6_GPIO10_SEL == 1| MW_EPWMXBAR6_GPIO11_SEL == 1| MW_EPWMXBAR6_GPIO12_SEL == 1 | MW_EPWMXBAR6_GPIO13_SEL == 1 | MW_EPWMXBAR6_GPIO14_SEL == 1 | MW_EPWMXBAR6_GPIO15_SEL == 1 | MW_EPWMXBAR6_GPIO16_SEL == 1 | MW_EPWMXBAR6_GPIO17_SEL == 1 | MW_EPWMXBAR6_GPIO18_SEL == 1 | MW_EPWMXBAR6_GPIO19_SEL == 1 | MW_EPWMXBAR6_GPIO20_SEL == 1 | MW_EPWMXBAR6_GPIO21_SEL == 1 | MW_EPWMXBAR6_GPIO22_SEL == 1 | MW_EPWMXBAR6_GPIO23_SEL == 1 | MW_EPWMXBAR6_GPIO24_SEL == 1 | MW_EPWMXBAR6_GPIO25_SEL == 1 | MW_EPWMXBAR6_GPIO26_SEL == 1 | MW_EPWMXBAR6_GPIO27_SEL == 1 | MW_EPWMXBAR6_GPIO28_SEL == 1 | MW_EPWMXBAR6_GPIO29_SEL == 1 | MW_EPWMXBAR6_GPIO30_SEL == 1 | MW_EPWMXBAR6_GPIO31_SEL == 1 | MW_EPWMXBAR6_GPIO32_SEL == 1 | MW_EPWMXBAR6_GPIO33_SEL == 1 | MW_EPWMXBAR6_GPIO34_SEL == 1 | MW_EPWMXBAR6_GPIO35_SEL == 1 | MW_EPWMXBAR6_GPIO36_SEL == 1 | MW_EPWMXBAR6_GPIO37_SEL == 1 | MW_EPWMXBAR6_GPIO38_SEL == 1 | MW_EPWMXBAR6_GPIO39_SEL == 1 | MW_EPWMXBAR6_GPIO40_SEL == 1 | MW_EPWMXBAR6_GPIO41_SEL == 1 | MW_EPWMXBAR6_GPIO42_SEL == 1 | MW_EPWMXBAR6_GPIO43_SEL == 1 | MW_EPWMXBAR6_GPIO44_SEL == 1 | | MW_EPWMXBAR6_GPIO45_SEL == 1 | MW_EPWMXBAR6_GPIO46_SEL == 1 | MW_EPWMXBAR6_GPIO47_SEL == 1| MW_EPWMXBAR6_GPIO48_SEL == 1 | MW_EPWMXBAR6_GPIO49_SEL == 1 | MW_EPWMXBAR6_GPIO50_SEL == 1 | MW_EPWMXBAR6_GPIO51_SEL == 1 | MW_EPWMXBAR6_GPIO52_SEL == 1 | MW_EPWMXBAR6_GPIO53_SEL == 1 | MW_EPWMXBAR6_GPIO54_SEL == 1 | MW_EPWMXBAR6_GPIO55_SEL == 1 | MW_EPWMXBAR6_GPIO56_SEL == 1 | MW_EPWMXBAR6_GPIO57_SEL == 1| MW_EPWMXBAR6_GPIO58_SEL == 1 | MW_EPWMXBAR6_GPIO59_SEL == 1 | MW_EPWMXBAR6_GPIO60_SEL == 1 | MW_EPWMXBAR6_GPIO61_SEL == 1 | MW_EPWMXBAR6_GPIO62_SEL == 1 | MW_EPWMXBAR6_GPIO63_SEL == 1 | MW_EPWMXBAR6_GPIO64_SEL == 1 | | MW_EPWMXBAR6_GPIO59_SEL == 1 | MW_EPWMXBAR6_GPIO60_SEL == 1 | MW_EPWMXBAR6_GPIO61_SEL == 1 | MW_EPWMXBAR6_GPIO62_SEL == 1 | MW_EPWMXBAR6_GPIO63_SEL == 1 | MW_EPWMXBAR6_GPIO64_SEL == 1 | MW_EPWMXBAR6_GPIO65_SEL == 1 | MW_EPWMXBAR6_GPIO66_SEL == 1 | MW_EPWMXBAR6_GPIO67_SEL == 1 | MW_EPWMXBAR6_GPIO68_SEL == 1 | MW_EPWMXBAR6_GPIO69_SEL == 1 | MW_EPWMXBAR6_GPIO70_SEL == 1 | MW_EPWMXBAR6_GPIO71_SEL == 1 | MW_EPWMXBAR6_GPIO72_SEL == 1 | MW_EPWMXBAR6_GPIO73_SEL == 1 | MW_EPWMXBAR6_GPIO74_SEL == 1 | MW_EPWMXBAR6_GPIO75_SEL == 1 | MW_EPWMXBAR6_GPIO76_SEL == 1 | MW_EPWMXBAR6_GPIO77_SEL == 1 | MW_EPWMXBAR6_GPIO78_SEL == 1 | | MW_EPWMXBAR6_GPIO80_SEL == 1 | MW_EPWMXBAR6_GPIO81_SEL == 1 | MW_EPWMXBAR6_GPIO82_SEL == 1 | MW_EPWMXBAR6_GPIO83_SEL == 1 | MW_EPWMXBAR6_GPIO84_SEL == 1 | MW_EPWMXBAR6_GPIO85_SEL == 1 | MW_EPWMXBAR6_GPIO86_SEL == 1 | MW_EPWMXBAR6_GPIO87_SEL == 1 | MW_EPWMXBAR6_GPIO88_SEL == 1 | MW_EPWMXBAR6_GPIO89_SEL == 1 | MW_EPWMXBAR6_GPIO90_SEL == 1 | MW_EPWMXBAR6_GPIO91_SEL == 1 | MW_EPWMXBAR6_GPIO92_SEL == 1 | MW_EPWMXBAR6_GPIO93_SEL == 1 | MW_EPWMXBAR6_GPIO94_SEL == 1 | MW_EPWMXBAR6_GPIO95_SEL == 1 | MW_EPWMXBAR6_GPIO96_SEL == 1 | MW_EPWMXBAR6_GPIO97_SEL == 1 | MW_EPWMXBAR6_GPIO98_SEL == 1 | MW_EPWMXBAR6_GPIO99_SEL == 1 | MW_EPWMXBAR6_GPIO100_SEL == 1 | MW_EPWMXBAR6_GPIO101_SEL == 1 | MW_EPWMXBAR6_GPIO102_SEL == 1 | MW_EPWMXBAR6_GPIO103_SEL == 1 | MW_EPWMXBAR6_GPIO104_SEL == 1 | MW_EPWMXBAR6_GPIO105_SEL == 1 | MW_EPWMXBAR6_GPIO106_SEL == 1 | MW_EPWMXBAR6_GPIO107_SEL == 1 | | MW_EPWMXBAR6_GPIO108_SEL == 1 | MW_EPWMXBAR6_GPIO109_SEL == 1| MW_EPWMXBAR6_GPIO110_SEL == 1 | MW_EPWMXBAR6_GPIO111_SEL == 1 | MW_EPWMXBAR6_GPIO112_SEL == 1 | MW_EPWMXBAR6_GPIO113_SEL == 1 | MW_EPWMXBAR6_GPIO114_SEL == 1 | MW_EPWMXBAR6_GPIO115_SEL == 1 | MW_EPWMXBAR6_GPIO116_SEL == 1 | MW_EPWMXBAR6_GPIO117_SEL == 1 | MW_EPWMXBAR6_GPIO118_SEL == 1 | MW_EPWMXBAR6_GPIO119_SEL == 1 | MW_EPWMXBAR6_GPIO120_SEL == 1 | MW_EPWMXBAR6_GPIO121_SEL == 1 | MW_EPWMXBAR6_GPIO122_SEL == 1 | MW_EPWMXBAR6_GPIO123_SEL == 1 | MW_EPWMXBAR6_GPIO124_SEL == 1 | MW_EPWMXBAR6_GPIO125_SEL == 1 | MW_EPWMXBAR6_GPIO126_SEL == 1 | MW_EPWMXBAR6_GPIO127_SEL == 1 | MW_EPWMXBAR6_GPIO128_SEL == 1 | MW_EPWMXBAR6_GPIO129_SEL == 1 | MW_EPWMXBAR6_GPIO130_SEL == 1 | MW_EPWMXBAR6_GPIO131_SEL == 1 | MW_EPWMXBAR6_GPIO132_SEL == 1 | MW_EPWMXBAR6_GPIO133_SEL == 1 | MW_EPWMXBAR6_GPIO134_SEL == 1 | MW_EPWMXBAR6_GPIO135_SEL == 1 | MW_EPWMXBAR6_GPIO136_SEL == 1 | MW_EPWMXBAR6_GPIO137_SEL == 1 | MW_EPWMXBAR6_GPIO139_SEL == 1 | MW_EPWMXBAR6_GPIO140_SEL == 1 | MW_EPWMXBAR6_GPIO141_SEL == 1 | MW_EPWMXBAR6_GPIO142_SEL == 1 | MW_EPWMXBAR6_GPIO143_SEL == 1 | MW_EPWMXBAR6_ICSSGPO0_PORT0_SEL == 1 | MW_EPWMXBAR6_ICSSGPO1_PORT0_SEL == 1 | MW_EPWMXBAR6_ICSSGPO2_PORT0_SEL == 1 | MW_EPWMXBAR6_ICSSGPO3_PORT0_SEL == 1 | MW_EPWMXBAR6_ICSSGPO4_PORT0_SEL == 1 | MW_EPWMXBAR6_ICSSGPO5_PORT0_SEL == 1 | MW_EPWMXBAR6_ICSSGPO6_PORT0_SEL == 1 | MW_EPWMXBAR6_ICSSGPO7_PORT0_SEL == 1 | MW_EPWMXBAR6_ICSSGPO8_PORT0_SEL == 1 | MW_EPWMXBAR6_ICSSGPO9_PORT0_SEL == 1 | MW_EPWMXBAR6_ICSSGPO10_PORT0_SEL == 1 | MW_EPWMXBAR6_ICSSGPO11_PORT0_SEL == 1 | MW_EPWMXBAR6_ICSSGPO12_PORT0_SEL == 1 | MW_EPWMXBAR6_ICSSGPO13_PORT0_SEL == 1 | MW_EPWMXBAR6_ICSSGPO14_PORT0_SEL == 1 | MW_EPWMXBAR6_ICSSGPO15_PORT0_SEL == 1 | MW_EPWMXBAR6_ICSSGPO0_PORT1_SEL == 1 | MW_EPWMXBAR6_ICSSGPO1_PORT1_SEL == 1 | MW_EPWMXBAR6_ICSSGPO2_PORT1_SEL == 1 | MW_EPWMXBAR6_ICSSGPO3_PORT1_SEL == 1 | MW_EPWMXBAR6_ICSSGPO4_PORT1_SEL == 1 | MW_EPWMXBAR6_ICSSGPO5_PORT1_SEL == 1 | MW_EPWMXBAR6_ICSSGPO6_PORT1_SEL == 1 | MW_EPWMXBAR6_ICSSGPO7_PORT1_SEL == 1 | MW_EPWMXBAR6_ICSSGPO8_PORT1_SEL == 1 | MW_EPWMXBAR6_ICSSGPO9_PORT1_SEL == 1 | MW_EPWMXBAR6_ICSSGPO10_PORT1_SEL == 1 | MW_EPWMXBAR6_ICSSGPO11_PORT1_SEL == 1 | MW_EPWMXBAR6_ICSSGPO12_PORT1_SEL == 1 | MW_EPWMXBAR6_ICSSGPO13_PORT1_SEL == 1 | MW_EPWMXBAR6_ICSSGPO14_PORT1_SEL == 1 | MW_EPWMXBAR6_ICSSGPO15_PORT1_SEL == 1)
    //     group4_epwmxbar[6] = EPWM_XBAR_6;
    // else
        group4_epwmxbar[6] = 0;
    group5_epwmxbar[6] = (MW_EPWMXBAR6_EPWM0_TRIPOUT_SEL << 0) | (MW_EPWMXBAR6_EPWM1_TRIPOUT_SEL << 1) | (MW_EPWMXBAR6_EPWM2_TRIPOUT_SEL << 2) | (MW_EPWMXBAR6_EPWM3_TRIPOUT_SEL << 3) | (MW_EPWMXBAR6_EPWM4_TRIPOUT_SEL << 4) | (MW_EPWMXBAR6_EPWM5_TRIPOUT_SEL << 5) | (MW_EPWMXBAR6_EPWM6_TRIPOUT_SEL << 6) | (MW_EPWMXBAR6_EPWM7_TRIPOUT_SEL << 7) | (MW_EPWMXBAR6_EPWM8_TRIPOUT_SEL << 8) | (MW_EPWMXBAR6_EPWM9_TRIPOUT_SEL << 9) | (MW_EPWMXBAR6_EPWM10_TRIPOUT_SEL << 10) | (MW_EPWMXBAR6_EPWM11_TRIPOUT_SEL << 11) | (MW_EPWMXBAR6_EPWM12_TRIPOUT_SEL << 12) | (MW_EPWMXBAR6_EPWM13_TRIPOUT_SEL << 13) | (MW_EPWMXBAR6_EPWM14_TRIPOUT_SEL << 14) | (MW_EPWMXBAR6_EPWM15_TRIPOUT_SEL << 15) | (MW_EPWMXBAR6_EPWM16_TRIPOUT_SEL << 16) | (MW_EPWMXBAR6_EPWM17_TRIPOUT_SEL << 17) | (MW_EPWMXBAR6_EPWM18_TRIPOUT_SEL << 18) | (MW_EPWMXBAR6_EPWM19_TRIPOUT_SEL << 19) | (MW_EPWMXBAR6_EPWM20_TRIPOUT_SEL << 20) | (MW_EPWMXBAR6_EPWM21_TRIPOUT_SEL << 21) | (MW_EPWMXBAR6_EPWM22_TRIPOUT_SEL << 22) | (MW_EPWMXBAR6_EPWM23_TRIPOUT_SEL << 23) | (MW_EPWMXBAR6_EPWM24_TRIPOUT_SEL << 24) | (MW_EPWMXBAR6_EPWM25_TRIPOUT_SEL << 25) | (MW_EPWMXBAR6_EPWM26_TRIPOUT_SEL << 26) | (MW_EPWMXBAR6_EPWM27_TRIPOUT_SEL << 27) | (MW_EPWMXBAR6_EPWM28_TRIPOUT_SEL << 28) | (MW_EPWMXBAR6_EPWM29_TRIPOUT_SEL << 29) | (MW_EPWMXBAR6_EPWM30_TRIPOUT_SEL << 30) | (MW_EPWMXBAR6_EPWM31_TRIPOUT_SEL << 31);
    group6_epwmxbar[6] = (MW_EPWMXBAR6_DEL0_TRIP_SEL << 0) | (MW_EPWMXBAR6_DEL1_TRIP_SEL << 1) | (MW_EPWMXBAR6_DEL2_TRIP_SEL << 2) | (MW_EPWMXBAR6_DEL3_TRIP_SEL << 3) | (MW_EPWMXBAR6_DEL4_TRIP_SEL << 4) | (MW_EPWMXBAR6_DEL5_TRIP_SEL << 5) | (MW_EPWMXBAR6_DEL6_TRIP_SEL << 6) | (MW_EPWMXBAR6_DEL7_TRIP_SEL << 7) | (MW_EPWMXBAR6_DEL8_TRIP_SEL << 8) | (MW_EPWMXBAR6_DEL9_TRIP_SEL << 9) | (MW_EPWMXBAR6_DEL10_TRIP_SEL << 10) | (MW_EPWMXBAR6_DEL11_TRIP_SEL << 11) | (MW_EPWMXBAR6_DEL12_TRIP_SEL << 12) | (MW_EPWMXBAR6_DEL13_TRIP_SEL << 13) | (MW_EPWMXBAR6_DEL14_TRIP_SEL << 14) | (MW_EPWMXBAR6_DEL15_TRIP_SEL << 15) | (MW_EPWMXBAR6_DEL16_TRIP_SEL << 16) | (MW_EPWMXBAR6_DEL17_TRIP_SEL << 17) | (MW_EPWMXBAR6_DEL18_TRIP_SEL << 18) | (MW_EPWMXBAR6_DEL19_TRIP_SEL << 19) | (MW_EPWMXBAR6_DEL20_TRIP_SEL << 20) | (MW_EPWMXBAR6_DEL21_TRIP_SEL << 21) | (MW_EPWMXBAR6_DEL22_TRIP_SEL << 22) | (MW_EPWMXBAR6_DEL23_TRIP_SEL << 23) | (MW_EPWMXBAR6_DEL24_TRIP_SEL << 24) | (MW_EPWMXBAR6_DEL25_TRIP_SEL << 25) | (MW_EPWMXBAR6_DEL26_TRIP_SEL << 26) | (MW_EPWMXBAR6_DEL27_TRIP_SEL << 27) | (MW_EPWMXBAR6_DEL28_TRIP_SEL << 28) | (MW_EPWMXBAR6_DEL29_TRIP_SEL << 29) | (MW_EPWMXBAR6_DEL30_TRIP_SEL << 30) | (MW_EPWMXBAR6_DEL31_TRIP_SEL << 31);
    group7_epwmxbar[6] = (MW_EPWMXBAR6_DEL0_ACTIVE_SEL << 0) | (MW_EPWMXBAR6_DEL1_ACTIVE_SEL << 1) | (MW_EPWMXBAR6_DEL2_ACTIVE_SEL << 2) | (MW_EPWMXBAR6_DEL3_ACTIVE_SEL << 3) | (MW_EPWMXBAR6_DEL4_ACTIVE_SEL << 4) | (MW_EPWMXBAR6_DEL5_ACTIVE_SEL << 5) | (MW_EPWMXBAR6_DEL6_ACTIVE_SEL << 6) | (MW_EPWMXBAR6_DEL7_ACTIVE_SEL << 7) | (MW_EPWMXBAR6_DEL8_ACTIVE_SEL << 8) | (MW_EPWMXBAR6_DEL9_ACTIVE_SEL << 9) | (MW_EPWMXBAR6_DEL10_ACTIVE_SEL << 10) | (MW_EPWMXBAR6_DEL11_ACTIVE_SEL << 11) | (MW_EPWMXBAR6_DEL12_ACTIVE_SEL << 12) | (MW_EPWMXBAR6_DEL13_ACTIVE_SEL << 13) | (MW_EPWMXBAR6_DEL14_ACTIVE_SEL << 14) | (MW_EPWMXBAR6_DEL15_ACTIVE_SEL << 15) | (MW_EPWMXBAR6_DEL16_ACTIVE_SEL << 16) | (MW_EPWMXBAR6_DEL17_ACTIVE_SEL << 17) | (MW_EPWMXBAR6_DEL18_ACTIVE_SEL << 18) | (MW_EPWMXBAR6_DEL19_ACTIVE_SEL << 19) | (MW_EPWMXBAR6_DEL20_ACTIVE_SEL << 20) | (MW_EPWMXBAR6_DEL21_ACTIVE_SEL << 21) | (MW_EPWMXBAR6_DEL22_ACTIVE_SEL << 22) | (MW_EPWMXBAR6_DEL23_ACTIVE_SEL << 23) | (MW_EPWMXBAR6_DEL24_ACTIVE_SEL << 24) | (MW_EPWMXBAR6_DEL25_ACTIVE_SEL << 25) | (MW_EPWMXBAR6_DEL26_ACTIVE_SEL << 26) | (MW_EPWMXBAR6_DEL27_ACTIVE_SEL << 27) | (MW_EPWMXBAR6_DEL28_ACTIVE_SEL << 28) | (MW_EPWMXBAR6_DEL29_ACTIVE_SEL << 29) | (MW_EPWMXBAR6_DEL30_ACTIVE_SEL << 30) | (MW_EPWMXBAR6_DEL31_ACTIVE_SEL << 31);
    group8_epwmxbar[6] = (MW_EPWMXBAR6_EQEP0_ERR_SEL << 0) | (MW_EPWMXBAR6_EQEP1_ERR_SEL << 1) | (MW_EPWMXBAR6_EQEP2_ERR_SEL << 2) | (MW_EPWMXBAR6_FSIRX0_RX_TRIG0_SEL << 3) | (MW_EPWMXBAR6_FSIRX0_RX_TRIG1_SEL << 4) | (MW_EPWMXBAR6_FSIRX0_RX_TRIG2_SEL << 5) | (MW_EPWMXBAR6_FSIRX0_RX_TRIG3_SEL << 6) | (MW_EPWMXBAR6_FSIRX1_RX_TRIG0_SEL << 7) | (MW_EPWMXBAR6_FSIRX1_RX_TRIG1_SEL << 8) | (MW_EPWMXBAR6_FSIRX1_RX_TRIG2_SEL << 9) | (MW_EPWMXBAR6_FSIRX1_RX_TRIG3_SEL << 10) | (MW_EPWMXBAR6_FSIRX2_RX_TRIG0_SEL << 11) | (MW_EPWMXBAR6_FSIRX2_RX_TRIG1_SEL << 12) | (MW_EPWMXBAR6_FSIRX2_RX_TRIG2_SEL << 13) | (MW_EPWMXBAR6_FSIRX2_RX_TRIG3_SEL << 14) | (MW_EPWMXBAR6_FSIRX3_RX_TRIG0_SEL << 15) | (MW_EPWMXBAR6_FSIRX3_RX_TRIG1_SEL << 16) | (MW_EPWMXBAR6_FSIRX3_RX_TRIG2_SEL << 17) | (MW_EPWMXBAR6_FSIRX3_RX_TRIG3_SEL << 18) | (MW_EPWMXBAR6_ECAP0_TRIPOUT_SEL << 19) | (MW_EPWMXBAR6_ECAP1_TRIPOUT_SEL << 20) | (MW_EPWMXBAR6_ECAP2_TRIPOUT_SEL << 21) | (MW_EPWMXBAR6_ECAP3_TRIPOUT_SEL << 22) | (MW_EPWMXBAR6_ECAP4_TRIPOUT_SEL << 23) | (MW_EPWMXBAR6_ECAP5_TRIPOUT_SEL << 24) | (MW_EPWMXBAR6_ECAP6_TRIPOUT_SEL << 25) | (MW_EPWMXBAR6_ECAP7_TRIPOUT_SEL << 26) | (MW_EPWMXBAR6_ECAP8_TRIPOUT_SEL << 27) | (MW_EPWMXBAR6_ECAP9_TRIPOUT_SEL << 28);
    group0_epwmxbar[7] = (MW_EPWMXBAR7_CMPSSA0_CTRIPL_SEL << 0) | (MW_EPWMXBAR7_CMPSSA0_CTRIPH_SEL << 1) | (MW_EPWMXBAR7_CMPSSA1_CTRIPL_SEL << 2) | (MW_EPWMXBAR7_CMPSSA1_CTRIPH_SEL << 3) | (MW_EPWMXBAR7_CMPSSA2_CTRIPL_SEL << 4) | (MW_EPWMXBAR7_CMPSSA2_CTRIPH_SEL << 5) | (MW_EPWMXBAR7_CMPSSA3_CTRIPL_SEL << 6) | (MW_EPWMXBAR7_CMPSSA3_CTRIPH_SEL << 7) | (MW_EPWMXBAR7_CMPSSA4_CTRIPL_SEL << 8) | (MW_EPWMXBAR7_CMPSSA4_CTRIPH_SEL << 9) | (MW_EPWMXBAR7_CMPSSA5_CTRIPL_SEL << 10) | (MW_EPWMXBAR7_CMPSSA5_CTRIPH_SEL << 11) | (MW_EPWMXBAR7_CMPSSA6_CTRIPL_SEL << 12) | (MW_EPWMXBAR7_CMPSSA6_CTRIPH_SEL << 13) | (MW_EPWMXBAR7_CMPSSA7_CTRIPL_SEL << 14) | (MW_EPWMXBAR7_CMPSSA7_CTRIPH_SEL << 15) | (MW_EPWMXBAR7_CMPSSA8_CTRIPL_SEL << 16) | (MW_EPWMXBAR7_CMPSSA8_CTRIPH_SEL << 17) | (MW_EPWMXBAR7_CMPSSA9_CTRIPL_SEL << 18) | (MW_EPWMXBAR7_CMPSSA9_CTRIPH_SEL << 19);
    group1_epwmxbar[7] = (MW_EPWMXBAR7_CMPSSB0_CTRIPL_SEL << 0) | (MW_EPWMXBAR7_CMPSSB0_CTRIPH_SEL << 1) | (MW_EPWMXBAR7_CMPSSB1_CTRIPL_SEL << 2) | (MW_EPWMXBAR7_CMPSSB1_CTRIPH_SEL << 3) | (MW_EPWMXBAR7_CMPSSB2_CTRIPL_SEL << 4) | (MW_EPWMXBAR7_CMPSSB2_CTRIPH_SEL << 5) | (MW_EPWMXBAR7_CMPSSB3_CTRIPL_SEL << 6) | (MW_EPWMXBAR7_CMPSSB3_CTRIPH_SEL << 7) | (MW_EPWMXBAR7_CMPSSB4_CTRIPL_SEL << 8) | (MW_EPWMXBAR7_CMPSSB4_CTRIPH_SEL << 9) | (MW_EPWMXBAR7_CMPSSB5_CTRIPL_SEL << 10) | (MW_EPWMXBAR7_CMPSSB5_CTRIPH_SEL << 11) | (MW_EPWMXBAR7_CMPSSB6_CTRIPL_SEL << 12) | (MW_EPWMXBAR7_CMPSSB6_CTRIPH_SEL << 13) | (MW_EPWMXBAR7_CMPSSB7_CTRIPL_SEL << 14) | (MW_EPWMXBAR7_CMPSSB7_CTRIPH_SEL << 15) | (MW_EPWMXBAR7_CMPSSB8_CTRIPL_SEL << 16) | (MW_EPWMXBAR7_CMPSSB8_CTRIPH_SEL << 17) | (MW_EPWMXBAR7_CMPSSB9_CTRIPL_SEL << 18) | (MW_EPWMXBAR7_CMPSSB9_CTRIPH_SEL << 19);
    group2_epwmxbar[7] = (MW_EPWMXBAR7_SD0_FILT0_CEVT1_SEL << 0) | (MW_EPWMXBAR7_SD0_FILT0_CEVT2_SEL << 1) | (MW_EPWMXBAR7_SD0_FILT0_CMPHZ_SEL << 2) | (MW_EPWMXBAR7_SD0_FILT1_CEVT1_SEL << 3) | (MW_EPWMXBAR7_SD0_FILT1_CEVT2_SEL << 4) | (MW_EPWMXBAR7_SD0_FILT1_CMPHZ_SEL << 5) | (MW_EPWMXBAR7_SD0_FILT2_CEVT1_SEL << 6) | (MW_EPWMXBAR7_SD0_FILT2_CEVT2_SEL << 7) | (MW_EPWMXBAR7_SD0_FILT2_CMPHZ_SEL << 8) | (MW_EPWMXBAR7_SD0_FILT3_CEVT1_SEL << 9) | (MW_EPWMXBAR7_SD0_FILT3_CEVT2_SEL << 10) | (MW_EPWMXBAR7_SD0_FILT3_CMPHZ_SEL << 11) | (MW_EPWMXBAR7_SD1_FILT0_CEVT1_SEL << 12) | (MW_EPWMXBAR7_SD1_FILT0_CEVT2_SEL << 13) | (MW_EPWMXBAR7_SD1_FILT0_CMPHZ_SEL << 14) | (MW_EPWMXBAR7_SD1_FILT1_CEVT1_SEL << 15) | (MW_EPWMXBAR7_SD1_FILT1_CEVT2_SEL << 16) | (MW_EPWMXBAR7_SD1_FILT1_CMPHZ_SEL << 17) | (MW_EPWMXBAR7_SD1_FILT2_CEVT1_SEL << 18) | (MW_EPWMXBAR7_SD1_FILT2_CEVT2_SEL << 19) | (MW_EPWMXBAR7_SD1_FILT2_CMPHZ_SEL << 20) | (MW_EPWMXBAR7_SD1_FILT3_CEVT1_SEL << 21) | (MW_EPWMXBAR7_SD1_FILT3_CEVT2_SEL << 22) | (MW_EPWMXBAR7_SD1_FILT3_CMPHZ_SEL << 23);
    group3_epwmxbar[7] = (MW_EPWMXBAR7_ADC0_EVT1_SEL << 0) | (MW_EPWMXBAR7_ADC0_EVT2_SEL << 1) | (MW_EPWMXBAR7_ADC0_EVT3_SEL << 2) | (MW_EPWMXBAR7_ADC0_EVT4_SEL << 3) | (MW_EPWMXBAR7_ADC1_EVT1_SEL << 4) | (MW_EPWMXBAR7_ADC1_EVT2_SEL << 5) | (MW_EPWMXBAR7_ADC1_EVT3_SEL << 6) | (MW_EPWMXBAR7_ADC1_EVT4_SEL << 7) | (MW_EPWMXBAR7_ADC2_EVT1_SEL << 8) | (MW_EPWMXBAR7_ADC2_EVT2_SEL << 9) | (MW_EPWMXBAR7_ADC2_EVT3_SEL << 10) | (MW_EPWMXBAR7_ADC2_EVT4_SEL << 11) | (MW_EPWMXBAR7_ADC3_EVT1_SEL << 12) | (MW_EPWMXBAR7_ADC3_EVT2_SEL << 13) | (MW_EPWMXBAR7_ADC3_EVT3_SEL << 14) | (MW_EPWMXBAR7_ADC3_EVT4_SEL << 15) | (MW_EPWMXBAR7_ADC4_EVT1_SEL << 16) | (MW_EPWMXBAR7_ADC4_EVT2_SEL << 17) | (MW_EPWMXBAR7_ADC4_EVT3_SEL << 18) | (MW_EPWMXBAR7_ADC4_EVT4_SEL << 19);
