TexasInstruments/am26x-hsp/src/am263px_init.c
    // if(MW_EPWMXBAR7_GPIO0_SEL == 1 | MW_EPWMXBAR7_GPIO1_SEL == 1 | MW_EPWMXBAR7_GPIO2_SEL == 1 | MW_EPWMXBAR7_GPIO3_SEL == 1 | MW_EPWMXBAR7_GPIO4_SEL == 1 | MW_EPWMXBAR7_GPIO5_SEL == 1 | MW_EPWMXBAR7_GPIO6_SEL == 1 | MW_EPWMXBAR7_GPIO7_SEL == 1| MW_EPWMXBAR7_GPIO8_SEL == 1 | MW_EPWMXBAR7_GPIO9_SEL == 1 | MW_EPWMXBAR7_GPIO10_SEL == 1| MW_EPWMXBAR7_GPIO11_SEL == 1| MW_EPWMXBAR7_GPIO12_SEL == 1 | MW_EPWMXBAR7_GPIO13_SEL == 1 | MW_EPWMXBAR7_GPIO14_SEL == 1 | MW_EPWMXBAR7_GPIO15_SEL == 1 | MW_EPWMXBAR7_GPIO16_SEL == 1 | MW_EPWMXBAR7_GPIO17_SEL == 1 | MW_EPWMXBAR7_GPIO18_SEL == 1 | MW_EPWMXBAR7_GPIO19_SEL == 1 | MW_EPWMXBAR7_GPIO20_SEL == 1 | MW_EPWMXBAR7_GPIO21_SEL == 1 | MW_EPWMXBAR7_GPIO22_SEL == 1 | MW_EPWMXBAR7_GPIO23_SEL == 1 | MW_EPWMXBAR7_GPIO24_SEL == 1 | MW_EPWMXBAR7_GPIO25_SEL == 1 | MW_EPWMXBAR7_GPIO26_SEL == 1 | MW_EPWMXBAR7_GPIO27_SEL == 1 | MW_EPWMXBAR7_GPIO28_SEL == 1 | MW_EPWMXBAR7_GPIO29_SEL == 1 | MW_EPWMXBAR7_GPIO30_SEL == 1 | MW_EPWMXBAR7_GPIO31_SEL == 1 | MW_EPWMXBAR7_GPIO32_SEL == 1 | MW_EPWMXBAR7_GPIO33_SEL == 1 | MW_EPWMXBAR7_GPIO34_SEL == 1 | MW_EPWMXBAR7_GPIO35_SEL == 1 | MW_EPWMXBAR7_GPIO36_SEL == 1 | MW_EPWMXBAR7_GPIO37_SEL == 1 | MW_EPWMXBAR7_GPIO38_SEL == 1 | MW_EPWMXBAR7_GPIO39_SEL == 1 | MW_EPWMXBAR7_GPIO40_SEL == 1 | MW_EPWMXBAR7_GPIO41_SEL == 1 | MW_EPWMXBAR7_GPIO42_SEL == 1 | MW_EPWMXBAR7_GPIO43_SEL == 1 | MW_EPWMXBAR7_GPIO44_SEL == 1 | | MW_EPWMXBAR7_GPIO45_SEL == 1 | MW_EPWMXBAR7_GPIO46_SEL == 1 | MW_EPWMXBAR7_GPIO47_SEL == 1| MW_EPWMXBAR7_GPIO48_SEL == 1 | MW_EPWMXBAR7_GPIO49_SEL == 1 | MW_EPWMXBAR7_GPIO50_SEL == 1 | MW_EPWMXBAR7_GPIO51_SEL == 1 | MW_EPWMXBAR7_GPIO52_SEL == 1 | MW_EPWMXBAR7_GPIO53_SEL == 1 | MW_EPWMXBAR7_GPIO54_SEL == 1 | MW_EPWMXBAR7_GPIO55_SEL == 1 | MW_EPWMXBAR7_GPIO56_SEL == 1 | MW_EPWMXBAR7_GPIO57_SEL == 1| MW_EPWMXBAR7_GPIO58_SEL == 1 | MW_EPWMXBAR7_GPIO59_SEL == 1 | MW_EPWMXBAR7_GPIO60_SEL == 1 | MW_EPWMXBAR7_GPIO61_SEL == 1 | MW_EPWMXBAR7_GPIO62_SEL == 1 | MW_EPWMXBAR7_GPIO63_SEL == 1 | MW_EPWMXBAR7_GPIO64_SEL == 1 | | MW_EPWMXBAR7_GPIO59_SEL == 1 | MW_EPWMXBAR7_GPIO60_SEL == 1 | MW_EPWMXBAR7_GPIO61_SEL == 1 | MW_EPWMXBAR7_GPIO62_SEL == 1 | MW_EPWMXBAR7_GPIO63_SEL == 1 | MW_EPWMXBAR7_GPIO64_SEL == 1 | MW_EPWMXBAR7_GPIO65_SEL == 1 | MW_EPWMXBAR7_GPIO66_SEL == 1 | MW_EPWMXBAR7_GPIO67_SEL == 1 | MW_EPWMXBAR7_GPIO68_SEL == 1 | MW_EPWMXBAR7_GPIO69_SEL == 1 | MW_EPWMXBAR7_GPIO70_SEL == 1 | MW_EPWMXBAR7_GPIO71_SEL == 1 | MW_EPWMXBAR7_GPIO72_SEL == 1 | MW_EPWMXBAR7_GPIO73_SEL == 1 | MW_EPWMXBAR7_GPIO74_SEL == 1 | MW_EPWMXBAR7_GPIO75_SEL == 1 | MW_EPWMXBAR7_GPIO76_SEL == 1 | MW_EPWMXBAR7_GPIO77_SEL == 1 | MW_EPWMXBAR7_GPIO78_SEL == 1 | | MW_EPWMXBAR7_GPIO80_SEL == 1 | MW_EPWMXBAR7_GPIO81_SEL == 1 | MW_EPWMXBAR7_GPIO82_SEL == 1 | MW_EPWMXBAR7_GPIO83_SEL == 1 | MW_EPWMXBAR7_GPIO84_SEL == 1 | MW_EPWMXBAR7_GPIO85_SEL == 1 | MW_EPWMXBAR7_GPIO86_SEL == 1 | MW_EPWMXBAR7_GPIO87_SEL == 1 | MW_EPWMXBAR7_GPIO88_SEL == 1 | MW_EPWMXBAR7_GPIO89_SEL == 1 | MW_EPWMXBAR7_GPIO90_SEL == 1 | MW_EPWMXBAR7_GPIO91_SEL == 1 | MW_EPWMXBAR7_GPIO92_SEL == 1 | MW_EPWMXBAR7_GPIO93_SEL == 1 | MW_EPWMXBAR7_GPIO94_SEL == 1 | MW_EPWMXBAR7_GPIO95_SEL == 1 | MW_EPWMXBAR7_GPIO96_SEL == 1 | MW_EPWMXBAR7_GPIO97_SEL == 1 | MW_EPWMXBAR7_GPIO98_SEL == 1 | MW_EPWMXBAR7_GPIO99_SEL == 1 | MW_EPWMXBAR7_GPIO100_SEL == 1 | MW_EPWMXBAR7_GPIO101_SEL == 1 | MW_EPWMXBAR7_GPIO102_SEL == 1 | MW_EPWMXBAR7_GPIO103_SEL == 1 | MW_EPWMXBAR7_GPIO104_SEL == 1 | MW_EPWMXBAR7_GPIO105_SEL == 1 | MW_EPWMXBAR7_GPIO106_SEL == 1 | MW_EPWMXBAR7_GPIO107_SEL == 1 | | MW_EPWMXBAR7_GPIO108_SEL == 1 | MW_EPWMXBAR7_GPIO109_SEL == 1| MW_EPWMXBAR7_GPIO110_SEL == 1 | MW_EPWMXBAR7_GPIO111_SEL == 1 | MW_EPWMXBAR7_GPIO112_SEL == 1 | MW_EPWMXBAR7_GPIO113_SEL == 1 | MW_EPWMXBAR7_GPIO114_SEL == 1 | MW_EPWMXBAR7_GPIO115_SEL == 1 | MW_EPWMXBAR7_GPIO116_SEL == 1 | MW_EPWMXBAR7_GPIO117_SEL == 1 | MW_EPWMXBAR7_GPIO118_SEL == 1 | MW_EPWMXBAR7_GPIO119_SEL == 1 | MW_EPWMXBAR7_GPIO120_SEL == 1 | MW_EPWMXBAR7_GPIO121_SEL == 1 | MW_EPWMXBAR7_GPIO122_SEL == 1 | MW_EPWMXBAR7_GPIO123_SEL == 1 | MW_EPWMXBAR7_GPIO124_SEL == 1 | MW_EPWMXBAR7_GPIO125_SEL == 1 | MW_EPWMXBAR7_GPIO126_SEL == 1 | MW_EPWMXBAR7_GPIO127_SEL == 1 | MW_EPWMXBAR7_GPIO128_SEL == 1 | MW_EPWMXBAR7_GPIO129_SEL == 1 | MW_EPWMXBAR7_GPIO130_SEL == 1 | MW_EPWMXBAR7_GPIO131_SEL == 1 | MW_EPWMXBAR7_GPIO132_SEL == 1 | MW_EPWMXBAR7_GPIO133_SEL == 1 | MW_EPWMXBAR7_GPIO134_SEL == 1 | MW_EPWMXBAR7_GPIO135_SEL == 1 | MW_EPWMXBAR7_GPIO136_SEL == 1 | MW_EPWMXBAR7_GPIO137_SEL == 1 | MW_EPWMXBAR7_GPIO139_SEL == 1 | MW_EPWMXBAR7_GPIO140_SEL == 1 | MW_EPWMXBAR7_GPIO141_SEL == 1 | MW_EPWMXBAR7_GPIO142_SEL == 1 | MW_EPWMXBAR7_GPIO143_SEL == 1 | MW_EPWMXBAR7_ICSSGPO0_PORT0_SEL == 1 | MW_EPWMXBAR7_ICSSGPO1_PORT0_SEL == 1 | MW_EPWMXBAR7_ICSSGPO2_PORT0_SEL == 1 | MW_EPWMXBAR7_ICSSGPO3_PORT0_SEL == 1 | MW_EPWMXBAR7_ICSSGPO4_PORT0_SEL == 1 | MW_EPWMXBAR7_ICSSGPO5_PORT0_SEL == 1 | MW_EPWMXBAR7_ICSSGPO6_PORT0_SEL == 1 | MW_EPWMXBAR7_ICSSGPO7_PORT0_SEL == 1 | MW_EPWMXBAR7_ICSSGPO8_PORT0_SEL == 1 | MW_EPWMXBAR7_ICSSGPO9_PORT0_SEL == 1 | MW_EPWMXBAR7_ICSSGPO10_PORT0_SEL == 1 | MW_EPWMXBAR7_ICSSGPO11_PORT0_SEL == 1 | MW_EPWMXBAR7_ICSSGPO12_PORT0_SEL == 1 | MW_EPWMXBAR7_ICSSGPO13_PORT0_SEL == 1 | MW_EPWMXBAR7_ICSSGPO14_PORT0_SEL == 1 | MW_EPWMXBAR7_ICSSGPO15_PORT0_SEL == 1 | MW_EPWMXBAR7_ICSSGPO0_PORT1_SEL == 1 | MW_EPWMXBAR7_ICSSGPO1_PORT1_SEL == 1 | MW_EPWMXBAR7_ICSSGPO2_PORT1_SEL == 1 | MW_EPWMXBAR7_ICSSGPO3_PORT1_SEL == 1 | MW_EPWMXBAR7_ICSSGPO4_PORT1_SEL == 1 | MW_EPWMXBAR7_ICSSGPO5_PORT1_SEL == 1 | MW_EPWMXBAR7_ICSSGPO6_PORT1_SEL == 1 | MW_EPWMXBAR7_ICSSGPO7_PORT1_SEL == 1 | MW_EPWMXBAR7_ICSSGPO8_PORT1_SEL == 1 | MW_EPWMXBAR7_ICSSGPO9_PORT1_SEL == 1 | MW_EPWMXBAR7_ICSSGPO10_PORT1_SEL == 1 | MW_EPWMXBAR7_ICSSGPO11_PORT1_SEL == 1 | MW_EPWMXBAR7_ICSSGPO12_PORT1_SEL == 1 | MW_EPWMXBAR7_ICSSGPO13_PORT1_SEL == 1 | MW_EPWMXBAR7_ICSSGPO14_PORT1_SEL == 1 | MW_EPWMXBAR7_ICSSGPO15_PORT1_SEL == 1)
    //     group4_epwmxbar[7] = EPWM_XBAR_7;
    // else
        group4_epwmxbar[7] = 0;
    group5_epwmxbar[7] = (MW_EPWMXBAR7_EPWM0_TRIPOUT_SEL << 0) | (MW_EPWMXBAR7_EPWM1_TRIPOUT_SEL << 1) | (MW_EPWMXBAR7_EPWM2_TRIPOUT_SEL << 2) | (MW_EPWMXBAR7_EPWM3_TRIPOUT_SEL << 3) | (MW_EPWMXBAR7_EPWM4_TRIPOUT_SEL << 4) | (MW_EPWMXBAR7_EPWM5_TRIPOUT_SEL << 5) | (MW_EPWMXBAR7_EPWM6_TRIPOUT_SEL << 6) | (MW_EPWMXBAR7_EPWM7_TRIPOUT_SEL << 7) | (MW_EPWMXBAR7_EPWM8_TRIPOUT_SEL << 8) | (MW_EPWMXBAR7_EPWM9_TRIPOUT_SEL << 9) | (MW_EPWMXBAR7_EPWM10_TRIPOUT_SEL << 10) | (MW_EPWMXBAR7_EPWM11_TRIPOUT_SEL << 11) | (MW_EPWMXBAR7_EPWM12_TRIPOUT_SEL << 12) | (MW_EPWMXBAR7_EPWM13_TRIPOUT_SEL << 13) | (MW_EPWMXBAR7_EPWM14_TRIPOUT_SEL << 14) | (MW_EPWMXBAR7_EPWM15_TRIPOUT_SEL << 15) | (MW_EPWMXBAR7_EPWM16_TRIPOUT_SEL << 16) | (MW_EPWMXBAR7_EPWM17_TRIPOUT_SEL << 17) | (MW_EPWMXBAR7_EPWM18_TRIPOUT_SEL << 18) | (MW_EPWMXBAR7_EPWM19_TRIPOUT_SEL << 19) | (MW_EPWMXBAR7_EPWM20_TRIPOUT_SEL << 20) | (MW_EPWMXBAR7_EPWM21_TRIPOUT_SEL << 21) | (MW_EPWMXBAR7_EPWM22_TRIPOUT_SEL << 22) | (MW_EPWMXBAR7_EPWM23_TRIPOUT_SEL << 23) | (MW_EPWMXBAR7_EPWM24_TRIPOUT_SEL << 24) | (MW_EPWMXBAR7_EPWM25_TRIPOUT_SEL << 25) | (MW_EPWMXBAR7_EPWM26_TRIPOUT_SEL << 26) | (MW_EPWMXBAR7_EPWM27_TRIPOUT_SEL << 27) | (MW_EPWMXBAR7_EPWM28_TRIPOUT_SEL << 28) | (MW_EPWMXBAR7_EPWM29_TRIPOUT_SEL << 29) | (MW_EPWMXBAR7_EPWM30_TRIPOUT_SEL << 30) | (MW_EPWMXBAR7_EPWM31_TRIPOUT_SEL << 31);
    group6_epwmxbar[7] = (MW_EPWMXBAR7_DEL0_TRIP_SEL << 0) | (MW_EPWMXBAR7_DEL1_TRIP_SEL << 1) | (MW_EPWMXBAR7_DEL2_TRIP_SEL << 2) | (MW_EPWMXBAR7_DEL3_TRIP_SEL << 3) | (MW_EPWMXBAR7_DEL4_TRIP_SEL << 4) | (MW_EPWMXBAR7_DEL5_TRIP_SEL << 5) | (MW_EPWMXBAR7_DEL6_TRIP_SEL << 6) | (MW_EPWMXBAR7_DEL7_TRIP_SEL << 7) | (MW_EPWMXBAR7_DEL8_TRIP_SEL << 8) | (MW_EPWMXBAR7_DEL9_TRIP_SEL << 9) | (MW_EPWMXBAR7_DEL10_TRIP_SEL << 10) | (MW_EPWMXBAR7_DEL11_TRIP_SEL << 11) | (MW_EPWMXBAR7_DEL12_TRIP_SEL << 12) | (MW_EPWMXBAR7_DEL13_TRIP_SEL << 13) | (MW_EPWMXBAR7_DEL14_TRIP_SEL << 14) | (MW_EPWMXBAR7_DEL15_TRIP_SEL << 15) | (MW_EPWMXBAR7_DEL16_TRIP_SEL << 16) | (MW_EPWMXBAR7_DEL17_TRIP_SEL << 17) | (MW_EPWMXBAR7_DEL18_TRIP_SEL << 18) | (MW_EPWMXBAR7_DEL19_TRIP_SEL << 19) | (MW_EPWMXBAR7_DEL20_TRIP_SEL << 20) | (MW_EPWMXBAR7_DEL21_TRIP_SEL << 21) | (MW_EPWMXBAR7_DEL22_TRIP_SEL << 22) | (MW_EPWMXBAR7_DEL23_TRIP_SEL << 23) | (MW_EPWMXBAR7_DEL24_TRIP_SEL << 24) | (MW_EPWMXBAR7_DEL25_TRIP_SEL << 25) | (MW_EPWMXBAR7_DEL26_TRIP_SEL << 26) | (MW_EPWMXBAR7_DEL27_TRIP_SEL << 27) | (MW_EPWMXBAR7_DEL28_TRIP_SEL << 28) | (MW_EPWMXBAR7_DEL29_TRIP_SEL << 29) | (MW_EPWMXBAR7_DEL30_TRIP_SEL << 30) | (MW_EPWMXBAR7_DEL31_TRIP_SEL << 31);
    group7_epwmxbar[7] = (MW_EPWMXBAR7_DEL0_ACTIVE_SEL << 0) | (MW_EPWMXBAR7_DEL1_ACTIVE_SEL << 1) | (MW_EPWMXBAR7_DEL2_ACTIVE_SEL << 2) | (MW_EPWMXBAR7_DEL3_ACTIVE_SEL << 3) | (MW_EPWMXBAR7_DEL4_ACTIVE_SEL << 4) | (MW_EPWMXBAR7_DEL5_ACTIVE_SEL << 5) | (MW_EPWMXBAR7_DEL6_ACTIVE_SEL << 6) | (MW_EPWMXBAR7_DEL7_ACTIVE_SEL << 7) | (MW_EPWMXBAR7_DEL8_ACTIVE_SEL << 8) | (MW_EPWMXBAR7_DEL9_ACTIVE_SEL << 9) | (MW_EPWMXBAR7_DEL10_ACTIVE_SEL << 10) | (MW_EPWMXBAR7_DEL11_ACTIVE_SEL << 11) | (MW_EPWMXBAR7_DEL12_ACTIVE_SEL << 12) | (MW_EPWMXBAR7_DEL13_ACTIVE_SEL << 13) | (MW_EPWMXBAR7_DEL14_ACTIVE_SEL << 14) | (MW_EPWMXBAR7_DEL15_ACTIVE_SEL << 15) | (MW_EPWMXBAR7_DEL16_ACTIVE_SEL << 16) | (MW_EPWMXBAR7_DEL17_ACTIVE_SEL << 17) | (MW_EPWMXBAR7_DEL18_ACTIVE_SEL << 18) | (MW_EPWMXBAR7_DEL19_ACTIVE_SEL << 19) | (MW_EPWMXBAR7_DEL20_ACTIVE_SEL << 20) | (MW_EPWMXBAR7_DEL21_ACTIVE_SEL << 21) | (MW_EPWMXBAR7_DEL22_ACTIVE_SEL << 22) | (MW_EPWMXBAR7_DEL23_ACTIVE_SEL << 23) | (MW_EPWMXBAR7_DEL24_ACTIVE_SEL << 24) | (MW_EPWMXBAR7_DEL25_ACTIVE_SEL << 25) | (MW_EPWMXBAR7_DEL26_ACTIVE_SEL << 26) | (MW_EPWMXBAR7_DEL27_ACTIVE_SEL << 27) | (MW_EPWMXBAR7_DEL28_ACTIVE_SEL << 28) | (MW_EPWMXBAR7_DEL29_ACTIVE_SEL << 29) | (MW_EPWMXBAR7_DEL30_ACTIVE_SEL << 30) | (MW_EPWMXBAR7_DEL31_ACTIVE_SEL << 31);
    group8_epwmxbar[7] = (MW_EPWMXBAR7_EQEP0_ERR_SEL << 0) | (MW_EPWMXBAR7_EQEP1_ERR_SEL << 1) | (MW_EPWMXBAR7_EQEP2_ERR_SEL << 2) | (MW_EPWMXBAR7_FSIRX0_RX_TRIG0_SEL << 3) | (MW_EPWMXBAR7_FSIRX0_RX_TRIG1_SEL << 4) | (MW_EPWMXBAR7_FSIRX0_RX_TRIG2_SEL << 5) | (MW_EPWMXBAR7_FSIRX0_RX_TRIG3_SEL << 6) | (MW_EPWMXBAR7_FSIRX1_RX_TRIG0_SEL << 7) | (MW_EPWMXBAR7_FSIRX1_RX_TRIG1_SEL << 8) | (MW_EPWMXBAR7_FSIRX1_RX_TRIG2_SEL << 9) | (MW_EPWMXBAR7_FSIRX1_RX_TRIG3_SEL << 10) | (MW_EPWMXBAR7_FSIRX2_RX_TRIG0_SEL << 11) | (MW_EPWMXBAR7_FSIRX2_RX_TRIG1_SEL << 12) | (MW_EPWMXBAR7_FSIRX2_RX_TRIG2_SEL << 13) | (MW_EPWMXBAR7_FSIRX2_RX_TRIG3_SEL << 14) | (MW_EPWMXBAR7_FSIRX3_RX_TRIG0_SEL << 15) | (MW_EPWMXBAR7_FSIRX3_RX_TRIG1_SEL << 16) | (MW_EPWMXBAR7_FSIRX3_RX_TRIG2_SEL << 17) | (MW_EPWMXBAR7_FSIRX3_RX_TRIG3_SEL << 18) | (MW_EPWMXBAR7_ECAP0_TRIPOUT_SEL << 19) | (MW_EPWMXBAR7_ECAP1_TRIPOUT_SEL << 20) | (MW_EPWMXBAR7_ECAP2_TRIPOUT_SEL << 21) | (MW_EPWMXBAR7_ECAP3_TRIPOUT_SEL << 22) | (MW_EPWMXBAR7_ECAP4_TRIPOUT_SEL << 23) | (MW_EPWMXBAR7_ECAP5_TRIPOUT_SEL << 24) | (MW_EPWMXBAR7_ECAP6_TRIPOUT_SEL << 25) | (MW_EPWMXBAR7_ECAP7_TRIPOUT_SEL << 26) | (MW_EPWMXBAR7_ECAP8_TRIPOUT_SEL << 27) | (MW_EPWMXBAR7_ECAP9_TRIPOUT_SEL << 28);
    group0_epwmxbar[8] = (MW_EPWMXBAR8_CMPSSA0_CTRIPL_SEL << 0) | (MW_EPWMXBAR8_CMPSSA0_CTRIPH_SEL << 1) | (MW_EPWMXBAR8_CMPSSA1_CTRIPL_SEL << 2) | (MW_EPWMXBAR8_CMPSSA1_CTRIPH_SEL << 3) | (MW_EPWMXBAR8_CMPSSA2_CTRIPL_SEL << 4) | (MW_EPWMXBAR8_CMPSSA2_CTRIPH_SEL << 5) | (MW_EPWMXBAR8_CMPSSA3_CTRIPL_SEL << 6) | (MW_EPWMXBAR8_CMPSSA3_CTRIPH_SEL << 7) | (MW_EPWMXBAR8_CMPSSA4_CTRIPL_SEL << 8) | (MW_EPWMXBAR8_CMPSSA4_CTRIPH_SEL << 9) | (MW_EPWMXBAR8_CMPSSA5_CTRIPL_SEL << 10) | (MW_EPWMXBAR8_CMPSSA5_CTRIPH_SEL << 11) | (MW_EPWMXBAR8_CMPSSA6_CTRIPL_SEL << 12) | (MW_EPWMXBAR8_CMPSSA6_CTRIPH_SEL << 13) | (MW_EPWMXBAR8_CMPSSA7_CTRIPL_SEL << 14) | (MW_EPWMXBAR8_CMPSSA7_CTRIPH_SEL << 15) | (MW_EPWMXBAR8_CMPSSA8_CTRIPL_SEL << 16) | (MW_EPWMXBAR8_CMPSSA8_CTRIPH_SEL << 17) | (MW_EPWMXBAR8_CMPSSA9_CTRIPL_SEL << 18) | (MW_EPWMXBAR8_CMPSSA9_CTRIPH_SEL << 19);
    group1_epwmxbar[8] = (MW_EPWMXBAR8_CMPSSB0_CTRIPL_SEL << 0) | (MW_EPWMXBAR8_CMPSSB0_CTRIPH_SEL << 1) | (MW_EPWMXBAR8_CMPSSB1_CTRIPL_SEL << 2) | (MW_EPWMXBAR8_CMPSSB1_CTRIPH_SEL << 3) | (MW_EPWMXBAR8_CMPSSB2_CTRIPL_SEL << 4) | (MW_EPWMXBAR8_CMPSSB2_CTRIPH_SEL << 5) | (MW_EPWMXBAR8_CMPSSB3_CTRIPL_SEL << 6) | (MW_EPWMXBAR8_CMPSSB3_CTRIPH_SEL << 7) | (MW_EPWMXBAR8_CMPSSB4_CTRIPL_SEL << 8) | (MW_EPWMXBAR8_CMPSSB4_CTRIPH_SEL << 9) | (MW_EPWMXBAR8_CMPSSB5_CTRIPL_SEL << 10) | (MW_EPWMXBAR8_CMPSSB5_CTRIPH_SEL << 11) | (MW_EPWMXBAR8_CMPSSB6_CTRIPL_SEL << 12) | (MW_EPWMXBAR8_CMPSSB6_CTRIPH_SEL << 13) | (MW_EPWMXBAR8_CMPSSB7_CTRIPL_SEL << 14) | (MW_EPWMXBAR8_CMPSSB7_CTRIPH_SEL << 15) | (MW_EPWMXBAR8_CMPSSB8_CTRIPL_SEL << 16) | (MW_EPWMXBAR8_CMPSSB8_CTRIPH_SEL << 17) | (MW_EPWMXBAR8_CMPSSB9_CTRIPL_SEL << 18) | (MW_EPWMXBAR8_CMPSSB9_CTRIPH_SEL << 19);
    group2_epwmxbar[8] = (MW_EPWMXBAR8_SD0_FILT0_CEVT1_SEL << 0) | (MW_EPWMXBAR8_SD0_FILT0_CEVT2_SEL << 1) | (MW_EPWMXBAR8_SD0_FILT0_CMPHZ_SEL << 2) | (MW_EPWMXBAR8_SD0_FILT1_CEVT1_SEL << 3) | (MW_EPWMXBAR8_SD0_FILT1_CEVT2_SEL << 4) | (MW_EPWMXBAR8_SD0_FILT1_CMPHZ_SEL << 5) | (MW_EPWMXBAR8_SD0_FILT2_CEVT1_SEL << 6) | (MW_EPWMXBAR8_SD0_FILT2_CEVT2_SEL << 7) | (MW_EPWMXBAR8_SD0_FILT2_CMPHZ_SEL << 8) | (MW_EPWMXBAR8_SD0_FILT3_CEVT1_SEL << 9) | (MW_EPWMXBAR8_SD0_FILT3_CEVT2_SEL << 10) | (MW_EPWMXBAR8_SD0_FILT3_CMPHZ_SEL << 11) | (MW_EPWMXBAR8_SD1_FILT0_CEVT1_SEL << 12) | (MW_EPWMXBAR8_SD1_FILT0_CEVT2_SEL << 13) | (MW_EPWMXBAR8_SD1_FILT0_CMPHZ_SEL << 14) | (MW_EPWMXBAR8_SD1_FILT1_CEVT1_SEL << 15) | (MW_EPWMXBAR8_SD1_FILT1_CEVT2_SEL << 16) | (MW_EPWMXBAR8_SD1_FILT1_CMPHZ_SEL << 17) | (MW_EPWMXBAR8_SD1_FILT2_CEVT1_SEL << 18) | (MW_EPWMXBAR8_SD1_FILT2_CEVT2_SEL << 19) | (MW_EPWMXBAR8_SD1_FILT2_CMPHZ_SEL << 20) | (MW_EPWMXBAR8_SD1_FILT3_CEVT1_SEL << 21) | (MW_EPWMXBAR8_SD1_FILT3_CEVT2_SEL << 22) | (MW_EPWMXBAR8_SD1_FILT3_CMPHZ_SEL << 23);
    group3_epwmxbar[8] = (MW_EPWMXBAR8_ADC0_EVT1_SEL << 0) | (MW_EPWMXBAR8_ADC0_EVT2_SEL << 1) | (MW_EPWMXBAR8_ADC0_EVT3_SEL << 2) | (MW_EPWMXBAR8_ADC0_EVT4_SEL << 3) | (MW_EPWMXBAR8_ADC1_EVT1_SEL << 4) | (MW_EPWMXBAR8_ADC1_EVT2_SEL << 5) | (MW_EPWMXBAR8_ADC1_EVT3_SEL << 6) | (MW_EPWMXBAR8_ADC1_EVT4_SEL << 7) | (MW_EPWMXBAR8_ADC2_EVT1_SEL << 8) | (MW_EPWMXBAR8_ADC2_EVT2_SEL << 9) | (MW_EPWMXBAR8_ADC2_EVT3_SEL << 10) | (MW_EPWMXBAR8_ADC2_EVT4_SEL << 11) | (MW_EPWMXBAR8_ADC3_EVT1_SEL << 12) | (MW_EPWMXBAR8_ADC3_EVT2_SEL << 13) | (MW_EPWMXBAR8_ADC3_EVT3_SEL << 14) | (MW_EPWMXBAR8_ADC3_EVT4_SEL << 15) | (MW_EPWMXBAR8_ADC4_EVT1_SEL << 16) | (MW_EPWMXBAR8_ADC4_EVT2_SEL << 17) | (MW_EPWMXBAR8_ADC4_EVT3_SEL << 18) | (MW_EPWMXBAR8_ADC4_EVT4_SEL << 19);
    // if(MW_EPWMXBAR8_GPIO0_SEL == 1 | MW_EPWMXBAR8_GPIO1_SEL == 1 | MW_EPWMXBAR8_GPIO2_SEL == 1 | MW_EPWMXBAR8_GPIO3_SEL == 1 | MW_EPWMXBAR8_GPIO4_SEL == 1 | MW_EPWMXBAR8_GPIO5_SEL == 1 | MW_EPWMXBAR8_GPIO6_SEL == 1 | MW_EPWMXBAR8_GPIO7_SEL == 1| MW_EPWMXBAR8_GPIO8_SEL == 1 | MW_EPWMXBAR8_GPIO9_SEL == 1 | MW_EPWMXBAR8_GPIO10_SEL == 1| MW_EPWMXBAR8_GPIO11_SEL == 1| MW_EPWMXBAR8_GPIO12_SEL == 1 | MW_EPWMXBAR8_GPIO13_SEL == 1 | MW_EPWMXBAR8_GPIO14_SEL == 1 | MW_EPWMXBAR8_GPIO15_SEL == 1 | MW_EPWMXBAR8_GPIO16_SEL == 1 | MW_EPWMXBAR8_GPIO17_SEL == 1 | MW_EPWMXBAR8_GPIO18_SEL == 1 | MW_EPWMXBAR8_GPIO19_SEL == 1 | MW_EPWMXBAR8_GPIO20_SEL == 1 | MW_EPWMXBAR8_GPIO21_SEL == 1 | MW_EPWMXBAR8_GPIO22_SEL == 1 | MW_EPWMXBAR8_GPIO23_SEL == 1 | MW_EPWMXBAR8_GPIO24_SEL == 1 | MW_EPWMXBAR8_GPIO25_SEL == 1 | MW_EPWMXBAR8_GPIO26_SEL == 1 | MW_EPWMXBAR8_GPIO27_SEL == 1 | MW_EPWMXBAR8_GPIO28_SEL == 1 | MW_EPWMXBAR8_GPIO29_SEL == 1 | MW_EPWMXBAR8_GPIO30_SEL == 1 | MW_EPWMXBAR8_GPIO31_SEL == 1 | MW_EPWMXBAR8_GPIO32_SEL == 1 | MW_EPWMXBAR8_GPIO33_SEL == 1 | MW_EPWMXBAR8_GPIO34_SEL == 1 | MW_EPWMXBAR8_GPIO35_SEL == 1 | MW_EPWMXBAR8_GPIO36_SEL == 1 | MW_EPWMXBAR8_GPIO37_SEL == 1 | MW_EPWMXBAR8_GPIO38_SEL == 1 | MW_EPWMXBAR8_GPIO39_SEL == 1 | MW_EPWMXBAR8_GPIO40_SEL == 1 | MW_EPWMXBAR8_GPIO41_SEL == 1 | MW_EPWMXBAR8_GPIO42_SEL == 1 | MW_EPWMXBAR8_GPIO43_SEL == 1 | MW_EPWMXBAR8_GPIO44_SEL == 1 | | MW_EPWMXBAR8_GPIO45_SEL == 1 | MW_EPWMXBAR8_GPIO46_SEL == 1 | MW_EPWMXBAR8_GPIO47_SEL == 1| MW_EPWMXBAR8_GPIO48_SEL == 1 | MW_EPWMXBAR8_GPIO49_SEL == 1 | MW_EPWMXBAR8_GPIO50_SEL == 1 | MW_EPWMXBAR8_GPIO51_SEL == 1 | MW_EPWMXBAR8_GPIO52_SEL == 1 | MW_EPWMXBAR8_GPIO53_SEL == 1 | MW_EPWMXBAR8_GPIO54_SEL == 1 | MW_EPWMXBAR8_GPIO55_SEL == 1 | MW_EPWMXBAR8_GPIO56_SEL == 1 | MW_EPWMXBAR8_GPIO57_SEL == 1| MW_EPWMXBAR8_GPIO58_SEL == 1 | MW_EPWMXBAR8_GPIO59_SEL == 1 | MW_EPWMXBAR8_GPIO60_SEL == 1 | MW_EPWMXBAR8_GPIO61_SEL == 1 | MW_EPWMXBAR8_GPIO62_SEL == 1 | MW_EPWMXBAR8_GPIO63_SEL == 1 | MW_EPWMXBAR8_GPIO64_SEL == 1 | | MW_EPWMXBAR8_GPIO59_SEL == 1 | MW_EPWMXBAR8_GPIO60_SEL == 1 | MW_EPWMXBAR8_GPIO61_SEL == 1 | MW_EPWMXBAR8_GPIO62_SEL == 1 | MW_EPWMXBAR8_GPIO63_SEL == 1 | MW_EPWMXBAR8_GPIO64_SEL == 1 | MW_EPWMXBAR8_GPIO65_SEL == 1 | MW_EPWMXBAR8_GPIO66_SEL == 1 | MW_EPWMXBAR8_GPIO67_SEL == 1 | MW_EPWMXBAR8_GPIO68_SEL == 1 | MW_EPWMXBAR8_GPIO69_SEL == 1 | MW_EPWMXBAR8_GPIO70_SEL == 1 | MW_EPWMXBAR8_GPIO71_SEL == 1 | MW_EPWMXBAR8_GPIO72_SEL == 1 | MW_EPWMXBAR8_GPIO73_SEL == 1 | MW_EPWMXBAR8_GPIO74_SEL == 1 | MW_EPWMXBAR8_GPIO75_SEL == 1 | MW_EPWMXBAR8_GPIO76_SEL == 1 | MW_EPWMXBAR8_GPIO77_SEL == 1 | MW_EPWMXBAR8_GPIO78_SEL == 1 | | MW_EPWMXBAR8_GPIO80_SEL == 1 | MW_EPWMXBAR8_GPIO81_SEL == 1 | MW_EPWMXBAR8_GPIO82_SEL == 1 | MW_EPWMXBAR8_GPIO83_SEL == 1 | MW_EPWMXBAR8_GPIO84_SEL == 1 | MW_EPWMXBAR8_GPIO85_SEL == 1 | MW_EPWMXBAR8_GPIO86_SEL == 1 | MW_EPWMXBAR8_GPIO87_SEL == 1 | MW_EPWMXBAR8_GPIO88_SEL == 1 | MW_EPWMXBAR8_GPIO89_SEL == 1 | MW_EPWMXBAR8_GPIO90_SEL == 1 | MW_EPWMXBAR8_GPIO91_SEL == 1 | MW_EPWMXBAR8_GPIO92_SEL == 1 | MW_EPWMXBAR8_GPIO93_SEL == 1 | MW_EPWMXBAR8_GPIO94_SEL == 1 | MW_EPWMXBAR8_GPIO95_SEL == 1 | MW_EPWMXBAR8_GPIO96_SEL == 1 | MW_EPWMXBAR8_GPIO97_SEL == 1 | MW_EPWMXBAR8_GPIO98_SEL == 1 | MW_EPWMXBAR8_GPIO99_SEL == 1 | MW_EPWMXBAR8_GPIO100_SEL == 1 | MW_EPWMXBAR8_GPIO101_SEL == 1 | MW_EPWMXBAR8_GPIO102_SEL == 1 | MW_EPWMXBAR8_GPIO103_SEL == 1 | MW_EPWMXBAR8_GPIO104_SEL == 1 | MW_EPWMXBAR8_GPIO105_SEL == 1 | MW_EPWMXBAR8_GPIO106_SEL == 1 | MW_EPWMXBAR8_GPIO107_SEL == 1 | | MW_EPWMXBAR8_GPIO108_SEL == 1 | MW_EPWMXBAR8_GPIO109_SEL == 1| MW_EPWMXBAR8_GPIO110_SEL == 1 | MW_EPWMXBAR8_GPIO111_SEL == 1 | MW_EPWMXBAR8_GPIO112_SEL == 1 | MW_EPWMXBAR8_GPIO113_SEL == 1 | MW_EPWMXBAR8_GPIO114_SEL == 1 | MW_EPWMXBAR8_GPIO115_SEL == 1 | MW_EPWMXBAR8_GPIO116_SEL == 1 | MW_EPWMXBAR8_GPIO117_SEL == 1 | MW_EPWMXBAR8_GPIO118_SEL == 1 | MW_EPWMXBAR8_GPIO119_SEL == 1 | MW_EPWMXBAR8_GPIO120_SEL == 1 | MW_EPWMXBAR8_GPIO121_SEL == 1 | MW_EPWMXBAR8_GPIO122_SEL == 1 | MW_EPWMXBAR8_GPIO123_SEL == 1 | MW_EPWMXBAR8_GPIO124_SEL == 1 | MW_EPWMXBAR8_GPIO125_SEL == 1 | MW_EPWMXBAR8_GPIO126_SEL == 1 | MW_EPWMXBAR8_GPIO127_SEL == 1 | MW_EPWMXBAR8_GPIO128_SEL == 1 | MW_EPWMXBAR8_GPIO129_SEL == 1 | MW_EPWMXBAR8_GPIO130_SEL == 1 | MW_EPWMXBAR8_GPIO131_SEL == 1 | MW_EPWMXBAR8_GPIO132_SEL == 1 | MW_EPWMXBAR8_GPIO133_SEL == 1 | MW_EPWMXBAR8_GPIO134_SEL == 1 | MW_EPWMXBAR8_GPIO135_SEL == 1 | MW_EPWMXBAR8_GPIO136_SEL == 1 | MW_EPWMXBAR8_GPIO137_SEL == 1 | MW_EPWMXBAR8_GPIO139_SEL == 1 | MW_EPWMXBAR8_GPIO140_SEL == 1 | MW_EPWMXBAR8_GPIO141_SEL == 1 | MW_EPWMXBAR8_GPIO142_SEL == 1 | MW_EPWMXBAR8_GPIO143_SEL == 1 | MW_EPWMXBAR8_ICSSGPO0_PORT0_SEL == 1 | MW_EPWMXBAR8_ICSSGPO1_PORT0_SEL == 1 | MW_EPWMXBAR8_ICSSGPO2_PORT0_SEL == 1 | MW_EPWMXBAR8_ICSSGPO3_PORT0_SEL == 1 | MW_EPWMXBAR8_ICSSGPO4_PORT0_SEL == 1 | MW_EPWMXBAR8_ICSSGPO5_PORT0_SEL == 1 | MW_EPWMXBAR8_ICSSGPO6_PORT0_SEL == 1 | MW_EPWMXBAR8_ICSSGPO7_PORT0_SEL == 1 | MW_EPWMXBAR8_ICSSGPO8_PORT0_SEL == 1 | MW_EPWMXBAR8_ICSSGPO9_PORT0_SEL == 1 | MW_EPWMXBAR8_ICSSGPO10_PORT0_SEL == 1 | MW_EPWMXBAR8_ICSSGPO11_PORT0_SEL == 1 | MW_EPWMXBAR8_ICSSGPO12_PORT0_SEL == 1 | MW_EPWMXBAR8_ICSSGPO13_PORT0_SEL == 1 | MW_EPWMXBAR8_ICSSGPO14_PORT0_SEL == 1 | MW_EPWMXBAR8_ICSSGPO15_PORT0_SEL == 1 | MW_EPWMXBAR8_ICSSGPO0_PORT1_SEL == 1 | MW_EPWMXBAR8_ICSSGPO1_PORT1_SEL == 1 | MW_EPWMXBAR8_ICSSGPO2_PORT1_SEL == 1 | MW_EPWMXBAR8_ICSSGPO3_PORT1_SEL == 1 | MW_EPWMXBAR8_ICSSGPO4_PORT1_SEL == 1 | MW_EPWMXBAR8_ICSSGPO5_PORT1_SEL == 1 | MW_EPWMXBAR8_ICSSGPO6_PORT1_SEL == 1 | MW_EPWMXBAR8_ICSSGPO7_PORT1_SEL == 1 | MW_EPWMXBAR8_ICSSGPO8_PORT1_SEL == 1 | MW_EPWMXBAR8_ICSSGPO9_PORT1_SEL == 1 | MW_EPWMXBAR8_ICSSGPO10_PORT1_SEL == 1 | MW_EPWMXBAR8_ICSSGPO11_PORT1_SEL == 1 | MW_EPWMXBAR8_ICSSGPO12_PORT1_SEL == 1 | MW_EPWMXBAR8_ICSSGPO13_PORT1_SEL == 1 | MW_EPWMXBAR8_ICSSGPO14_PORT1_SEL == 1 | MW_EPWMXBAR8_ICSSGPO15_PORT1_SEL == 1)
    //     group4_epwmxbar[8] = EPWM_XBAR_8;
    // else
        group4_epwmxbar[8] = 0;
    group5_epwmxbar[8] = (MW_EPWMXBAR8_EPWM0_TRIPOUT_SEL << 0) | (MW_EPWMXBAR8_EPWM1_TRIPOUT_SEL << 1) | (MW_EPWMXBAR8_EPWM2_TRIPOUT_SEL << 2) | (MW_EPWMXBAR8_EPWM3_TRIPOUT_SEL << 3) | (MW_EPWMXBAR8_EPWM4_TRIPOUT_SEL << 4) | (MW_EPWMXBAR8_EPWM5_TRIPOUT_SEL << 5) | (MW_EPWMXBAR8_EPWM6_TRIPOUT_SEL << 6) | (MW_EPWMXBAR8_EPWM7_TRIPOUT_SEL << 7) | (MW_EPWMXBAR8_EPWM8_TRIPOUT_SEL << 8) | (MW_EPWMXBAR8_EPWM9_TRIPOUT_SEL << 9) | (MW_EPWMXBAR8_EPWM10_TRIPOUT_SEL << 10) | (MW_EPWMXBAR8_EPWM11_TRIPOUT_SEL << 11) | (MW_EPWMXBAR8_EPWM12_TRIPOUT_SEL << 12) | (MW_EPWMXBAR8_EPWM13_TRIPOUT_SEL << 13) | (MW_EPWMXBAR8_EPWM14_TRIPOUT_SEL << 14) | (MW_EPWMXBAR8_EPWM15_TRIPOUT_SEL << 15) | (MW_EPWMXBAR8_EPWM16_TRIPOUT_SEL << 16) | (MW_EPWMXBAR8_EPWM17_TRIPOUT_SEL << 17) | (MW_EPWMXBAR8_EPWM18_TRIPOUT_SEL << 18) | (MW_EPWMXBAR8_EPWM19_TRIPOUT_SEL << 19) | (MW_EPWMXBAR8_EPWM20_TRIPOUT_SEL << 20) | (MW_EPWMXBAR8_EPWM21_TRIPOUT_SEL << 21) | (MW_EPWMXBAR8_EPWM22_TRIPOUT_SEL << 22) | (MW_EPWMXBAR8_EPWM23_TRIPOUT_SEL << 23) | (MW_EPWMXBAR8_EPWM24_TRIPOUT_SEL << 24) | (MW_EPWMXBAR8_EPWM25_TRIPOUT_SEL << 25) | (MW_EPWMXBAR8_EPWM26_TRIPOUT_SEL << 26) | (MW_EPWMXBAR8_EPWM27_TRIPOUT_SEL << 27) | (MW_EPWMXBAR8_EPWM28_TRIPOUT_SEL << 28) | (MW_EPWMXBAR8_EPWM29_TRIPOUT_SEL << 29) | (MW_EPWMXBAR8_EPWM30_TRIPOUT_SEL << 30) | (MW_EPWMXBAR8_EPWM31_TRIPOUT_SEL << 31);
    group6_epwmxbar[8] = (MW_EPWMXBAR8_DEL0_TRIP_SEL << 0) | (MW_EPWMXBAR8_DEL1_TRIP_SEL << 1) | (MW_EPWMXBAR8_DEL2_TRIP_SEL << 2) | (MW_EPWMXBAR8_DEL3_TRIP_SEL << 3) | (MW_EPWMXBAR8_DEL4_TRIP_SEL << 4) | (MW_EPWMXBAR8_DEL5_TRIP_SEL << 5) | (MW_EPWMXBAR8_DEL6_TRIP_SEL << 6) | (MW_EPWMXBAR8_DEL7_TRIP_SEL << 7) | (MW_EPWMXBAR8_DEL8_TRIP_SEL << 8) | (MW_EPWMXBAR8_DEL9_TRIP_SEL << 9) | (MW_EPWMXBAR8_DEL10_TRIP_SEL << 10) | (MW_EPWMXBAR8_DEL11_TRIP_SEL << 11) | (MW_EPWMXBAR8_DEL12_TRIP_SEL << 12) | (MW_EPWMXBAR8_DEL13_TRIP_SEL << 13) | (MW_EPWMXBAR8_DEL14_TRIP_SEL << 14) | (MW_EPWMXBAR8_DEL15_TRIP_SEL << 15) | (MW_EPWMXBAR8_DEL16_TRIP_SEL << 16) | (MW_EPWMXBAR8_DEL17_TRIP_SEL << 17) | (MW_EPWMXBAR8_DEL18_TRIP_SEL << 18) | (MW_EPWMXBAR8_DEL19_TRIP_SEL << 19) | (MW_EPWMXBAR8_DEL20_TRIP_SEL << 20) | (MW_EPWMXBAR8_DEL21_TRIP_SEL << 21) | (MW_EPWMXBAR8_DEL22_TRIP_SEL << 22) | (MW_EPWMXBAR8_DEL23_TRIP_SEL << 23) | (MW_EPWMXBAR8_DEL24_TRIP_SEL << 24) | (MW_EPWMXBAR8_DEL25_TRIP_SEL << 25) | (MW_EPWMXBAR8_DEL26_TRIP_SEL << 26) | (MW_EPWMXBAR8_DEL27_TRIP_SEL << 27) | (MW_EPWMXBAR8_DEL28_TRIP_SEL << 28) | (MW_EPWMXBAR8_DEL29_TRIP_SEL << 29) | (MW_EPWMXBAR8_DEL30_TRIP_SEL << 30) | (MW_EPWMXBAR8_DEL31_TRIP_SEL << 31);
