TexasInstruments/am26x-hsp/src/am263px_init.c
    group7_epwmxbar[8] = (MW_EPWMXBAR8_DEL0_ACTIVE_SEL << 0) | (MW_EPWMXBAR8_DEL1_ACTIVE_SEL << 1) | (MW_EPWMXBAR8_DEL2_ACTIVE_SEL << 2) | (MW_EPWMXBAR8_DEL3_ACTIVE_SEL << 3) | (MW_EPWMXBAR8_DEL4_ACTIVE_SEL << 4) | (MW_EPWMXBAR8_DEL5_ACTIVE_SEL << 5) | (MW_EPWMXBAR8_DEL6_ACTIVE_SEL << 6) | (MW_EPWMXBAR8_DEL7_ACTIVE_SEL << 7) | (MW_EPWMXBAR8_DEL8_ACTIVE_SEL << 8) | (MW_EPWMXBAR8_DEL9_ACTIVE_SEL << 9) | (MW_EPWMXBAR8_DEL10_ACTIVE_SEL << 10) | (MW_EPWMXBAR8_DEL11_ACTIVE_SEL << 11) | (MW_EPWMXBAR8_DEL12_ACTIVE_SEL << 12) | (MW_EPWMXBAR8_DEL13_ACTIVE_SEL << 13) | (MW_EPWMXBAR8_DEL14_ACTIVE_SEL << 14) | (MW_EPWMXBAR8_DEL15_ACTIVE_SEL << 15) | (MW_EPWMXBAR8_DEL16_ACTIVE_SEL << 16) | (MW_EPWMXBAR8_DEL17_ACTIVE_SEL << 17) | (MW_EPWMXBAR8_DEL18_ACTIVE_SEL << 18) | (MW_EPWMXBAR8_DEL19_ACTIVE_SEL << 19) | (MW_EPWMXBAR8_DEL20_ACTIVE_SEL << 20) | (MW_EPWMXBAR8_DEL21_ACTIVE_SEL << 21) | (MW_EPWMXBAR8_DEL22_ACTIVE_SEL << 22) | (MW_EPWMXBAR8_DEL23_ACTIVE_SEL << 23) | (MW_EPWMXBAR8_DEL24_ACTIVE_SEL << 24) | (MW_EPWMXBAR8_DEL25_ACTIVE_SEL << 25) | (MW_EPWMXBAR8_DEL26_ACTIVE_SEL << 26) | (MW_EPWMXBAR8_DEL27_ACTIVE_SEL << 27) | (MW_EPWMXBAR8_DEL28_ACTIVE_SEL << 28) | (MW_EPWMXBAR8_DEL29_ACTIVE_SEL << 29) | (MW_EPWMXBAR8_DEL30_ACTIVE_SEL << 30) | (MW_EPWMXBAR8_DEL31_ACTIVE_SEL << 31);
    group8_epwmxbar[8] = (MW_EPWMXBAR8_EQEP0_ERR_SEL << 0) | (MW_EPWMXBAR8_EQEP1_ERR_SEL << 1) | (MW_EPWMXBAR8_EQEP2_ERR_SEL << 2) | (MW_EPWMXBAR8_FSIRX0_RX_TRIG0_SEL << 3) | (MW_EPWMXBAR8_FSIRX0_RX_TRIG1_SEL << 4) | (MW_EPWMXBAR8_FSIRX0_RX_TRIG2_SEL << 5) | (MW_EPWMXBAR8_FSIRX0_RX_TRIG3_SEL << 6) | (MW_EPWMXBAR8_FSIRX1_RX_TRIG0_SEL << 7) | (MW_EPWMXBAR8_FSIRX1_RX_TRIG1_SEL << 8) | (MW_EPWMXBAR8_FSIRX1_RX_TRIG2_SEL << 9) | (MW_EPWMXBAR8_FSIRX1_RX_TRIG3_SEL << 10) | (MW_EPWMXBAR8_FSIRX2_RX_TRIG0_SEL << 11) | (MW_EPWMXBAR8_FSIRX2_RX_TRIG1_SEL << 12) | (MW_EPWMXBAR8_FSIRX2_RX_TRIG2_SEL << 13) | (MW_EPWMXBAR8_FSIRX2_RX_TRIG3_SEL << 14) | (MW_EPWMXBAR8_FSIRX3_RX_TRIG0_SEL << 15) | (MW_EPWMXBAR8_FSIRX3_RX_TRIG1_SEL << 16) | (MW_EPWMXBAR8_FSIRX3_RX_TRIG2_SEL << 17) | (MW_EPWMXBAR8_FSIRX3_RX_TRIG3_SEL << 18) | (MW_EPWMXBAR8_ECAP0_TRIPOUT_SEL << 19) | (MW_EPWMXBAR8_ECAP1_TRIPOUT_SEL << 20) | (MW_EPWMXBAR8_ECAP2_TRIPOUT_SEL << 21) | (MW_EPWMXBAR8_ECAP3_TRIPOUT_SEL << 22) | (MW_EPWMXBAR8_ECAP4_TRIPOUT_SEL << 23) | (MW_EPWMXBAR8_ECAP5_TRIPOUT_SEL << 24) | (MW_EPWMXBAR8_ECAP6_TRIPOUT_SEL << 25) | (MW_EPWMXBAR8_ECAP7_TRIPOUT_SEL << 26) | (MW_EPWMXBAR8_ECAP8_TRIPOUT_SEL << 27) | (MW_EPWMXBAR8_ECAP9_TRIPOUT_SEL << 28);
    group0_epwmxbar[9] = (MW_EPWMXBAR9_CMPSSA0_CTRIPL_SEL << 0) | (MW_EPWMXBAR9_CMPSSA0_CTRIPH_SEL << 1) | (MW_EPWMXBAR9_CMPSSA1_CTRIPL_SEL << 2) | (MW_EPWMXBAR9_CMPSSA1_CTRIPH_SEL << 3) | (MW_EPWMXBAR9_CMPSSA2_CTRIPL_SEL << 4) | (MW_EPWMXBAR9_CMPSSA2_CTRIPH_SEL << 5) | (MW_EPWMXBAR9_CMPSSA3_CTRIPL_SEL << 6) | (MW_EPWMXBAR9_CMPSSA3_CTRIPH_SEL << 7) | (MW_EPWMXBAR9_CMPSSA4_CTRIPL_SEL << 8) | (MW_EPWMXBAR9_CMPSSA4_CTRIPH_SEL << 9) | (MW_EPWMXBAR9_CMPSSA5_CTRIPL_SEL << 10) | (MW_EPWMXBAR9_CMPSSA5_CTRIPH_SEL << 11) | (MW_EPWMXBAR9_CMPSSA6_CTRIPL_SEL << 12) | (MW_EPWMXBAR9_CMPSSA6_CTRIPH_SEL << 13) | (MW_EPWMXBAR9_CMPSSA7_CTRIPL_SEL << 14) | (MW_EPWMXBAR9_CMPSSA7_CTRIPH_SEL << 15) | (MW_EPWMXBAR9_CMPSSA8_CTRIPL_SEL << 16) | (MW_EPWMXBAR9_CMPSSA8_CTRIPH_SEL << 17) | (MW_EPWMXBAR9_CMPSSA9_CTRIPL_SEL << 18) | (MW_EPWMXBAR9_CMPSSA9_CTRIPH_SEL << 19);
    group1_epwmxbar[9] = (MW_EPWMXBAR9_CMPSSB0_CTRIPL_SEL << 0) | (MW_EPWMXBAR9_CMPSSB0_CTRIPH_SEL << 1) | (MW_EPWMXBAR9_CMPSSB1_CTRIPL_SEL << 2) | (MW_EPWMXBAR9_CMPSSB1_CTRIPH_SEL << 3) | (MW_EPWMXBAR9_CMPSSB2_CTRIPL_SEL << 4) | (MW_EPWMXBAR9_CMPSSB2_CTRIPH_SEL << 5) | (MW_EPWMXBAR9_CMPSSB3_CTRIPL_SEL << 6) | (MW_EPWMXBAR9_CMPSSB3_CTRIPH_SEL << 7) | (MW_EPWMXBAR9_CMPSSB4_CTRIPL_SEL << 8) | (MW_EPWMXBAR9_CMPSSB4_CTRIPH_SEL << 9) | (MW_EPWMXBAR9_CMPSSB5_CTRIPL_SEL << 10) | (MW_EPWMXBAR9_CMPSSB5_CTRIPH_SEL << 11) | (MW_EPWMXBAR9_CMPSSB6_CTRIPL_SEL << 12) | (MW_EPWMXBAR9_CMPSSB6_CTRIPH_SEL << 13) | (MW_EPWMXBAR9_CMPSSB7_CTRIPL_SEL << 14) | (MW_EPWMXBAR9_CMPSSB7_CTRIPH_SEL << 15) | (MW_EPWMXBAR9_CMPSSB8_CTRIPL_SEL << 16) | (MW_EPWMXBAR9_CMPSSB8_CTRIPH_SEL << 17) | (MW_EPWMXBAR9_CMPSSB9_CTRIPL_SEL << 18) | (MW_EPWMXBAR9_CMPSSB9_CTRIPH_SEL << 19);
    group2_epwmxbar[9] = (MW_EPWMXBAR9_SD0_FILT0_CEVT1_SEL << 0) | (MW_EPWMXBAR9_SD0_FILT0_CEVT2_SEL << 1) | (MW_EPWMXBAR9_SD0_FILT0_CMPHZ_SEL << 2) | (MW_EPWMXBAR9_SD0_FILT1_CEVT1_SEL << 3) | (MW_EPWMXBAR9_SD0_FILT1_CEVT2_SEL << 4) | (MW_EPWMXBAR9_SD0_FILT1_CMPHZ_SEL << 5) | (MW_EPWMXBAR9_SD0_FILT2_CEVT1_SEL << 6) | (MW_EPWMXBAR9_SD0_FILT2_CEVT2_SEL << 7) | (MW_EPWMXBAR9_SD0_FILT2_CMPHZ_SEL << 8) | (MW_EPWMXBAR9_SD0_FILT3_CEVT1_SEL << 9) | (MW_EPWMXBAR9_SD0_FILT3_CEVT2_SEL << 10) | (MW_EPWMXBAR9_SD0_FILT3_CMPHZ_SEL << 11) | (MW_EPWMXBAR9_SD1_FILT0_CEVT1_SEL << 12) | (MW_EPWMXBAR9_SD1_FILT0_CEVT2_SEL << 13) | (MW_EPWMXBAR9_SD1_FILT0_CMPHZ_SEL << 14) | (MW_EPWMXBAR9_SD1_FILT1_CEVT1_SEL << 15) | (MW_EPWMXBAR9_SD1_FILT1_CEVT2_SEL << 16) | (MW_EPWMXBAR9_SD1_FILT1_CMPHZ_SEL << 17) | (MW_EPWMXBAR9_SD1_FILT2_CEVT1_SEL << 18) | (MW_EPWMXBAR9_SD1_FILT2_CEVT2_SEL << 19) | (MW_EPWMXBAR9_SD1_FILT2_CMPHZ_SEL << 20) | (MW_EPWMXBAR9_SD1_FILT3_CEVT1_SEL << 21) | (MW_EPWMXBAR9_SD1_FILT3_CEVT2_SEL << 22) | (MW_EPWMXBAR9_SD1_FILT3_CMPHZ_SEL << 23);
    group3_epwmxbar[9] = (MW_EPWMXBAR9_ADC0_EVT1_SEL << 0) | (MW_EPWMXBAR9_ADC0_EVT2_SEL << 1) | (MW_EPWMXBAR9_ADC0_EVT3_SEL << 2) | (MW_EPWMXBAR9_ADC0_EVT4_SEL << 3) | (MW_EPWMXBAR9_ADC1_EVT1_SEL << 4) | (MW_EPWMXBAR9_ADC1_EVT2_SEL << 5) | (MW_EPWMXBAR9_ADC1_EVT3_SEL << 6) | (MW_EPWMXBAR9_ADC1_EVT4_SEL << 7) | (MW_EPWMXBAR9_ADC2_EVT1_SEL << 8) | (MW_EPWMXBAR9_ADC2_EVT2_SEL << 9) | (MW_EPWMXBAR9_ADC2_EVT3_SEL << 10) | (MW_EPWMXBAR9_ADC2_EVT4_SEL << 11) | (MW_EPWMXBAR9_ADC3_EVT1_SEL << 12) | (MW_EPWMXBAR9_ADC3_EVT2_SEL << 13) | (MW_EPWMXBAR9_ADC3_EVT3_SEL << 14) | (MW_EPWMXBAR9_ADC3_EVT4_SEL << 15) | (MW_EPWMXBAR9_ADC4_EVT1_SEL << 16) | (MW_EPWMXBAR9_ADC4_EVT2_SEL << 17) | (MW_EPWMXBAR9_ADC4_EVT3_SEL << 18) | (MW_EPWMXBAR9_ADC4_EVT4_SEL << 19);
    // if(MW_EPWMXBAR9_GPIO0_SEL == 1 | MW_EPWMXBAR9_GPIO1_SEL == 1 | MW_EPWMXBAR9_GPIO2_SEL == 1 | MW_EPWMXBAR9_GPIO3_SEL == 1 | MW_EPWMXBAR9_GPIO4_SEL == 1 | MW_EPWMXBAR9_GPIO5_SEL == 1 | MW_EPWMXBAR9_GPIO6_SEL == 1 | MW_EPWMXBAR9_GPIO7_SEL == 1| MW_EPWMXBAR9_GPIO8_SEL == 1 | MW_EPWMXBAR9_GPIO9_SEL == 1 | MW_EPWMXBAR9_GPIO10_SEL == 1| MW_EPWMXBAR9_GPIO11_SEL == 1| MW_EPWMXBAR9_GPIO12_SEL == 1 | MW_EPWMXBAR9_GPIO13_SEL == 1 | MW_EPWMXBAR9_GPIO14_SEL == 1 | MW_EPWMXBAR9_GPIO15_SEL == 1 | MW_EPWMXBAR9_GPIO16_SEL == 1 | MW_EPWMXBAR9_GPIO17_SEL == 1 | MW_EPWMXBAR9_GPIO18_SEL == 1 | MW_EPWMXBAR9_GPIO19_SEL == 1 | MW_EPWMXBAR9_GPIO20_SEL == 1 | MW_EPWMXBAR9_GPIO21_SEL == 1 | MW_EPWMXBAR9_GPIO22_SEL == 1 | MW_EPWMXBAR9_GPIO23_SEL == 1 | MW_EPWMXBAR9_GPIO24_SEL == 1 | MW_EPWMXBAR9_GPIO25_SEL == 1 | MW_EPWMXBAR9_GPIO26_SEL == 1 | MW_EPWMXBAR9_GPIO27_SEL == 1 | MW_EPWMXBAR9_GPIO28_SEL == 1 | MW_EPWMXBAR9_GPIO29_SEL == 1 | MW_EPWMXBAR9_GPIO30_SEL == 1 | MW_EPWMXBAR9_GPIO31_SEL == 1 | MW_EPWMXBAR9_GPIO32_SEL == 1 | MW_EPWMXBAR9_GPIO33_SEL == 1 | MW_EPWMXBAR9_GPIO34_SEL == 1 | MW_EPWMXBAR9_GPIO35_SEL == 1 | MW_EPWMXBAR9_GPIO36_SEL == 1 | MW_EPWMXBAR9_GPIO37_SEL == 1 | MW_EPWMXBAR9_GPIO38_SEL == 1 | MW_EPWMXBAR9_GPIO39_SEL == 1 | MW_EPWMXBAR9_GPIO40_SEL == 1 | MW_EPWMXBAR9_GPIO41_SEL == 1 | MW_EPWMXBAR9_GPIO42_SEL == 1 | MW_EPWMXBAR9_GPIO43_SEL == 1 | MW_EPWMXBAR9_GPIO44_SEL == 1 | | MW_EPWMXBAR9_GPIO45_SEL == 1 | MW_EPWMXBAR9_GPIO46_SEL == 1 | MW_EPWMXBAR9_GPIO47_SEL == 1| MW_EPWMXBAR9_GPIO48_SEL == 1 | MW_EPWMXBAR9_GPIO49_SEL == 1 | MW_EPWMXBAR9_GPIO50_SEL == 1 | MW_EPWMXBAR9_GPIO51_SEL == 1 | MW_EPWMXBAR9_GPIO52_SEL == 1 | MW_EPWMXBAR9_GPIO53_SEL == 1 | MW_EPWMXBAR9_GPIO54_SEL == 1 | MW_EPWMXBAR9_GPIO55_SEL == 1 | MW_EPWMXBAR9_GPIO56_SEL == 1 | MW_EPWMXBAR9_GPIO57_SEL == 1| MW_EPWMXBAR9_GPIO58_SEL == 1 | MW_EPWMXBAR9_GPIO59_SEL == 1 | MW_EPWMXBAR9_GPIO60_SEL == 1 | MW_EPWMXBAR9_GPIO61_SEL == 1 | MW_EPWMXBAR9_GPIO62_SEL == 1 | MW_EPWMXBAR9_GPIO63_SEL == 1 | MW_EPWMXBAR9_GPIO64_SEL == 1 | | MW_EPWMXBAR9_GPIO59_SEL == 1 | MW_EPWMXBAR9_GPIO60_SEL == 1 | MW_EPWMXBAR9_GPIO61_SEL == 1 | MW_EPWMXBAR9_GPIO62_SEL == 1 | MW_EPWMXBAR9_GPIO63_SEL == 1 | MW_EPWMXBAR9_GPIO64_SEL == 1 | MW_EPWMXBAR9_GPIO65_SEL == 1 | MW_EPWMXBAR9_GPIO66_SEL == 1 | MW_EPWMXBAR9_GPIO67_SEL == 1 | MW_EPWMXBAR9_GPIO68_SEL == 1 | MW_EPWMXBAR9_GPIO69_SEL == 1 | MW_EPWMXBAR9_GPIO70_SEL == 1 | MW_EPWMXBAR9_GPIO71_SEL == 1 | MW_EPWMXBAR9_GPIO72_SEL == 1 | MW_EPWMXBAR9_GPIO73_SEL == 1 | MW_EPWMXBAR9_GPIO74_SEL == 1 | MW_EPWMXBAR9_GPIO75_SEL == 1 | MW_EPWMXBAR9_GPIO76_SEL == 1 | MW_EPWMXBAR9_GPIO77_SEL == 1 | MW_EPWMXBAR9_GPIO78_SEL == 1 | | MW_EPWMXBAR9_GPIO80_SEL == 1 | MW_EPWMXBAR9_GPIO81_SEL == 1 | MW_EPWMXBAR9_GPIO82_SEL == 1 | MW_EPWMXBAR9_GPIO83_SEL == 1 | MW_EPWMXBAR9_GPIO84_SEL == 1 | MW_EPWMXBAR9_GPIO85_SEL == 1 | MW_EPWMXBAR9_GPIO86_SEL == 1 | MW_EPWMXBAR9_GPIO87_SEL == 1 | MW_EPWMXBAR9_GPIO88_SEL == 1 | MW_EPWMXBAR9_GPIO89_SEL == 1 | MW_EPWMXBAR9_GPIO90_SEL == 1 | MW_EPWMXBAR9_GPIO91_SEL == 1 | MW_EPWMXBAR9_GPIO92_SEL == 1 | MW_EPWMXBAR9_GPIO93_SEL == 1 | MW_EPWMXBAR9_GPIO94_SEL == 1 | MW_EPWMXBAR9_GPIO95_SEL == 1 | MW_EPWMXBAR9_GPIO96_SEL == 1 | MW_EPWMXBAR9_GPIO97_SEL == 1 | MW_EPWMXBAR9_GPIO98_SEL == 1 | MW_EPWMXBAR9_GPIO99_SEL == 1 | MW_EPWMXBAR9_GPIO100_SEL == 1 | MW_EPWMXBAR9_GPIO101_SEL == 1 | MW_EPWMXBAR9_GPIO102_SEL == 1 | MW_EPWMXBAR9_GPIO103_SEL == 1 | MW_EPWMXBAR9_GPIO104_SEL == 1 | MW_EPWMXBAR9_GPIO105_SEL == 1 | MW_EPWMXBAR9_GPIO106_SEL == 1 | MW_EPWMXBAR9_GPIO107_SEL == 1 | | MW_EPWMXBAR9_GPIO108_SEL == 1 | MW_EPWMXBAR9_GPIO109_SEL == 1| MW_EPWMXBAR9_GPIO110_SEL == 1 | MW_EPWMXBAR9_GPIO111_SEL == 1 | MW_EPWMXBAR9_GPIO112_SEL == 1 | MW_EPWMXBAR9_GPIO113_SEL == 1 | MW_EPWMXBAR9_GPIO114_SEL == 1 | MW_EPWMXBAR9_GPIO115_SEL == 1 | MW_EPWMXBAR9_GPIO116_SEL == 1 | MW_EPWMXBAR9_GPIO117_SEL == 1 | MW_EPWMXBAR9_GPIO118_SEL == 1 | MW_EPWMXBAR9_GPIO119_SEL == 1 | MW_EPWMXBAR9_GPIO120_SEL == 1 | MW_EPWMXBAR9_GPIO121_SEL == 1 | MW_EPWMXBAR9_GPIO122_SEL == 1 | MW_EPWMXBAR9_GPIO123_SEL == 1 | MW_EPWMXBAR9_GPIO124_SEL == 1 | MW_EPWMXBAR9_GPIO125_SEL == 1 | MW_EPWMXBAR9_GPIO126_SEL == 1 | MW_EPWMXBAR9_GPIO127_SEL == 1 | MW_EPWMXBAR9_GPIO128_SEL == 1 | MW_EPWMXBAR9_GPIO129_SEL == 1 | MW_EPWMXBAR9_GPIO130_SEL == 1 | MW_EPWMXBAR9_GPIO131_SEL == 1 | MW_EPWMXBAR9_GPIO132_SEL == 1 | MW_EPWMXBAR9_GPIO133_SEL == 1 | MW_EPWMXBAR9_GPIO134_SEL == 1 | MW_EPWMXBAR9_GPIO135_SEL == 1 | MW_EPWMXBAR9_GPIO136_SEL == 1 | MW_EPWMXBAR9_GPIO137_SEL == 1 | MW_EPWMXBAR9_GPIO139_SEL == 1 | MW_EPWMXBAR9_GPIO140_SEL == 1 | MW_EPWMXBAR9_GPIO141_SEL == 1 | MW_EPWMXBAR9_GPIO142_SEL == 1 | MW_EPWMXBAR9_GPIO143_SEL == 1 | MW_EPWMXBAR9_ICSSGPO0_PORT0_SEL == 1 | MW_EPWMXBAR9_ICSSGPO1_PORT0_SEL == 1 | MW_EPWMXBAR9_ICSSGPO2_PORT0_SEL == 1 | MW_EPWMXBAR9_ICSSGPO3_PORT0_SEL == 1 | MW_EPWMXBAR9_ICSSGPO4_PORT0_SEL == 1 | MW_EPWMXBAR9_ICSSGPO5_PORT0_SEL == 1 | MW_EPWMXBAR9_ICSSGPO6_PORT0_SEL == 1 | MW_EPWMXBAR9_ICSSGPO7_PORT0_SEL == 1 | MW_EPWMXBAR9_ICSSGPO8_PORT0_SEL == 1 | MW_EPWMXBAR9_ICSSGPO9_PORT0_SEL == 1 | MW_EPWMXBAR9_ICSSGPO10_PORT0_SEL == 1 | MW_EPWMXBAR9_ICSSGPO11_PORT0_SEL == 1 | MW_EPWMXBAR9_ICSSGPO12_PORT0_SEL == 1 | MW_EPWMXBAR9_ICSSGPO13_PORT0_SEL == 1 | MW_EPWMXBAR9_ICSSGPO14_PORT0_SEL == 1 | MW_EPWMXBAR9_ICSSGPO15_PORT0_SEL == 1 | MW_EPWMXBAR9_ICSSGPO0_PORT1_SEL == 1 | MW_EPWMXBAR9_ICSSGPO1_PORT1_SEL == 1 | MW_EPWMXBAR9_ICSSGPO2_PORT1_SEL == 1 | MW_EPWMXBAR9_ICSSGPO3_PORT1_SEL == 1 | MW_EPWMXBAR9_ICSSGPO4_PORT1_SEL == 1 | MW_EPWMXBAR9_ICSSGPO5_PORT1_SEL == 1 | MW_EPWMXBAR9_ICSSGPO6_PORT1_SEL == 1 | MW_EPWMXBAR9_ICSSGPO7_PORT1_SEL == 1 | MW_EPWMXBAR9_ICSSGPO8_PORT1_SEL == 1 | MW_EPWMXBAR9_ICSSGPO9_PORT1_SEL == 1 | MW_EPWMXBAR9_ICSSGPO10_PORT1_SEL == 1 | MW_EPWMXBAR9_ICSSGPO11_PORT1_SEL == 1 | MW_EPWMXBAR9_ICSSGPO12_PORT1_SEL == 1 | MW_EPWMXBAR9_ICSSGPO13_PORT1_SEL == 1 | MW_EPWMXBAR9_ICSSGPO14_PORT1_SEL == 1 | MW_EPWMXBAR9_ICSSGPO15_PORT1_SEL == 1)
    //     group4_epwmxbar[9] = EPWM_XBAR_9;
    // else
        group4_epwmxbar[9] = 0;
    group5_epwmxbar[9] = (MW_EPWMXBAR9_EPWM0_TRIPOUT_SEL << 0) | (MW_EPWMXBAR9_EPWM1_TRIPOUT_SEL << 1) | (MW_EPWMXBAR9_EPWM2_TRIPOUT_SEL << 2) | (MW_EPWMXBAR9_EPWM3_TRIPOUT_SEL << 3) | (MW_EPWMXBAR9_EPWM4_TRIPOUT_SEL << 4) | (MW_EPWMXBAR9_EPWM5_TRIPOUT_SEL << 5) | (MW_EPWMXBAR9_EPWM6_TRIPOUT_SEL << 6) | (MW_EPWMXBAR9_EPWM7_TRIPOUT_SEL << 7) | (MW_EPWMXBAR9_EPWM8_TRIPOUT_SEL << 8) | (MW_EPWMXBAR9_EPWM9_TRIPOUT_SEL << 9) | (MW_EPWMXBAR9_EPWM10_TRIPOUT_SEL << 10) | (MW_EPWMXBAR9_EPWM11_TRIPOUT_SEL << 11) | (MW_EPWMXBAR9_EPWM12_TRIPOUT_SEL << 12) | (MW_EPWMXBAR9_EPWM13_TRIPOUT_SEL << 13) | (MW_EPWMXBAR9_EPWM14_TRIPOUT_SEL << 14) | (MW_EPWMXBAR9_EPWM15_TRIPOUT_SEL << 15) | (MW_EPWMXBAR9_EPWM16_TRIPOUT_SEL << 16) | (MW_EPWMXBAR9_EPWM17_TRIPOUT_SEL << 17) | (MW_EPWMXBAR9_EPWM18_TRIPOUT_SEL << 18) | (MW_EPWMXBAR9_EPWM19_TRIPOUT_SEL << 19) | (MW_EPWMXBAR9_EPWM20_TRIPOUT_SEL << 20) | (MW_EPWMXBAR9_EPWM21_TRIPOUT_SEL << 21) | (MW_EPWMXBAR9_EPWM22_TRIPOUT_SEL << 22) | (MW_EPWMXBAR9_EPWM23_TRIPOUT_SEL << 23) | (MW_EPWMXBAR9_EPWM24_TRIPOUT_SEL << 24) | (MW_EPWMXBAR9_EPWM25_TRIPOUT_SEL << 25) | (MW_EPWMXBAR9_EPWM26_TRIPOUT_SEL << 26) | (MW_EPWMXBAR9_EPWM27_TRIPOUT_SEL << 27) | (MW_EPWMXBAR9_EPWM28_TRIPOUT_SEL << 28) | (MW_EPWMXBAR9_EPWM29_TRIPOUT_SEL << 29) | (MW_EPWMXBAR9_EPWM30_TRIPOUT_SEL << 30) | (MW_EPWMXBAR9_EPWM31_TRIPOUT_SEL << 31);
    group6_epwmxbar[9] = (MW_EPWMXBAR9_DEL0_TRIP_SEL << 0) | (MW_EPWMXBAR9_DEL1_TRIP_SEL << 1) | (MW_EPWMXBAR9_DEL2_TRIP_SEL << 2) | (MW_EPWMXBAR9_DEL3_TRIP_SEL << 3) | (MW_EPWMXBAR9_DEL4_TRIP_SEL << 4) | (MW_EPWMXBAR9_DEL5_TRIP_SEL << 5) | (MW_EPWMXBAR9_DEL6_TRIP_SEL << 6) | (MW_EPWMXBAR9_DEL7_TRIP_SEL << 7) | (MW_EPWMXBAR9_DEL8_TRIP_SEL << 8) | (MW_EPWMXBAR9_DEL9_TRIP_SEL << 9) | (MW_EPWMXBAR9_DEL10_TRIP_SEL << 10) | (MW_EPWMXBAR9_DEL11_TRIP_SEL << 11) | (MW_EPWMXBAR9_DEL12_TRIP_SEL << 12) | (MW_EPWMXBAR9_DEL13_TRIP_SEL << 13) | (MW_EPWMXBAR9_DEL14_TRIP_SEL << 14) | (MW_EPWMXBAR9_DEL15_TRIP_SEL << 15) | (MW_EPWMXBAR9_DEL16_TRIP_SEL << 16) | (MW_EPWMXBAR9_DEL17_TRIP_SEL << 17) | (MW_EPWMXBAR9_DEL18_TRIP_SEL << 18) | (MW_EPWMXBAR9_DEL19_TRIP_SEL << 19) | (MW_EPWMXBAR9_DEL20_TRIP_SEL << 20) | (MW_EPWMXBAR9_DEL21_TRIP_SEL << 21) | (MW_EPWMXBAR9_DEL22_TRIP_SEL << 22) | (MW_EPWMXBAR9_DEL23_TRIP_SEL << 23) | (MW_EPWMXBAR9_DEL24_TRIP_SEL << 24) | (MW_EPWMXBAR9_DEL25_TRIP_SEL << 25) | (MW_EPWMXBAR9_DEL26_TRIP_SEL << 26) | (MW_EPWMXBAR9_DEL27_TRIP_SEL << 27) | (MW_EPWMXBAR9_DEL28_TRIP_SEL << 28) | (MW_EPWMXBAR9_DEL29_TRIP_SEL << 29) | (MW_EPWMXBAR9_DEL30_TRIP_SEL << 30) | (MW_EPWMXBAR9_DEL31_TRIP_SEL << 31);
    group7_epwmxbar[9] = (MW_EPWMXBAR9_DEL0_ACTIVE_SEL << 0) | (MW_EPWMXBAR9_DEL1_ACTIVE_SEL << 1) | (MW_EPWMXBAR9_DEL2_ACTIVE_SEL << 2) | (MW_EPWMXBAR9_DEL3_ACTIVE_SEL << 3) | (MW_EPWMXBAR9_DEL4_ACTIVE_SEL << 4) | (MW_EPWMXBAR9_DEL5_ACTIVE_SEL << 5) | (MW_EPWMXBAR9_DEL6_ACTIVE_SEL << 6) | (MW_EPWMXBAR9_DEL7_ACTIVE_SEL << 7) | (MW_EPWMXBAR9_DEL8_ACTIVE_SEL << 8) | (MW_EPWMXBAR9_DEL9_ACTIVE_SEL << 9) | (MW_EPWMXBAR9_DEL10_ACTIVE_SEL << 10) | (MW_EPWMXBAR9_DEL11_ACTIVE_SEL << 11) | (MW_EPWMXBAR9_DEL12_ACTIVE_SEL << 12) | (MW_EPWMXBAR9_DEL13_ACTIVE_SEL << 13) | (MW_EPWMXBAR9_DEL14_ACTIVE_SEL << 14) | (MW_EPWMXBAR9_DEL15_ACTIVE_SEL << 15) | (MW_EPWMXBAR9_DEL16_ACTIVE_SEL << 16) | (MW_EPWMXBAR9_DEL17_ACTIVE_SEL << 17) | (MW_EPWMXBAR9_DEL18_ACTIVE_SEL << 18) | (MW_EPWMXBAR9_DEL19_ACTIVE_SEL << 19) | (MW_EPWMXBAR9_DEL20_ACTIVE_SEL << 20) | (MW_EPWMXBAR9_DEL21_ACTIVE_SEL << 21) | (MW_EPWMXBAR9_DEL22_ACTIVE_SEL << 22) | (MW_EPWMXBAR9_DEL23_ACTIVE_SEL << 23) | (MW_EPWMXBAR9_DEL24_ACTIVE_SEL << 24) | (MW_EPWMXBAR9_DEL25_ACTIVE_SEL << 25) | (MW_EPWMXBAR9_DEL26_ACTIVE_SEL << 26) | (MW_EPWMXBAR9_DEL27_ACTIVE_SEL << 27) | (MW_EPWMXBAR9_DEL28_ACTIVE_SEL << 28) | (MW_EPWMXBAR9_DEL29_ACTIVE_SEL << 29) | (MW_EPWMXBAR9_DEL30_ACTIVE_SEL << 30) | (MW_EPWMXBAR9_DEL31_ACTIVE_SEL << 31);
    group8_epwmxbar[9] = (MW_EPWMXBAR9_EQEP0_ERR_SEL << 0) | (MW_EPWMXBAR9_EQEP1_ERR_SEL << 1) | (MW_EPWMXBAR9_EQEP2_ERR_SEL << 2) | (MW_EPWMXBAR9_FSIRX0_RX_TRIG0_SEL << 3) | (MW_EPWMXBAR9_FSIRX0_RX_TRIG1_SEL << 4) | (MW_EPWMXBAR9_FSIRX0_RX_TRIG2_SEL << 5) | (MW_EPWMXBAR9_FSIRX0_RX_TRIG3_SEL << 6) | (MW_EPWMXBAR9_FSIRX1_RX_TRIG0_SEL << 7) | (MW_EPWMXBAR9_FSIRX1_RX_TRIG1_SEL << 8) | (MW_EPWMXBAR9_FSIRX1_RX_TRIG2_SEL << 9) | (MW_EPWMXBAR9_FSIRX1_RX_TRIG3_SEL << 10) | (MW_EPWMXBAR9_FSIRX2_RX_TRIG0_SEL << 11) | (MW_EPWMXBAR9_FSIRX2_RX_TRIG1_SEL << 12) | (MW_EPWMXBAR9_FSIRX2_RX_TRIG2_SEL << 13) | (MW_EPWMXBAR9_FSIRX2_RX_TRIG3_SEL << 14) | (MW_EPWMXBAR9_FSIRX3_RX_TRIG0_SEL << 15) | (MW_EPWMXBAR9_FSIRX3_RX_TRIG1_SEL << 16) | (MW_EPWMXBAR9_FSIRX3_RX_TRIG2_SEL << 17) | (MW_EPWMXBAR9_FSIRX3_RX_TRIG3_SEL << 18) | (MW_EPWMXBAR9_ECAP0_TRIPOUT_SEL << 19) | (MW_EPWMXBAR9_ECAP1_TRIPOUT_SEL << 20) | (MW_EPWMXBAR9_ECAP2_TRIPOUT_SEL << 21) | (MW_EPWMXBAR9_ECAP3_TRIPOUT_SEL << 22) | (MW_EPWMXBAR9_ECAP4_TRIPOUT_SEL << 23) | (MW_EPWMXBAR9_ECAP5_TRIPOUT_SEL << 24) | (MW_EPWMXBAR9_ECAP6_TRIPOUT_SEL << 25) | (MW_EPWMXBAR9_ECAP7_TRIPOUT_SEL << 26) | (MW_EPWMXBAR9_ECAP8_TRIPOUT_SEL << 27) | (MW_EPWMXBAR9_ECAP9_TRIPOUT_SEL << 28);
    group0_epwmxbar[10] = (MW_EPWMXBAR10_CMPSSA0_CTRIPL_SEL << 0) | (MW_EPWMXBAR10_CMPSSA0_CTRIPH_SEL << 1) | (MW_EPWMXBAR10_CMPSSA1_CTRIPL_SEL << 2) | (MW_EPWMXBAR10_CMPSSA1_CTRIPH_SEL << 3) | (MW_EPWMXBAR10_CMPSSA2_CTRIPL_SEL << 4) | (MW_EPWMXBAR10_CMPSSA2_CTRIPH_SEL << 5) | (MW_EPWMXBAR10_CMPSSA3_CTRIPL_SEL << 6) | (MW_EPWMXBAR10_CMPSSA3_CTRIPH_SEL << 7) | (MW_EPWMXBAR10_CMPSSA4_CTRIPL_SEL << 8) | (MW_EPWMXBAR10_CMPSSA4_CTRIPH_SEL << 9) | (MW_EPWMXBAR10_CMPSSA5_CTRIPL_SEL << 10) | (MW_EPWMXBAR10_CMPSSA5_CTRIPH_SEL << 11) | (MW_EPWMXBAR10_CMPSSA6_CTRIPL_SEL << 12) | (MW_EPWMXBAR10_CMPSSA6_CTRIPH_SEL << 13) | (MW_EPWMXBAR10_CMPSSA7_CTRIPL_SEL << 14) | (MW_EPWMXBAR10_CMPSSA7_CTRIPH_SEL << 15) | (MW_EPWMXBAR10_CMPSSA8_CTRIPL_SEL << 16) | (MW_EPWMXBAR10_CMPSSA8_CTRIPH_SEL << 17) | (MW_EPWMXBAR10_CMPSSA9_CTRIPL_SEL << 18) | (MW_EPWMXBAR10_CMPSSA9_CTRIPH_SEL << 19);
    group1_epwmxbar[10] = (MW_EPWMXBAR10_CMPSSB0_CTRIPL_SEL << 0) | (MW_EPWMXBAR10_CMPSSB0_CTRIPH_SEL << 1) | (MW_EPWMXBAR10_CMPSSB1_CTRIPL_SEL << 2) | (MW_EPWMXBAR10_CMPSSB1_CTRIPH_SEL << 3) | (MW_EPWMXBAR10_CMPSSB2_CTRIPL_SEL << 4) | (MW_EPWMXBAR10_CMPSSB2_CTRIPH_SEL << 5) | (MW_EPWMXBAR10_CMPSSB3_CTRIPL_SEL << 6) | (MW_EPWMXBAR10_CMPSSB3_CTRIPH_SEL << 7) | (MW_EPWMXBAR10_CMPSSB4_CTRIPL_SEL << 8) | (MW_EPWMXBAR10_CMPSSB4_CTRIPH_SEL << 9) | (MW_EPWMXBAR10_CMPSSB5_CTRIPL_SEL << 10) | (MW_EPWMXBAR10_CMPSSB5_CTRIPH_SEL << 11) | (MW_EPWMXBAR10_CMPSSB6_CTRIPL_SEL << 12) | (MW_EPWMXBAR10_CMPSSB6_CTRIPH_SEL << 13) | (MW_EPWMXBAR10_CMPSSB7_CTRIPL_SEL << 14) | (MW_EPWMXBAR10_CMPSSB7_CTRIPH_SEL << 15) | (MW_EPWMXBAR10_CMPSSB8_CTRIPL_SEL << 16) | (MW_EPWMXBAR10_CMPSSB8_CTRIPH_SEL << 17) | (MW_EPWMXBAR10_CMPSSB9_CTRIPL_SEL << 18) | (MW_EPWMXBAR10_CMPSSB9_CTRIPH_SEL << 19);
    group2_epwmxbar[10] = (MW_EPWMXBAR10_SD0_FILT0_CEVT1_SEL << 0) | (MW_EPWMXBAR10_SD0_FILT0_CEVT2_SEL << 1) | (MW_EPWMXBAR10_SD0_FILT0_CMPHZ_SEL << 2) | (MW_EPWMXBAR10_SD0_FILT1_CEVT1_SEL << 3) | (MW_EPWMXBAR10_SD0_FILT1_CEVT2_SEL << 4) | (MW_EPWMXBAR10_SD0_FILT1_CMPHZ_SEL << 5) | (MW_EPWMXBAR10_SD0_FILT2_CEVT1_SEL << 6) | (MW_EPWMXBAR10_SD0_FILT2_CEVT2_SEL << 7) | (MW_EPWMXBAR10_SD0_FILT2_CMPHZ_SEL << 8) | (MW_EPWMXBAR10_SD0_FILT3_CEVT1_SEL << 9) | (MW_EPWMXBAR10_SD0_FILT3_CEVT2_SEL << 10) | (MW_EPWMXBAR10_SD0_FILT3_CMPHZ_SEL << 11) | (MW_EPWMXBAR10_SD1_FILT0_CEVT1_SEL << 12) | (MW_EPWMXBAR10_SD1_FILT0_CEVT2_SEL << 13) | (MW_EPWMXBAR10_SD1_FILT0_CMPHZ_SEL << 14) | (MW_EPWMXBAR10_SD1_FILT1_CEVT1_SEL << 15) | (MW_EPWMXBAR10_SD1_FILT1_CEVT2_SEL << 16) | (MW_EPWMXBAR10_SD1_FILT1_CMPHZ_SEL << 17) | (MW_EPWMXBAR10_SD1_FILT2_CEVT1_SEL << 18) | (MW_EPWMXBAR10_SD1_FILT2_CEVT2_SEL << 19) | (MW_EPWMXBAR10_SD1_FILT2_CMPHZ_SEL << 20) | (MW_EPWMXBAR10_SD1_FILT3_CEVT1_SEL << 21) | (MW_EPWMXBAR10_SD1_FILT3_CEVT2_SEL << 22) | (MW_EPWMXBAR10_SD1_FILT3_CMPHZ_SEL << 23);
    group3_epwmxbar[10] = (MW_EPWMXBAR10_ADC0_EVT1_SEL << 0) | (MW_EPWMXBAR10_ADC0_EVT2_SEL << 1) | (MW_EPWMXBAR10_ADC0_EVT3_SEL << 2) | (MW_EPWMXBAR10_ADC0_EVT4_SEL << 3) | (MW_EPWMXBAR10_ADC1_EVT1_SEL << 4) | (MW_EPWMXBAR10_ADC1_EVT2_SEL << 5) | (MW_EPWMXBAR10_ADC1_EVT3_SEL << 6) | (MW_EPWMXBAR10_ADC1_EVT4_SEL << 7) | (MW_EPWMXBAR10_ADC2_EVT1_SEL << 8) | (MW_EPWMXBAR10_ADC2_EVT2_SEL << 9) | (MW_EPWMXBAR10_ADC2_EVT3_SEL << 10) | (MW_EPWMXBAR10_ADC2_EVT4_SEL << 11) | (MW_EPWMXBAR10_ADC3_EVT1_SEL << 12) | (MW_EPWMXBAR10_ADC3_EVT2_SEL << 13) | (MW_EPWMXBAR10_ADC3_EVT3_SEL << 14) | (MW_EPWMXBAR10_ADC3_EVT4_SEL << 15) | (MW_EPWMXBAR10_ADC4_EVT1_SEL << 16) | (MW_EPWMXBAR10_ADC4_EVT2_SEL << 17) | (MW_EPWMXBAR10_ADC4_EVT3_SEL << 18) | (MW_EPWMXBAR10_ADC4_EVT4_SEL << 19);
