TexasInstruments/am26x-hsp/src/am263px_init.c
    // if(MW_EPWMXBAR10_GPIO0_SEL == 1 | MW_EPWMXBAR10_GPIO1_SEL == 1 | MW_EPWMXBAR10_GPIO2_SEL == 1 | MW_EPWMXBAR10_GPIO3_SEL == 1 | MW_EPWMXBAR10_GPIO4_SEL == 1 | MW_EPWMXBAR10_GPIO5_SEL == 1 | MW_EPWMXBAR10_GPIO6_SEL == 1 | MW_EPWMXBAR10_GPIO7_SEL == 1| MW_EPWMXBAR10_GPIO8_SEL == 1 | MW_EPWMXBAR10_GPIO9_SEL == 1 | MW_EPWMXBAR10_GPIO10_SEL == 1| MW_EPWMXBAR10_GPIO11_SEL == 1| MW_EPWMXBAR10_GPIO12_SEL == 1 | MW_EPWMXBAR10_GPIO13_SEL == 1 | MW_EPWMXBAR10_GPIO14_SEL == 1 | MW_EPWMXBAR10_GPIO15_SEL == 1 | MW_EPWMXBAR10_GPIO16_SEL == 1 | MW_EPWMXBAR10_GPIO17_SEL == 1 | MW_EPWMXBAR10_GPIO18_SEL == 1 | MW_EPWMXBAR10_GPIO19_SEL == 1 | MW_EPWMXBAR10_GPIO20_SEL == 1 | MW_EPWMXBAR10_GPIO21_SEL == 1 | MW_EPWMXBAR10_GPIO22_SEL == 1 | MW_EPWMXBAR10_GPIO23_SEL == 1 | MW_EPWMXBAR10_GPIO24_SEL == 1 | MW_EPWMXBAR10_GPIO25_SEL == 1 | MW_EPWMXBAR10_GPIO26_SEL == 1 | MW_EPWMXBAR10_GPIO27_SEL == 1 | MW_EPWMXBAR10_GPIO28_SEL == 1 | MW_EPWMXBAR10_GPIO29_SEL == 1 | MW_EPWMXBAR10_GPIO30_SEL == 1 | MW_EPWMXBAR10_GPIO31_SEL == 1 | MW_EPWMXBAR10_GPIO32_SEL == 1 | MW_EPWMXBAR10_GPIO33_SEL == 1 | MW_EPWMXBAR10_GPIO34_SEL == 1 | MW_EPWMXBAR10_GPIO35_SEL == 1 | MW_EPWMXBAR10_GPIO36_SEL == 1 | MW_EPWMXBAR10_GPIO37_SEL == 1 | MW_EPWMXBAR10_GPIO38_SEL == 1 | MW_EPWMXBAR10_GPIO39_SEL == 1 | MW_EPWMXBAR10_GPIO40_SEL == 1 | MW_EPWMXBAR10_GPIO41_SEL == 1 | MW_EPWMXBAR10_GPIO42_SEL == 1 | MW_EPWMXBAR10_GPIO43_SEL == 1 | MW_EPWMXBAR10_GPIO44_SEL == 1 | | MW_EPWMXBAR10_GPIO45_SEL == 1 | MW_EPWMXBAR10_GPIO46_SEL == 1 | MW_EPWMXBAR10_GPIO47_SEL == 1| MW_EPWMXBAR10_GPIO48_SEL == 1 | MW_EPWMXBAR10_GPIO49_SEL == 1 | MW_EPWMXBAR10_GPIO50_SEL == 1 | MW_EPWMXBAR10_GPIO51_SEL == 1 | MW_EPWMXBAR10_GPIO52_SEL == 1 | MW_EPWMXBAR10_GPIO53_SEL == 1 | MW_EPWMXBAR10_GPIO54_SEL == 1 | MW_EPWMXBAR10_GPIO55_SEL == 1 | MW_EPWMXBAR10_GPIO56_SEL == 1 | MW_EPWMXBAR10_GPIO57_SEL == 1| MW_EPWMXBAR10_GPIO58_SEL == 1 | MW_EPWMXBAR10_GPIO59_SEL == 1 | MW_EPWMXBAR10_GPIO60_SEL == 1 | MW_EPWMXBAR10_GPIO61_SEL == 1 | MW_EPWMXBAR10_GPIO62_SEL == 1 | MW_EPWMXBAR10_GPIO63_SEL == 1 | MW_EPWMXBAR10_GPIO64_SEL == 1 | | MW_EPWMXBAR10_GPIO59_SEL == 1 | MW_EPWMXBAR10_GPIO60_SEL == 1 | MW_EPWMXBAR10_GPIO61_SEL == 1 | MW_EPWMXBAR10_GPIO62_SEL == 1 | MW_EPWMXBAR10_GPIO63_SEL == 1 | MW_EPWMXBAR10_GPIO64_SEL == 1 | MW_EPWMXBAR10_GPIO65_SEL == 1 | MW_EPWMXBAR10_GPIO66_SEL == 1 | MW_EPWMXBAR10_GPIO67_SEL == 1 | MW_EPWMXBAR10_GPIO68_SEL == 1 | MW_EPWMXBAR10_GPIO69_SEL == 1 | MW_EPWMXBAR10_GPIO70_SEL == 1 | MW_EPWMXBAR10_GPIO71_SEL == 1 | MW_EPWMXBAR10_GPIO72_SEL == 1 | MW_EPWMXBAR10_GPIO73_SEL == 1 | MW_EPWMXBAR10_GPIO74_SEL == 1 | MW_EPWMXBAR10_GPIO75_SEL == 1 | MW_EPWMXBAR10_GPIO76_SEL == 1 | MW_EPWMXBAR10_GPIO77_SEL == 1 | MW_EPWMXBAR10_GPIO78_SEL == 1 | | MW_EPWMXBAR10_GPIO80_SEL == 1 | MW_EPWMXBAR10_GPIO81_SEL == 1 | MW_EPWMXBAR10_GPIO82_SEL == 1 | MW_EPWMXBAR10_GPIO83_SEL == 1 | MW_EPWMXBAR10_GPIO84_SEL == 1 | MW_EPWMXBAR10_GPIO85_SEL == 1 | MW_EPWMXBAR10_GPIO86_SEL == 1 | MW_EPWMXBAR10_GPIO87_SEL == 1 | MW_EPWMXBAR10_GPIO88_SEL == 1 | MW_EPWMXBAR10_GPIO89_SEL == 1 | MW_EPWMXBAR10_GPIO90_SEL == 1 | MW_EPWMXBAR10_GPIO91_SEL == 1 | MW_EPWMXBAR10_GPIO92_SEL == 1 | MW_EPWMXBAR10_GPIO93_SEL == 1 | MW_EPWMXBAR10_GPIO94_SEL == 1 | MW_EPWMXBAR10_GPIO95_SEL == 1 | MW_EPWMXBAR10_GPIO96_SEL == 1 | MW_EPWMXBAR10_GPIO97_SEL == 1 | MW_EPWMXBAR10_GPIO98_SEL == 1 | MW_EPWMXBAR10_GPIO99_SEL == 1 | MW_EPWMXBAR10_GPIO100_SEL == 1 | MW_EPWMXBAR10_GPIO101_SEL == 1 | MW_EPWMXBAR10_GPIO102_SEL == 1 | MW_EPWMXBAR10_GPIO103_SEL == 1 | MW_EPWMXBAR10_GPIO104_SEL == 1 | MW_EPWMXBAR10_GPIO105_SEL == 1 | MW_EPWMXBAR10_GPIO106_SEL == 1 | MW_EPWMXBAR10_GPIO107_SEL == 1 | | MW_EPWMXBAR10_GPIO108_SEL == 1 | MW_EPWMXBAR10_GPIO109_SEL == 1| MW_EPWMXBAR10_GPIO110_SEL == 1 | MW_EPWMXBAR10_GPIO111_SEL == 1 | MW_EPWMXBAR10_GPIO112_SEL == 1 | MW_EPWMXBAR10_GPIO113_SEL == 1 | MW_EPWMXBAR10_GPIO114_SEL == 1 | MW_EPWMXBAR10_GPIO115_SEL == 1 | MW_EPWMXBAR10_GPIO116_SEL == 1 | MW_EPWMXBAR10_GPIO117_SEL == 1 | MW_EPWMXBAR10_GPIO118_SEL == 1 | MW_EPWMXBAR10_GPIO119_SEL == 1 | MW_EPWMXBAR10_GPIO120_SEL == 1 | MW_EPWMXBAR10_GPIO121_SEL == 1 | MW_EPWMXBAR10_GPIO122_SEL == 1 | MW_EPWMXBAR10_GPIO123_SEL == 1 | MW_EPWMXBAR10_GPIO124_SEL == 1 | MW_EPWMXBAR10_GPIO125_SEL == 1 | MW_EPWMXBAR10_GPIO126_SEL == 1 | MW_EPWMXBAR10_GPIO127_SEL == 1 | MW_EPWMXBAR10_GPIO128_SEL == 1 | MW_EPWMXBAR10_GPIO129_SEL == 1 | MW_EPWMXBAR10_GPIO130_SEL == 1 | MW_EPWMXBAR10_GPIO131_SEL == 1 | MW_EPWMXBAR10_GPIO132_SEL == 1 | MW_EPWMXBAR10_GPIO133_SEL == 1 | MW_EPWMXBAR10_GPIO134_SEL == 1 | MW_EPWMXBAR10_GPIO135_SEL == 1 | MW_EPWMXBAR10_GPIO136_SEL == 1 | MW_EPWMXBAR10_GPIO137_SEL == 1 | MW_EPWMXBAR10_GPIO139_SEL == 1 | MW_EPWMXBAR10_GPIO140_SEL == 1 | MW_EPWMXBAR10_GPIO141_SEL == 1 | MW_EPWMXBAR10_GPIO142_SEL == 1 | MW_EPWMXBAR10_GPIO143_SEL == 1 | MW_EPWMXBAR10_ICSSGPO0_PORT0_SEL == 1 | MW_EPWMXBAR10_ICSSGPO1_PORT0_SEL == 1 | MW_EPWMXBAR10_ICSSGPO2_PORT0_SEL == 1 | MW_EPWMXBAR10_ICSSGPO3_PORT0_SEL == 1 | MW_EPWMXBAR10_ICSSGPO4_PORT0_SEL == 1 | MW_EPWMXBAR10_ICSSGPO5_PORT0_SEL == 1 | MW_EPWMXBAR10_ICSSGPO6_PORT0_SEL == 1 | MW_EPWMXBAR10_ICSSGPO7_PORT0_SEL == 1 | MW_EPWMXBAR10_ICSSGPO8_PORT0_SEL == 1 | MW_EPWMXBAR10_ICSSGPO9_PORT0_SEL == 1 | MW_EPWMXBAR10_ICSSGPO10_PORT0_SEL == 1 | MW_EPWMXBAR10_ICSSGPO11_PORT0_SEL == 1 | MW_EPWMXBAR10_ICSSGPO12_PORT0_SEL == 1 | MW_EPWMXBAR10_ICSSGPO13_PORT0_SEL == 1 | MW_EPWMXBAR10_ICSSGPO14_PORT0_SEL == 1 | MW_EPWMXBAR10_ICSSGPO15_PORT0_SEL == 1 | MW_EPWMXBAR10_ICSSGPO0_PORT1_SEL == 1 | MW_EPWMXBAR10_ICSSGPO1_PORT1_SEL == 1 | MW_EPWMXBAR10_ICSSGPO2_PORT1_SEL == 1 | MW_EPWMXBAR10_ICSSGPO3_PORT1_SEL == 1 | MW_EPWMXBAR10_ICSSGPO4_PORT1_SEL == 1 | MW_EPWMXBAR10_ICSSGPO5_PORT1_SEL == 1 | MW_EPWMXBAR10_ICSSGPO6_PORT1_SEL == 1 | MW_EPWMXBAR10_ICSSGPO7_PORT1_SEL == 1 | MW_EPWMXBAR10_ICSSGPO8_PORT1_SEL == 1 | MW_EPWMXBAR10_ICSSGPO9_PORT1_SEL == 1 | MW_EPWMXBAR10_ICSSGPO10_PORT1_SEL == 1 | MW_EPWMXBAR10_ICSSGPO11_PORT1_SEL == 1 | MW_EPWMXBAR10_ICSSGPO12_PORT1_SEL == 1 | MW_EPWMXBAR10_ICSSGPO13_PORT1_SEL == 1 | MW_EPWMXBAR10_ICSSGPO14_PORT1_SEL == 1 | MW_EPWMXBAR10_ICSSGPO15_PORT1_SEL == 1)
    //     group4_epwmxbar[10] = EPWM_XBAR_10;
    // else
        group4_epwmxbar[10] = 0;
    group5_epwmxbar[10] = (MW_EPWMXBAR10_EPWM0_TRIPOUT_SEL << 0) | (MW_EPWMXBAR10_EPWM1_TRIPOUT_SEL << 1) | (MW_EPWMXBAR10_EPWM2_TRIPOUT_SEL << 2) | (MW_EPWMXBAR10_EPWM3_TRIPOUT_SEL << 3) | (MW_EPWMXBAR10_EPWM4_TRIPOUT_SEL << 4) | (MW_EPWMXBAR10_EPWM5_TRIPOUT_SEL << 5) | (MW_EPWMXBAR10_EPWM6_TRIPOUT_SEL << 6) | (MW_EPWMXBAR10_EPWM7_TRIPOUT_SEL << 7) | (MW_EPWMXBAR10_EPWM8_TRIPOUT_SEL << 8) | (MW_EPWMXBAR10_EPWM9_TRIPOUT_SEL << 9) | (MW_EPWMXBAR10_EPWM10_TRIPOUT_SEL << 10) | (MW_EPWMXBAR10_EPWM11_TRIPOUT_SEL << 11) | (MW_EPWMXBAR10_EPWM12_TRIPOUT_SEL << 12) | (MW_EPWMXBAR10_EPWM13_TRIPOUT_SEL << 13) | (MW_EPWMXBAR10_EPWM14_TRIPOUT_SEL << 14) | (MW_EPWMXBAR10_EPWM15_TRIPOUT_SEL << 15) | (MW_EPWMXBAR10_EPWM16_TRIPOUT_SEL << 16) | (MW_EPWMXBAR10_EPWM17_TRIPOUT_SEL << 17) | (MW_EPWMXBAR10_EPWM18_TRIPOUT_SEL << 18) | (MW_EPWMXBAR10_EPWM19_TRIPOUT_SEL << 19) | (MW_EPWMXBAR10_EPWM20_TRIPOUT_SEL << 20) | (MW_EPWMXBAR10_EPWM21_TRIPOUT_SEL << 21) | (MW_EPWMXBAR10_EPWM22_TRIPOUT_SEL << 22) | (MW_EPWMXBAR10_EPWM23_TRIPOUT_SEL << 23) | (MW_EPWMXBAR10_EPWM24_TRIPOUT_SEL << 24) | (MW_EPWMXBAR10_EPWM25_TRIPOUT_SEL << 25) | (MW_EPWMXBAR10_EPWM26_TRIPOUT_SEL << 26) | (MW_EPWMXBAR10_EPWM27_TRIPOUT_SEL << 27) | (MW_EPWMXBAR10_EPWM28_TRIPOUT_SEL << 28) | (MW_EPWMXBAR10_EPWM29_TRIPOUT_SEL << 29) | (MW_EPWMXBAR10_EPWM30_TRIPOUT_SEL << 30) | (MW_EPWMXBAR10_EPWM31_TRIPOUT_SEL << 31);
    group6_epwmxbar[10] = (MW_EPWMXBAR10_DEL0_TRIP_SEL << 0) | (MW_EPWMXBAR10_DEL1_TRIP_SEL << 1) | (MW_EPWMXBAR10_DEL2_TRIP_SEL << 2) | (MW_EPWMXBAR10_DEL3_TRIP_SEL << 3) | (MW_EPWMXBAR10_DEL4_TRIP_SEL << 4) | (MW_EPWMXBAR10_DEL5_TRIP_SEL << 5) | (MW_EPWMXBAR10_DEL6_TRIP_SEL << 6) | (MW_EPWMXBAR10_DEL7_TRIP_SEL << 7) | (MW_EPWMXBAR10_DEL8_TRIP_SEL << 8) | (MW_EPWMXBAR10_DEL9_TRIP_SEL << 9) | (MW_EPWMXBAR10_DEL10_TRIP_SEL << 10) | (MW_EPWMXBAR10_DEL11_TRIP_SEL << 11) | (MW_EPWMXBAR10_DEL12_TRIP_SEL << 12) | (MW_EPWMXBAR10_DEL13_TRIP_SEL << 13) | (MW_EPWMXBAR10_DEL14_TRIP_SEL << 14) | (MW_EPWMXBAR10_DEL15_TRIP_SEL << 15) | (MW_EPWMXBAR10_DEL16_TRIP_SEL << 16) | (MW_EPWMXBAR10_DEL17_TRIP_SEL << 17) | (MW_EPWMXBAR10_DEL18_TRIP_SEL << 18) | (MW_EPWMXBAR10_DEL19_TRIP_SEL << 19) | (MW_EPWMXBAR10_DEL20_TRIP_SEL << 20) | (MW_EPWMXBAR10_DEL21_TRIP_SEL << 21) | (MW_EPWMXBAR10_DEL22_TRIP_SEL << 22) | (MW_EPWMXBAR10_DEL23_TRIP_SEL << 23) | (MW_EPWMXBAR10_DEL24_TRIP_SEL << 24) | (MW_EPWMXBAR10_DEL25_TRIP_SEL << 25) | (MW_EPWMXBAR10_DEL26_TRIP_SEL << 26) | (MW_EPWMXBAR10_DEL27_TRIP_SEL << 27) | (MW_EPWMXBAR10_DEL28_TRIP_SEL << 28) | (MW_EPWMXBAR10_DEL29_TRIP_SEL << 29) | (MW_EPWMXBAR10_DEL30_TRIP_SEL << 30) | (MW_EPWMXBAR10_DEL31_TRIP_SEL << 31);
    group7_epwmxbar[10] = (MW_EPWMXBAR10_DEL0_ACTIVE_SEL << 0) | (MW_EPWMXBAR10_DEL1_ACTIVE_SEL << 1) | (MW_EPWMXBAR10_DEL2_ACTIVE_SEL << 2) | (MW_EPWMXBAR10_DEL3_ACTIVE_SEL << 3) | (MW_EPWMXBAR10_DEL4_ACTIVE_SEL << 4) | (MW_EPWMXBAR10_DEL5_ACTIVE_SEL << 5) | (MW_EPWMXBAR10_DEL6_ACTIVE_SEL << 6) | (MW_EPWMXBAR10_DEL7_ACTIVE_SEL << 7) | (MW_EPWMXBAR10_DEL8_ACTIVE_SEL << 8) | (MW_EPWMXBAR10_DEL9_ACTIVE_SEL << 9) | (MW_EPWMXBAR10_DEL10_ACTIVE_SEL << 10) | (MW_EPWMXBAR10_DEL11_ACTIVE_SEL << 11) | (MW_EPWMXBAR10_DEL12_ACTIVE_SEL << 12) | (MW_EPWMXBAR10_DEL13_ACTIVE_SEL << 13) | (MW_EPWMXBAR10_DEL14_ACTIVE_SEL << 14) | (MW_EPWMXBAR10_DEL15_ACTIVE_SEL << 15) | (MW_EPWMXBAR10_DEL16_ACTIVE_SEL << 16) | (MW_EPWMXBAR10_DEL17_ACTIVE_SEL << 17) | (MW_EPWMXBAR10_DEL18_ACTIVE_SEL << 18) | (MW_EPWMXBAR10_DEL19_ACTIVE_SEL << 19) | (MW_EPWMXBAR10_DEL20_ACTIVE_SEL << 20) | (MW_EPWMXBAR10_DEL21_ACTIVE_SEL << 21) | (MW_EPWMXBAR10_DEL22_ACTIVE_SEL << 22) | (MW_EPWMXBAR10_DEL23_ACTIVE_SEL << 23) | (MW_EPWMXBAR10_DEL24_ACTIVE_SEL << 24) | (MW_EPWMXBAR10_DEL25_ACTIVE_SEL << 25) | (MW_EPWMXBAR10_DEL26_ACTIVE_SEL << 26) | (MW_EPWMXBAR10_DEL27_ACTIVE_SEL << 27) | (MW_EPWMXBAR10_DEL28_ACTIVE_SEL << 28) | (MW_EPWMXBAR10_DEL29_ACTIVE_SEL << 29) | (MW_EPWMXBAR10_DEL30_ACTIVE_SEL << 30) | (MW_EPWMXBAR10_DEL31_ACTIVE_SEL << 31);
    group8_epwmxbar[10] = (MW_EPWMXBAR10_EQEP0_ERR_SEL << 0) | (MW_EPWMXBAR10_EQEP1_ERR_SEL << 1) | (MW_EPWMXBAR10_EQEP2_ERR_SEL << 2) | (MW_EPWMXBAR10_FSIRX0_RX_TRIG0_SEL << 3) | (MW_EPWMXBAR10_FSIRX0_RX_TRIG1_SEL << 4) | (MW_EPWMXBAR10_FSIRX0_RX_TRIG2_SEL << 5) | (MW_EPWMXBAR10_FSIRX0_RX_TRIG3_SEL << 6) | (MW_EPWMXBAR10_FSIRX1_RX_TRIG0_SEL << 7) | (MW_EPWMXBAR10_FSIRX1_RX_TRIG1_SEL << 8) | (MW_EPWMXBAR10_FSIRX1_RX_TRIG2_SEL << 9) | (MW_EPWMXBAR10_FSIRX1_RX_TRIG3_SEL << 10) | (MW_EPWMXBAR10_FSIRX2_RX_TRIG0_SEL << 11) | (MW_EPWMXBAR10_FSIRX2_RX_TRIG1_SEL << 12) | (MW_EPWMXBAR10_FSIRX2_RX_TRIG2_SEL << 13) | (MW_EPWMXBAR10_FSIRX2_RX_TRIG3_SEL << 14) | (MW_EPWMXBAR10_FSIRX3_RX_TRIG0_SEL << 15) | (MW_EPWMXBAR10_FSIRX3_RX_TRIG1_SEL << 16) | (MW_EPWMXBAR10_FSIRX3_RX_TRIG2_SEL << 17) | (MW_EPWMXBAR10_FSIRX3_RX_TRIG3_SEL << 18) | (MW_EPWMXBAR10_ECAP0_TRIPOUT_SEL << 19) | (MW_EPWMXBAR10_ECAP1_TRIPOUT_SEL << 20) | (MW_EPWMXBAR10_ECAP2_TRIPOUT_SEL << 21) | (MW_EPWMXBAR10_ECAP3_TRIPOUT_SEL << 22) | (MW_EPWMXBAR10_ECAP4_TRIPOUT_SEL << 23) | (MW_EPWMXBAR10_ECAP5_TRIPOUT_SEL << 24) | (MW_EPWMXBAR10_ECAP6_TRIPOUT_SEL << 25) | (MW_EPWMXBAR10_ECAP7_TRIPOUT_SEL << 26) | (MW_EPWMXBAR10_ECAP8_TRIPOUT_SEL << 27) | (MW_EPWMXBAR10_ECAP9_TRIPOUT_SEL << 28);
    group0_epwmxbar[11] = (MW_EPWMXBAR11_CMPSSA0_CTRIPL_SEL << 0) | (MW_EPWMXBAR11_CMPSSA0_CTRIPH_SEL << 1) | (MW_EPWMXBAR11_CMPSSA1_CTRIPL_SEL << 2) | (MW_EPWMXBAR11_CMPSSA1_CTRIPH_SEL << 3) | (MW_EPWMXBAR11_CMPSSA2_CTRIPL_SEL << 4) | (MW_EPWMXBAR11_CMPSSA2_CTRIPH_SEL << 5) | (MW_EPWMXBAR11_CMPSSA3_CTRIPL_SEL << 6) | (MW_EPWMXBAR11_CMPSSA3_CTRIPH_SEL << 7) | (MW_EPWMXBAR11_CMPSSA4_CTRIPL_SEL << 8) | (MW_EPWMXBAR11_CMPSSA4_CTRIPH_SEL << 9) | (MW_EPWMXBAR11_CMPSSA5_CTRIPL_SEL << 10) | (MW_EPWMXBAR11_CMPSSA5_CTRIPH_SEL << 11) | (MW_EPWMXBAR11_CMPSSA6_CTRIPL_SEL << 12) | (MW_EPWMXBAR11_CMPSSA6_CTRIPH_SEL << 13) | (MW_EPWMXBAR11_CMPSSA7_CTRIPL_SEL << 14) | (MW_EPWMXBAR11_CMPSSA7_CTRIPH_SEL << 15) | (MW_EPWMXBAR11_CMPSSA8_CTRIPL_SEL << 16) | (MW_EPWMXBAR11_CMPSSA8_CTRIPH_SEL << 17) | (MW_EPWMXBAR11_CMPSSA9_CTRIPL_SEL << 18) | (MW_EPWMXBAR11_CMPSSA9_CTRIPH_SEL << 19);
    group1_epwmxbar[11] = (MW_EPWMXBAR11_CMPSSB0_CTRIPL_SEL << 0) | (MW_EPWMXBAR11_CMPSSB0_CTRIPH_SEL << 1) | (MW_EPWMXBAR11_CMPSSB1_CTRIPL_SEL << 2) | (MW_EPWMXBAR11_CMPSSB1_CTRIPH_SEL << 3) | (MW_EPWMXBAR11_CMPSSB2_CTRIPL_SEL << 4) | (MW_EPWMXBAR11_CMPSSB2_CTRIPH_SEL << 5) | (MW_EPWMXBAR11_CMPSSB3_CTRIPL_SEL << 6) | (MW_EPWMXBAR11_CMPSSB3_CTRIPH_SEL << 7) | (MW_EPWMXBAR11_CMPSSB4_CTRIPL_SEL << 8) | (MW_EPWMXBAR11_CMPSSB4_CTRIPH_SEL << 9) | (MW_EPWMXBAR11_CMPSSB5_CTRIPL_SEL << 10) | (MW_EPWMXBAR11_CMPSSB5_CTRIPH_SEL << 11) | (MW_EPWMXBAR11_CMPSSB6_CTRIPL_SEL << 12) | (MW_EPWMXBAR11_CMPSSB6_CTRIPH_SEL << 13) | (MW_EPWMXBAR11_CMPSSB7_CTRIPL_SEL << 14) | (MW_EPWMXBAR11_CMPSSB7_CTRIPH_SEL << 15) | (MW_EPWMXBAR11_CMPSSB8_CTRIPL_SEL << 16) | (MW_EPWMXBAR11_CMPSSB8_CTRIPH_SEL << 17) | (MW_EPWMXBAR11_CMPSSB9_CTRIPL_SEL << 18) | (MW_EPWMXBAR11_CMPSSB9_CTRIPH_SEL << 19);
    group2_epwmxbar[11] = (MW_EPWMXBAR11_SD0_FILT0_CEVT1_SEL << 0) | (MW_EPWMXBAR11_SD0_FILT0_CEVT2_SEL << 1) | (MW_EPWMXBAR11_SD0_FILT0_CMPHZ_SEL << 2) | (MW_EPWMXBAR11_SD0_FILT1_CEVT1_SEL << 3) | (MW_EPWMXBAR11_SD0_FILT1_CEVT2_SEL << 4) | (MW_EPWMXBAR11_SD0_FILT1_CMPHZ_SEL << 5) | (MW_EPWMXBAR11_SD0_FILT2_CEVT1_SEL << 6) | (MW_EPWMXBAR11_SD0_FILT2_CEVT2_SEL << 7) | (MW_EPWMXBAR11_SD0_FILT2_CMPHZ_SEL << 8) | (MW_EPWMXBAR11_SD0_FILT3_CEVT1_SEL << 9) | (MW_EPWMXBAR11_SD0_FILT3_CEVT2_SEL << 10) | (MW_EPWMXBAR11_SD0_FILT3_CMPHZ_SEL << 11) | (MW_EPWMXBAR11_SD1_FILT0_CEVT1_SEL << 12) | (MW_EPWMXBAR11_SD1_FILT0_CEVT2_SEL << 13) | (MW_EPWMXBAR11_SD1_FILT0_CMPHZ_SEL << 14) | (MW_EPWMXBAR11_SD1_FILT1_CEVT1_SEL << 15) | (MW_EPWMXBAR11_SD1_FILT1_CEVT2_SEL << 16) | (MW_EPWMXBAR11_SD1_FILT1_CMPHZ_SEL << 17) | (MW_EPWMXBAR11_SD1_FILT2_CEVT1_SEL << 18) | (MW_EPWMXBAR11_SD1_FILT2_CEVT2_SEL << 19) | (MW_EPWMXBAR11_SD1_FILT2_CMPHZ_SEL << 20) | (MW_EPWMXBAR11_SD1_FILT3_CEVT1_SEL << 21) | (MW_EPWMXBAR11_SD1_FILT3_CEVT2_SEL << 22) | (MW_EPWMXBAR11_SD1_FILT3_CMPHZ_SEL << 23);
    group3_epwmxbar[11] = (MW_EPWMXBAR11_ADC0_EVT1_SEL << 0) | (MW_EPWMXBAR11_ADC0_EVT2_SEL << 1) | (MW_EPWMXBAR11_ADC0_EVT3_SEL << 2) | (MW_EPWMXBAR11_ADC0_EVT4_SEL << 3) | (MW_EPWMXBAR11_ADC1_EVT1_SEL << 4) | (MW_EPWMXBAR11_ADC1_EVT2_SEL << 5) | (MW_EPWMXBAR11_ADC1_EVT3_SEL << 6) | (MW_EPWMXBAR11_ADC1_EVT4_SEL << 7) | (MW_EPWMXBAR11_ADC2_EVT1_SEL << 8) | (MW_EPWMXBAR11_ADC2_EVT2_SEL << 9) | (MW_EPWMXBAR11_ADC2_EVT3_SEL << 10) | (MW_EPWMXBAR11_ADC2_EVT4_SEL << 11) | (MW_EPWMXBAR11_ADC3_EVT1_SEL << 12) | (MW_EPWMXBAR11_ADC3_EVT2_SEL << 13) | (MW_EPWMXBAR11_ADC3_EVT3_SEL << 14) | (MW_EPWMXBAR11_ADC3_EVT4_SEL << 15) | (MW_EPWMXBAR11_ADC4_EVT1_SEL << 16) | (MW_EPWMXBAR11_ADC4_EVT2_SEL << 17) | (MW_EPWMXBAR11_ADC4_EVT3_SEL << 18) | (MW_EPWMXBAR11_ADC4_EVT4_SEL << 19);
    // if(MW_EPWMXBAR11_GPIO0_SEL == 1 | MW_EPWMXBAR11_GPIO1_SEL == 1 | MW_EPWMXBAR11_GPIO2_SEL == 1 | MW_EPWMXBAR11_GPIO3_SEL == 1 | MW_EPWMXBAR11_GPIO4_SEL == 1 | MW_EPWMXBAR11_GPIO5_SEL == 1 | MW_EPWMXBAR11_GPIO6_SEL == 1 | MW_EPWMXBAR11_GPIO7_SEL == 1| MW_EPWMXBAR11_GPIO8_SEL == 1 | MW_EPWMXBAR11_GPIO9_SEL == 1 | MW_EPWMXBAR11_GPIO10_SEL == 1| MW_EPWMXBAR11_GPIO11_SEL == 1| MW_EPWMXBAR11_GPIO12_SEL == 1 | MW_EPWMXBAR11_GPIO13_SEL == 1 | MW_EPWMXBAR11_GPIO14_SEL == 1 | MW_EPWMXBAR11_GPIO15_SEL == 1 | MW_EPWMXBAR11_GPIO16_SEL == 1 | MW_EPWMXBAR11_GPIO17_SEL == 1 | MW_EPWMXBAR11_GPIO18_SEL == 1 | MW_EPWMXBAR11_GPIO19_SEL == 1 | MW_EPWMXBAR11_GPIO20_SEL == 1 | MW_EPWMXBAR11_GPIO21_SEL == 1 | MW_EPWMXBAR11_GPIO22_SEL == 1 | MW_EPWMXBAR11_GPIO23_SEL == 1 | MW_EPWMXBAR11_GPIO24_SEL == 1 | MW_EPWMXBAR11_GPIO25_SEL == 1 | MW_EPWMXBAR11_GPIO26_SEL == 1 | MW_EPWMXBAR11_GPIO27_SEL == 1 | MW_EPWMXBAR11_GPIO28_SEL == 1 | MW_EPWMXBAR11_GPIO29_SEL == 1 | MW_EPWMXBAR11_GPIO30_SEL == 1 | MW_EPWMXBAR11_GPIO31_SEL == 1 | MW_EPWMXBAR11_GPIO32_SEL == 1 | MW_EPWMXBAR11_GPIO33_SEL == 1 | MW_EPWMXBAR11_GPIO34_SEL == 1 | MW_EPWMXBAR11_GPIO35_SEL == 1 | MW_EPWMXBAR11_GPIO36_SEL == 1 | MW_EPWMXBAR11_GPIO37_SEL == 1 | MW_EPWMXBAR11_GPIO38_SEL == 1 | MW_EPWMXBAR11_GPIO39_SEL == 1 | MW_EPWMXBAR11_GPIO40_SEL == 1 | MW_EPWMXBAR11_GPIO41_SEL == 1 | MW_EPWMXBAR11_GPIO42_SEL == 1 | MW_EPWMXBAR11_GPIO43_SEL == 1 | MW_EPWMXBAR11_GPIO44_SEL == 1 | | MW_EPWMXBAR11_GPIO45_SEL == 1 | MW_EPWMXBAR11_GPIO46_SEL == 1 | MW_EPWMXBAR11_GPIO47_SEL == 1| MW_EPWMXBAR11_GPIO48_SEL == 1 | MW_EPWMXBAR11_GPIO49_SEL == 1 | MW_EPWMXBAR11_GPIO50_SEL == 1 | MW_EPWMXBAR11_GPIO51_SEL == 1 | MW_EPWMXBAR11_GPIO52_SEL == 1 | MW_EPWMXBAR11_GPIO53_SEL == 1 | MW_EPWMXBAR11_GPIO54_SEL == 1 | MW_EPWMXBAR11_GPIO55_SEL == 1 | MW_EPWMXBAR11_GPIO56_SEL == 1 | MW_EPWMXBAR11_GPIO57_SEL == 1| MW_EPWMXBAR11_GPIO58_SEL == 1 | MW_EPWMXBAR11_GPIO59_SEL == 1 | MW_EPWMXBAR11_GPIO60_SEL == 1 | MW_EPWMXBAR11_GPIO61_SEL == 1 | MW_EPWMXBAR11_GPIO62_SEL == 1 | MW_EPWMXBAR11_GPIO63_SEL == 1 | MW_EPWMXBAR11_GPIO64_SEL == 1 | | MW_EPWMXBAR11_GPIO59_SEL == 1 | MW_EPWMXBAR11_GPIO60_SEL == 1 | MW_EPWMXBAR11_GPIO61_SEL == 1 | MW_EPWMXBAR11_GPIO62_SEL == 1 | MW_EPWMXBAR11_GPIO63_SEL == 1 | MW_EPWMXBAR11_GPIO64_SEL == 1 | MW_EPWMXBAR11_GPIO65_SEL == 1 | MW_EPWMXBAR11_GPIO66_SEL == 1 | MW_EPWMXBAR11_GPIO67_SEL == 1 | MW_EPWMXBAR11_GPIO68_SEL == 1 | MW_EPWMXBAR11_GPIO69_SEL == 1 | MW_EPWMXBAR11_GPIO70_SEL == 1 | MW_EPWMXBAR11_GPIO71_SEL == 1 | MW_EPWMXBAR11_GPIO72_SEL == 1 | MW_EPWMXBAR11_GPIO73_SEL == 1 | MW_EPWMXBAR11_GPIO74_SEL == 1 | MW_EPWMXBAR11_GPIO75_SEL == 1 | MW_EPWMXBAR11_GPIO76_SEL == 1 | MW_EPWMXBAR11_GPIO77_SEL == 1 | MW_EPWMXBAR11_GPIO78_SEL == 1 | | MW_EPWMXBAR11_GPIO80_SEL == 1 | MW_EPWMXBAR11_GPIO81_SEL == 1 | MW_EPWMXBAR11_GPIO82_SEL == 1 | MW_EPWMXBAR11_GPIO83_SEL == 1 | MW_EPWMXBAR11_GPIO84_SEL == 1 | MW_EPWMXBAR11_GPIO85_SEL == 1 | MW_EPWMXBAR11_GPIO86_SEL == 1 | MW_EPWMXBAR11_GPIO87_SEL == 1 | MW_EPWMXBAR11_GPIO88_SEL == 1 | MW_EPWMXBAR11_GPIO89_SEL == 1 | MW_EPWMXBAR11_GPIO90_SEL == 1 | MW_EPWMXBAR11_GPIO91_SEL == 1 | MW_EPWMXBAR11_GPIO92_SEL == 1 | MW_EPWMXBAR11_GPIO93_SEL == 1 | MW_EPWMXBAR11_GPIO94_SEL == 1 | MW_EPWMXBAR11_GPIO95_SEL == 1 | MW_EPWMXBAR11_GPIO96_SEL == 1 | MW_EPWMXBAR11_GPIO97_SEL == 1 | MW_EPWMXBAR11_GPIO98_SEL == 1 | MW_EPWMXBAR11_GPIO99_SEL == 1 | MW_EPWMXBAR11_GPIO100_SEL == 1 | MW_EPWMXBAR11_GPIO101_SEL == 1 | MW_EPWMXBAR11_GPIO102_SEL == 1 | MW_EPWMXBAR11_GPIO103_SEL == 1 | MW_EPWMXBAR11_GPIO104_SEL == 1 | MW_EPWMXBAR11_GPIO105_SEL == 1 | MW_EPWMXBAR11_GPIO106_SEL == 1 | MW_EPWMXBAR11_GPIO107_SEL == 1 | | MW_EPWMXBAR11_GPIO108_SEL == 1 | MW_EPWMXBAR11_GPIO109_SEL == 1| MW_EPWMXBAR11_GPIO110_SEL == 1 | MW_EPWMXBAR11_GPIO111_SEL == 1 | MW_EPWMXBAR11_GPIO112_SEL == 1 | MW_EPWMXBAR11_GPIO113_SEL == 1 | MW_EPWMXBAR11_GPIO114_SEL == 1 | MW_EPWMXBAR11_GPIO115_SEL == 1 | MW_EPWMXBAR11_GPIO116_SEL == 1 | MW_EPWMXBAR11_GPIO117_SEL == 1 | MW_EPWMXBAR11_GPIO118_SEL == 1 | MW_EPWMXBAR11_GPIO119_SEL == 1 | MW_EPWMXBAR11_GPIO120_SEL == 1 | MW_EPWMXBAR11_GPIO121_SEL == 1 | MW_EPWMXBAR11_GPIO122_SEL == 1 | MW_EPWMXBAR11_GPIO123_SEL == 1 | MW_EPWMXBAR11_GPIO124_SEL == 1 | MW_EPWMXBAR11_GPIO125_SEL == 1 | MW_EPWMXBAR11_GPIO126_SEL == 1 | MW_EPWMXBAR11_GPIO127_SEL == 1 | MW_EPWMXBAR11_GPIO128_SEL == 1 | MW_EPWMXBAR11_GPIO129_SEL == 1 | MW_EPWMXBAR11_GPIO130_SEL == 1 | MW_EPWMXBAR11_GPIO131_SEL == 1 | MW_EPWMXBAR11_GPIO132_SEL == 1 | MW_EPWMXBAR11_GPIO133_SEL == 1 | MW_EPWMXBAR11_GPIO134_SEL == 1 | MW_EPWMXBAR11_GPIO135_SEL == 1 | MW_EPWMXBAR11_GPIO136_SEL == 1 | MW_EPWMXBAR11_GPIO137_SEL == 1 | MW_EPWMXBAR11_GPIO139_SEL == 1 | MW_EPWMXBAR11_GPIO140_SEL == 1 | MW_EPWMXBAR11_GPIO141_SEL == 1 | MW_EPWMXBAR11_GPIO142_SEL == 1 | MW_EPWMXBAR11_GPIO143_SEL == 1 | MW_EPWMXBAR11_ICSSGPO0_PORT0_SEL == 1 | MW_EPWMXBAR11_ICSSGPO1_PORT0_SEL == 1 | MW_EPWMXBAR11_ICSSGPO2_PORT0_SEL == 1 | MW_EPWMXBAR11_ICSSGPO3_PORT0_SEL == 1 | MW_EPWMXBAR11_ICSSGPO4_PORT0_SEL == 1 | MW_EPWMXBAR11_ICSSGPO5_PORT0_SEL == 1 | MW_EPWMXBAR11_ICSSGPO6_PORT0_SEL == 1 | MW_EPWMXBAR11_ICSSGPO7_PORT0_SEL == 1 | MW_EPWMXBAR11_ICSSGPO8_PORT0_SEL == 1 | MW_EPWMXBAR11_ICSSGPO9_PORT0_SEL == 1 | MW_EPWMXBAR11_ICSSGPO10_PORT0_SEL == 1 | MW_EPWMXBAR11_ICSSGPO11_PORT0_SEL == 1 | MW_EPWMXBAR11_ICSSGPO12_PORT0_SEL == 1 | MW_EPWMXBAR11_ICSSGPO13_PORT0_SEL == 1 | MW_EPWMXBAR11_ICSSGPO14_PORT0_SEL == 1 | MW_EPWMXBAR11_ICSSGPO15_PORT0_SEL == 1 | MW_EPWMXBAR11_ICSSGPO0_PORT1_SEL == 1 | MW_EPWMXBAR11_ICSSGPO1_PORT1_SEL == 1 | MW_EPWMXBAR11_ICSSGPO2_PORT1_SEL == 1 | MW_EPWMXBAR11_ICSSGPO3_PORT1_SEL == 1 | MW_EPWMXBAR11_ICSSGPO4_PORT1_SEL == 1 | MW_EPWMXBAR11_ICSSGPO5_PORT1_SEL == 1 | MW_EPWMXBAR11_ICSSGPO6_PORT1_SEL == 1 | MW_EPWMXBAR11_ICSSGPO7_PORT1_SEL == 1 | MW_EPWMXBAR11_ICSSGPO8_PORT1_SEL == 1 | MW_EPWMXBAR11_ICSSGPO9_PORT1_SEL == 1 | MW_EPWMXBAR11_ICSSGPO10_PORT1_SEL == 1 | MW_EPWMXBAR11_ICSSGPO11_PORT1_SEL == 1 | MW_EPWMXBAR11_ICSSGPO12_PORT1_SEL == 1 | MW_EPWMXBAR11_ICSSGPO13_PORT1_SEL == 1 | MW_EPWMXBAR11_ICSSGPO14_PORT1_SEL == 1 | MW_EPWMXBAR11_ICSSGPO15_PORT1_SEL == 1)
    //     group4_epwmxbar[11] = EPWM_XBAR_11;
    // else
        group4_epwmxbar[11] = 0;
    group5_epwmxbar[11] = (MW_EPWMXBAR11_EPWM0_TRIPOUT_SEL << 0) | (MW_EPWMXBAR11_EPWM1_TRIPOUT_SEL << 1) | (MW_EPWMXBAR11_EPWM2_TRIPOUT_SEL << 2) | (MW_EPWMXBAR11_EPWM3_TRIPOUT_SEL << 3) | (MW_EPWMXBAR11_EPWM4_TRIPOUT_SEL << 4) | (MW_EPWMXBAR11_EPWM5_TRIPOUT_SEL << 5) | (MW_EPWMXBAR11_EPWM6_TRIPOUT_SEL << 6) | (MW_EPWMXBAR11_EPWM7_TRIPOUT_SEL << 7) | (MW_EPWMXBAR11_EPWM8_TRIPOUT_SEL << 8) | (MW_EPWMXBAR11_EPWM9_TRIPOUT_SEL << 9) | (MW_EPWMXBAR11_EPWM10_TRIPOUT_SEL << 10) | (MW_EPWMXBAR11_EPWM11_TRIPOUT_SEL << 11) | (MW_EPWMXBAR11_EPWM12_TRIPOUT_SEL << 12) | (MW_EPWMXBAR11_EPWM13_TRIPOUT_SEL << 13) | (MW_EPWMXBAR11_EPWM14_TRIPOUT_SEL << 14) | (MW_EPWMXBAR11_EPWM15_TRIPOUT_SEL << 15) | (MW_EPWMXBAR11_EPWM16_TRIPOUT_SEL << 16) | (MW_EPWMXBAR11_EPWM17_TRIPOUT_SEL << 17) | (MW_EPWMXBAR11_EPWM18_TRIPOUT_SEL << 18) | (MW_EPWMXBAR11_EPWM19_TRIPOUT_SEL << 19) | (MW_EPWMXBAR11_EPWM20_TRIPOUT_SEL << 20) | (MW_EPWMXBAR11_EPWM21_TRIPOUT_SEL << 21) | (MW_EPWMXBAR11_EPWM22_TRIPOUT_SEL << 22) | (MW_EPWMXBAR11_EPWM23_TRIPOUT_SEL << 23) | (MW_EPWMXBAR11_EPWM24_TRIPOUT_SEL << 24) | (MW_EPWMXBAR11_EPWM25_TRIPOUT_SEL << 25) | (MW_EPWMXBAR11_EPWM26_TRIPOUT_SEL << 26) | (MW_EPWMXBAR11_EPWM27_TRIPOUT_SEL << 27) | (MW_EPWMXBAR11_EPWM28_TRIPOUT_SEL << 28) | (MW_EPWMXBAR11_EPWM29_TRIPOUT_SEL << 29) | (MW_EPWMXBAR11_EPWM30_TRIPOUT_SEL << 30) | (MW_EPWMXBAR11_EPWM31_TRIPOUT_SEL << 31);
    group6_epwmxbar[11] = (MW_EPWMXBAR11_DEL0_TRIP_SEL << 0) | (MW_EPWMXBAR11_DEL1_TRIP_SEL << 1) | (MW_EPWMXBAR11_DEL2_TRIP_SEL << 2) | (MW_EPWMXBAR11_DEL3_TRIP_SEL << 3) | (MW_EPWMXBAR11_DEL4_TRIP_SEL << 4) | (MW_EPWMXBAR11_DEL5_TRIP_SEL << 5) | (MW_EPWMXBAR11_DEL6_TRIP_SEL << 6) | (MW_EPWMXBAR11_DEL7_TRIP_SEL << 7) | (MW_EPWMXBAR11_DEL8_TRIP_SEL << 8) | (MW_EPWMXBAR11_DEL9_TRIP_SEL << 9) | (MW_EPWMXBAR11_DEL10_TRIP_SEL << 10) | (MW_EPWMXBAR11_DEL11_TRIP_SEL << 11) | (MW_EPWMXBAR11_DEL12_TRIP_SEL << 12) | (MW_EPWMXBAR11_DEL13_TRIP_SEL << 13) | (MW_EPWMXBAR11_DEL14_TRIP_SEL << 14) | (MW_EPWMXBAR11_DEL15_TRIP_SEL << 15) | (MW_EPWMXBAR11_DEL16_TRIP_SEL << 16) | (MW_EPWMXBAR11_DEL17_TRIP_SEL << 17) | (MW_EPWMXBAR11_DEL18_TRIP_SEL << 18) | (MW_EPWMXBAR11_DEL19_TRIP_SEL << 19) | (MW_EPWMXBAR11_DEL20_TRIP_SEL << 20) | (MW_EPWMXBAR11_DEL21_TRIP_SEL << 21) | (MW_EPWMXBAR11_DEL22_TRIP_SEL << 22) | (MW_EPWMXBAR11_DEL23_TRIP_SEL << 23) | (MW_EPWMXBAR11_DEL24_TRIP_SEL << 24) | (MW_EPWMXBAR11_DEL25_TRIP_SEL << 25) | (MW_EPWMXBAR11_DEL26_TRIP_SEL << 26) | (MW_EPWMXBAR11_DEL27_TRIP_SEL << 27) | (MW_EPWMXBAR11_DEL28_TRIP_SEL << 28) | (MW_EPWMXBAR11_DEL29_TRIP_SEL << 29) | (MW_EPWMXBAR11_DEL30_TRIP_SEL << 30) | (MW_EPWMXBAR11_DEL31_TRIP_SEL << 31);
