TexasInstruments/am26x-hsp/src/am263px_init.c
    group7_epwmxbar[11] = (MW_EPWMXBAR11_DEL0_ACTIVE_SEL << 0) | (MW_EPWMXBAR11_DEL1_ACTIVE_SEL << 1) | (MW_EPWMXBAR11_DEL2_ACTIVE_SEL << 2) | (MW_EPWMXBAR11_DEL3_ACTIVE_SEL << 3) | (MW_EPWMXBAR11_DEL4_ACTIVE_SEL << 4) | (MW_EPWMXBAR11_DEL5_ACTIVE_SEL << 5) | (MW_EPWMXBAR11_DEL6_ACTIVE_SEL << 6) | (MW_EPWMXBAR11_DEL7_ACTIVE_SEL << 7) | (MW_EPWMXBAR11_DEL8_ACTIVE_SEL << 8) | (MW_EPWMXBAR11_DEL9_ACTIVE_SEL << 9) | (MW_EPWMXBAR11_DEL10_ACTIVE_SEL << 10) | (MW_EPWMXBAR11_DEL11_ACTIVE_SEL << 11) | (MW_EPWMXBAR11_DEL12_ACTIVE_SEL << 12) | (MW_EPWMXBAR11_DEL13_ACTIVE_SEL << 13) | (MW_EPWMXBAR11_DEL14_ACTIVE_SEL << 14) | (MW_EPWMXBAR11_DEL15_ACTIVE_SEL << 15) | (MW_EPWMXBAR11_DEL16_ACTIVE_SEL << 16) | (MW_EPWMXBAR11_DEL17_ACTIVE_SEL << 17) | (MW_EPWMXBAR11_DEL18_ACTIVE_SEL << 18) | (MW_EPWMXBAR11_DEL19_ACTIVE_SEL << 19) | (MW_EPWMXBAR11_DEL20_ACTIVE_SEL << 20) | (MW_EPWMXBAR11_DEL21_ACTIVE_SEL << 21) | (MW_EPWMXBAR11_DEL22_ACTIVE_SEL << 22) | (MW_EPWMXBAR11_DEL23_ACTIVE_SEL << 23) | (MW_EPWMXBAR11_DEL24_ACTIVE_SEL << 24) | (MW_EPWMXBAR11_DEL25_ACTIVE_SEL << 25) | (MW_EPWMXBAR11_DEL26_ACTIVE_SEL << 26) | (MW_EPWMXBAR11_DEL27_ACTIVE_SEL << 27) | (MW_EPWMXBAR11_DEL28_ACTIVE_SEL << 28) | (MW_EPWMXBAR11_DEL29_ACTIVE_SEL << 29) | (MW_EPWMXBAR11_DEL30_ACTIVE_SEL << 30) | (MW_EPWMXBAR11_DEL31_ACTIVE_SEL << 31);
    group8_epwmxbar[11] = (MW_EPWMXBAR11_EQEP0_ERR_SEL << 0) | (MW_EPWMXBAR11_EQEP1_ERR_SEL << 1) | (MW_EPWMXBAR11_EQEP2_ERR_SEL << 2) | (MW_EPWMXBAR11_FSIRX0_RX_TRIG0_SEL << 3) | (MW_EPWMXBAR11_FSIRX0_RX_TRIG1_SEL << 4) | (MW_EPWMXBAR11_FSIRX0_RX_TRIG2_SEL << 5) | (MW_EPWMXBAR11_FSIRX0_RX_TRIG3_SEL << 6) | (MW_EPWMXBAR11_FSIRX1_RX_TRIG0_SEL << 7) | (MW_EPWMXBAR11_FSIRX1_RX_TRIG1_SEL << 8) | (MW_EPWMXBAR11_FSIRX1_RX_TRIG2_SEL << 9) | (MW_EPWMXBAR11_FSIRX1_RX_TRIG3_SEL << 10) | (MW_EPWMXBAR11_FSIRX2_RX_TRIG0_SEL << 11) | (MW_EPWMXBAR11_FSIRX2_RX_TRIG1_SEL << 12) | (MW_EPWMXBAR11_FSIRX2_RX_TRIG2_SEL << 13) | (MW_EPWMXBAR11_FSIRX2_RX_TRIG3_SEL << 14) | (MW_EPWMXBAR11_FSIRX3_RX_TRIG0_SEL << 15) | (MW_EPWMXBAR11_FSIRX3_RX_TRIG1_SEL << 16) | (MW_EPWMXBAR11_FSIRX3_RX_TRIG2_SEL << 17) | (MW_EPWMXBAR11_FSIRX3_RX_TRIG3_SEL << 18) | (MW_EPWMXBAR11_ECAP0_TRIPOUT_SEL << 19) | (MW_EPWMXBAR11_ECAP1_TRIPOUT_SEL << 20) | (MW_EPWMXBAR11_ECAP2_TRIPOUT_SEL << 21) | (MW_EPWMXBAR11_ECAP3_TRIPOUT_SEL << 22) | (MW_EPWMXBAR11_ECAP4_TRIPOUT_SEL << 23) | (MW_EPWMXBAR11_ECAP5_TRIPOUT_SEL << 24) | (MW_EPWMXBAR11_ECAP6_TRIPOUT_SEL << 25) | (MW_EPWMXBAR11_ECAP7_TRIPOUT_SEL << 26) | (MW_EPWMXBAR11_ECAP8_TRIPOUT_SEL << 27) | (MW_EPWMXBAR11_ECAP9_TRIPOUT_SEL << 28);
    group0_epwmxbar[12] = (MW_EPWMXBAR12_CMPSSA0_CTRIPL_SEL << 0) | (MW_EPWMXBAR12_CMPSSA0_CTRIPH_SEL << 1) | (MW_EPWMXBAR12_CMPSSA1_CTRIPL_SEL << 2) | (MW_EPWMXBAR12_CMPSSA1_CTRIPH_SEL << 3) | (MW_EPWMXBAR12_CMPSSA2_CTRIPL_SEL << 4) | (MW_EPWMXBAR12_CMPSSA2_CTRIPH_SEL << 5) | (MW_EPWMXBAR12_CMPSSA3_CTRIPL_SEL << 6) | (MW_EPWMXBAR12_CMPSSA3_CTRIPH_SEL << 7) | (MW_EPWMXBAR12_CMPSSA4_CTRIPL_SEL << 8) | (MW_EPWMXBAR12_CMPSSA4_CTRIPH_SEL << 9) | (MW_EPWMXBAR12_CMPSSA5_CTRIPL_SEL << 10) | (MW_EPWMXBAR12_CMPSSA5_CTRIPH_SEL << 11) | (MW_EPWMXBAR12_CMPSSA6_CTRIPL_SEL << 12) | (MW_EPWMXBAR12_CMPSSA6_CTRIPH_SEL << 13) | (MW_EPWMXBAR12_CMPSSA7_CTRIPL_SEL << 14) | (MW_EPWMXBAR12_CMPSSA7_CTRIPH_SEL << 15) | (MW_EPWMXBAR12_CMPSSA8_CTRIPL_SEL << 16) | (MW_EPWMXBAR12_CMPSSA8_CTRIPH_SEL << 17) | (MW_EPWMXBAR12_CMPSSA9_CTRIPL_SEL << 18) | (MW_EPWMXBAR12_CMPSSA9_CTRIPH_SEL << 19);
    group1_epwmxbar[12] = (MW_EPWMXBAR12_CMPSSB0_CTRIPL_SEL << 0) | (MW_EPWMXBAR12_CMPSSB0_CTRIPH_SEL << 1) | (MW_EPWMXBAR12_CMPSSB1_CTRIPL_SEL << 2) | (MW_EPWMXBAR12_CMPSSB1_CTRIPH_SEL << 3) | (MW_EPWMXBAR12_CMPSSB2_CTRIPL_SEL << 4) | (MW_EPWMXBAR12_CMPSSB2_CTRIPH_SEL << 5) | (MW_EPWMXBAR12_CMPSSB3_CTRIPL_SEL << 6) | (MW_EPWMXBAR12_CMPSSB3_CTRIPH_SEL << 7) | (MW_EPWMXBAR12_CMPSSB4_CTRIPL_SEL << 8) | (MW_EPWMXBAR12_CMPSSB4_CTRIPH_SEL << 9) | (MW_EPWMXBAR12_CMPSSB5_CTRIPL_SEL << 10) | (MW_EPWMXBAR12_CMPSSB5_CTRIPH_SEL << 11) | (MW_EPWMXBAR12_CMPSSB6_CTRIPL_SEL << 12) | (MW_EPWMXBAR12_CMPSSB6_CTRIPH_SEL << 13) | (MW_EPWMXBAR12_CMPSSB7_CTRIPL_SEL << 14) | (MW_EPWMXBAR12_CMPSSB7_CTRIPH_SEL << 15) | (MW_EPWMXBAR12_CMPSSB8_CTRIPL_SEL << 16) | (MW_EPWMXBAR12_CMPSSB8_CTRIPH_SEL << 17) | (MW_EPWMXBAR12_CMPSSB9_CTRIPL_SEL << 18) | (MW_EPWMXBAR12_CMPSSB9_CTRIPH_SEL << 19);
    group2_epwmxbar[12] = (MW_EPWMXBAR12_SD0_FILT0_CEVT1_SEL << 0) | (MW_EPWMXBAR12_SD0_FILT0_CEVT2_SEL << 1) | (MW_EPWMXBAR12_SD0_FILT0_CMPHZ_SEL << 2) | (MW_EPWMXBAR12_SD0_FILT1_CEVT1_SEL << 3) | (MW_EPWMXBAR12_SD0_FILT1_CEVT2_SEL << 4) | (MW_EPWMXBAR12_SD0_FILT1_CMPHZ_SEL << 5) | (MW_EPWMXBAR12_SD0_FILT2_CEVT1_SEL << 6) | (MW_EPWMXBAR12_SD0_FILT2_CEVT2_SEL << 7) | (MW_EPWMXBAR12_SD0_FILT2_CMPHZ_SEL << 8) | (MW_EPWMXBAR12_SD0_FILT3_CEVT1_SEL << 9) | (MW_EPWMXBAR12_SD0_FILT3_CEVT2_SEL << 10) | (MW_EPWMXBAR12_SD0_FILT3_CMPHZ_SEL << 11) | (MW_EPWMXBAR12_SD1_FILT0_CEVT1_SEL << 12) | (MW_EPWMXBAR12_SD1_FILT0_CEVT2_SEL << 13) | (MW_EPWMXBAR12_SD1_FILT0_CMPHZ_SEL << 14) | (MW_EPWMXBAR12_SD1_FILT1_CEVT1_SEL << 15) | (MW_EPWMXBAR12_SD1_FILT1_CEVT2_SEL << 16) | (MW_EPWMXBAR12_SD1_FILT1_CMPHZ_SEL << 17) | (MW_EPWMXBAR12_SD1_FILT2_CEVT1_SEL << 18) | (MW_EPWMXBAR12_SD1_FILT2_CEVT2_SEL << 19) | (MW_EPWMXBAR12_SD1_FILT2_CMPHZ_SEL << 20) | (MW_EPWMXBAR12_SD1_FILT3_CEVT1_SEL << 21) | (MW_EPWMXBAR12_SD1_FILT3_CEVT2_SEL << 22) | (MW_EPWMXBAR12_SD1_FILT3_CMPHZ_SEL << 23);
    group3_epwmxbar[12] = (MW_EPWMXBAR12_ADC0_EVT1_SEL << 0) | (MW_EPWMXBAR12_ADC0_EVT2_SEL << 1) | (MW_EPWMXBAR12_ADC0_EVT3_SEL << 2) | (MW_EPWMXBAR12_ADC0_EVT4_SEL << 3) | (MW_EPWMXBAR12_ADC1_EVT1_SEL << 4) | (MW_EPWMXBAR12_ADC1_EVT2_SEL << 5) | (MW_EPWMXBAR12_ADC1_EVT3_SEL << 6) | (MW_EPWMXBAR12_ADC1_EVT4_SEL << 7) | (MW_EPWMXBAR12_ADC2_EVT1_SEL << 8) | (MW_EPWMXBAR12_ADC2_EVT2_SEL << 9) | (MW_EPWMXBAR12_ADC2_EVT3_SEL << 10) | (MW_EPWMXBAR12_ADC2_EVT4_SEL << 11) | (MW_EPWMXBAR12_ADC3_EVT1_SEL << 12) | (MW_EPWMXBAR12_ADC3_EVT2_SEL << 13) | (MW_EPWMXBAR12_ADC3_EVT3_SEL << 14) | (MW_EPWMXBAR12_ADC3_EVT4_SEL << 15) | (MW_EPWMXBAR12_ADC4_EVT1_SEL << 16) | (MW_EPWMXBAR12_ADC4_EVT2_SEL << 17) | (MW_EPWMXBAR12_ADC4_EVT3_SEL << 18) | (MW_EPWMXBAR12_ADC4_EVT4_SEL << 19);
    // if(MW_EPWMXBAR12_GPIO0_SEL == 1 | MW_EPWMXBAR12_GPIO1_SEL == 1 | MW_EPWMXBAR12_GPIO2_SEL == 1 | MW_EPWMXBAR12_GPIO3_SEL == 1 | MW_EPWMXBAR12_GPIO4_SEL == 1 | MW_EPWMXBAR12_GPIO5_SEL == 1 | MW_EPWMXBAR12_GPIO6_SEL == 1 | MW_EPWMXBAR12_GPIO7_SEL == 1| MW_EPWMXBAR12_GPIO8_SEL == 1 | MW_EPWMXBAR12_GPIO9_SEL == 1 | MW_EPWMXBAR12_GPIO10_SEL == 1| MW_EPWMXBAR12_GPIO11_SEL == 1| MW_EPWMXBAR12_GPIO12_SEL == 1 | MW_EPWMXBAR12_GPIO13_SEL == 1 | MW_EPWMXBAR12_GPIO14_SEL == 1 | MW_EPWMXBAR12_GPIO15_SEL == 1 | MW_EPWMXBAR12_GPIO16_SEL == 1 | MW_EPWMXBAR12_GPIO17_SEL == 1 | MW_EPWMXBAR12_GPIO18_SEL == 1 | MW_EPWMXBAR12_GPIO19_SEL == 1 | MW_EPWMXBAR12_GPIO20_SEL == 1 | MW_EPWMXBAR12_GPIO21_SEL == 1 | MW_EPWMXBAR12_GPIO22_SEL == 1 | MW_EPWMXBAR12_GPIO23_SEL == 1 | MW_EPWMXBAR12_GPIO24_SEL == 1 | MW_EPWMXBAR12_GPIO25_SEL == 1 | MW_EPWMXBAR12_GPIO26_SEL == 1 | MW_EPWMXBAR12_GPIO27_SEL == 1 | MW_EPWMXBAR12_GPIO28_SEL == 1 | MW_EPWMXBAR12_GPIO29_SEL == 1 | MW_EPWMXBAR12_GPIO30_SEL == 1 | MW_EPWMXBAR12_GPIO31_SEL == 1 | MW_EPWMXBAR12_GPIO32_SEL == 1 | MW_EPWMXBAR12_GPIO33_SEL == 1 | MW_EPWMXBAR12_GPIO34_SEL == 1 | MW_EPWMXBAR12_GPIO35_SEL == 1 | MW_EPWMXBAR12_GPIO36_SEL == 1 | MW_EPWMXBAR12_GPIO37_SEL == 1 | MW_EPWMXBAR12_GPIO38_SEL == 1 | MW_EPWMXBAR12_GPIO39_SEL == 1 | MW_EPWMXBAR12_GPIO40_SEL == 1 | MW_EPWMXBAR12_GPIO41_SEL == 1 | MW_EPWMXBAR12_GPIO42_SEL == 1 | MW_EPWMXBAR12_GPIO43_SEL == 1 | MW_EPWMXBAR12_GPIO44_SEL == 1 | | MW_EPWMXBAR12_GPIO45_SEL == 1 | MW_EPWMXBAR12_GPIO46_SEL == 1 | MW_EPWMXBAR12_GPIO47_SEL == 1| MW_EPWMXBAR12_GPIO48_SEL == 1 | MW_EPWMXBAR12_GPIO49_SEL == 1 | MW_EPWMXBAR12_GPIO50_SEL == 1 | MW_EPWMXBAR12_GPIO51_SEL == 1 | MW_EPWMXBAR12_GPIO52_SEL == 1 | MW_EPWMXBAR12_GPIO53_SEL == 1 | MW_EPWMXBAR12_GPIO54_SEL == 1 | MW_EPWMXBAR12_GPIO55_SEL == 1 | MW_EPWMXBAR12_GPIO56_SEL == 1 | MW_EPWMXBAR12_GPIO57_SEL == 1| MW_EPWMXBAR12_GPIO58_SEL == 1 | MW_EPWMXBAR12_GPIO59_SEL == 1 | MW_EPWMXBAR12_GPIO60_SEL == 1 | MW_EPWMXBAR12_GPIO61_SEL == 1 | MW_EPWMXBAR12_GPIO62_SEL == 1 | MW_EPWMXBAR12_GPIO63_SEL == 1 | MW_EPWMXBAR12_GPIO64_SEL == 1 | | MW_EPWMXBAR12_GPIO59_SEL == 1 | MW_EPWMXBAR12_GPIO60_SEL == 1 | MW_EPWMXBAR12_GPIO61_SEL == 1 | MW_EPWMXBAR12_GPIO62_SEL == 1 | MW_EPWMXBAR12_GPIO63_SEL == 1 | MW_EPWMXBAR12_GPIO64_SEL == 1 | MW_EPWMXBAR12_GPIO65_SEL == 1 | MW_EPWMXBAR12_GPIO66_SEL == 1 | MW_EPWMXBAR12_GPIO67_SEL == 1 | MW_EPWMXBAR12_GPIO68_SEL == 1 | MW_EPWMXBAR12_GPIO69_SEL == 1 | MW_EPWMXBAR12_GPIO70_SEL == 1 | MW_EPWMXBAR12_GPIO71_SEL == 1 | MW_EPWMXBAR12_GPIO72_SEL == 1 | MW_EPWMXBAR12_GPIO73_SEL == 1 | MW_EPWMXBAR12_GPIO74_SEL == 1 | MW_EPWMXBAR12_GPIO75_SEL == 1 | MW_EPWMXBAR12_GPIO76_SEL == 1 | MW_EPWMXBAR12_GPIO77_SEL == 1 | MW_EPWMXBAR12_GPIO78_SEL == 1 | | MW_EPWMXBAR12_GPIO80_SEL == 1 | MW_EPWMXBAR12_GPIO81_SEL == 1 | MW_EPWMXBAR12_GPIO82_SEL == 1 | MW_EPWMXBAR12_GPIO83_SEL == 1 | MW_EPWMXBAR12_GPIO84_SEL == 1 | MW_EPWMXBAR12_GPIO85_SEL == 1 | MW_EPWMXBAR12_GPIO86_SEL == 1 | MW_EPWMXBAR12_GPIO87_SEL == 1 | MW_EPWMXBAR12_GPIO88_SEL == 1 | MW_EPWMXBAR12_GPIO89_SEL == 1 | MW_EPWMXBAR12_GPIO90_SEL == 1 | MW_EPWMXBAR12_GPIO91_SEL == 1 | MW_EPWMXBAR12_GPIO92_SEL == 1 | MW_EPWMXBAR12_GPIO93_SEL == 1 | MW_EPWMXBAR12_GPIO94_SEL == 1 | MW_EPWMXBAR12_GPIO95_SEL == 1 | MW_EPWMXBAR12_GPIO96_SEL == 1 | MW_EPWMXBAR12_GPIO97_SEL == 1 | MW_EPWMXBAR12_GPIO98_SEL == 1 | MW_EPWMXBAR12_GPIO99_SEL == 1 | MW_EPWMXBAR12_GPIO100_SEL == 1 | MW_EPWMXBAR12_GPIO101_SEL == 1 | MW_EPWMXBAR12_GPIO102_SEL == 1 | MW_EPWMXBAR12_GPIO103_SEL == 1 | MW_EPWMXBAR12_GPIO104_SEL == 1 | MW_EPWMXBAR12_GPIO105_SEL == 1 | MW_EPWMXBAR12_GPIO106_SEL == 1 | MW_EPWMXBAR12_GPIO107_SEL == 1 | | MW_EPWMXBAR12_GPIO108_SEL == 1 | MW_EPWMXBAR12_GPIO109_SEL == 1| MW_EPWMXBAR12_GPIO110_SEL == 1 | MW_EPWMXBAR12_GPIO111_SEL == 1 | MW_EPWMXBAR12_GPIO112_SEL == 1 | MW_EPWMXBAR12_GPIO113_SEL == 1 | MW_EPWMXBAR12_GPIO114_SEL == 1 | MW_EPWMXBAR12_GPIO115_SEL == 1 | MW_EPWMXBAR12_GPIO116_SEL == 1 | MW_EPWMXBAR12_GPIO117_SEL == 1 | MW_EPWMXBAR12_GPIO118_SEL == 1 | MW_EPWMXBAR12_GPIO119_SEL == 1 | MW_EPWMXBAR12_GPIO120_SEL == 1 | MW_EPWMXBAR12_GPIO121_SEL == 1 | MW_EPWMXBAR12_GPIO122_SEL == 1 | MW_EPWMXBAR12_GPIO123_SEL == 1 | MW_EPWMXBAR12_GPIO124_SEL == 1 | MW_EPWMXBAR12_GPIO125_SEL == 1 | MW_EPWMXBAR12_GPIO126_SEL == 1 | MW_EPWMXBAR12_GPIO127_SEL == 1 | MW_EPWMXBAR12_GPIO128_SEL == 1 | MW_EPWMXBAR12_GPIO129_SEL == 1 | MW_EPWMXBAR12_GPIO130_SEL == 1 | MW_EPWMXBAR12_GPIO131_SEL == 1 | MW_EPWMXBAR12_GPIO132_SEL == 1 | MW_EPWMXBAR12_GPIO133_SEL == 1 | MW_EPWMXBAR12_GPIO134_SEL == 1 | MW_EPWMXBAR12_GPIO135_SEL == 1 | MW_EPWMXBAR12_GPIO136_SEL == 1 | MW_EPWMXBAR12_GPIO137_SEL == 1 | MW_EPWMXBAR12_GPIO139_SEL == 1 | MW_EPWMXBAR12_GPIO140_SEL == 1 | MW_EPWMXBAR12_GPIO141_SEL == 1 | MW_EPWMXBAR12_GPIO142_SEL == 1 | MW_EPWMXBAR12_GPIO143_SEL == 1 | MW_EPWMXBAR12_ICSSGPO0_PORT0_SEL == 1 | MW_EPWMXBAR12_ICSSGPO1_PORT0_SEL == 1 | MW_EPWMXBAR12_ICSSGPO2_PORT0_SEL == 1 | MW_EPWMXBAR12_ICSSGPO3_PORT0_SEL == 1 | MW_EPWMXBAR12_ICSSGPO4_PORT0_SEL == 1 | MW_EPWMXBAR12_ICSSGPO5_PORT0_SEL == 1 | MW_EPWMXBAR12_ICSSGPO6_PORT0_SEL == 1 | MW_EPWMXBAR12_ICSSGPO7_PORT0_SEL == 1 | MW_EPWMXBAR12_ICSSGPO8_PORT0_SEL == 1 | MW_EPWMXBAR12_ICSSGPO9_PORT0_SEL == 1 | MW_EPWMXBAR12_ICSSGPO10_PORT0_SEL == 1 | MW_EPWMXBAR12_ICSSGPO11_PORT0_SEL == 1 | MW_EPWMXBAR12_ICSSGPO12_PORT0_SEL == 1 | MW_EPWMXBAR12_ICSSGPO13_PORT0_SEL == 1 | MW_EPWMXBAR12_ICSSGPO14_PORT0_SEL == 1 | MW_EPWMXBAR12_ICSSGPO15_PORT0_SEL == 1 | MW_EPWMXBAR12_ICSSGPO0_PORT1_SEL == 1 | MW_EPWMXBAR12_ICSSGPO1_PORT1_SEL == 1 | MW_EPWMXBAR12_ICSSGPO2_PORT1_SEL == 1 | MW_EPWMXBAR12_ICSSGPO3_PORT1_SEL == 1 | MW_EPWMXBAR12_ICSSGPO4_PORT1_SEL == 1 | MW_EPWMXBAR12_ICSSGPO5_PORT1_SEL == 1 | MW_EPWMXBAR12_ICSSGPO6_PORT1_SEL == 1 | MW_EPWMXBAR12_ICSSGPO7_PORT1_SEL == 1 | MW_EPWMXBAR12_ICSSGPO8_PORT1_SEL == 1 | MW_EPWMXBAR12_ICSSGPO9_PORT1_SEL == 1 | MW_EPWMXBAR12_ICSSGPO10_PORT1_SEL == 1 | MW_EPWMXBAR12_ICSSGPO11_PORT1_SEL == 1 | MW_EPWMXBAR12_ICSSGPO12_PORT1_SEL == 1 | MW_EPWMXBAR12_ICSSGPO13_PORT1_SEL == 1 | MW_EPWMXBAR12_ICSSGPO14_PORT1_SEL == 1 | MW_EPWMXBAR12_ICSSGPO15_PORT1_SEL == 1)
    //     group4_epwmxbar[12] = EPWM_XBAR_12;
    // else
        group4_epwmxbar[12] = 0;
    group5_epwmxbar[12] = (MW_EPWMXBAR12_EPWM0_TRIPOUT_SEL << 0) | (MW_EPWMXBAR12_EPWM1_TRIPOUT_SEL << 1) | (MW_EPWMXBAR12_EPWM2_TRIPOUT_SEL << 2) | (MW_EPWMXBAR12_EPWM3_TRIPOUT_SEL << 3) | (MW_EPWMXBAR12_EPWM4_TRIPOUT_SEL << 4) | (MW_EPWMXBAR12_EPWM5_TRIPOUT_SEL << 5) | (MW_EPWMXBAR12_EPWM6_TRIPOUT_SEL << 6) | (MW_EPWMXBAR12_EPWM7_TRIPOUT_SEL << 7) | (MW_EPWMXBAR12_EPWM8_TRIPOUT_SEL << 8) | (MW_EPWMXBAR12_EPWM9_TRIPOUT_SEL << 9) | (MW_EPWMXBAR12_EPWM10_TRIPOUT_SEL << 10) | (MW_EPWMXBAR12_EPWM11_TRIPOUT_SEL << 11) | (MW_EPWMXBAR12_EPWM12_TRIPOUT_SEL << 12) | (MW_EPWMXBAR12_EPWM13_TRIPOUT_SEL << 13) | (MW_EPWMXBAR12_EPWM14_TRIPOUT_SEL << 14) | (MW_EPWMXBAR12_EPWM15_TRIPOUT_SEL << 15) | (MW_EPWMXBAR12_EPWM16_TRIPOUT_SEL << 16) | (MW_EPWMXBAR12_EPWM17_TRIPOUT_SEL << 17) | (MW_EPWMXBAR12_EPWM18_TRIPOUT_SEL << 18) | (MW_EPWMXBAR12_EPWM19_TRIPOUT_SEL << 19) | (MW_EPWMXBAR12_EPWM20_TRIPOUT_SEL << 20) | (MW_EPWMXBAR12_EPWM21_TRIPOUT_SEL << 21) | (MW_EPWMXBAR12_EPWM22_TRIPOUT_SEL << 22) | (MW_EPWMXBAR12_EPWM23_TRIPOUT_SEL << 23) | (MW_EPWMXBAR12_EPWM24_TRIPOUT_SEL << 24) | (MW_EPWMXBAR12_EPWM25_TRIPOUT_SEL << 25) | (MW_EPWMXBAR12_EPWM26_TRIPOUT_SEL << 26) | (MW_EPWMXBAR12_EPWM27_TRIPOUT_SEL << 27) | (MW_EPWMXBAR12_EPWM28_TRIPOUT_SEL << 28) | (MW_EPWMXBAR12_EPWM29_TRIPOUT_SEL << 29) | (MW_EPWMXBAR12_EPWM30_TRIPOUT_SEL << 30) | (MW_EPWMXBAR12_EPWM31_TRIPOUT_SEL << 31);
    group6_epwmxbar[12] = (MW_EPWMXBAR12_DEL0_TRIP_SEL << 0) | (MW_EPWMXBAR12_DEL1_TRIP_SEL << 1) | (MW_EPWMXBAR12_DEL2_TRIP_SEL << 2) | (MW_EPWMXBAR12_DEL3_TRIP_SEL << 3) | (MW_EPWMXBAR12_DEL4_TRIP_SEL << 4) | (MW_EPWMXBAR12_DEL5_TRIP_SEL << 5) | (MW_EPWMXBAR12_DEL6_TRIP_SEL << 6) | (MW_EPWMXBAR12_DEL7_TRIP_SEL << 7) | (MW_EPWMXBAR12_DEL8_TRIP_SEL << 8) | (MW_EPWMXBAR12_DEL9_TRIP_SEL << 9) | (MW_EPWMXBAR12_DEL10_TRIP_SEL << 10) | (MW_EPWMXBAR12_DEL11_TRIP_SEL << 11) | (MW_EPWMXBAR12_DEL12_TRIP_SEL << 12) | (MW_EPWMXBAR12_DEL13_TRIP_SEL << 13) | (MW_EPWMXBAR12_DEL14_TRIP_SEL << 14) | (MW_EPWMXBAR12_DEL15_TRIP_SEL << 15) | (MW_EPWMXBAR12_DEL16_TRIP_SEL << 16) | (MW_EPWMXBAR12_DEL17_TRIP_SEL << 17) | (MW_EPWMXBAR12_DEL18_TRIP_SEL << 18) | (MW_EPWMXBAR12_DEL19_TRIP_SEL << 19) | (MW_EPWMXBAR12_DEL20_TRIP_SEL << 20) | (MW_EPWMXBAR12_DEL21_TRIP_SEL << 21) | (MW_EPWMXBAR12_DEL22_TRIP_SEL << 22) | (MW_EPWMXBAR12_DEL23_TRIP_SEL << 23) | (MW_EPWMXBAR12_DEL24_TRIP_SEL << 24) | (MW_EPWMXBAR12_DEL25_TRIP_SEL << 25) | (MW_EPWMXBAR12_DEL26_TRIP_SEL << 26) | (MW_EPWMXBAR12_DEL27_TRIP_SEL << 27) | (MW_EPWMXBAR12_DEL28_TRIP_SEL << 28) | (MW_EPWMXBAR12_DEL29_TRIP_SEL << 29) | (MW_EPWMXBAR12_DEL30_TRIP_SEL << 30) | (MW_EPWMXBAR12_DEL31_TRIP_SEL << 31);
    group7_epwmxbar[12] = (MW_EPWMXBAR12_DEL0_ACTIVE_SEL << 0) | (MW_EPWMXBAR12_DEL1_ACTIVE_SEL << 1) | (MW_EPWMXBAR12_DEL2_ACTIVE_SEL << 2) | (MW_EPWMXBAR12_DEL3_ACTIVE_SEL << 3) | (MW_EPWMXBAR12_DEL4_ACTIVE_SEL << 4) | (MW_EPWMXBAR12_DEL5_ACTIVE_SEL << 5) | (MW_EPWMXBAR12_DEL6_ACTIVE_SEL << 6) | (MW_EPWMXBAR12_DEL7_ACTIVE_SEL << 7) | (MW_EPWMXBAR12_DEL8_ACTIVE_SEL << 8) | (MW_EPWMXBAR12_DEL9_ACTIVE_SEL << 9) | (MW_EPWMXBAR12_DEL10_ACTIVE_SEL << 10) | (MW_EPWMXBAR12_DEL11_ACTIVE_SEL << 11) | (MW_EPWMXBAR12_DEL12_ACTIVE_SEL << 12) | (MW_EPWMXBAR12_DEL13_ACTIVE_SEL << 13) | (MW_EPWMXBAR12_DEL14_ACTIVE_SEL << 14) | (MW_EPWMXBAR12_DEL15_ACTIVE_SEL << 15) | (MW_EPWMXBAR12_DEL16_ACTIVE_SEL << 16) | (MW_EPWMXBAR12_DEL17_ACTIVE_SEL << 17) | (MW_EPWMXBAR12_DEL18_ACTIVE_SEL << 18) | (MW_EPWMXBAR12_DEL19_ACTIVE_SEL << 19) | (MW_EPWMXBAR12_DEL20_ACTIVE_SEL << 20) | (MW_EPWMXBAR12_DEL21_ACTIVE_SEL << 21) | (MW_EPWMXBAR12_DEL22_ACTIVE_SEL << 22) | (MW_EPWMXBAR12_DEL23_ACTIVE_SEL << 23) | (MW_EPWMXBAR12_DEL24_ACTIVE_SEL << 24) | (MW_EPWMXBAR12_DEL25_ACTIVE_SEL << 25) | (MW_EPWMXBAR12_DEL26_ACTIVE_SEL << 26) | (MW_EPWMXBAR12_DEL27_ACTIVE_SEL << 27) | (MW_EPWMXBAR12_DEL28_ACTIVE_SEL << 28) | (MW_EPWMXBAR12_DEL29_ACTIVE_SEL << 29) | (MW_EPWMXBAR12_DEL30_ACTIVE_SEL << 30) | (MW_EPWMXBAR12_DEL31_ACTIVE_SEL << 31);
    group8_epwmxbar[12] = (MW_EPWMXBAR12_EQEP0_ERR_SEL << 0) | (MW_EPWMXBAR12_EQEP1_ERR_SEL << 1) | (MW_EPWMXBAR12_EQEP2_ERR_SEL << 2) | (MW_EPWMXBAR12_FSIRX0_RX_TRIG0_SEL << 3) | (MW_EPWMXBAR12_FSIRX0_RX_TRIG1_SEL << 4) | (MW_EPWMXBAR12_FSIRX0_RX_TRIG2_SEL << 5) | (MW_EPWMXBAR12_FSIRX0_RX_TRIG3_SEL << 6) | (MW_EPWMXBAR12_FSIRX1_RX_TRIG0_SEL << 7) | (MW_EPWMXBAR12_FSIRX1_RX_TRIG1_SEL << 8) | (MW_EPWMXBAR12_FSIRX1_RX_TRIG2_SEL << 9) | (MW_EPWMXBAR12_FSIRX1_RX_TRIG3_SEL << 10) | (MW_EPWMXBAR12_FSIRX2_RX_TRIG0_SEL << 11) | (MW_EPWMXBAR12_FSIRX2_RX_TRIG1_SEL << 12) | (MW_EPWMXBAR12_FSIRX2_RX_TRIG2_SEL << 13) | (MW_EPWMXBAR12_FSIRX2_RX_TRIG3_SEL << 14) | (MW_EPWMXBAR12_FSIRX3_RX_TRIG0_SEL << 15) | (MW_EPWMXBAR12_FSIRX3_RX_TRIG1_SEL << 16) | (MW_EPWMXBAR12_FSIRX3_RX_TRIG2_SEL << 17) | (MW_EPWMXBAR12_FSIRX3_RX_TRIG3_SEL << 18) | (MW_EPWMXBAR12_ECAP0_TRIPOUT_SEL << 19) | (MW_EPWMXBAR12_ECAP1_TRIPOUT_SEL << 20) | (MW_EPWMXBAR12_ECAP2_TRIPOUT_SEL << 21) | (MW_EPWMXBAR12_ECAP3_TRIPOUT_SEL << 22) | (MW_EPWMXBAR12_ECAP4_TRIPOUT_SEL << 23) | (MW_EPWMXBAR12_ECAP5_TRIPOUT_SEL << 24) | (MW_EPWMXBAR12_ECAP6_TRIPOUT_SEL << 25) | (MW_EPWMXBAR12_ECAP7_TRIPOUT_SEL << 26) | (MW_EPWMXBAR12_ECAP8_TRIPOUT_SEL << 27) | (MW_EPWMXBAR12_ECAP9_TRIPOUT_SEL << 28);
    group0_epwmxbar[13] = (MW_EPWMXBAR13_CMPSSA0_CTRIPL_SEL << 0) | (MW_EPWMXBAR13_CMPSSA0_CTRIPH_SEL << 1) | (MW_EPWMXBAR13_CMPSSA1_CTRIPL_SEL << 2) | (MW_EPWMXBAR13_CMPSSA1_CTRIPH_SEL << 3) | (MW_EPWMXBAR13_CMPSSA2_CTRIPL_SEL << 4) | (MW_EPWMXBAR13_CMPSSA2_CTRIPH_SEL << 5) | (MW_EPWMXBAR13_CMPSSA3_CTRIPL_SEL << 6) | (MW_EPWMXBAR13_CMPSSA3_CTRIPH_SEL << 7) | (MW_EPWMXBAR13_CMPSSA4_CTRIPL_SEL << 8) | (MW_EPWMXBAR13_CMPSSA4_CTRIPH_SEL << 9) | (MW_EPWMXBAR13_CMPSSA5_CTRIPL_SEL << 10) | (MW_EPWMXBAR13_CMPSSA5_CTRIPH_SEL << 11) | (MW_EPWMXBAR13_CMPSSA6_CTRIPL_SEL << 12) | (MW_EPWMXBAR13_CMPSSA6_CTRIPH_SEL << 13) | (MW_EPWMXBAR13_CMPSSA7_CTRIPL_SEL << 14) | (MW_EPWMXBAR13_CMPSSA7_CTRIPH_SEL << 15) | (MW_EPWMXBAR13_CMPSSA8_CTRIPL_SEL << 16) | (MW_EPWMXBAR13_CMPSSA8_CTRIPH_SEL << 17) | (MW_EPWMXBAR13_CMPSSA9_CTRIPL_SEL << 18) | (MW_EPWMXBAR13_CMPSSA9_CTRIPH_SEL << 19);
    group1_epwmxbar[13] = (MW_EPWMXBAR13_CMPSSB0_CTRIPL_SEL << 0) | (MW_EPWMXBAR13_CMPSSB0_CTRIPH_SEL << 1) | (MW_EPWMXBAR13_CMPSSB1_CTRIPL_SEL << 2) | (MW_EPWMXBAR13_CMPSSB1_CTRIPH_SEL << 3) | (MW_EPWMXBAR13_CMPSSB2_CTRIPL_SEL << 4) | (MW_EPWMXBAR13_CMPSSB2_CTRIPH_SEL << 5) | (MW_EPWMXBAR13_CMPSSB3_CTRIPL_SEL << 6) | (MW_EPWMXBAR13_CMPSSB3_CTRIPH_SEL << 7) | (MW_EPWMXBAR13_CMPSSB4_CTRIPL_SEL << 8) | (MW_EPWMXBAR13_CMPSSB4_CTRIPH_SEL << 9) | (MW_EPWMXBAR13_CMPSSB5_CTRIPL_SEL << 10) | (MW_EPWMXBAR13_CMPSSB5_CTRIPH_SEL << 11) | (MW_EPWMXBAR13_CMPSSB6_CTRIPL_SEL << 12) | (MW_EPWMXBAR13_CMPSSB6_CTRIPH_SEL << 13) | (MW_EPWMXBAR13_CMPSSB7_CTRIPL_SEL << 14) | (MW_EPWMXBAR13_CMPSSB7_CTRIPH_SEL << 15) | (MW_EPWMXBAR13_CMPSSB8_CTRIPL_SEL << 16) | (MW_EPWMXBAR13_CMPSSB8_CTRIPH_SEL << 17) | (MW_EPWMXBAR13_CMPSSB9_CTRIPL_SEL << 18) | (MW_EPWMXBAR13_CMPSSB9_CTRIPH_SEL << 19);
    group2_epwmxbar[13] = (MW_EPWMXBAR13_SD0_FILT0_CEVT1_SEL << 0) | (MW_EPWMXBAR13_SD0_FILT0_CEVT2_SEL << 1) | (MW_EPWMXBAR13_SD0_FILT0_CMPHZ_SEL << 2) | (MW_EPWMXBAR13_SD0_FILT1_CEVT1_SEL << 3) | (MW_EPWMXBAR13_SD0_FILT1_CEVT2_SEL << 4) | (MW_EPWMXBAR13_SD0_FILT1_CMPHZ_SEL << 5) | (MW_EPWMXBAR13_SD0_FILT2_CEVT1_SEL << 6) | (MW_EPWMXBAR13_SD0_FILT2_CEVT2_SEL << 7) | (MW_EPWMXBAR13_SD0_FILT2_CMPHZ_SEL << 8) | (MW_EPWMXBAR13_SD0_FILT3_CEVT1_SEL << 9) | (MW_EPWMXBAR13_SD0_FILT3_CEVT2_SEL << 10) | (MW_EPWMXBAR13_SD0_FILT3_CMPHZ_SEL << 11) | (MW_EPWMXBAR13_SD1_FILT0_CEVT1_SEL << 12) | (MW_EPWMXBAR13_SD1_FILT0_CEVT2_SEL << 13) | (MW_EPWMXBAR13_SD1_FILT0_CMPHZ_SEL << 14) | (MW_EPWMXBAR13_SD1_FILT1_CEVT1_SEL << 15) | (MW_EPWMXBAR13_SD1_FILT1_CEVT2_SEL << 16) | (MW_EPWMXBAR13_SD1_FILT1_CMPHZ_SEL << 17) | (MW_EPWMXBAR13_SD1_FILT2_CEVT1_SEL << 18) | (MW_EPWMXBAR13_SD1_FILT2_CEVT2_SEL << 19) | (MW_EPWMXBAR13_SD1_FILT2_CMPHZ_SEL << 20) | (MW_EPWMXBAR13_SD1_FILT3_CEVT1_SEL << 21) | (MW_EPWMXBAR13_SD1_FILT3_CEVT2_SEL << 22) | (MW_EPWMXBAR13_SD1_FILT3_CMPHZ_SEL << 23);
    group3_epwmxbar[13] = (MW_EPWMXBAR13_ADC0_EVT1_SEL << 0) | (MW_EPWMXBAR13_ADC0_EVT2_SEL << 1) | (MW_EPWMXBAR13_ADC0_EVT3_SEL << 2) | (MW_EPWMXBAR13_ADC0_EVT4_SEL << 3) | (MW_EPWMXBAR13_ADC1_EVT1_SEL << 4) | (MW_EPWMXBAR13_ADC1_EVT2_SEL << 5) | (MW_EPWMXBAR13_ADC1_EVT3_SEL << 6) | (MW_EPWMXBAR13_ADC1_EVT4_SEL << 7) | (MW_EPWMXBAR13_ADC2_EVT1_SEL << 8) | (MW_EPWMXBAR13_ADC2_EVT2_SEL << 9) | (MW_EPWMXBAR13_ADC2_EVT3_SEL << 10) | (MW_EPWMXBAR13_ADC2_EVT4_SEL << 11) | (MW_EPWMXBAR13_ADC3_EVT1_SEL << 12) | (MW_EPWMXBAR13_ADC3_EVT2_SEL << 13) | (MW_EPWMXBAR13_ADC3_EVT3_SEL << 14) | (MW_EPWMXBAR13_ADC3_EVT4_SEL << 15) | (MW_EPWMXBAR13_ADC4_EVT1_SEL << 16) | (MW_EPWMXBAR13_ADC4_EVT2_SEL << 17) | (MW_EPWMXBAR13_ADC4_EVT3_SEL << 18) | (MW_EPWMXBAR13_ADC4_EVT4_SEL << 19);
