TexasInstruments/am26x-hsp/src/am263px_init.c
    // if(MW_EPWMXBAR13_GPIO0_SEL == 1 | MW_EPWMXBAR13_GPIO1_SEL == 1 | MW_EPWMXBAR13_GPIO2_SEL == 1 | MW_EPWMXBAR13_GPIO3_SEL == 1 | MW_EPWMXBAR13_GPIO4_SEL == 1 | MW_EPWMXBAR13_GPIO5_SEL == 1 | MW_EPWMXBAR13_GPIO6_SEL == 1 | MW_EPWMXBAR13_GPIO7_SEL == 1| MW_EPWMXBAR13_GPIO8_SEL == 1 | MW_EPWMXBAR13_GPIO9_SEL == 1 | MW_EPWMXBAR13_GPIO10_SEL == 1| MW_EPWMXBAR13_GPIO11_SEL == 1| MW_EPWMXBAR13_GPIO12_SEL == 1 | MW_EPWMXBAR13_GPIO13_SEL == 1 | MW_EPWMXBAR13_GPIO14_SEL == 1 | MW_EPWMXBAR13_GPIO15_SEL == 1 | MW_EPWMXBAR13_GPIO16_SEL == 1 | MW_EPWMXBAR13_GPIO17_SEL == 1 | MW_EPWMXBAR13_GPIO18_SEL == 1 | MW_EPWMXBAR13_GPIO19_SEL == 1 | MW_EPWMXBAR13_GPIO20_SEL == 1 | MW_EPWMXBAR13_GPIO21_SEL == 1 | MW_EPWMXBAR13_GPIO22_SEL == 1 | MW_EPWMXBAR13_GPIO23_SEL == 1 | MW_EPWMXBAR13_GPIO24_SEL == 1 | MW_EPWMXBAR13_GPIO25_SEL == 1 | MW_EPWMXBAR13_GPIO26_SEL == 1 | MW_EPWMXBAR13_GPIO27_SEL == 1 | MW_EPWMXBAR13_GPIO28_SEL == 1 | MW_EPWMXBAR13_GPIO29_SEL == 1 | MW_EPWMXBAR13_GPIO30_SEL == 1 | MW_EPWMXBAR13_GPIO31_SEL == 1 | MW_EPWMXBAR13_GPIO32_SEL == 1 | MW_EPWMXBAR13_GPIO33_SEL == 1 | MW_EPWMXBAR13_GPIO34_SEL == 1 | MW_EPWMXBAR13_GPIO35_SEL == 1 | MW_EPWMXBAR13_GPIO36_SEL == 1 | MW_EPWMXBAR13_GPIO37_SEL == 1 | MW_EPWMXBAR13_GPIO38_SEL == 1 | MW_EPWMXBAR13_GPIO39_SEL == 1 | MW_EPWMXBAR13_GPIO40_SEL == 1 | MW_EPWMXBAR13_GPIO41_SEL == 1 | MW_EPWMXBAR13_GPIO42_SEL == 1 | MW_EPWMXBAR13_GPIO43_SEL == 1 | MW_EPWMXBAR13_GPIO44_SEL == 1 | | MW_EPWMXBAR13_GPIO45_SEL == 1 | MW_EPWMXBAR13_GPIO46_SEL == 1 | MW_EPWMXBAR13_GPIO47_SEL == 1| MW_EPWMXBAR13_GPIO48_SEL == 1 | MW_EPWMXBAR13_GPIO49_SEL == 1 | MW_EPWMXBAR13_GPIO50_SEL == 1 | MW_EPWMXBAR13_GPIO51_SEL == 1 | MW_EPWMXBAR13_GPIO52_SEL == 1 | MW_EPWMXBAR13_GPIO53_SEL == 1 | MW_EPWMXBAR13_GPIO54_SEL == 1 | MW_EPWMXBAR13_GPIO55_SEL == 1 | MW_EPWMXBAR13_GPIO56_SEL == 1 | MW_EPWMXBAR13_GPIO57_SEL == 1| MW_EPWMXBAR13_GPIO58_SEL == 1 | MW_EPWMXBAR13_GPIO59_SEL == 1 | MW_EPWMXBAR13_GPIO60_SEL == 1 | MW_EPWMXBAR13_GPIO61_SEL == 1 | MW_EPWMXBAR13_GPIO62_SEL == 1 | MW_EPWMXBAR13_GPIO63_SEL == 1 | MW_EPWMXBAR13_GPIO64_SEL == 1 | | MW_EPWMXBAR13_GPIO59_SEL == 1 | MW_EPWMXBAR13_GPIO60_SEL == 1 | MW_EPWMXBAR13_GPIO61_SEL == 1 | MW_EPWMXBAR13_GPIO62_SEL == 1 | MW_EPWMXBAR13_GPIO63_SEL == 1 | MW_EPWMXBAR13_GPIO64_SEL == 1 | MW_EPWMXBAR13_GPIO65_SEL == 1 | MW_EPWMXBAR13_GPIO66_SEL == 1 | MW_EPWMXBAR13_GPIO67_SEL == 1 | MW_EPWMXBAR13_GPIO68_SEL == 1 | MW_EPWMXBAR13_GPIO69_SEL == 1 | MW_EPWMXBAR13_GPIO70_SEL == 1 | MW_EPWMXBAR13_GPIO71_SEL == 1 | MW_EPWMXBAR13_GPIO72_SEL == 1 | MW_EPWMXBAR13_GPIO73_SEL == 1 | MW_EPWMXBAR13_GPIO74_SEL == 1 | MW_EPWMXBAR13_GPIO75_SEL == 1 | MW_EPWMXBAR13_GPIO76_SEL == 1 | MW_EPWMXBAR13_GPIO77_SEL == 1 | MW_EPWMXBAR13_GPIO78_SEL == 1 | | MW_EPWMXBAR13_GPIO80_SEL == 1 | MW_EPWMXBAR13_GPIO81_SEL == 1 | MW_EPWMXBAR13_GPIO82_SEL == 1 | MW_EPWMXBAR13_GPIO83_SEL == 1 | MW_EPWMXBAR13_GPIO84_SEL == 1 | MW_EPWMXBAR13_GPIO85_SEL == 1 | MW_EPWMXBAR13_GPIO86_SEL == 1 | MW_EPWMXBAR13_GPIO87_SEL == 1 | MW_EPWMXBAR13_GPIO88_SEL == 1 | MW_EPWMXBAR13_GPIO89_SEL == 1 | MW_EPWMXBAR13_GPIO90_SEL == 1 | MW_EPWMXBAR13_GPIO91_SEL == 1 | MW_EPWMXBAR13_GPIO92_SEL == 1 | MW_EPWMXBAR13_GPIO93_SEL == 1 | MW_EPWMXBAR13_GPIO94_SEL == 1 | MW_EPWMXBAR13_GPIO95_SEL == 1 | MW_EPWMXBAR13_GPIO96_SEL == 1 | MW_EPWMXBAR13_GPIO97_SEL == 1 | MW_EPWMXBAR13_GPIO98_SEL == 1 | MW_EPWMXBAR13_GPIO99_SEL == 1 | MW_EPWMXBAR13_GPIO100_SEL == 1 | MW_EPWMXBAR13_GPIO101_SEL == 1 | MW_EPWMXBAR13_GPIO102_SEL == 1 | MW_EPWMXBAR13_GPIO103_SEL == 1 | MW_EPWMXBAR13_GPIO104_SEL == 1 | MW_EPWMXBAR13_GPIO105_SEL == 1 | MW_EPWMXBAR13_GPIO106_SEL == 1 | MW_EPWMXBAR13_GPIO107_SEL == 1 | | MW_EPWMXBAR13_GPIO108_SEL == 1 | MW_EPWMXBAR13_GPIO109_SEL == 1| MW_EPWMXBAR13_GPIO110_SEL == 1 | MW_EPWMXBAR13_GPIO111_SEL == 1 | MW_EPWMXBAR13_GPIO112_SEL == 1 | MW_EPWMXBAR13_GPIO113_SEL == 1 | MW_EPWMXBAR13_GPIO114_SEL == 1 | MW_EPWMXBAR13_GPIO115_SEL == 1 | MW_EPWMXBAR13_GPIO116_SEL == 1 | MW_EPWMXBAR13_GPIO117_SEL == 1 | MW_EPWMXBAR13_GPIO118_SEL == 1 | MW_EPWMXBAR13_GPIO119_SEL == 1 | MW_EPWMXBAR13_GPIO120_SEL == 1 | MW_EPWMXBAR13_GPIO121_SEL == 1 | MW_EPWMXBAR13_GPIO122_SEL == 1 | MW_EPWMXBAR13_GPIO123_SEL == 1 | MW_EPWMXBAR13_GPIO124_SEL == 1 | MW_EPWMXBAR13_GPIO125_SEL == 1 | MW_EPWMXBAR13_GPIO126_SEL == 1 | MW_EPWMXBAR13_GPIO127_SEL == 1 | MW_EPWMXBAR13_GPIO128_SEL == 1 | MW_EPWMXBAR13_GPIO129_SEL == 1 | MW_EPWMXBAR13_GPIO130_SEL == 1 | MW_EPWMXBAR13_GPIO131_SEL == 1 | MW_EPWMXBAR13_GPIO132_SEL == 1 | MW_EPWMXBAR13_GPIO133_SEL == 1 | MW_EPWMXBAR13_GPIO134_SEL == 1 | MW_EPWMXBAR13_GPIO135_SEL == 1 | MW_EPWMXBAR13_GPIO136_SEL == 1 | MW_EPWMXBAR13_GPIO137_SEL == 1 | MW_EPWMXBAR13_GPIO139_SEL == 1 | MW_EPWMXBAR13_GPIO140_SEL == 1 | MW_EPWMXBAR13_GPIO141_SEL == 1 | MW_EPWMXBAR13_GPIO142_SEL == 1 | MW_EPWMXBAR13_GPIO143_SEL == 1 | MW_EPWMXBAR13_ICSSGPO0_PORT0_SEL == 1 | MW_EPWMXBAR13_ICSSGPO1_PORT0_SEL == 1 | MW_EPWMXBAR13_ICSSGPO2_PORT0_SEL == 1 | MW_EPWMXBAR13_ICSSGPO3_PORT0_SEL == 1 | MW_EPWMXBAR13_ICSSGPO4_PORT0_SEL == 1 | MW_EPWMXBAR13_ICSSGPO5_PORT0_SEL == 1 | MW_EPWMXBAR13_ICSSGPO6_PORT0_SEL == 1 | MW_EPWMXBAR13_ICSSGPO7_PORT0_SEL == 1 | MW_EPWMXBAR13_ICSSGPO8_PORT0_SEL == 1 | MW_EPWMXBAR13_ICSSGPO9_PORT0_SEL == 1 | MW_EPWMXBAR13_ICSSGPO10_PORT0_SEL == 1 | MW_EPWMXBAR13_ICSSGPO11_PORT0_SEL == 1 | MW_EPWMXBAR13_ICSSGPO12_PORT0_SEL == 1 | MW_EPWMXBAR13_ICSSGPO13_PORT0_SEL == 1 | MW_EPWMXBAR13_ICSSGPO14_PORT0_SEL == 1 | MW_EPWMXBAR13_ICSSGPO15_PORT0_SEL == 1 | MW_EPWMXBAR13_ICSSGPO0_PORT1_SEL == 1 | MW_EPWMXBAR13_ICSSGPO1_PORT1_SEL == 1 | MW_EPWMXBAR13_ICSSGPO2_PORT1_SEL == 1 | MW_EPWMXBAR13_ICSSGPO3_PORT1_SEL == 1 | MW_EPWMXBAR13_ICSSGPO4_PORT1_SEL == 1 | MW_EPWMXBAR13_ICSSGPO5_PORT1_SEL == 1 | MW_EPWMXBAR13_ICSSGPO6_PORT1_SEL == 1 | MW_EPWMXBAR13_ICSSGPO7_PORT1_SEL == 1 | MW_EPWMXBAR13_ICSSGPO8_PORT1_SEL == 1 | MW_EPWMXBAR13_ICSSGPO9_PORT1_SEL == 1 | MW_EPWMXBAR13_ICSSGPO10_PORT1_SEL == 1 | MW_EPWMXBAR13_ICSSGPO11_PORT1_SEL == 1 | MW_EPWMXBAR13_ICSSGPO12_PORT1_SEL == 1 | MW_EPWMXBAR13_ICSSGPO13_PORT1_SEL == 1 | MW_EPWMXBAR13_ICSSGPO14_PORT1_SEL == 1 | MW_EPWMXBAR13_ICSSGPO15_PORT1_SEL == 1)
    //     group4_epwmxbar[13] = EPWM_XBAR_13;
    // else
        group4_epwmxbar[13] = 0;
    group5_epwmxbar[13] = (MW_EPWMXBAR13_EPWM0_TRIPOUT_SEL << 0) | (MW_EPWMXBAR13_EPWM1_TRIPOUT_SEL << 1) | (MW_EPWMXBAR13_EPWM2_TRIPOUT_SEL << 2) | (MW_EPWMXBAR13_EPWM3_TRIPOUT_SEL << 3) | (MW_EPWMXBAR13_EPWM4_TRIPOUT_SEL << 4) | (MW_EPWMXBAR13_EPWM5_TRIPOUT_SEL << 5) | (MW_EPWMXBAR13_EPWM6_TRIPOUT_SEL << 6) | (MW_EPWMXBAR13_EPWM7_TRIPOUT_SEL << 7) | (MW_EPWMXBAR13_EPWM8_TRIPOUT_SEL << 8) | (MW_EPWMXBAR13_EPWM9_TRIPOUT_SEL << 9) | (MW_EPWMXBAR13_EPWM10_TRIPOUT_SEL << 10) | (MW_EPWMXBAR13_EPWM11_TRIPOUT_SEL << 11) | (MW_EPWMXBAR13_EPWM12_TRIPOUT_SEL << 12) | (MW_EPWMXBAR13_EPWM13_TRIPOUT_SEL << 13) | (MW_EPWMXBAR13_EPWM14_TRIPOUT_SEL << 14) | (MW_EPWMXBAR13_EPWM15_TRIPOUT_SEL << 15) | (MW_EPWMXBAR13_EPWM16_TRIPOUT_SEL << 16) | (MW_EPWMXBAR13_EPWM17_TRIPOUT_SEL << 17) | (MW_EPWMXBAR13_EPWM18_TRIPOUT_SEL << 18) | (MW_EPWMXBAR13_EPWM19_TRIPOUT_SEL << 19) | (MW_EPWMXBAR13_EPWM20_TRIPOUT_SEL << 20) | (MW_EPWMXBAR13_EPWM21_TRIPOUT_SEL << 21) | (MW_EPWMXBAR13_EPWM22_TRIPOUT_SEL << 22) | (MW_EPWMXBAR13_EPWM23_TRIPOUT_SEL << 23) | (MW_EPWMXBAR13_EPWM24_TRIPOUT_SEL << 24) | (MW_EPWMXBAR13_EPWM25_TRIPOUT_SEL << 25) | (MW_EPWMXBAR13_EPWM26_TRIPOUT_SEL << 26) | (MW_EPWMXBAR13_EPWM27_TRIPOUT_SEL << 27) | (MW_EPWMXBAR13_EPWM28_TRIPOUT_SEL << 28) | (MW_EPWMXBAR13_EPWM29_TRIPOUT_SEL << 29) | (MW_EPWMXBAR13_EPWM30_TRIPOUT_SEL << 30) | (MW_EPWMXBAR13_EPWM31_TRIPOUT_SEL << 31);
    group6_epwmxbar[13] = (MW_EPWMXBAR13_DEL0_TRIP_SEL << 0) | (MW_EPWMXBAR13_DEL1_TRIP_SEL << 1) | (MW_EPWMXBAR13_DEL2_TRIP_SEL << 2) | (MW_EPWMXBAR13_DEL3_TRIP_SEL << 3) | (MW_EPWMXBAR13_DEL4_TRIP_SEL << 4) | (MW_EPWMXBAR13_DEL5_TRIP_SEL << 5) | (MW_EPWMXBAR13_DEL6_TRIP_SEL << 6) | (MW_EPWMXBAR13_DEL7_TRIP_SEL << 7) | (MW_EPWMXBAR13_DEL8_TRIP_SEL << 8) | (MW_EPWMXBAR13_DEL9_TRIP_SEL << 9) | (MW_EPWMXBAR13_DEL10_TRIP_SEL << 10) | (MW_EPWMXBAR13_DEL11_TRIP_SEL << 11) | (MW_EPWMXBAR13_DEL12_TRIP_SEL << 12) | (MW_EPWMXBAR13_DEL13_TRIP_SEL << 13) | (MW_EPWMXBAR13_DEL14_TRIP_SEL << 14) | (MW_EPWMXBAR13_DEL15_TRIP_SEL << 15) | (MW_EPWMXBAR13_DEL16_TRIP_SEL << 16) | (MW_EPWMXBAR13_DEL17_TRIP_SEL << 17) | (MW_EPWMXBAR13_DEL18_TRIP_SEL << 18) | (MW_EPWMXBAR13_DEL19_TRIP_SEL << 19) | (MW_EPWMXBAR13_DEL20_TRIP_SEL << 20) | (MW_EPWMXBAR13_DEL21_TRIP_SEL << 21) | (MW_EPWMXBAR13_DEL22_TRIP_SEL << 22) | (MW_EPWMXBAR13_DEL23_TRIP_SEL << 23) | (MW_EPWMXBAR13_DEL24_TRIP_SEL << 24) | (MW_EPWMXBAR13_DEL25_TRIP_SEL << 25) | (MW_EPWMXBAR13_DEL26_TRIP_SEL << 26) | (MW_EPWMXBAR13_DEL27_TRIP_SEL << 27) | (MW_EPWMXBAR13_DEL28_TRIP_SEL << 28) | (MW_EPWMXBAR13_DEL29_TRIP_SEL << 29) | (MW_EPWMXBAR13_DEL30_TRIP_SEL << 30) | (MW_EPWMXBAR13_DEL31_TRIP_SEL << 31);
    group7_epwmxbar[13] = (MW_EPWMXBAR13_DEL0_ACTIVE_SEL << 0) | (MW_EPWMXBAR13_DEL1_ACTIVE_SEL << 1) | (MW_EPWMXBAR13_DEL2_ACTIVE_SEL << 2) | (MW_EPWMXBAR13_DEL3_ACTIVE_SEL << 3) | (MW_EPWMXBAR13_DEL4_ACTIVE_SEL << 4) | (MW_EPWMXBAR13_DEL5_ACTIVE_SEL << 5) | (MW_EPWMXBAR13_DEL6_ACTIVE_SEL << 6) | (MW_EPWMXBAR13_DEL7_ACTIVE_SEL << 7) | (MW_EPWMXBAR13_DEL8_ACTIVE_SEL << 8) | (MW_EPWMXBAR13_DEL9_ACTIVE_SEL << 9) | (MW_EPWMXBAR13_DEL10_ACTIVE_SEL << 10) | (MW_EPWMXBAR13_DEL11_ACTIVE_SEL << 11) | (MW_EPWMXBAR13_DEL12_ACTIVE_SEL << 12) | (MW_EPWMXBAR13_DEL13_ACTIVE_SEL << 13) | (MW_EPWMXBAR13_DEL14_ACTIVE_SEL << 14) | (MW_EPWMXBAR13_DEL15_ACTIVE_SEL << 15) | (MW_EPWMXBAR13_DEL16_ACTIVE_SEL << 16) | (MW_EPWMXBAR13_DEL17_ACTIVE_SEL << 17) | (MW_EPWMXBAR13_DEL18_ACTIVE_SEL << 18) | (MW_EPWMXBAR13_DEL19_ACTIVE_SEL << 19) | (MW_EPWMXBAR13_DEL20_ACTIVE_SEL << 20) | (MW_EPWMXBAR13_DEL21_ACTIVE_SEL << 21) | (MW_EPWMXBAR13_DEL22_ACTIVE_SEL << 22) | (MW_EPWMXBAR13_DEL23_ACTIVE_SEL << 23) | (MW_EPWMXBAR13_DEL24_ACTIVE_SEL << 24) | (MW_EPWMXBAR13_DEL25_ACTIVE_SEL << 25) | (MW_EPWMXBAR13_DEL26_ACTIVE_SEL << 26) | (MW_EPWMXBAR13_DEL27_ACTIVE_SEL << 27) | (MW_EPWMXBAR13_DEL28_ACTIVE_SEL << 28) | (MW_EPWMXBAR13_DEL29_ACTIVE_SEL << 29) | (MW_EPWMXBAR13_DEL30_ACTIVE_SEL << 30) | (MW_EPWMXBAR13_DEL31_ACTIVE_SEL << 31);
    group8_epwmxbar[13] = (MW_EPWMXBAR13_EQEP0_ERR_SEL << 0) | (MW_EPWMXBAR13_EQEP1_ERR_SEL << 1) | (MW_EPWMXBAR13_EQEP2_ERR_SEL << 2) | (MW_EPWMXBAR13_FSIRX0_RX_TRIG0_SEL << 3) | (MW_EPWMXBAR13_FSIRX0_RX_TRIG1_SEL << 4) | (MW_EPWMXBAR13_FSIRX0_RX_TRIG2_SEL << 5) | (MW_EPWMXBAR13_FSIRX0_RX_TRIG3_SEL << 6) | (MW_EPWMXBAR13_FSIRX1_RX_TRIG0_SEL << 7) | (MW_EPWMXBAR13_FSIRX1_RX_TRIG1_SEL << 8) | (MW_EPWMXBAR13_FSIRX1_RX_TRIG2_SEL << 9) | (MW_EPWMXBAR13_FSIRX1_RX_TRIG3_SEL << 10) | (MW_EPWMXBAR13_FSIRX2_RX_TRIG0_SEL << 11) | (MW_EPWMXBAR13_FSIRX2_RX_TRIG1_SEL << 12) | (MW_EPWMXBAR13_FSIRX2_RX_TRIG2_SEL << 13) | (MW_EPWMXBAR13_FSIRX2_RX_TRIG3_SEL << 14) | (MW_EPWMXBAR13_FSIRX3_RX_TRIG0_SEL << 15) | (MW_EPWMXBAR13_FSIRX3_RX_TRIG1_SEL << 16) | (MW_EPWMXBAR13_FSIRX3_RX_TRIG2_SEL << 17) | (MW_EPWMXBAR13_FSIRX3_RX_TRIG3_SEL << 18) | (MW_EPWMXBAR13_ECAP0_TRIPOUT_SEL << 19) | (MW_EPWMXBAR13_ECAP1_TRIPOUT_SEL << 20) | (MW_EPWMXBAR13_ECAP2_TRIPOUT_SEL << 21) | (MW_EPWMXBAR13_ECAP3_TRIPOUT_SEL << 22) | (MW_EPWMXBAR13_ECAP4_TRIPOUT_SEL << 23) | (MW_EPWMXBAR13_ECAP5_TRIPOUT_SEL << 24) | (MW_EPWMXBAR13_ECAP6_TRIPOUT_SEL << 25) | (MW_EPWMXBAR13_ECAP7_TRIPOUT_SEL << 26) | (MW_EPWMXBAR13_ECAP8_TRIPOUT_SEL << 27) | (MW_EPWMXBAR13_ECAP9_TRIPOUT_SEL << 28);
    group0_epwmxbar[14] = (MW_EPWMXBAR14_CMPSSA0_CTRIPL_SEL << 0) | (MW_EPWMXBAR14_CMPSSA0_CTRIPH_SEL << 1) | (MW_EPWMXBAR14_CMPSSA1_CTRIPL_SEL << 2) | (MW_EPWMXBAR14_CMPSSA1_CTRIPH_SEL << 3) | (MW_EPWMXBAR14_CMPSSA2_CTRIPL_SEL << 4) | (MW_EPWMXBAR14_CMPSSA2_CTRIPH_SEL << 5) | (MW_EPWMXBAR14_CMPSSA3_CTRIPL_SEL << 6) | (MW_EPWMXBAR14_CMPSSA3_CTRIPH_SEL << 7) | (MW_EPWMXBAR14_CMPSSA4_CTRIPL_SEL << 8) | (MW_EPWMXBAR14_CMPSSA4_CTRIPH_SEL << 9) | (MW_EPWMXBAR14_CMPSSA5_CTRIPL_SEL << 10) | (MW_EPWMXBAR14_CMPSSA5_CTRIPH_SEL << 11) | (MW_EPWMXBAR14_CMPSSA6_CTRIPL_SEL << 12) | (MW_EPWMXBAR14_CMPSSA6_CTRIPH_SEL << 13) | (MW_EPWMXBAR14_CMPSSA7_CTRIPL_SEL << 14) | (MW_EPWMXBAR14_CMPSSA7_CTRIPH_SEL << 15) | (MW_EPWMXBAR14_CMPSSA8_CTRIPL_SEL << 16) | (MW_EPWMXBAR14_CMPSSA8_CTRIPH_SEL << 17) | (MW_EPWMXBAR14_CMPSSA9_CTRIPL_SEL << 18) | (MW_EPWMXBAR14_CMPSSA9_CTRIPH_SEL << 19);
    group1_epwmxbar[14] = (MW_EPWMXBAR14_CMPSSB0_CTRIPL_SEL << 0) | (MW_EPWMXBAR14_CMPSSB0_CTRIPH_SEL << 1) | (MW_EPWMXBAR14_CMPSSB1_CTRIPL_SEL << 2) | (MW_EPWMXBAR14_CMPSSB1_CTRIPH_SEL << 3) | (MW_EPWMXBAR14_CMPSSB2_CTRIPL_SEL << 4) | (MW_EPWMXBAR14_CMPSSB2_CTRIPH_SEL << 5) | (MW_EPWMXBAR14_CMPSSB3_CTRIPL_SEL << 6) | (MW_EPWMXBAR14_CMPSSB3_CTRIPH_SEL << 7) | (MW_EPWMXBAR14_CMPSSB4_CTRIPL_SEL << 8) | (MW_EPWMXBAR14_CMPSSB4_CTRIPH_SEL << 9) | (MW_EPWMXBAR14_CMPSSB5_CTRIPL_SEL << 10) | (MW_EPWMXBAR14_CMPSSB5_CTRIPH_SEL << 11) | (MW_EPWMXBAR14_CMPSSB6_CTRIPL_SEL << 12) | (MW_EPWMXBAR14_CMPSSB6_CTRIPH_SEL << 13) | (MW_EPWMXBAR14_CMPSSB7_CTRIPL_SEL << 14) | (MW_EPWMXBAR14_CMPSSB7_CTRIPH_SEL << 15) | (MW_EPWMXBAR14_CMPSSB8_CTRIPL_SEL << 16) | (MW_EPWMXBAR14_CMPSSB8_CTRIPH_SEL << 17) | (MW_EPWMXBAR14_CMPSSB9_CTRIPL_SEL << 18) | (MW_EPWMXBAR14_CMPSSB9_CTRIPH_SEL << 19);
    group2_epwmxbar[14] = (MW_EPWMXBAR14_SD0_FILT0_CEVT1_SEL << 0) | (MW_EPWMXBAR14_SD0_FILT0_CEVT2_SEL << 1) | (MW_EPWMXBAR14_SD0_FILT0_CMPHZ_SEL << 2) | (MW_EPWMXBAR14_SD0_FILT1_CEVT1_SEL << 3) | (MW_EPWMXBAR14_SD0_FILT1_CEVT2_SEL << 4) | (MW_EPWMXBAR14_SD0_FILT1_CMPHZ_SEL << 5) | (MW_EPWMXBAR14_SD0_FILT2_CEVT1_SEL << 6) | (MW_EPWMXBAR14_SD0_FILT2_CEVT2_SEL << 7) | (MW_EPWMXBAR14_SD0_FILT2_CMPHZ_SEL << 8) | (MW_EPWMXBAR14_SD0_FILT3_CEVT1_SEL << 9) | (MW_EPWMXBAR14_SD0_FILT3_CEVT2_SEL << 10) | (MW_EPWMXBAR14_SD0_FILT3_CMPHZ_SEL << 11) | (MW_EPWMXBAR14_SD1_FILT0_CEVT1_SEL << 12) | (MW_EPWMXBAR14_SD1_FILT0_CEVT2_SEL << 13) | (MW_EPWMXBAR14_SD1_FILT0_CMPHZ_SEL << 14) | (MW_EPWMXBAR14_SD1_FILT1_CEVT1_SEL << 15) | (MW_EPWMXBAR14_SD1_FILT1_CEVT2_SEL << 16) | (MW_EPWMXBAR14_SD1_FILT1_CMPHZ_SEL << 17) | (MW_EPWMXBAR14_SD1_FILT2_CEVT1_SEL << 18) | (MW_EPWMXBAR14_SD1_FILT2_CEVT2_SEL << 19) | (MW_EPWMXBAR14_SD1_FILT2_CMPHZ_SEL << 20) | (MW_EPWMXBAR14_SD1_FILT3_CEVT1_SEL << 21) | (MW_EPWMXBAR14_SD1_FILT3_CEVT2_SEL << 22) | (MW_EPWMXBAR14_SD1_FILT3_CMPHZ_SEL << 23);
    group3_epwmxbar[14] = (MW_EPWMXBAR14_ADC0_EVT1_SEL << 0) | (MW_EPWMXBAR14_ADC0_EVT2_SEL << 1) | (MW_EPWMXBAR14_ADC0_EVT3_SEL << 2) | (MW_EPWMXBAR14_ADC0_EVT4_SEL << 3) | (MW_EPWMXBAR14_ADC1_EVT1_SEL << 4) | (MW_EPWMXBAR14_ADC1_EVT2_SEL << 5) | (MW_EPWMXBAR14_ADC1_EVT3_SEL << 6) | (MW_EPWMXBAR14_ADC1_EVT4_SEL << 7) | (MW_EPWMXBAR14_ADC2_EVT1_SEL << 8) | (MW_EPWMXBAR14_ADC2_EVT2_SEL << 9) | (MW_EPWMXBAR14_ADC2_EVT3_SEL << 10) | (MW_EPWMXBAR14_ADC2_EVT4_SEL << 11) | (MW_EPWMXBAR14_ADC3_EVT1_SEL << 12) | (MW_EPWMXBAR14_ADC3_EVT2_SEL << 13) | (MW_EPWMXBAR14_ADC3_EVT3_SEL << 14) | (MW_EPWMXBAR14_ADC3_EVT4_SEL << 15) | (MW_EPWMXBAR14_ADC4_EVT1_SEL << 16) | (MW_EPWMXBAR14_ADC4_EVT2_SEL << 17) | (MW_EPWMXBAR14_ADC4_EVT3_SEL << 18) | (MW_EPWMXBAR14_ADC4_EVT4_SEL << 19);
    // if(MW_EPWMXBAR14_GPIO0_SEL == 1 | MW_EPWMXBAR14_GPIO1_SEL == 1 | MW_EPWMXBAR14_GPIO2_SEL == 1 | MW_EPWMXBAR14_GPIO3_SEL == 1 | MW_EPWMXBAR14_GPIO4_SEL == 1 | MW_EPWMXBAR14_GPIO5_SEL == 1 | MW_EPWMXBAR14_GPIO6_SEL == 1 | MW_EPWMXBAR14_GPIO7_SEL == 1| MW_EPWMXBAR14_GPIO8_SEL == 1 | MW_EPWMXBAR14_GPIO9_SEL == 1 | MW_EPWMXBAR14_GPIO10_SEL == 1| MW_EPWMXBAR14_GPIO11_SEL == 1| MW_EPWMXBAR14_GPIO12_SEL == 1 | MW_EPWMXBAR14_GPIO13_SEL == 1 | MW_EPWMXBAR14_GPIO14_SEL == 1 | MW_EPWMXBAR14_GPIO15_SEL == 1 | MW_EPWMXBAR14_GPIO16_SEL == 1 | MW_EPWMXBAR14_GPIO17_SEL == 1 | MW_EPWMXBAR14_GPIO18_SEL == 1 | MW_EPWMXBAR14_GPIO19_SEL == 1 | MW_EPWMXBAR14_GPIO20_SEL == 1 | MW_EPWMXBAR14_GPIO21_SEL == 1 | MW_EPWMXBAR14_GPIO22_SEL == 1 | MW_EPWMXBAR14_GPIO23_SEL == 1 | MW_EPWMXBAR14_GPIO24_SEL == 1 | MW_EPWMXBAR14_GPIO25_SEL == 1 | MW_EPWMXBAR14_GPIO26_SEL == 1 | MW_EPWMXBAR14_GPIO27_SEL == 1 | MW_EPWMXBAR14_GPIO28_SEL == 1 | MW_EPWMXBAR14_GPIO29_SEL == 1 | MW_EPWMXBAR14_GPIO30_SEL == 1 | MW_EPWMXBAR14_GPIO31_SEL == 1 | MW_EPWMXBAR14_GPIO32_SEL == 1 | MW_EPWMXBAR14_GPIO33_SEL == 1 | MW_EPWMXBAR14_GPIO34_SEL == 1 | MW_EPWMXBAR14_GPIO35_SEL == 1 | MW_EPWMXBAR14_GPIO36_SEL == 1 | MW_EPWMXBAR14_GPIO37_SEL == 1 | MW_EPWMXBAR14_GPIO38_SEL == 1 | MW_EPWMXBAR14_GPIO39_SEL == 1 | MW_EPWMXBAR14_GPIO40_SEL == 1 | MW_EPWMXBAR14_GPIO41_SEL == 1 | MW_EPWMXBAR14_GPIO42_SEL == 1 | MW_EPWMXBAR14_GPIO43_SEL == 1 | MW_EPWMXBAR14_GPIO44_SEL == 1 | | MW_EPWMXBAR14_GPIO45_SEL == 1 | MW_EPWMXBAR14_GPIO46_SEL == 1 | MW_EPWMXBAR14_GPIO47_SEL == 1| MW_EPWMXBAR14_GPIO48_SEL == 1 | MW_EPWMXBAR14_GPIO49_SEL == 1 | MW_EPWMXBAR14_GPIO50_SEL == 1 | MW_EPWMXBAR14_GPIO51_SEL == 1 | MW_EPWMXBAR14_GPIO52_SEL == 1 | MW_EPWMXBAR14_GPIO53_SEL == 1 | MW_EPWMXBAR14_GPIO54_SEL == 1 | MW_EPWMXBAR14_GPIO55_SEL == 1 | MW_EPWMXBAR14_GPIO56_SEL == 1 | MW_EPWMXBAR14_GPIO57_SEL == 1| MW_EPWMXBAR14_GPIO58_SEL == 1 | MW_EPWMXBAR14_GPIO59_SEL == 1 | MW_EPWMXBAR14_GPIO60_SEL == 1 | MW_EPWMXBAR14_GPIO61_SEL == 1 | MW_EPWMXBAR14_GPIO62_SEL == 1 | MW_EPWMXBAR14_GPIO63_SEL == 1 | MW_EPWMXBAR14_GPIO64_SEL == 1 | | MW_EPWMXBAR14_GPIO59_SEL == 1 | MW_EPWMXBAR14_GPIO60_SEL == 1 | MW_EPWMXBAR14_GPIO61_SEL == 1 | MW_EPWMXBAR14_GPIO62_SEL == 1 | MW_EPWMXBAR14_GPIO63_SEL == 1 | MW_EPWMXBAR14_GPIO64_SEL == 1 | MW_EPWMXBAR14_GPIO65_SEL == 1 | MW_EPWMXBAR14_GPIO66_SEL == 1 | MW_EPWMXBAR14_GPIO67_SEL == 1 | MW_EPWMXBAR14_GPIO68_SEL == 1 | MW_EPWMXBAR14_GPIO69_SEL == 1 | MW_EPWMXBAR14_GPIO70_SEL == 1 | MW_EPWMXBAR14_GPIO71_SEL == 1 | MW_EPWMXBAR14_GPIO72_SEL == 1 | MW_EPWMXBAR14_GPIO73_SEL == 1 | MW_EPWMXBAR14_GPIO74_SEL == 1 | MW_EPWMXBAR14_GPIO75_SEL == 1 | MW_EPWMXBAR14_GPIO76_SEL == 1 | MW_EPWMXBAR14_GPIO77_SEL == 1 | MW_EPWMXBAR14_GPIO78_SEL == 1 | | MW_EPWMXBAR14_GPIO80_SEL == 1 | MW_EPWMXBAR14_GPIO81_SEL == 1 | MW_EPWMXBAR14_GPIO82_SEL == 1 | MW_EPWMXBAR14_GPIO83_SEL == 1 | MW_EPWMXBAR14_GPIO84_SEL == 1 | MW_EPWMXBAR14_GPIO85_SEL == 1 | MW_EPWMXBAR14_GPIO86_SEL == 1 | MW_EPWMXBAR14_GPIO87_SEL == 1 | MW_EPWMXBAR14_GPIO88_SEL == 1 | MW_EPWMXBAR14_GPIO89_SEL == 1 | MW_EPWMXBAR14_GPIO90_SEL == 1 | MW_EPWMXBAR14_GPIO91_SEL == 1 | MW_EPWMXBAR14_GPIO92_SEL == 1 | MW_EPWMXBAR14_GPIO93_SEL == 1 | MW_EPWMXBAR14_GPIO94_SEL == 1 | MW_EPWMXBAR14_GPIO95_SEL == 1 | MW_EPWMXBAR14_GPIO96_SEL == 1 | MW_EPWMXBAR14_GPIO97_SEL == 1 | MW_EPWMXBAR14_GPIO98_SEL == 1 | MW_EPWMXBAR14_GPIO99_SEL == 1 | MW_EPWMXBAR14_GPIO100_SEL == 1 | MW_EPWMXBAR14_GPIO101_SEL == 1 | MW_EPWMXBAR14_GPIO102_SEL == 1 | MW_EPWMXBAR14_GPIO103_SEL == 1 | MW_EPWMXBAR14_GPIO104_SEL == 1 | MW_EPWMXBAR14_GPIO105_SEL == 1 | MW_EPWMXBAR14_GPIO106_SEL == 1 | MW_EPWMXBAR14_GPIO107_SEL == 1 | | MW_EPWMXBAR14_GPIO108_SEL == 1 | MW_EPWMXBAR14_GPIO109_SEL == 1| MW_EPWMXBAR14_GPIO110_SEL == 1 | MW_EPWMXBAR14_GPIO111_SEL == 1 | MW_EPWMXBAR14_GPIO112_SEL == 1 | MW_EPWMXBAR14_GPIO113_SEL == 1 | MW_EPWMXBAR14_GPIO114_SEL == 1 | MW_EPWMXBAR14_GPIO115_SEL == 1 | MW_EPWMXBAR14_GPIO116_SEL == 1 | MW_EPWMXBAR14_GPIO117_SEL == 1 | MW_EPWMXBAR14_GPIO118_SEL == 1 | MW_EPWMXBAR14_GPIO119_SEL == 1 | MW_EPWMXBAR14_GPIO120_SEL == 1 | MW_EPWMXBAR14_GPIO121_SEL == 1 | MW_EPWMXBAR14_GPIO122_SEL == 1 | MW_EPWMXBAR14_GPIO123_SEL == 1 | MW_EPWMXBAR14_GPIO124_SEL == 1 | MW_EPWMXBAR14_GPIO125_SEL == 1 | MW_EPWMXBAR14_GPIO126_SEL == 1 | MW_EPWMXBAR14_GPIO127_SEL == 1 | MW_EPWMXBAR14_GPIO128_SEL == 1 | MW_EPWMXBAR14_GPIO129_SEL == 1 | MW_EPWMXBAR14_GPIO130_SEL == 1 | MW_EPWMXBAR14_GPIO131_SEL == 1 | MW_EPWMXBAR14_GPIO132_SEL == 1 | MW_EPWMXBAR14_GPIO133_SEL == 1 | MW_EPWMXBAR14_GPIO134_SEL == 1 | MW_EPWMXBAR14_GPIO135_SEL == 1 | MW_EPWMXBAR14_GPIO136_SEL == 1 | MW_EPWMXBAR14_GPIO137_SEL == 1 | MW_EPWMXBAR14_GPIO139_SEL == 1 | MW_EPWMXBAR14_GPIO140_SEL == 1 | MW_EPWMXBAR14_GPIO141_SEL == 1 | MW_EPWMXBAR14_GPIO142_SEL == 1 | MW_EPWMXBAR14_GPIO143_SEL == 1 | MW_EPWMXBAR14_ICSSGPO0_PORT0_SEL == 1 | MW_EPWMXBAR14_ICSSGPO1_PORT0_SEL == 1 | MW_EPWMXBAR14_ICSSGPO2_PORT0_SEL == 1 | MW_EPWMXBAR14_ICSSGPO3_PORT0_SEL == 1 | MW_EPWMXBAR14_ICSSGPO4_PORT0_SEL == 1 | MW_EPWMXBAR14_ICSSGPO5_PORT0_SEL == 1 | MW_EPWMXBAR14_ICSSGPO6_PORT0_SEL == 1 | MW_EPWMXBAR14_ICSSGPO7_PORT0_SEL == 1 | MW_EPWMXBAR14_ICSSGPO8_PORT0_SEL == 1 | MW_EPWMXBAR14_ICSSGPO9_PORT0_SEL == 1 | MW_EPWMXBAR14_ICSSGPO10_PORT0_SEL == 1 | MW_EPWMXBAR14_ICSSGPO11_PORT0_SEL == 1 | MW_EPWMXBAR14_ICSSGPO12_PORT0_SEL == 1 | MW_EPWMXBAR14_ICSSGPO13_PORT0_SEL == 1 | MW_EPWMXBAR14_ICSSGPO14_PORT0_SEL == 1 | MW_EPWMXBAR14_ICSSGPO15_PORT0_SEL == 1 | MW_EPWMXBAR14_ICSSGPO0_PORT1_SEL == 1 | MW_EPWMXBAR14_ICSSGPO1_PORT1_SEL == 1 | MW_EPWMXBAR14_ICSSGPO2_PORT1_SEL == 1 | MW_EPWMXBAR14_ICSSGPO3_PORT1_SEL == 1 | MW_EPWMXBAR14_ICSSGPO4_PORT1_SEL == 1 | MW_EPWMXBAR14_ICSSGPO5_PORT1_SEL == 1 | MW_EPWMXBAR14_ICSSGPO6_PORT1_SEL == 1 | MW_EPWMXBAR14_ICSSGPO7_PORT1_SEL == 1 | MW_EPWMXBAR14_ICSSGPO8_PORT1_SEL == 1 | MW_EPWMXBAR14_ICSSGPO9_PORT1_SEL == 1 | MW_EPWMXBAR14_ICSSGPO10_PORT1_SEL == 1 | MW_EPWMXBAR14_ICSSGPO11_PORT1_SEL == 1 | MW_EPWMXBAR14_ICSSGPO12_PORT1_SEL == 1 | MW_EPWMXBAR14_ICSSGPO13_PORT1_SEL == 1 | MW_EPWMXBAR14_ICSSGPO14_PORT1_SEL == 1 | MW_EPWMXBAR14_ICSSGPO15_PORT1_SEL == 1)
    //     group4_epwmxbar[14] = EPWM_XBAR_14;
    // else
        group4_epwmxbar[14] = 0;
    group5_epwmxbar[14] = (MW_EPWMXBAR14_EPWM0_TRIPOUT_SEL << 0) | (MW_EPWMXBAR14_EPWM1_TRIPOUT_SEL << 1) | (MW_EPWMXBAR14_EPWM2_TRIPOUT_SEL << 2) | (MW_EPWMXBAR14_EPWM3_TRIPOUT_SEL << 3) | (MW_EPWMXBAR14_EPWM4_TRIPOUT_SEL << 4) | (MW_EPWMXBAR14_EPWM5_TRIPOUT_SEL << 5) | (MW_EPWMXBAR14_EPWM6_TRIPOUT_SEL << 6) | (MW_EPWMXBAR14_EPWM7_TRIPOUT_SEL << 7) | (MW_EPWMXBAR14_EPWM8_TRIPOUT_SEL << 8) | (MW_EPWMXBAR14_EPWM9_TRIPOUT_SEL << 9) | (MW_EPWMXBAR14_EPWM10_TRIPOUT_SEL << 10) | (MW_EPWMXBAR14_EPWM11_TRIPOUT_SEL << 11) | (MW_EPWMXBAR14_EPWM12_TRIPOUT_SEL << 12) | (MW_EPWMXBAR14_EPWM13_TRIPOUT_SEL << 13) | (MW_EPWMXBAR14_EPWM14_TRIPOUT_SEL << 14) | (MW_EPWMXBAR14_EPWM15_TRIPOUT_SEL << 15) | (MW_EPWMXBAR14_EPWM16_TRIPOUT_SEL << 16) | (MW_EPWMXBAR14_EPWM17_TRIPOUT_SEL << 17) | (MW_EPWMXBAR14_EPWM18_TRIPOUT_SEL << 18) | (MW_EPWMXBAR14_EPWM19_TRIPOUT_SEL << 19) | (MW_EPWMXBAR14_EPWM20_TRIPOUT_SEL << 20) | (MW_EPWMXBAR14_EPWM21_TRIPOUT_SEL << 21) | (MW_EPWMXBAR14_EPWM22_TRIPOUT_SEL << 22) | (MW_EPWMXBAR14_EPWM23_TRIPOUT_SEL << 23) | (MW_EPWMXBAR14_EPWM24_TRIPOUT_SEL << 24) | (MW_EPWMXBAR14_EPWM25_TRIPOUT_SEL << 25) | (MW_EPWMXBAR14_EPWM26_TRIPOUT_SEL << 26) | (MW_EPWMXBAR14_EPWM27_TRIPOUT_SEL << 27) | (MW_EPWMXBAR14_EPWM28_TRIPOUT_SEL << 28) | (MW_EPWMXBAR14_EPWM29_TRIPOUT_SEL << 29) | (MW_EPWMXBAR14_EPWM30_TRIPOUT_SEL << 30) | (MW_EPWMXBAR14_EPWM31_TRIPOUT_SEL << 31);
    group6_epwmxbar[14] = (MW_EPWMXBAR14_DEL0_TRIP_SEL << 0) | (MW_EPWMXBAR14_DEL1_TRIP_SEL << 1) | (MW_EPWMXBAR14_DEL2_TRIP_SEL << 2) | (MW_EPWMXBAR14_DEL3_TRIP_SEL << 3) | (MW_EPWMXBAR14_DEL4_TRIP_SEL << 4) | (MW_EPWMXBAR14_DEL5_TRIP_SEL << 5) | (MW_EPWMXBAR14_DEL6_TRIP_SEL << 6) | (MW_EPWMXBAR14_DEL7_TRIP_SEL << 7) | (MW_EPWMXBAR14_DEL8_TRIP_SEL << 8) | (MW_EPWMXBAR14_DEL9_TRIP_SEL << 9) | (MW_EPWMXBAR14_DEL10_TRIP_SEL << 10) | (MW_EPWMXBAR14_DEL11_TRIP_SEL << 11) | (MW_EPWMXBAR14_DEL12_TRIP_SEL << 12) | (MW_EPWMXBAR14_DEL13_TRIP_SEL << 13) | (MW_EPWMXBAR14_DEL14_TRIP_SEL << 14) | (MW_EPWMXBAR14_DEL15_TRIP_SEL << 15) | (MW_EPWMXBAR14_DEL16_TRIP_SEL << 16) | (MW_EPWMXBAR14_DEL17_TRIP_SEL << 17) | (MW_EPWMXBAR14_DEL18_TRIP_SEL << 18) | (MW_EPWMXBAR14_DEL19_TRIP_SEL << 19) | (MW_EPWMXBAR14_DEL20_TRIP_SEL << 20) | (MW_EPWMXBAR14_DEL21_TRIP_SEL << 21) | (MW_EPWMXBAR14_DEL22_TRIP_SEL << 22) | (MW_EPWMXBAR14_DEL23_TRIP_SEL << 23) | (MW_EPWMXBAR14_DEL24_TRIP_SEL << 24) | (MW_EPWMXBAR14_DEL25_TRIP_SEL << 25) | (MW_EPWMXBAR14_DEL26_TRIP_SEL << 26) | (MW_EPWMXBAR14_DEL27_TRIP_SEL << 27) | (MW_EPWMXBAR14_DEL28_TRIP_SEL << 28) | (MW_EPWMXBAR14_DEL29_TRIP_SEL << 29) | (MW_EPWMXBAR14_DEL30_TRIP_SEL << 30) | (MW_EPWMXBAR14_DEL31_TRIP_SEL << 31);
