TexasInstruments/am26x-hsp/src/am263px_init.c
    group7_epwmxbar[14] = (MW_EPWMXBAR14_DEL0_ACTIVE_SEL << 0) | (MW_EPWMXBAR14_DEL1_ACTIVE_SEL << 1) | (MW_EPWMXBAR14_DEL2_ACTIVE_SEL << 2) | (MW_EPWMXBAR14_DEL3_ACTIVE_SEL << 3) | (MW_EPWMXBAR14_DEL4_ACTIVE_SEL << 4) | (MW_EPWMXBAR14_DEL5_ACTIVE_SEL << 5) | (MW_EPWMXBAR14_DEL6_ACTIVE_SEL << 6) | (MW_EPWMXBAR14_DEL7_ACTIVE_SEL << 7) | (MW_EPWMXBAR14_DEL8_ACTIVE_SEL << 8) | (MW_EPWMXBAR14_DEL9_ACTIVE_SEL << 9) | (MW_EPWMXBAR14_DEL10_ACTIVE_SEL << 10) | (MW_EPWMXBAR14_DEL11_ACTIVE_SEL << 11) | (MW_EPWMXBAR14_DEL12_ACTIVE_SEL << 12) | (MW_EPWMXBAR14_DEL13_ACTIVE_SEL << 13) | (MW_EPWMXBAR14_DEL14_ACTIVE_SEL << 14) | (MW_EPWMXBAR14_DEL15_ACTIVE_SEL << 15) | (MW_EPWMXBAR14_DEL16_ACTIVE_SEL << 16) | (MW_EPWMXBAR14_DEL17_ACTIVE_SEL << 17) | (MW_EPWMXBAR14_DEL18_ACTIVE_SEL << 18) | (MW_EPWMXBAR14_DEL19_ACTIVE_SEL << 19) | (MW_EPWMXBAR14_DEL20_ACTIVE_SEL << 20) | (MW_EPWMXBAR14_DEL21_ACTIVE_SEL << 21) | (MW_EPWMXBAR14_DEL22_ACTIVE_SEL << 22) | (MW_EPWMXBAR14_DEL23_ACTIVE_SEL << 23) | (MW_EPWMXBAR14_DEL24_ACTIVE_SEL << 24) | (MW_EPWMXBAR14_DEL25_ACTIVE_SEL << 25) | (MW_EPWMXBAR14_DEL26_ACTIVE_SEL << 26) | (MW_EPWMXBAR14_DEL27_ACTIVE_SEL << 27) | (MW_EPWMXBAR14_DEL28_ACTIVE_SEL << 28) | (MW_EPWMXBAR14_DEL29_ACTIVE_SEL << 29) | (MW_EPWMXBAR14_DEL30_ACTIVE_SEL << 30) | (MW_EPWMXBAR14_DEL31_ACTIVE_SEL << 31);
    group8_epwmxbar[14] = (MW_EPWMXBAR14_EQEP0_ERR_SEL << 0) | (MW_EPWMXBAR14_EQEP1_ERR_SEL << 1) | (MW_EPWMXBAR14_EQEP2_ERR_SEL << 2) | (MW_EPWMXBAR14_FSIRX0_RX_TRIG0_SEL << 3) | (MW_EPWMXBAR14_FSIRX0_RX_TRIG1_SEL << 4) | (MW_EPWMXBAR14_FSIRX0_RX_TRIG2_SEL << 5) | (MW_EPWMXBAR14_FSIRX0_RX_TRIG3_SEL << 6) | (MW_EPWMXBAR14_FSIRX1_RX_TRIG0_SEL << 7) | (MW_EPWMXBAR14_FSIRX1_RX_TRIG1_SEL << 8) | (MW_EPWMXBAR14_FSIRX1_RX_TRIG2_SEL << 9) | (MW_EPWMXBAR14_FSIRX1_RX_TRIG3_SEL << 10) | (MW_EPWMXBAR14_FSIRX2_RX_TRIG0_SEL << 11) | (MW_EPWMXBAR14_FSIRX2_RX_TRIG1_SEL << 12) | (MW_EPWMXBAR14_FSIRX2_RX_TRIG2_SEL << 13) | (MW_EPWMXBAR14_FSIRX2_RX_TRIG3_SEL << 14) | (MW_EPWMXBAR14_FSIRX3_RX_TRIG0_SEL << 15) | (MW_EPWMXBAR14_FSIRX3_RX_TRIG1_SEL << 16) | (MW_EPWMXBAR14_FSIRX3_RX_TRIG2_SEL << 17) | (MW_EPWMXBAR14_FSIRX3_RX_TRIG3_SEL << 18) | (MW_EPWMXBAR14_ECAP0_TRIPOUT_SEL << 19) | (MW_EPWMXBAR14_ECAP1_TRIPOUT_SEL << 20) | (MW_EPWMXBAR14_ECAP2_TRIPOUT_SEL << 21) | (MW_EPWMXBAR14_ECAP3_TRIPOUT_SEL << 22) | (MW_EPWMXBAR14_ECAP4_TRIPOUT_SEL << 23) | (MW_EPWMXBAR14_ECAP5_TRIPOUT_SEL << 24) | (MW_EPWMXBAR14_ECAP6_TRIPOUT_SEL << 25) | (MW_EPWMXBAR14_ECAP7_TRIPOUT_SEL << 26) | (MW_EPWMXBAR14_ECAP8_TRIPOUT_SEL << 27) | (MW_EPWMXBAR14_ECAP9_TRIPOUT_SEL << 28);
    group0_epwmxbar[15] = (MW_EPWMXBAR15_CMPSSA0_CTRIPL_SEL << 0) | (MW_EPWMXBAR15_CMPSSA0_CTRIPH_SEL << 1) | (MW_EPWMXBAR15_CMPSSA1_CTRIPL_SEL << 2) | (MW_EPWMXBAR15_CMPSSA1_CTRIPH_SEL << 3) | (MW_EPWMXBAR15_CMPSSA2_CTRIPL_SEL << 4) | (MW_EPWMXBAR15_CMPSSA2_CTRIPH_SEL << 5) | (MW_EPWMXBAR15_CMPSSA3_CTRIPL_SEL << 6) | (MW_EPWMXBAR15_CMPSSA3_CTRIPH_SEL << 7) | (MW_EPWMXBAR15_CMPSSA4_CTRIPL_SEL << 8) | (MW_EPWMXBAR15_CMPSSA4_CTRIPH_SEL << 9) | (MW_EPWMXBAR15_CMPSSA5_CTRIPL_SEL << 10) | (MW_EPWMXBAR15_CMPSSA5_CTRIPH_SEL << 11) | (MW_EPWMXBAR15_CMPSSA6_CTRIPL_SEL << 12) | (MW_EPWMXBAR15_CMPSSA6_CTRIPH_SEL << 13) | (MW_EPWMXBAR15_CMPSSA7_CTRIPL_SEL << 14) | (MW_EPWMXBAR15_CMPSSA7_CTRIPH_SEL << 15) | (MW_EPWMXBAR15_CMPSSA8_CTRIPL_SEL << 16) | (MW_EPWMXBAR15_CMPSSA8_CTRIPH_SEL << 17) | (MW_EPWMXBAR15_CMPSSA9_CTRIPL_SEL << 18) | (MW_EPWMXBAR15_CMPSSA9_CTRIPH_SEL << 19);
    group1_epwmxbar[15] = (MW_EPWMXBAR15_CMPSSB0_CTRIPL_SEL << 0) | (MW_EPWMXBAR15_CMPSSB0_CTRIPH_SEL << 1) | (MW_EPWMXBAR15_CMPSSB1_CTRIPL_SEL << 2) | (MW_EPWMXBAR15_CMPSSB1_CTRIPH_SEL << 3) | (MW_EPWMXBAR15_CMPSSB2_CTRIPL_SEL << 4) | (MW_EPWMXBAR15_CMPSSB2_CTRIPH_SEL << 5) | (MW_EPWMXBAR15_CMPSSB3_CTRIPL_SEL << 6) | (MW_EPWMXBAR15_CMPSSB3_CTRIPH_SEL << 7) | (MW_EPWMXBAR15_CMPSSB4_CTRIPL_SEL << 8) | (MW_EPWMXBAR15_CMPSSB4_CTRIPH_SEL << 9) | (MW_EPWMXBAR15_CMPSSB5_CTRIPL_SEL << 10) | (MW_EPWMXBAR15_CMPSSB5_CTRIPH_SEL << 11) | (MW_EPWMXBAR15_CMPSSB6_CTRIPL_SEL << 12) | (MW_EPWMXBAR15_CMPSSB6_CTRIPH_SEL << 13) | (MW_EPWMXBAR15_CMPSSB7_CTRIPL_SEL << 14) | (MW_EPWMXBAR15_CMPSSB7_CTRIPH_SEL << 15) | (MW_EPWMXBAR15_CMPSSB8_CTRIPL_SEL << 16) | (MW_EPWMXBAR15_CMPSSB8_CTRIPH_SEL << 17) | (MW_EPWMXBAR15_CMPSSB9_CTRIPL_SEL << 18) | (MW_EPWMXBAR15_CMPSSB9_CTRIPH_SEL << 19);
    group2_epwmxbar[15] = (MW_EPWMXBAR15_SD0_FILT0_CEVT1_SEL << 0) | (MW_EPWMXBAR15_SD0_FILT0_CEVT2_SEL << 1) | (MW_EPWMXBAR15_SD0_FILT0_CMPHZ_SEL << 2) | (MW_EPWMXBAR15_SD0_FILT1_CEVT1_SEL << 3) | (MW_EPWMXBAR15_SD0_FILT1_CEVT2_SEL << 4) | (MW_EPWMXBAR15_SD0_FILT1_CMPHZ_SEL << 5) | (MW_EPWMXBAR15_SD0_FILT2_CEVT1_SEL << 6) | (MW_EPWMXBAR15_SD0_FILT2_CEVT2_SEL << 7) | (MW_EPWMXBAR15_SD0_FILT2_CMPHZ_SEL << 8) | (MW_EPWMXBAR15_SD0_FILT3_CEVT1_SEL << 9) | (MW_EPWMXBAR15_SD0_FILT3_CEVT2_SEL << 10) | (MW_EPWMXBAR15_SD0_FILT3_CMPHZ_SEL << 11) | (MW_EPWMXBAR15_SD1_FILT0_CEVT1_SEL << 12) | (MW_EPWMXBAR15_SD1_FILT0_CEVT2_SEL << 13) | (MW_EPWMXBAR15_SD1_FILT0_CMPHZ_SEL << 14) | (MW_EPWMXBAR15_SD1_FILT1_CEVT1_SEL << 15) | (MW_EPWMXBAR15_SD1_FILT1_CEVT2_SEL << 16) | (MW_EPWMXBAR15_SD1_FILT1_CMPHZ_SEL << 17) | (MW_EPWMXBAR15_SD1_FILT2_CEVT1_SEL << 18) | (MW_EPWMXBAR15_SD1_FILT2_CEVT2_SEL << 19) | (MW_EPWMXBAR15_SD1_FILT2_CMPHZ_SEL << 20) | (MW_EPWMXBAR15_SD1_FILT3_CEVT1_SEL << 21) | (MW_EPWMXBAR15_SD1_FILT3_CEVT2_SEL << 22) | (MW_EPWMXBAR15_SD1_FILT3_CMPHZ_SEL << 23);
    group3_epwmxbar[15] = (MW_EPWMXBAR15_ADC0_EVT1_SEL << 0) | (MW_EPWMXBAR15_ADC0_EVT2_SEL << 1) | (MW_EPWMXBAR15_ADC0_EVT3_SEL << 2) | (MW_EPWMXBAR15_ADC0_EVT4_SEL << 3) | (MW_EPWMXBAR15_ADC1_EVT1_SEL << 4) | (MW_EPWMXBAR15_ADC1_EVT2_SEL << 5) | (MW_EPWMXBAR15_ADC1_EVT3_SEL << 6) | (MW_EPWMXBAR15_ADC1_EVT4_SEL << 7) | (MW_EPWMXBAR15_ADC2_EVT1_SEL << 8) | (MW_EPWMXBAR15_ADC2_EVT2_SEL << 9) | (MW_EPWMXBAR15_ADC2_EVT3_SEL << 10) | (MW_EPWMXBAR15_ADC2_EVT4_SEL << 11) | (MW_EPWMXBAR15_ADC3_EVT1_SEL << 12) | (MW_EPWMXBAR15_ADC3_EVT2_SEL << 13) | (MW_EPWMXBAR15_ADC3_EVT3_SEL << 14) | (MW_EPWMXBAR15_ADC3_EVT4_SEL << 15) | (MW_EPWMXBAR15_ADC4_EVT1_SEL << 16) | (MW_EPWMXBAR15_ADC4_EVT2_SEL << 17) | (MW_EPWMXBAR15_ADC4_EVT3_SEL << 18) | (MW_EPWMXBAR15_ADC4_EVT4_SEL << 19);
    // if(MW_EPWMXBAR15_GPIO0_SEL == 1 | MW_EPWMXBAR15_GPIO1_SEL == 1 | MW_EPWMXBAR15_GPIO2_SEL == 1 | MW_EPWMXBAR15_GPIO3_SEL == 1 | MW_EPWMXBAR15_GPIO4_SEL == 1 | MW_EPWMXBAR15_GPIO5_SEL == 1 | MW_EPWMXBAR15_GPIO6_SEL == 1 | MW_EPWMXBAR15_GPIO7_SEL == 1| MW_EPWMXBAR15_GPIO8_SEL == 1 | MW_EPWMXBAR15_GPIO9_SEL == 1 | MW_EPWMXBAR15_GPIO10_SEL == 1| MW_EPWMXBAR15_GPIO11_SEL == 1| MW_EPWMXBAR15_GPIO12_SEL == 1 | MW_EPWMXBAR15_GPIO13_SEL == 1 | MW_EPWMXBAR15_GPIO14_SEL == 1 | MW_EPWMXBAR15_GPIO15_SEL == 1 | MW_EPWMXBAR15_GPIO16_SEL == 1 | MW_EPWMXBAR15_GPIO17_SEL == 1 | MW_EPWMXBAR15_GPIO18_SEL == 1 | MW_EPWMXBAR15_GPIO19_SEL == 1 | MW_EPWMXBAR15_GPIO20_SEL == 1 | MW_EPWMXBAR15_GPIO21_SEL == 1 | MW_EPWMXBAR15_GPIO22_SEL == 1 | MW_EPWMXBAR15_GPIO23_SEL == 1 | MW_EPWMXBAR15_GPIO24_SEL == 1 | MW_EPWMXBAR15_GPIO25_SEL == 1 | MW_EPWMXBAR15_GPIO26_SEL == 1 | MW_EPWMXBAR15_GPIO27_SEL == 1 | MW_EPWMXBAR15_GPIO28_SEL == 1 | MW_EPWMXBAR15_GPIO29_SEL == 1 | MW_EPWMXBAR15_GPIO30_SEL == 1 | MW_EPWMXBAR15_GPIO31_SEL == 1 | MW_EPWMXBAR15_GPIO32_SEL == 1 | MW_EPWMXBAR15_GPIO33_SEL == 1 | MW_EPWMXBAR15_GPIO34_SEL == 1 | MW_EPWMXBAR15_GPIO35_SEL == 1 | MW_EPWMXBAR15_GPIO36_SEL == 1 | MW_EPWMXBAR15_GPIO37_SEL == 1 | MW_EPWMXBAR15_GPIO38_SEL == 1 | MW_EPWMXBAR15_GPIO39_SEL == 1 | MW_EPWMXBAR15_GPIO40_SEL == 1 | MW_EPWMXBAR15_GPIO41_SEL == 1 | MW_EPWMXBAR15_GPIO42_SEL == 1 | MW_EPWMXBAR15_GPIO43_SEL == 1 | MW_EPWMXBAR15_GPIO44_SEL == 1 | | MW_EPWMXBAR15_GPIO45_SEL == 1 | MW_EPWMXBAR15_GPIO46_SEL == 1 | MW_EPWMXBAR15_GPIO47_SEL == 1| MW_EPWMXBAR15_GPIO48_SEL == 1 | MW_EPWMXBAR15_GPIO49_SEL == 1 | MW_EPWMXBAR15_GPIO50_SEL == 1 | MW_EPWMXBAR15_GPIO51_SEL == 1 | MW_EPWMXBAR15_GPIO52_SEL == 1 | MW_EPWMXBAR15_GPIO53_SEL == 1 | MW_EPWMXBAR15_GPIO54_SEL == 1 | MW_EPWMXBAR15_GPIO55_SEL == 1 | MW_EPWMXBAR15_GPIO56_SEL == 1 | MW_EPWMXBAR15_GPIO57_SEL == 1| MW_EPWMXBAR15_GPIO58_SEL == 1 | MW_EPWMXBAR15_GPIO59_SEL == 1 | MW_EPWMXBAR15_GPIO60_SEL == 1 | MW_EPWMXBAR15_GPIO61_SEL == 1 | MW_EPWMXBAR15_GPIO62_SEL == 1 | MW_EPWMXBAR15_GPIO63_SEL == 1 | MW_EPWMXBAR15_GPIO64_SEL == 1 | | MW_EPWMXBAR15_GPIO59_SEL == 1 | MW_EPWMXBAR15_GPIO60_SEL == 1 | MW_EPWMXBAR15_GPIO61_SEL == 1 | MW_EPWMXBAR15_GPIO62_SEL == 1 | MW_EPWMXBAR15_GPIO63_SEL == 1 | MW_EPWMXBAR15_GPIO64_SEL == 1 | MW_EPWMXBAR15_GPIO65_SEL == 1 | MW_EPWMXBAR15_GPIO66_SEL == 1 | MW_EPWMXBAR15_GPIO67_SEL == 1 | MW_EPWMXBAR15_GPIO68_SEL == 1 | MW_EPWMXBAR15_GPIO69_SEL == 1 | MW_EPWMXBAR15_GPIO70_SEL == 1 | MW_EPWMXBAR15_GPIO71_SEL == 1 | MW_EPWMXBAR15_GPIO72_SEL == 1 | MW_EPWMXBAR15_GPIO73_SEL == 1 | MW_EPWMXBAR15_GPIO74_SEL == 1 | MW_EPWMXBAR15_GPIO75_SEL == 1 | MW_EPWMXBAR15_GPIO76_SEL == 1 | MW_EPWMXBAR15_GPIO77_SEL == 1 | MW_EPWMXBAR15_GPIO78_SEL == 1 | | MW_EPWMXBAR15_GPIO80_SEL == 1 | MW_EPWMXBAR15_GPIO81_SEL == 1 | MW_EPWMXBAR15_GPIO82_SEL == 1 | MW_EPWMXBAR15_GPIO83_SEL == 1 | MW_EPWMXBAR15_GPIO84_SEL == 1 | MW_EPWMXBAR15_GPIO85_SEL == 1 | MW_EPWMXBAR15_GPIO86_SEL == 1 | MW_EPWMXBAR15_GPIO87_SEL == 1 | MW_EPWMXBAR15_GPIO88_SEL == 1 | MW_EPWMXBAR15_GPIO89_SEL == 1 | MW_EPWMXBAR15_GPIO90_SEL == 1 | MW_EPWMXBAR15_GPIO91_SEL == 1 | MW_EPWMXBAR15_GPIO92_SEL == 1 | MW_EPWMXBAR15_GPIO93_SEL == 1 | MW_EPWMXBAR15_GPIO94_SEL == 1 | MW_EPWMXBAR15_GPIO95_SEL == 1 | MW_EPWMXBAR15_GPIO96_SEL == 1 | MW_EPWMXBAR15_GPIO97_SEL == 1 | MW_EPWMXBAR15_GPIO98_SEL == 1 | MW_EPWMXBAR15_GPIO99_SEL == 1 | MW_EPWMXBAR15_GPIO100_SEL == 1 | MW_EPWMXBAR15_GPIO101_SEL == 1 | MW_EPWMXBAR15_GPIO102_SEL == 1 | MW_EPWMXBAR15_GPIO103_SEL == 1 | MW_EPWMXBAR15_GPIO104_SEL == 1 | MW_EPWMXBAR15_GPIO105_SEL == 1 | MW_EPWMXBAR15_GPIO106_SEL == 1 | MW_EPWMXBAR15_GPIO107_SEL == 1 | | MW_EPWMXBAR15_GPIO108_SEL == 1 | MW_EPWMXBAR15_GPIO109_SEL == 1| MW_EPWMXBAR15_GPIO110_SEL == 1 | MW_EPWMXBAR15_GPIO111_SEL == 1 | MW_EPWMXBAR15_GPIO112_SEL == 1 | MW_EPWMXBAR15_GPIO113_SEL == 1 | MW_EPWMXBAR15_GPIO114_SEL == 1 | MW_EPWMXBAR15_GPIO115_SEL == 1 | MW_EPWMXBAR15_GPIO116_SEL == 1 | MW_EPWMXBAR15_GPIO117_SEL == 1 | MW_EPWMXBAR15_GPIO118_SEL == 1 | MW_EPWMXBAR15_GPIO119_SEL == 1 | MW_EPWMXBAR15_GPIO120_SEL == 1 | MW_EPWMXBAR15_GPIO121_SEL == 1 | MW_EPWMXBAR15_GPIO122_SEL == 1 | MW_EPWMXBAR15_GPIO123_SEL == 1 | MW_EPWMXBAR15_GPIO124_SEL == 1 | MW_EPWMXBAR15_GPIO125_SEL == 1 | MW_EPWMXBAR15_GPIO126_SEL == 1 | MW_EPWMXBAR15_GPIO127_SEL == 1 | MW_EPWMXBAR15_GPIO128_SEL == 1 | MW_EPWMXBAR15_GPIO129_SEL == 1 | MW_EPWMXBAR15_GPIO130_SEL == 1 | MW_EPWMXBAR15_GPIO131_SEL == 1 | MW_EPWMXBAR15_GPIO132_SEL == 1 | MW_EPWMXBAR15_GPIO133_SEL == 1 | MW_EPWMXBAR15_GPIO134_SEL == 1 | MW_EPWMXBAR15_GPIO135_SEL == 1 | MW_EPWMXBAR15_GPIO136_SEL == 1 | MW_EPWMXBAR15_GPIO137_SEL == 1 | MW_EPWMXBAR15_GPIO139_SEL == 1 | MW_EPWMXBAR15_GPIO140_SEL == 1 | MW_EPWMXBAR15_GPIO141_SEL == 1 | MW_EPWMXBAR15_GPIO142_SEL == 1 | MW_EPWMXBAR15_GPIO143_SEL == 1 | MW_EPWMXBAR15_ICSSGPO0_PORT0_SEL == 1 | MW_EPWMXBAR15_ICSSGPO1_PORT0_SEL == 1 | MW_EPWMXBAR15_ICSSGPO2_PORT0_SEL == 1 | MW_EPWMXBAR15_ICSSGPO3_PORT0_SEL == 1 | MW_EPWMXBAR15_ICSSGPO4_PORT0_SEL == 1 | MW_EPWMXBAR15_ICSSGPO5_PORT0_SEL == 1 | MW_EPWMXBAR15_ICSSGPO6_PORT0_SEL == 1 | MW_EPWMXBAR15_ICSSGPO7_PORT0_SEL == 1 | MW_EPWMXBAR15_ICSSGPO8_PORT0_SEL == 1 | MW_EPWMXBAR15_ICSSGPO9_PORT0_SEL == 1 | MW_EPWMXBAR15_ICSSGPO10_PORT0_SEL == 1 | MW_EPWMXBAR15_ICSSGPO11_PORT0_SEL == 1 | MW_EPWMXBAR15_ICSSGPO12_PORT0_SEL == 1 | MW_EPWMXBAR15_ICSSGPO13_PORT0_SEL == 1 | MW_EPWMXBAR15_ICSSGPO14_PORT0_SEL == 1 | MW_EPWMXBAR15_ICSSGPO15_PORT0_SEL == 1 | MW_EPWMXBAR15_ICSSGPO0_PORT1_SEL == 1 | MW_EPWMXBAR15_ICSSGPO1_PORT1_SEL == 1 | MW_EPWMXBAR15_ICSSGPO2_PORT1_SEL == 1 | MW_EPWMXBAR15_ICSSGPO3_PORT1_SEL == 1 | MW_EPWMXBAR15_ICSSGPO4_PORT1_SEL == 1 | MW_EPWMXBAR15_ICSSGPO5_PORT1_SEL == 1 | MW_EPWMXBAR15_ICSSGPO6_PORT1_SEL == 1 | MW_EPWMXBAR15_ICSSGPO7_PORT1_SEL == 1 | MW_EPWMXBAR15_ICSSGPO8_PORT1_SEL == 1 | MW_EPWMXBAR15_ICSSGPO9_PORT1_SEL == 1 | MW_EPWMXBAR15_ICSSGPO10_PORT1_SEL == 1 | MW_EPWMXBAR15_ICSSGPO11_PORT1_SEL == 1 | MW_EPWMXBAR15_ICSSGPO12_PORT1_SEL == 1 | MW_EPWMXBAR15_ICSSGPO13_PORT1_SEL == 1 | MW_EPWMXBAR15_ICSSGPO14_PORT1_SEL == 1 | MW_EPWMXBAR15_ICSSGPO15_PORT1_SEL == 1)
    //     group4_epwmxbar[15] = EPWM_XBAR_15;
    // else
        group4_epwmxbar[15] = 0;
    group5_epwmxbar[15] = (MW_EPWMXBAR15_EPWM0_TRIPOUT_SEL << 0) | (MW_EPWMXBAR15_EPWM1_TRIPOUT_SEL << 1) | (MW_EPWMXBAR15_EPWM2_TRIPOUT_SEL << 2) | (MW_EPWMXBAR15_EPWM3_TRIPOUT_SEL << 3) | (MW_EPWMXBAR15_EPWM4_TRIPOUT_SEL << 4) | (MW_EPWMXBAR15_EPWM5_TRIPOUT_SEL << 5) | (MW_EPWMXBAR15_EPWM6_TRIPOUT_SEL << 6) | (MW_EPWMXBAR15_EPWM7_TRIPOUT_SEL << 7) | (MW_EPWMXBAR15_EPWM8_TRIPOUT_SEL << 8) | (MW_EPWMXBAR15_EPWM9_TRIPOUT_SEL << 9) | (MW_EPWMXBAR15_EPWM10_TRIPOUT_SEL << 10) | (MW_EPWMXBAR15_EPWM11_TRIPOUT_SEL << 11) | (MW_EPWMXBAR15_EPWM12_TRIPOUT_SEL << 12) | (MW_EPWMXBAR15_EPWM13_TRIPOUT_SEL << 13) | (MW_EPWMXBAR15_EPWM14_TRIPOUT_SEL << 14) | (MW_EPWMXBAR15_EPWM15_TRIPOUT_SEL << 15) | (MW_EPWMXBAR15_EPWM16_TRIPOUT_SEL << 16) | (MW_EPWMXBAR15_EPWM17_TRIPOUT_SEL << 17) | (MW_EPWMXBAR15_EPWM18_TRIPOUT_SEL << 18) | (MW_EPWMXBAR15_EPWM19_TRIPOUT_SEL << 19) | (MW_EPWMXBAR15_EPWM20_TRIPOUT_SEL << 20) | (MW_EPWMXBAR15_EPWM21_TRIPOUT_SEL << 21) | (MW_EPWMXBAR15_EPWM22_TRIPOUT_SEL << 22) | (MW_EPWMXBAR15_EPWM23_TRIPOUT_SEL << 23) | (MW_EPWMXBAR15_EPWM24_TRIPOUT_SEL << 24) | (MW_EPWMXBAR15_EPWM25_TRIPOUT_SEL << 25) | (MW_EPWMXBAR15_EPWM26_TRIPOUT_SEL << 26) | (MW_EPWMXBAR15_EPWM27_TRIPOUT_SEL << 27) | (MW_EPWMXBAR15_EPWM28_TRIPOUT_SEL << 28) | (MW_EPWMXBAR15_EPWM29_TRIPOUT_SEL << 29) | (MW_EPWMXBAR15_EPWM30_TRIPOUT_SEL << 30) | (MW_EPWMXBAR15_EPWM31_TRIPOUT_SEL << 31);
    group6_epwmxbar[15] = (MW_EPWMXBAR15_DEL0_TRIP_SEL << 0) | (MW_EPWMXBAR15_DEL1_TRIP_SEL << 1) | (MW_EPWMXBAR15_DEL2_TRIP_SEL << 2) | (MW_EPWMXBAR15_DEL3_TRIP_SEL << 3) | (MW_EPWMXBAR15_DEL4_TRIP_SEL << 4) | (MW_EPWMXBAR15_DEL5_TRIP_SEL << 5) | (MW_EPWMXBAR15_DEL6_TRIP_SEL << 6) | (MW_EPWMXBAR15_DEL7_TRIP_SEL << 7) | (MW_EPWMXBAR15_DEL8_TRIP_SEL << 8) | (MW_EPWMXBAR15_DEL9_TRIP_SEL << 9) | (MW_EPWMXBAR15_DEL10_TRIP_SEL << 10) | (MW_EPWMXBAR15_DEL11_TRIP_SEL << 11) | (MW_EPWMXBAR15_DEL12_TRIP_SEL << 12) | (MW_EPWMXBAR15_DEL13_TRIP_SEL << 13) | (MW_EPWMXBAR15_DEL14_TRIP_SEL << 14) | (MW_EPWMXBAR15_DEL15_TRIP_SEL << 15) | (MW_EPWMXBAR15_DEL16_TRIP_SEL << 16) | (MW_EPWMXBAR15_DEL17_TRIP_SEL << 17) | (MW_EPWMXBAR15_DEL18_TRIP_SEL << 18) | (MW_EPWMXBAR15_DEL19_TRIP_SEL << 19) | (MW_EPWMXBAR15_DEL20_TRIP_SEL << 20) | (MW_EPWMXBAR15_DEL21_TRIP_SEL << 21) | (MW_EPWMXBAR15_DEL22_TRIP_SEL << 22) | (MW_EPWMXBAR15_DEL23_TRIP_SEL << 23) | (MW_EPWMXBAR15_DEL24_TRIP_SEL << 24) | (MW_EPWMXBAR15_DEL25_TRIP_SEL << 25) | (MW_EPWMXBAR15_DEL26_TRIP_SEL << 26) | (MW_EPWMXBAR15_DEL27_TRIP_SEL << 27) | (MW_EPWMXBAR15_DEL28_TRIP_SEL << 28) | (MW_EPWMXBAR15_DEL29_TRIP_SEL << 29) | (MW_EPWMXBAR15_DEL30_TRIP_SEL << 30) | (MW_EPWMXBAR15_DEL31_TRIP_SEL << 31);
    group7_epwmxbar[15] = (MW_EPWMXBAR15_DEL0_ACTIVE_SEL << 0) | (MW_EPWMXBAR15_DEL1_ACTIVE_SEL << 1) | (MW_EPWMXBAR15_DEL2_ACTIVE_SEL << 2) | (MW_EPWMXBAR15_DEL3_ACTIVE_SEL << 3) | (MW_EPWMXBAR15_DEL4_ACTIVE_SEL << 4) | (MW_EPWMXBAR15_DEL5_ACTIVE_SEL << 5) | (MW_EPWMXBAR15_DEL6_ACTIVE_SEL << 6) | (MW_EPWMXBAR15_DEL7_ACTIVE_SEL << 7) | (MW_EPWMXBAR15_DEL8_ACTIVE_SEL << 8) | (MW_EPWMXBAR15_DEL9_ACTIVE_SEL << 9) | (MW_EPWMXBAR15_DEL10_ACTIVE_SEL << 10) | (MW_EPWMXBAR15_DEL11_ACTIVE_SEL << 11) | (MW_EPWMXBAR15_DEL12_ACTIVE_SEL << 12) | (MW_EPWMXBAR15_DEL13_ACTIVE_SEL << 13) | (MW_EPWMXBAR15_DEL14_ACTIVE_SEL << 14) | (MW_EPWMXBAR15_DEL15_ACTIVE_SEL << 15) | (MW_EPWMXBAR15_DEL16_ACTIVE_SEL << 16) | (MW_EPWMXBAR15_DEL17_ACTIVE_SEL << 17) | (MW_EPWMXBAR15_DEL18_ACTIVE_SEL << 18) | (MW_EPWMXBAR15_DEL19_ACTIVE_SEL << 19) | (MW_EPWMXBAR15_DEL20_ACTIVE_SEL << 20) | (MW_EPWMXBAR15_DEL21_ACTIVE_SEL << 21) | (MW_EPWMXBAR15_DEL22_ACTIVE_SEL << 22) | (MW_EPWMXBAR15_DEL23_ACTIVE_SEL << 23) | (MW_EPWMXBAR15_DEL24_ACTIVE_SEL << 24) | (MW_EPWMXBAR15_DEL25_ACTIVE_SEL << 25) | (MW_EPWMXBAR15_DEL26_ACTIVE_SEL << 26) | (MW_EPWMXBAR15_DEL27_ACTIVE_SEL << 27) | (MW_EPWMXBAR15_DEL28_ACTIVE_SEL << 28) | (MW_EPWMXBAR15_DEL29_ACTIVE_SEL << 29) | (MW_EPWMXBAR15_DEL30_ACTIVE_SEL << 30) | (MW_EPWMXBAR15_DEL31_ACTIVE_SEL << 31);
    group8_epwmxbar[15] = (MW_EPWMXBAR15_EQEP0_ERR_SEL << 0) | (MW_EPWMXBAR15_EQEP1_ERR_SEL << 1) | (MW_EPWMXBAR15_EQEP2_ERR_SEL << 2) | (MW_EPWMXBAR15_FSIRX0_RX_TRIG0_SEL << 3) | (MW_EPWMXBAR15_FSIRX0_RX_TRIG1_SEL << 4) | (MW_EPWMXBAR15_FSIRX0_RX_TRIG2_SEL << 5) | (MW_EPWMXBAR15_FSIRX0_RX_TRIG3_SEL << 6) | (MW_EPWMXBAR15_FSIRX1_RX_TRIG0_SEL << 7) | (MW_EPWMXBAR15_FSIRX1_RX_TRIG1_SEL << 8) | (MW_EPWMXBAR15_FSIRX1_RX_TRIG2_SEL << 9) | (MW_EPWMXBAR15_FSIRX1_RX_TRIG3_SEL << 10) | (MW_EPWMXBAR15_FSIRX2_RX_TRIG0_SEL << 11) | (MW_EPWMXBAR15_FSIRX2_RX_TRIG1_SEL << 12) | (MW_EPWMXBAR15_FSIRX2_RX_TRIG2_SEL << 13) | (MW_EPWMXBAR15_FSIRX2_RX_TRIG3_SEL << 14) | (MW_EPWMXBAR15_FSIRX3_RX_TRIG0_SEL << 15) | (MW_EPWMXBAR15_FSIRX3_RX_TRIG1_SEL << 16) | (MW_EPWMXBAR15_FSIRX3_RX_TRIG2_SEL << 17) | (MW_EPWMXBAR15_FSIRX3_RX_TRIG3_SEL << 18) | (MW_EPWMXBAR15_ECAP0_TRIPOUT_SEL << 19) | (MW_EPWMXBAR15_ECAP1_TRIPOUT_SEL << 20) | (MW_EPWMXBAR15_ECAP2_TRIPOUT_SEL << 21) | (MW_EPWMXBAR15_ECAP3_TRIPOUT_SEL << 22) | (MW_EPWMXBAR15_ECAP4_TRIPOUT_SEL << 23) | (MW_EPWMXBAR15_ECAP5_TRIPOUT_SEL << 24) | (MW_EPWMXBAR15_ECAP6_TRIPOUT_SEL << 25) | (MW_EPWMXBAR15_ECAP7_TRIPOUT_SEL << 26) | (MW_EPWMXBAR15_ECAP8_TRIPOUT_SEL << 27) | (MW_EPWMXBAR15_ECAP9_TRIPOUT_SEL << 28);
    group0_epwmxbar[16] = (MW_EPWMXBAR16_CMPSSA0_CTRIPL_SEL << 0) | (MW_EPWMXBAR16_CMPSSA0_CTRIPH_SEL << 1) | (MW_EPWMXBAR16_CMPSSA1_CTRIPL_SEL << 2) | (MW_EPWMXBAR16_CMPSSA1_CTRIPH_SEL << 3) | (MW_EPWMXBAR16_CMPSSA2_CTRIPL_SEL << 4) | (MW_EPWMXBAR16_CMPSSA2_CTRIPH_SEL << 5) | (MW_EPWMXBAR16_CMPSSA3_CTRIPL_SEL << 6) | (MW_EPWMXBAR16_CMPSSA3_CTRIPH_SEL << 7) | (MW_EPWMXBAR16_CMPSSA4_CTRIPL_SEL << 8) | (MW_EPWMXBAR16_CMPSSA4_CTRIPH_SEL << 9) | (MW_EPWMXBAR16_CMPSSA5_CTRIPL_SEL << 10) | (MW_EPWMXBAR16_CMPSSA5_CTRIPH_SEL << 11) | (MW_EPWMXBAR16_CMPSSA6_CTRIPL_SEL << 12) | (MW_EPWMXBAR16_CMPSSA6_CTRIPH_SEL << 13) | (MW_EPWMXBAR16_CMPSSA7_CTRIPL_SEL << 14) | (MW_EPWMXBAR16_CMPSSA7_CTRIPH_SEL << 15) | (MW_EPWMXBAR16_CMPSSA8_CTRIPL_SEL << 16) | (MW_EPWMXBAR16_CMPSSA8_CTRIPH_SEL << 17) | (MW_EPWMXBAR16_CMPSSA9_CTRIPL_SEL << 18) | (MW_EPWMXBAR16_CMPSSA9_CTRIPH_SEL << 19);
    group1_epwmxbar[16] = (MW_EPWMXBAR16_CMPSSB0_CTRIPL_SEL << 0) | (MW_EPWMXBAR16_CMPSSB0_CTRIPH_SEL << 1) | (MW_EPWMXBAR16_CMPSSB1_CTRIPL_SEL << 2) | (MW_EPWMXBAR16_CMPSSB1_CTRIPH_SEL << 3) | (MW_EPWMXBAR16_CMPSSB2_CTRIPL_SEL << 4) | (MW_EPWMXBAR16_CMPSSB2_CTRIPH_SEL << 5) | (MW_EPWMXBAR16_CMPSSB3_CTRIPL_SEL << 6) | (MW_EPWMXBAR16_CMPSSB3_CTRIPH_SEL << 7) | (MW_EPWMXBAR16_CMPSSB4_CTRIPL_SEL << 8) | (MW_EPWMXBAR16_CMPSSB4_CTRIPH_SEL << 9) | (MW_EPWMXBAR16_CMPSSB5_CTRIPL_SEL << 10) | (MW_EPWMXBAR16_CMPSSB5_CTRIPH_SEL << 11) | (MW_EPWMXBAR16_CMPSSB6_CTRIPL_SEL << 12) | (MW_EPWMXBAR16_CMPSSB6_CTRIPH_SEL << 13) | (MW_EPWMXBAR16_CMPSSB7_CTRIPL_SEL << 14) | (MW_EPWMXBAR16_CMPSSB7_CTRIPH_SEL << 15) | (MW_EPWMXBAR16_CMPSSB8_CTRIPL_SEL << 16) | (MW_EPWMXBAR16_CMPSSB8_CTRIPH_SEL << 17) | (MW_EPWMXBAR16_CMPSSB9_CTRIPL_SEL << 18) | (MW_EPWMXBAR16_CMPSSB9_CTRIPH_SEL << 19);
    group2_epwmxbar[16] = (MW_EPWMXBAR16_SD0_FILT0_CEVT1_SEL << 0) | (MW_EPWMXBAR16_SD0_FILT0_CEVT2_SEL << 1) | (MW_EPWMXBAR16_SD0_FILT0_CMPHZ_SEL << 2) | (MW_EPWMXBAR16_SD0_FILT1_CEVT1_SEL << 3) | (MW_EPWMXBAR16_SD0_FILT1_CEVT2_SEL << 4) | (MW_EPWMXBAR16_SD0_FILT1_CMPHZ_SEL << 5) | (MW_EPWMXBAR16_SD0_FILT2_CEVT1_SEL << 6) | (MW_EPWMXBAR16_SD0_FILT2_CEVT2_SEL << 7) | (MW_EPWMXBAR16_SD0_FILT2_CMPHZ_SEL << 8) | (MW_EPWMXBAR16_SD0_FILT3_CEVT1_SEL << 9) | (MW_EPWMXBAR16_SD0_FILT3_CEVT2_SEL << 10) | (MW_EPWMXBAR16_SD0_FILT3_CMPHZ_SEL << 11) | (MW_EPWMXBAR16_SD1_FILT0_CEVT1_SEL << 12) | (MW_EPWMXBAR16_SD1_FILT0_CEVT2_SEL << 13) | (MW_EPWMXBAR16_SD1_FILT0_CMPHZ_SEL << 14) | (MW_EPWMXBAR16_SD1_FILT1_CEVT1_SEL << 15) | (MW_EPWMXBAR16_SD1_FILT1_CEVT2_SEL << 16) | (MW_EPWMXBAR16_SD1_FILT1_CMPHZ_SEL << 17) | (MW_EPWMXBAR16_SD1_FILT2_CEVT1_SEL << 18) | (MW_EPWMXBAR16_SD1_FILT2_CEVT2_SEL << 19) | (MW_EPWMXBAR16_SD1_FILT2_CMPHZ_SEL << 20) | (MW_EPWMXBAR16_SD1_FILT3_CEVT1_SEL << 21) | (MW_EPWMXBAR16_SD1_FILT3_CEVT2_SEL << 22) | (MW_EPWMXBAR16_SD1_FILT3_CMPHZ_SEL << 23);
    group3_epwmxbar[16] = (MW_EPWMXBAR16_ADC0_EVT1_SEL << 0) | (MW_EPWMXBAR16_ADC0_EVT2_SEL << 1) | (MW_EPWMXBAR16_ADC0_EVT3_SEL << 2) | (MW_EPWMXBAR16_ADC0_EVT4_SEL << 3) | (MW_EPWMXBAR16_ADC1_EVT1_SEL << 4) | (MW_EPWMXBAR16_ADC1_EVT2_SEL << 5) | (MW_EPWMXBAR16_ADC1_EVT3_SEL << 6) | (MW_EPWMXBAR16_ADC1_EVT4_SEL << 7) | (MW_EPWMXBAR16_ADC2_EVT1_SEL << 8) | (MW_EPWMXBAR16_ADC2_EVT2_SEL << 9) | (MW_EPWMXBAR16_ADC2_EVT3_SEL << 10) | (MW_EPWMXBAR16_ADC2_EVT4_SEL << 11) | (MW_EPWMXBAR16_ADC3_EVT1_SEL << 12) | (MW_EPWMXBAR16_ADC3_EVT2_SEL << 13) | (MW_EPWMXBAR16_ADC3_EVT3_SEL << 14) | (MW_EPWMXBAR16_ADC3_EVT4_SEL << 15) | (MW_EPWMXBAR16_ADC4_EVT1_SEL << 16) | (MW_EPWMXBAR16_ADC4_EVT2_SEL << 17) | (MW_EPWMXBAR16_ADC4_EVT3_SEL << 18) | (MW_EPWMXBAR16_ADC4_EVT4_SEL << 19);
