TexasInstruments/am26x-hsp/src/am263px_init.c
    // if(MW_EPWMXBAR16_GPIO0_SEL == 1 | MW_EPWMXBAR16_GPIO1_SEL == 1 | MW_EPWMXBAR16_GPIO2_SEL == 1 | MW_EPWMXBAR16_GPIO3_SEL == 1 | MW_EPWMXBAR16_GPIO4_SEL == 1 | MW_EPWMXBAR16_GPIO5_SEL == 1 | MW_EPWMXBAR16_GPIO6_SEL == 1 | MW_EPWMXBAR16_GPIO7_SEL == 1| MW_EPWMXBAR16_GPIO8_SEL == 1 | MW_EPWMXBAR16_GPIO9_SEL == 1 | MW_EPWMXBAR16_GPIO10_SEL == 1| MW_EPWMXBAR16_GPIO11_SEL == 1| MW_EPWMXBAR16_GPIO12_SEL == 1 | MW_EPWMXBAR16_GPIO13_SEL == 1 | MW_EPWMXBAR16_GPIO14_SEL == 1 | MW_EPWMXBAR16_GPIO15_SEL == 1 | MW_EPWMXBAR16_GPIO16_SEL == 1 | MW_EPWMXBAR16_GPIO17_SEL == 1 | MW_EPWMXBAR16_GPIO18_SEL == 1 | MW_EPWMXBAR16_GPIO19_SEL == 1 | MW_EPWMXBAR16_GPIO20_SEL == 1 | MW_EPWMXBAR16_GPIO21_SEL == 1 | MW_EPWMXBAR16_GPIO22_SEL == 1 | MW_EPWMXBAR16_GPIO23_SEL == 1 | MW_EPWMXBAR16_GPIO24_SEL == 1 | MW_EPWMXBAR16_GPIO25_SEL == 1 | MW_EPWMXBAR16_GPIO26_SEL == 1 | MW_EPWMXBAR16_GPIO27_SEL == 1 | MW_EPWMXBAR16_GPIO28_SEL == 1 | MW_EPWMXBAR16_GPIO29_SEL == 1 | MW_EPWMXBAR16_GPIO30_SEL == 1 | MW_EPWMXBAR16_GPIO31_SEL == 1 | MW_EPWMXBAR16_GPIO32_SEL == 1 | MW_EPWMXBAR16_GPIO33_SEL == 1 | MW_EPWMXBAR16_GPIO34_SEL == 1 | MW_EPWMXBAR16_GPIO35_SEL == 1 | MW_EPWMXBAR16_GPIO36_SEL == 1 | MW_EPWMXBAR16_GPIO37_SEL == 1 | MW_EPWMXBAR16_GPIO38_SEL == 1 | MW_EPWMXBAR16_GPIO39_SEL == 1 | MW_EPWMXBAR16_GPIO40_SEL == 1 | MW_EPWMXBAR16_GPIO41_SEL == 1 | MW_EPWMXBAR16_GPIO42_SEL == 1 | MW_EPWMXBAR16_GPIO43_SEL == 1 | MW_EPWMXBAR16_GPIO44_SEL == 1 | | MW_EPWMXBAR16_GPIO45_SEL == 1 | MW_EPWMXBAR16_GPIO46_SEL == 1 | MW_EPWMXBAR16_GPIO47_SEL == 1| MW_EPWMXBAR16_GPIO48_SEL == 1 | MW_EPWMXBAR16_GPIO49_SEL == 1 | MW_EPWMXBAR16_GPIO50_SEL == 1 | MW_EPWMXBAR16_GPIO51_SEL == 1 | MW_EPWMXBAR16_GPIO52_SEL == 1 | MW_EPWMXBAR16_GPIO53_SEL == 1 | MW_EPWMXBAR16_GPIO54_SEL == 1 | MW_EPWMXBAR16_GPIO55_SEL == 1 | MW_EPWMXBAR16_GPIO56_SEL == 1 | MW_EPWMXBAR16_GPIO57_SEL == 1| MW_EPWMXBAR16_GPIO58_SEL == 1 | MW_EPWMXBAR16_GPIO59_SEL == 1 | MW_EPWMXBAR16_GPIO60_SEL == 1 | MW_EPWMXBAR16_GPIO61_SEL == 1 | MW_EPWMXBAR16_GPIO62_SEL == 1 | MW_EPWMXBAR16_GPIO63_SEL == 1 | MW_EPWMXBAR16_GPIO64_SEL == 1 | | MW_EPWMXBAR16_GPIO59_SEL == 1 | MW_EPWMXBAR16_GPIO60_SEL == 1 | MW_EPWMXBAR16_GPIO61_SEL == 1 | MW_EPWMXBAR16_GPIO62_SEL == 1 | MW_EPWMXBAR16_GPIO63_SEL == 1 | MW_EPWMXBAR16_GPIO64_SEL == 1 | MW_EPWMXBAR16_GPIO65_SEL == 1 | MW_EPWMXBAR16_GPIO66_SEL == 1 | MW_EPWMXBAR16_GPIO67_SEL == 1 | MW_EPWMXBAR16_GPIO68_SEL == 1 | MW_EPWMXBAR16_GPIO69_SEL == 1 | MW_EPWMXBAR16_GPIO70_SEL == 1 | MW_EPWMXBAR16_GPIO71_SEL == 1 | MW_EPWMXBAR16_GPIO72_SEL == 1 | MW_EPWMXBAR16_GPIO73_SEL == 1 | MW_EPWMXBAR16_GPIO74_SEL == 1 | MW_EPWMXBAR16_GPIO75_SEL == 1 | MW_EPWMXBAR16_GPIO76_SEL == 1 | MW_EPWMXBAR16_GPIO77_SEL == 1 | MW_EPWMXBAR16_GPIO78_SEL == 1 | | MW_EPWMXBAR16_GPIO80_SEL == 1 | MW_EPWMXBAR16_GPIO81_SEL == 1 | MW_EPWMXBAR16_GPIO82_SEL == 1 | MW_EPWMXBAR16_GPIO83_SEL == 1 | MW_EPWMXBAR16_GPIO84_SEL == 1 | MW_EPWMXBAR16_GPIO85_SEL == 1 | MW_EPWMXBAR16_GPIO86_SEL == 1 | MW_EPWMXBAR16_GPIO87_SEL == 1 | MW_EPWMXBAR16_GPIO88_SEL == 1 | MW_EPWMXBAR16_GPIO89_SEL == 1 | MW_EPWMXBAR16_GPIO90_SEL == 1 | MW_EPWMXBAR16_GPIO91_SEL == 1 | MW_EPWMXBAR16_GPIO92_SEL == 1 | MW_EPWMXBAR16_GPIO93_SEL == 1 | MW_EPWMXBAR16_GPIO94_SEL == 1 | MW_EPWMXBAR16_GPIO95_SEL == 1 | MW_EPWMXBAR16_GPIO96_SEL == 1 | MW_EPWMXBAR16_GPIO97_SEL == 1 | MW_EPWMXBAR16_GPIO98_SEL == 1 | MW_EPWMXBAR16_GPIO99_SEL == 1 | MW_EPWMXBAR16_GPIO100_SEL == 1 | MW_EPWMXBAR16_GPIO101_SEL == 1 | MW_EPWMXBAR16_GPIO102_SEL == 1 | MW_EPWMXBAR16_GPIO103_SEL == 1 | MW_EPWMXBAR16_GPIO104_SEL == 1 | MW_EPWMXBAR16_GPIO105_SEL == 1 | MW_EPWMXBAR16_GPIO106_SEL == 1 | MW_EPWMXBAR16_GPIO107_SEL == 1 | | MW_EPWMXBAR16_GPIO108_SEL == 1 | MW_EPWMXBAR16_GPIO109_SEL == 1| MW_EPWMXBAR16_GPIO110_SEL == 1 | MW_EPWMXBAR16_GPIO111_SEL == 1 | MW_EPWMXBAR16_GPIO112_SEL == 1 | MW_EPWMXBAR16_GPIO113_SEL == 1 | MW_EPWMXBAR16_GPIO114_SEL == 1 | MW_EPWMXBAR16_GPIO115_SEL == 1 | MW_EPWMXBAR16_GPIO116_SEL == 1 | MW_EPWMXBAR16_GPIO117_SEL == 1 | MW_EPWMXBAR16_GPIO118_SEL == 1 | MW_EPWMXBAR16_GPIO119_SEL == 1 | MW_EPWMXBAR16_GPIO120_SEL == 1 | MW_EPWMXBAR16_GPIO121_SEL == 1 | MW_EPWMXBAR16_GPIO122_SEL == 1 | MW_EPWMXBAR16_GPIO123_SEL == 1 | MW_EPWMXBAR16_GPIO124_SEL == 1 | MW_EPWMXBAR16_GPIO125_SEL == 1 | MW_EPWMXBAR16_GPIO126_SEL == 1 | MW_EPWMXBAR16_GPIO127_SEL == 1 | MW_EPWMXBAR16_GPIO128_SEL == 1 | MW_EPWMXBAR16_GPIO129_SEL == 1 | MW_EPWMXBAR16_GPIO130_SEL == 1 | MW_EPWMXBAR16_GPIO131_SEL == 1 | MW_EPWMXBAR16_GPIO132_SEL == 1 | MW_EPWMXBAR16_GPIO133_SEL == 1 | MW_EPWMXBAR16_GPIO134_SEL == 1 | MW_EPWMXBAR16_GPIO135_SEL == 1 | MW_EPWMXBAR16_GPIO136_SEL == 1 | MW_EPWMXBAR16_GPIO137_SEL == 1 | MW_EPWMXBAR16_GPIO139_SEL == 1 | MW_EPWMXBAR16_GPIO140_SEL == 1 | MW_EPWMXBAR16_GPIO141_SEL == 1 | MW_EPWMXBAR16_GPIO142_SEL == 1 | MW_EPWMXBAR16_GPIO143_SEL == 1 | MW_EPWMXBAR16_ICSSGPO0_PORT0_SEL == 1 | MW_EPWMXBAR16_ICSSGPO1_PORT0_SEL == 1 | MW_EPWMXBAR16_ICSSGPO2_PORT0_SEL == 1 | MW_EPWMXBAR16_ICSSGPO3_PORT0_SEL == 1 | MW_EPWMXBAR16_ICSSGPO4_PORT0_SEL == 1 | MW_EPWMXBAR16_ICSSGPO5_PORT0_SEL == 1 | MW_EPWMXBAR16_ICSSGPO6_PORT0_SEL == 1 | MW_EPWMXBAR16_ICSSGPO7_PORT0_SEL == 1 | MW_EPWMXBAR16_ICSSGPO8_PORT0_SEL == 1 | MW_EPWMXBAR16_ICSSGPO9_PORT0_SEL == 1 | MW_EPWMXBAR16_ICSSGPO10_PORT0_SEL == 1 | MW_EPWMXBAR16_ICSSGPO11_PORT0_SEL == 1 | MW_EPWMXBAR16_ICSSGPO12_PORT0_SEL == 1 | MW_EPWMXBAR16_ICSSGPO13_PORT0_SEL == 1 | MW_EPWMXBAR16_ICSSGPO14_PORT0_SEL == 1 | MW_EPWMXBAR16_ICSSGPO15_PORT0_SEL == 1 | MW_EPWMXBAR16_ICSSGPO0_PORT1_SEL == 1 | MW_EPWMXBAR16_ICSSGPO1_PORT1_SEL == 1 | MW_EPWMXBAR16_ICSSGPO2_PORT1_SEL == 1 | MW_EPWMXBAR16_ICSSGPO3_PORT1_SEL == 1 | MW_EPWMXBAR16_ICSSGPO4_PORT1_SEL == 1 | MW_EPWMXBAR16_ICSSGPO5_PORT1_SEL == 1 | MW_EPWMXBAR16_ICSSGPO6_PORT1_SEL == 1 | MW_EPWMXBAR16_ICSSGPO7_PORT1_SEL == 1 | MW_EPWMXBAR16_ICSSGPO8_PORT1_SEL == 1 | MW_EPWMXBAR16_ICSSGPO9_PORT1_SEL == 1 | MW_EPWMXBAR16_ICSSGPO10_PORT1_SEL == 1 | MW_EPWMXBAR16_ICSSGPO11_PORT1_SEL == 1 | MW_EPWMXBAR16_ICSSGPO12_PORT1_SEL == 1 | MW_EPWMXBAR16_ICSSGPO13_PORT1_SEL == 1 | MW_EPWMXBAR16_ICSSGPO14_PORT1_SEL == 1 | MW_EPWMXBAR16_ICSSGPO15_PORT1_SEL == 1)
    //     group4_epwmxbar[16] = EPWM_XBAR_16;
    // else
        group4_epwmxbar[16] = 0;
    group5_epwmxbar[16] = (MW_EPWMXBAR16_EPWM0_TRIPOUT_SEL << 0) | (MW_EPWMXBAR16_EPWM1_TRIPOUT_SEL << 1) | (MW_EPWMXBAR16_EPWM2_TRIPOUT_SEL << 2) | (MW_EPWMXBAR16_EPWM3_TRIPOUT_SEL << 3) | (MW_EPWMXBAR16_EPWM4_TRIPOUT_SEL << 4) | (MW_EPWMXBAR16_EPWM5_TRIPOUT_SEL << 5) | (MW_EPWMXBAR16_EPWM6_TRIPOUT_SEL << 6) | (MW_EPWMXBAR16_EPWM7_TRIPOUT_SEL << 7) | (MW_EPWMXBAR16_EPWM8_TRIPOUT_SEL << 8) | (MW_EPWMXBAR16_EPWM9_TRIPOUT_SEL << 9) | (MW_EPWMXBAR16_EPWM10_TRIPOUT_SEL << 10) | (MW_EPWMXBAR16_EPWM11_TRIPOUT_SEL << 11) | (MW_EPWMXBAR16_EPWM12_TRIPOUT_SEL << 12) | (MW_EPWMXBAR16_EPWM13_TRIPOUT_SEL << 13) | (MW_EPWMXBAR16_EPWM14_TRIPOUT_SEL << 14) | (MW_EPWMXBAR16_EPWM15_TRIPOUT_SEL << 15) | (MW_EPWMXBAR16_EPWM16_TRIPOUT_SEL << 16) | (MW_EPWMXBAR16_EPWM17_TRIPOUT_SEL << 17) | (MW_EPWMXBAR16_EPWM18_TRIPOUT_SEL << 18) | (MW_EPWMXBAR16_EPWM19_TRIPOUT_SEL << 19) | (MW_EPWMXBAR16_EPWM20_TRIPOUT_SEL << 20) | (MW_EPWMXBAR16_EPWM21_TRIPOUT_SEL << 21) | (MW_EPWMXBAR16_EPWM22_TRIPOUT_SEL << 22) | (MW_EPWMXBAR16_EPWM23_TRIPOUT_SEL << 23) | (MW_EPWMXBAR16_EPWM24_TRIPOUT_SEL << 24) | (MW_EPWMXBAR16_EPWM25_TRIPOUT_SEL << 25) | (MW_EPWMXBAR16_EPWM26_TRIPOUT_SEL << 26) | (MW_EPWMXBAR16_EPWM27_TRIPOUT_SEL << 27) | (MW_EPWMXBAR16_EPWM28_TRIPOUT_SEL << 28) | (MW_EPWMXBAR16_EPWM29_TRIPOUT_SEL << 29) | (MW_EPWMXBAR16_EPWM30_TRIPOUT_SEL << 30) | (MW_EPWMXBAR16_EPWM31_TRIPOUT_SEL << 31);
    group6_epwmxbar[16] = (MW_EPWMXBAR16_DEL0_TRIP_SEL << 0) | (MW_EPWMXBAR16_DEL1_TRIP_SEL << 1) | (MW_EPWMXBAR16_DEL2_TRIP_SEL << 2) | (MW_EPWMXBAR16_DEL3_TRIP_SEL << 3) | (MW_EPWMXBAR16_DEL4_TRIP_SEL << 4) | (MW_EPWMXBAR16_DEL5_TRIP_SEL << 5) | (MW_EPWMXBAR16_DEL6_TRIP_SEL << 6) | (MW_EPWMXBAR16_DEL7_TRIP_SEL << 7) | (MW_EPWMXBAR16_DEL8_TRIP_SEL << 8) | (MW_EPWMXBAR16_DEL9_TRIP_SEL << 9) | (MW_EPWMXBAR16_DEL10_TRIP_SEL << 10) | (MW_EPWMXBAR16_DEL11_TRIP_SEL << 11) | (MW_EPWMXBAR16_DEL12_TRIP_SEL << 12) | (MW_EPWMXBAR16_DEL13_TRIP_SEL << 13) | (MW_EPWMXBAR16_DEL14_TRIP_SEL << 14) | (MW_EPWMXBAR16_DEL15_TRIP_SEL << 15) | (MW_EPWMXBAR16_DEL16_TRIP_SEL << 16) | (MW_EPWMXBAR16_DEL17_TRIP_SEL << 17) | (MW_EPWMXBAR16_DEL18_TRIP_SEL << 18) | (MW_EPWMXBAR16_DEL19_TRIP_SEL << 19) | (MW_EPWMXBAR16_DEL20_TRIP_SEL << 20) | (MW_EPWMXBAR16_DEL21_TRIP_SEL << 21) | (MW_EPWMXBAR16_DEL22_TRIP_SEL << 22) | (MW_EPWMXBAR16_DEL23_TRIP_SEL << 23) | (MW_EPWMXBAR16_DEL24_TRIP_SEL << 24) | (MW_EPWMXBAR16_DEL25_TRIP_SEL << 25) | (MW_EPWMXBAR16_DEL26_TRIP_SEL << 26) | (MW_EPWMXBAR16_DEL27_TRIP_SEL << 27) | (MW_EPWMXBAR16_DEL28_TRIP_SEL << 28) | (MW_EPWMXBAR16_DEL29_TRIP_SEL << 29) | (MW_EPWMXBAR16_DEL30_TRIP_SEL << 30) | (MW_EPWMXBAR16_DEL31_TRIP_SEL << 31);
    group7_epwmxbar[16] = (MW_EPWMXBAR16_DEL0_ACTIVE_SEL << 0) | (MW_EPWMXBAR16_DEL1_ACTIVE_SEL << 1) | (MW_EPWMXBAR16_DEL2_ACTIVE_SEL << 2) | (MW_EPWMXBAR16_DEL3_ACTIVE_SEL << 3) | (MW_EPWMXBAR16_DEL4_ACTIVE_SEL << 4) | (MW_EPWMXBAR16_DEL5_ACTIVE_SEL << 5) | (MW_EPWMXBAR16_DEL6_ACTIVE_SEL << 6) | (MW_EPWMXBAR16_DEL7_ACTIVE_SEL << 7) | (MW_EPWMXBAR16_DEL8_ACTIVE_SEL << 8) | (MW_EPWMXBAR16_DEL9_ACTIVE_SEL << 9) | (MW_EPWMXBAR16_DEL10_ACTIVE_SEL << 10) | (MW_EPWMXBAR16_DEL11_ACTIVE_SEL << 11) | (MW_EPWMXBAR16_DEL12_ACTIVE_SEL << 12) | (MW_EPWMXBAR16_DEL13_ACTIVE_SEL << 13) | (MW_EPWMXBAR16_DEL14_ACTIVE_SEL << 14) | (MW_EPWMXBAR16_DEL15_ACTIVE_SEL << 15) | (MW_EPWMXBAR16_DEL16_ACTIVE_SEL << 16) | (MW_EPWMXBAR16_DEL17_ACTIVE_SEL << 17) | (MW_EPWMXBAR16_DEL18_ACTIVE_SEL << 18) | (MW_EPWMXBAR16_DEL19_ACTIVE_SEL << 19) | (MW_EPWMXBAR16_DEL20_ACTIVE_SEL << 20) | (MW_EPWMXBAR16_DEL21_ACTIVE_SEL << 21) | (MW_EPWMXBAR16_DEL22_ACTIVE_SEL << 22) | (MW_EPWMXBAR16_DEL23_ACTIVE_SEL << 23) | (MW_EPWMXBAR16_DEL24_ACTIVE_SEL << 24) | (MW_EPWMXBAR16_DEL25_ACTIVE_SEL << 25) | (MW_EPWMXBAR16_DEL26_ACTIVE_SEL << 26) | (MW_EPWMXBAR16_DEL27_ACTIVE_SEL << 27) | (MW_EPWMXBAR16_DEL28_ACTIVE_SEL << 28) | (MW_EPWMXBAR16_DEL29_ACTIVE_SEL << 29) | (MW_EPWMXBAR16_DEL30_ACTIVE_SEL << 30) | (MW_EPWMXBAR16_DEL31_ACTIVE_SEL << 31);
    group8_epwmxbar[16] = (MW_EPWMXBAR16_EQEP0_ERR_SEL << 0) | (MW_EPWMXBAR16_EQEP1_ERR_SEL << 1) | (MW_EPWMXBAR16_EQEP2_ERR_SEL << 2) | (MW_EPWMXBAR16_FSIRX0_RX_TRIG0_SEL << 3) | (MW_EPWMXBAR16_FSIRX0_RX_TRIG1_SEL << 4) | (MW_EPWMXBAR16_FSIRX0_RX_TRIG2_SEL << 5) | (MW_EPWMXBAR16_FSIRX0_RX_TRIG3_SEL << 6) | (MW_EPWMXBAR16_FSIRX1_RX_TRIG0_SEL << 7) | (MW_EPWMXBAR16_FSIRX1_RX_TRIG1_SEL << 8) | (MW_EPWMXBAR16_FSIRX1_RX_TRIG2_SEL << 9) | (MW_EPWMXBAR16_FSIRX1_RX_TRIG3_SEL << 10) | (MW_EPWMXBAR16_FSIRX2_RX_TRIG0_SEL << 11) | (MW_EPWMXBAR16_FSIRX2_RX_TRIG1_SEL << 12) | (MW_EPWMXBAR16_FSIRX2_RX_TRIG2_SEL << 13) | (MW_EPWMXBAR16_FSIRX2_RX_TRIG3_SEL << 14) | (MW_EPWMXBAR16_FSIRX3_RX_TRIG0_SEL << 15) | (MW_EPWMXBAR16_FSIRX3_RX_TRIG1_SEL << 16) | (MW_EPWMXBAR16_FSIRX3_RX_TRIG2_SEL << 17) | (MW_EPWMXBAR16_FSIRX3_RX_TRIG3_SEL << 18) | (MW_EPWMXBAR16_ECAP0_TRIPOUT_SEL << 19) | (MW_EPWMXBAR16_ECAP1_TRIPOUT_SEL << 20) | (MW_EPWMXBAR16_ECAP2_TRIPOUT_SEL << 21) | (MW_EPWMXBAR16_ECAP3_TRIPOUT_SEL << 22) | (MW_EPWMXBAR16_ECAP4_TRIPOUT_SEL << 23) | (MW_EPWMXBAR16_ECAP5_TRIPOUT_SEL << 24) | (MW_EPWMXBAR16_ECAP6_TRIPOUT_SEL << 25) | (MW_EPWMXBAR16_ECAP7_TRIPOUT_SEL << 26) | (MW_EPWMXBAR16_ECAP8_TRIPOUT_SEL << 27) | (MW_EPWMXBAR16_ECAP9_TRIPOUT_SEL << 28);
    group0_epwmxbar[17] = (MW_EPWMXBAR17_CMPSSA0_CTRIPL_SEL << 0) | (MW_EPWMXBAR17_CMPSSA0_CTRIPH_SEL << 1) | (MW_EPWMXBAR17_CMPSSA1_CTRIPL_SEL << 2) | (MW_EPWMXBAR17_CMPSSA1_CTRIPH_SEL << 3) | (MW_EPWMXBAR17_CMPSSA2_CTRIPL_SEL << 4) | (MW_EPWMXBAR17_CMPSSA2_CTRIPH_SEL << 5) | (MW_EPWMXBAR17_CMPSSA3_CTRIPL_SEL << 6) | (MW_EPWMXBAR17_CMPSSA3_CTRIPH_SEL << 7) | (MW_EPWMXBAR17_CMPSSA4_CTRIPL_SEL << 8) | (MW_EPWMXBAR17_CMPSSA4_CTRIPH_SEL << 9) | (MW_EPWMXBAR17_CMPSSA5_CTRIPL_SEL << 10) | (MW_EPWMXBAR17_CMPSSA5_CTRIPH_SEL << 11) | (MW_EPWMXBAR17_CMPSSA6_CTRIPL_SEL << 12) | (MW_EPWMXBAR17_CMPSSA6_CTRIPH_SEL << 13) | (MW_EPWMXBAR17_CMPSSA7_CTRIPL_SEL << 14) | (MW_EPWMXBAR17_CMPSSA7_CTRIPH_SEL << 15) | (MW_EPWMXBAR17_CMPSSA8_CTRIPL_SEL << 16) | (MW_EPWMXBAR17_CMPSSA8_CTRIPH_SEL << 17) | (MW_EPWMXBAR17_CMPSSA9_CTRIPL_SEL << 18) | (MW_EPWMXBAR17_CMPSSA9_CTRIPH_SEL << 19);
    group1_epwmxbar[17] = (MW_EPWMXBAR17_CMPSSB0_CTRIPL_SEL << 0) | (MW_EPWMXBAR17_CMPSSB0_CTRIPH_SEL << 1) | (MW_EPWMXBAR17_CMPSSB1_CTRIPL_SEL << 2) | (MW_EPWMXBAR17_CMPSSB1_CTRIPH_SEL << 3) | (MW_EPWMXBAR17_CMPSSB2_CTRIPL_SEL << 4) | (MW_EPWMXBAR17_CMPSSB2_CTRIPH_SEL << 5) | (MW_EPWMXBAR17_CMPSSB3_CTRIPL_SEL << 6) | (MW_EPWMXBAR17_CMPSSB3_CTRIPH_SEL << 7) | (MW_EPWMXBAR17_CMPSSB4_CTRIPL_SEL << 8) | (MW_EPWMXBAR17_CMPSSB4_CTRIPH_SEL << 9) | (MW_EPWMXBAR17_CMPSSB5_CTRIPL_SEL << 10) | (MW_EPWMXBAR17_CMPSSB5_CTRIPH_SEL << 11) | (MW_EPWMXBAR17_CMPSSB6_CTRIPL_SEL << 12) | (MW_EPWMXBAR17_CMPSSB6_CTRIPH_SEL << 13) | (MW_EPWMXBAR17_CMPSSB7_CTRIPL_SEL << 14) | (MW_EPWMXBAR17_CMPSSB7_CTRIPH_SEL << 15) | (MW_EPWMXBAR17_CMPSSB8_CTRIPL_SEL << 16) | (MW_EPWMXBAR17_CMPSSB8_CTRIPH_SEL << 17) | (MW_EPWMXBAR17_CMPSSB9_CTRIPL_SEL << 18) | (MW_EPWMXBAR17_CMPSSB9_CTRIPH_SEL << 19);
    group2_epwmxbar[17] = (MW_EPWMXBAR17_SD0_FILT0_CEVT1_SEL << 0) | (MW_EPWMXBAR17_SD0_FILT0_CEVT2_SEL << 1) | (MW_EPWMXBAR17_SD0_FILT0_CMPHZ_SEL << 2) | (MW_EPWMXBAR17_SD0_FILT1_CEVT1_SEL << 3) | (MW_EPWMXBAR17_SD0_FILT1_CEVT2_SEL << 4) | (MW_EPWMXBAR17_SD0_FILT1_CMPHZ_SEL << 5) | (MW_EPWMXBAR17_SD0_FILT2_CEVT1_SEL << 6) | (MW_EPWMXBAR17_SD0_FILT2_CEVT2_SEL << 7) | (MW_EPWMXBAR17_SD0_FILT2_CMPHZ_SEL << 8) | (MW_EPWMXBAR17_SD0_FILT3_CEVT1_SEL << 9) | (MW_EPWMXBAR17_SD0_FILT3_CEVT2_SEL << 10) | (MW_EPWMXBAR17_SD0_FILT3_CMPHZ_SEL << 11) | (MW_EPWMXBAR17_SD1_FILT0_CEVT1_SEL << 12) | (MW_EPWMXBAR17_SD1_FILT0_CEVT2_SEL << 13) | (MW_EPWMXBAR17_SD1_FILT0_CMPHZ_SEL << 14) | (MW_EPWMXBAR17_SD1_FILT1_CEVT1_SEL << 15) | (MW_EPWMXBAR17_SD1_FILT1_CEVT2_SEL << 16) | (MW_EPWMXBAR17_SD1_FILT1_CMPHZ_SEL << 17) | (MW_EPWMXBAR17_SD1_FILT2_CEVT1_SEL << 18) | (MW_EPWMXBAR17_SD1_FILT2_CEVT2_SEL << 19) | (MW_EPWMXBAR17_SD1_FILT2_CMPHZ_SEL << 20) | (MW_EPWMXBAR17_SD1_FILT3_CEVT1_SEL << 21) | (MW_EPWMXBAR17_SD1_FILT3_CEVT2_SEL << 22) | (MW_EPWMXBAR17_SD1_FILT3_CMPHZ_SEL << 23);
    group3_epwmxbar[17] = (MW_EPWMXBAR17_ADC0_EVT1_SEL << 0) | (MW_EPWMXBAR17_ADC0_EVT2_SEL << 1) | (MW_EPWMXBAR17_ADC0_EVT3_SEL << 2) | (MW_EPWMXBAR17_ADC0_EVT4_SEL << 3) | (MW_EPWMXBAR17_ADC1_EVT1_SEL << 4) | (MW_EPWMXBAR17_ADC1_EVT2_SEL << 5) | (MW_EPWMXBAR17_ADC1_EVT3_SEL << 6) | (MW_EPWMXBAR17_ADC1_EVT4_SEL << 7) | (MW_EPWMXBAR17_ADC2_EVT1_SEL << 8) | (MW_EPWMXBAR17_ADC2_EVT2_SEL << 9) | (MW_EPWMXBAR17_ADC2_EVT3_SEL << 10) | (MW_EPWMXBAR17_ADC2_EVT4_SEL << 11) | (MW_EPWMXBAR17_ADC3_EVT1_SEL << 12) | (MW_EPWMXBAR17_ADC3_EVT2_SEL << 13) | (MW_EPWMXBAR17_ADC3_EVT3_SEL << 14) | (MW_EPWMXBAR17_ADC3_EVT4_SEL << 15) | (MW_EPWMXBAR17_ADC4_EVT1_SEL << 16) | (MW_EPWMXBAR17_ADC4_EVT2_SEL << 17) | (MW_EPWMXBAR17_ADC4_EVT3_SEL << 18) | (MW_EPWMXBAR17_ADC4_EVT4_SEL << 19);
    // if(MW_EPWMXBAR17_GPIO0_SEL == 1 | MW_EPWMXBAR17_GPIO1_SEL == 1 | MW_EPWMXBAR17_GPIO2_SEL == 1 | MW_EPWMXBAR17_GPIO3_SEL == 1 | MW_EPWMXBAR17_GPIO4_SEL == 1 | MW_EPWMXBAR17_GPIO5_SEL == 1 | MW_EPWMXBAR17_GPIO6_SEL == 1 | MW_EPWMXBAR17_GPIO7_SEL == 1| MW_EPWMXBAR17_GPIO8_SEL == 1 | MW_EPWMXBAR17_GPIO9_SEL == 1 | MW_EPWMXBAR17_GPIO10_SEL == 1| MW_EPWMXBAR17_GPIO11_SEL == 1| MW_EPWMXBAR17_GPIO12_SEL == 1 | MW_EPWMXBAR17_GPIO13_SEL == 1 | MW_EPWMXBAR17_GPIO14_SEL == 1 | MW_EPWMXBAR17_GPIO15_SEL == 1 | MW_EPWMXBAR17_GPIO16_SEL == 1 | MW_EPWMXBAR17_GPIO17_SEL == 1 | MW_EPWMXBAR17_GPIO18_SEL == 1 | MW_EPWMXBAR17_GPIO19_SEL == 1 | MW_EPWMXBAR17_GPIO20_SEL == 1 | MW_EPWMXBAR17_GPIO21_SEL == 1 | MW_EPWMXBAR17_GPIO22_SEL == 1 | MW_EPWMXBAR17_GPIO23_SEL == 1 | MW_EPWMXBAR17_GPIO24_SEL == 1 | MW_EPWMXBAR17_GPIO25_SEL == 1 | MW_EPWMXBAR17_GPIO26_SEL == 1 | MW_EPWMXBAR17_GPIO27_SEL == 1 | MW_EPWMXBAR17_GPIO28_SEL == 1 | MW_EPWMXBAR17_GPIO29_SEL == 1 | MW_EPWMXBAR17_GPIO30_SEL == 1 | MW_EPWMXBAR17_GPIO31_SEL == 1 | MW_EPWMXBAR17_GPIO32_SEL == 1 | MW_EPWMXBAR17_GPIO33_SEL == 1 | MW_EPWMXBAR17_GPIO34_SEL == 1 | MW_EPWMXBAR17_GPIO35_SEL == 1 | MW_EPWMXBAR17_GPIO36_SEL == 1 | MW_EPWMXBAR17_GPIO37_SEL == 1 | MW_EPWMXBAR17_GPIO38_SEL == 1 | MW_EPWMXBAR17_GPIO39_SEL == 1 | MW_EPWMXBAR17_GPIO40_SEL == 1 | MW_EPWMXBAR17_GPIO41_SEL == 1 | MW_EPWMXBAR17_GPIO42_SEL == 1 | MW_EPWMXBAR17_GPIO43_SEL == 1 | MW_EPWMXBAR17_GPIO44_SEL == 1 | | MW_EPWMXBAR17_GPIO45_SEL == 1 | MW_EPWMXBAR17_GPIO46_SEL == 1 | MW_EPWMXBAR17_GPIO47_SEL == 1| MW_EPWMXBAR17_GPIO48_SEL == 1 | MW_EPWMXBAR17_GPIO49_SEL == 1 | MW_EPWMXBAR17_GPIO50_SEL == 1 | MW_EPWMXBAR17_GPIO51_SEL == 1 | MW_EPWMXBAR17_GPIO52_SEL == 1 | MW_EPWMXBAR17_GPIO53_SEL == 1 | MW_EPWMXBAR17_GPIO54_SEL == 1 | MW_EPWMXBAR17_GPIO55_SEL == 1 | MW_EPWMXBAR17_GPIO56_SEL == 1 | MW_EPWMXBAR17_GPIO57_SEL == 1| MW_EPWMXBAR17_GPIO58_SEL == 1 | MW_EPWMXBAR17_GPIO59_SEL == 1 | MW_EPWMXBAR17_GPIO60_SEL == 1 | MW_EPWMXBAR17_GPIO61_SEL == 1 | MW_EPWMXBAR17_GPIO62_SEL == 1 | MW_EPWMXBAR17_GPIO63_SEL == 1 | MW_EPWMXBAR17_GPIO64_SEL == 1 | | MW_EPWMXBAR17_GPIO59_SEL == 1 | MW_EPWMXBAR17_GPIO60_SEL == 1 | MW_EPWMXBAR17_GPIO61_SEL == 1 | MW_EPWMXBAR17_GPIO62_SEL == 1 | MW_EPWMXBAR17_GPIO63_SEL == 1 | MW_EPWMXBAR17_GPIO64_SEL == 1 | MW_EPWMXBAR17_GPIO65_SEL == 1 | MW_EPWMXBAR17_GPIO66_SEL == 1 | MW_EPWMXBAR17_GPIO67_SEL == 1 | MW_EPWMXBAR17_GPIO68_SEL == 1 | MW_EPWMXBAR17_GPIO69_SEL == 1 | MW_EPWMXBAR17_GPIO70_SEL == 1 | MW_EPWMXBAR17_GPIO71_SEL == 1 | MW_EPWMXBAR17_GPIO72_SEL == 1 | MW_EPWMXBAR17_GPIO73_SEL == 1 | MW_EPWMXBAR17_GPIO74_SEL == 1 | MW_EPWMXBAR17_GPIO75_SEL == 1 | MW_EPWMXBAR17_GPIO76_SEL == 1 | MW_EPWMXBAR17_GPIO77_SEL == 1 | MW_EPWMXBAR17_GPIO78_SEL == 1 | | MW_EPWMXBAR17_GPIO80_SEL == 1 | MW_EPWMXBAR17_GPIO81_SEL == 1 | MW_EPWMXBAR17_GPIO82_SEL == 1 | MW_EPWMXBAR17_GPIO83_SEL == 1 | MW_EPWMXBAR17_GPIO84_SEL == 1 | MW_EPWMXBAR17_GPIO85_SEL == 1 | MW_EPWMXBAR17_GPIO86_SEL == 1 | MW_EPWMXBAR17_GPIO87_SEL == 1 | MW_EPWMXBAR17_GPIO88_SEL == 1 | MW_EPWMXBAR17_GPIO89_SEL == 1 | MW_EPWMXBAR17_GPIO90_SEL == 1 | MW_EPWMXBAR17_GPIO91_SEL == 1 | MW_EPWMXBAR17_GPIO92_SEL == 1 | MW_EPWMXBAR17_GPIO93_SEL == 1 | MW_EPWMXBAR17_GPIO94_SEL == 1 | MW_EPWMXBAR17_GPIO95_SEL == 1 | MW_EPWMXBAR17_GPIO96_SEL == 1 | MW_EPWMXBAR17_GPIO97_SEL == 1 | MW_EPWMXBAR17_GPIO98_SEL == 1 | MW_EPWMXBAR17_GPIO99_SEL == 1 | MW_EPWMXBAR17_GPIO100_SEL == 1 | MW_EPWMXBAR17_GPIO101_SEL == 1 | MW_EPWMXBAR17_GPIO102_SEL == 1 | MW_EPWMXBAR17_GPIO103_SEL == 1 | MW_EPWMXBAR17_GPIO104_SEL == 1 | MW_EPWMXBAR17_GPIO105_SEL == 1 | MW_EPWMXBAR17_GPIO106_SEL == 1 | MW_EPWMXBAR17_GPIO107_SEL == 1 | | MW_EPWMXBAR17_GPIO108_SEL == 1 | MW_EPWMXBAR17_GPIO109_SEL == 1| MW_EPWMXBAR17_GPIO110_SEL == 1 | MW_EPWMXBAR17_GPIO111_SEL == 1 | MW_EPWMXBAR17_GPIO112_SEL == 1 | MW_EPWMXBAR17_GPIO113_SEL == 1 | MW_EPWMXBAR17_GPIO114_SEL == 1 | MW_EPWMXBAR17_GPIO115_SEL == 1 | MW_EPWMXBAR17_GPIO116_SEL == 1 | MW_EPWMXBAR17_GPIO117_SEL == 1 | MW_EPWMXBAR17_GPIO118_SEL == 1 | MW_EPWMXBAR17_GPIO119_SEL == 1 | MW_EPWMXBAR17_GPIO120_SEL == 1 | MW_EPWMXBAR17_GPIO121_SEL == 1 | MW_EPWMXBAR17_GPIO122_SEL == 1 | MW_EPWMXBAR17_GPIO123_SEL == 1 | MW_EPWMXBAR17_GPIO124_SEL == 1 | MW_EPWMXBAR17_GPIO125_SEL == 1 | MW_EPWMXBAR17_GPIO126_SEL == 1 | MW_EPWMXBAR17_GPIO127_SEL == 1 | MW_EPWMXBAR17_GPIO128_SEL == 1 | MW_EPWMXBAR17_GPIO129_SEL == 1 | MW_EPWMXBAR17_GPIO130_SEL == 1 | MW_EPWMXBAR17_GPIO131_SEL == 1 | MW_EPWMXBAR17_GPIO132_SEL == 1 | MW_EPWMXBAR17_GPIO133_SEL == 1 | MW_EPWMXBAR17_GPIO134_SEL == 1 | MW_EPWMXBAR17_GPIO135_SEL == 1 | MW_EPWMXBAR17_GPIO136_SEL == 1 | MW_EPWMXBAR17_GPIO137_SEL == 1 | MW_EPWMXBAR17_GPIO139_SEL == 1 | MW_EPWMXBAR17_GPIO140_SEL == 1 | MW_EPWMXBAR17_GPIO141_SEL == 1 | MW_EPWMXBAR17_GPIO142_SEL == 1 | MW_EPWMXBAR17_GPIO143_SEL == 1 | MW_EPWMXBAR17_ICSSGPO0_PORT0_SEL == 1 | MW_EPWMXBAR17_ICSSGPO1_PORT0_SEL == 1 | MW_EPWMXBAR17_ICSSGPO2_PORT0_SEL == 1 | MW_EPWMXBAR17_ICSSGPO3_PORT0_SEL == 1 | MW_EPWMXBAR17_ICSSGPO4_PORT0_SEL == 1 | MW_EPWMXBAR17_ICSSGPO5_PORT0_SEL == 1 | MW_EPWMXBAR17_ICSSGPO6_PORT0_SEL == 1 | MW_EPWMXBAR17_ICSSGPO7_PORT0_SEL == 1 | MW_EPWMXBAR17_ICSSGPO8_PORT0_SEL == 1 | MW_EPWMXBAR17_ICSSGPO9_PORT0_SEL == 1 | MW_EPWMXBAR17_ICSSGPO10_PORT0_SEL == 1 | MW_EPWMXBAR17_ICSSGPO11_PORT0_SEL == 1 | MW_EPWMXBAR17_ICSSGPO12_PORT0_SEL == 1 | MW_EPWMXBAR17_ICSSGPO13_PORT0_SEL == 1 | MW_EPWMXBAR17_ICSSGPO14_PORT0_SEL == 1 | MW_EPWMXBAR17_ICSSGPO15_PORT0_SEL == 1 | MW_EPWMXBAR17_ICSSGPO0_PORT1_SEL == 1 | MW_EPWMXBAR17_ICSSGPO1_PORT1_SEL == 1 | MW_EPWMXBAR17_ICSSGPO2_PORT1_SEL == 1 | MW_EPWMXBAR17_ICSSGPO3_PORT1_SEL == 1 | MW_EPWMXBAR17_ICSSGPO4_PORT1_SEL == 1 | MW_EPWMXBAR17_ICSSGPO5_PORT1_SEL == 1 | MW_EPWMXBAR17_ICSSGPO6_PORT1_SEL == 1 | MW_EPWMXBAR17_ICSSGPO7_PORT1_SEL == 1 | MW_EPWMXBAR17_ICSSGPO8_PORT1_SEL == 1 | MW_EPWMXBAR17_ICSSGPO9_PORT1_SEL == 1 | MW_EPWMXBAR17_ICSSGPO10_PORT1_SEL == 1 | MW_EPWMXBAR17_ICSSGPO11_PORT1_SEL == 1 | MW_EPWMXBAR17_ICSSGPO12_PORT1_SEL == 1 | MW_EPWMXBAR17_ICSSGPO13_PORT1_SEL == 1 | MW_EPWMXBAR17_ICSSGPO14_PORT1_SEL == 1 | MW_EPWMXBAR17_ICSSGPO15_PORT1_SEL == 1)
    //     group4_epwmxbar[17] = EPWM_XBAR_17;
    // else
        group4_epwmxbar[17] = 0;
    group5_epwmxbar[17] = (MW_EPWMXBAR17_EPWM0_TRIPOUT_SEL << 0) | (MW_EPWMXBAR17_EPWM1_TRIPOUT_SEL << 1) | (MW_EPWMXBAR17_EPWM2_TRIPOUT_SEL << 2) | (MW_EPWMXBAR17_EPWM3_TRIPOUT_SEL << 3) | (MW_EPWMXBAR17_EPWM4_TRIPOUT_SEL << 4) | (MW_EPWMXBAR17_EPWM5_TRIPOUT_SEL << 5) | (MW_EPWMXBAR17_EPWM6_TRIPOUT_SEL << 6) | (MW_EPWMXBAR17_EPWM7_TRIPOUT_SEL << 7) | (MW_EPWMXBAR17_EPWM8_TRIPOUT_SEL << 8) | (MW_EPWMXBAR17_EPWM9_TRIPOUT_SEL << 9) | (MW_EPWMXBAR17_EPWM10_TRIPOUT_SEL << 10) | (MW_EPWMXBAR17_EPWM11_TRIPOUT_SEL << 11) | (MW_EPWMXBAR17_EPWM12_TRIPOUT_SEL << 12) | (MW_EPWMXBAR17_EPWM13_TRIPOUT_SEL << 13) | (MW_EPWMXBAR17_EPWM14_TRIPOUT_SEL << 14) | (MW_EPWMXBAR17_EPWM15_TRIPOUT_SEL << 15) | (MW_EPWMXBAR17_EPWM16_TRIPOUT_SEL << 16) | (MW_EPWMXBAR17_EPWM17_TRIPOUT_SEL << 17) | (MW_EPWMXBAR17_EPWM18_TRIPOUT_SEL << 18) | (MW_EPWMXBAR17_EPWM19_TRIPOUT_SEL << 19) | (MW_EPWMXBAR17_EPWM20_TRIPOUT_SEL << 20) | (MW_EPWMXBAR17_EPWM21_TRIPOUT_SEL << 21) | (MW_EPWMXBAR17_EPWM22_TRIPOUT_SEL << 22) | (MW_EPWMXBAR17_EPWM23_TRIPOUT_SEL << 23) | (MW_EPWMXBAR17_EPWM24_TRIPOUT_SEL << 24) | (MW_EPWMXBAR17_EPWM25_TRIPOUT_SEL << 25) | (MW_EPWMXBAR17_EPWM26_TRIPOUT_SEL << 26) | (MW_EPWMXBAR17_EPWM27_TRIPOUT_SEL << 27) | (MW_EPWMXBAR17_EPWM28_TRIPOUT_SEL << 28) | (MW_EPWMXBAR17_EPWM29_TRIPOUT_SEL << 29) | (MW_EPWMXBAR17_EPWM30_TRIPOUT_SEL << 30) | (MW_EPWMXBAR17_EPWM31_TRIPOUT_SEL << 31);
    group6_epwmxbar[17] = (MW_EPWMXBAR17_DEL0_TRIP_SEL << 0) | (MW_EPWMXBAR17_DEL1_TRIP_SEL << 1) | (MW_EPWMXBAR17_DEL2_TRIP_SEL << 2) | (MW_EPWMXBAR17_DEL3_TRIP_SEL << 3) | (MW_EPWMXBAR17_DEL4_TRIP_SEL << 4) | (MW_EPWMXBAR17_DEL5_TRIP_SEL << 5) | (MW_EPWMXBAR17_DEL6_TRIP_SEL << 6) | (MW_EPWMXBAR17_DEL7_TRIP_SEL << 7) | (MW_EPWMXBAR17_DEL8_TRIP_SEL << 8) | (MW_EPWMXBAR17_DEL9_TRIP_SEL << 9) | (MW_EPWMXBAR17_DEL10_TRIP_SEL << 10) | (MW_EPWMXBAR17_DEL11_TRIP_SEL << 11) | (MW_EPWMXBAR17_DEL12_TRIP_SEL << 12) | (MW_EPWMXBAR17_DEL13_TRIP_SEL << 13) | (MW_EPWMXBAR17_DEL14_TRIP_SEL << 14) | (MW_EPWMXBAR17_DEL15_TRIP_SEL << 15) | (MW_EPWMXBAR17_DEL16_TRIP_SEL << 16) | (MW_EPWMXBAR17_DEL17_TRIP_SEL << 17) | (MW_EPWMXBAR17_DEL18_TRIP_SEL << 18) | (MW_EPWMXBAR17_DEL19_TRIP_SEL << 19) | (MW_EPWMXBAR17_DEL20_TRIP_SEL << 20) | (MW_EPWMXBAR17_DEL21_TRIP_SEL << 21) | (MW_EPWMXBAR17_DEL22_TRIP_SEL << 22) | (MW_EPWMXBAR17_DEL23_TRIP_SEL << 23) | (MW_EPWMXBAR17_DEL24_TRIP_SEL << 24) | (MW_EPWMXBAR17_DEL25_TRIP_SEL << 25) | (MW_EPWMXBAR17_DEL26_TRIP_SEL << 26) | (MW_EPWMXBAR17_DEL27_TRIP_SEL << 27) | (MW_EPWMXBAR17_DEL28_TRIP_SEL << 28) | (MW_EPWMXBAR17_DEL29_TRIP_SEL << 29) | (MW_EPWMXBAR17_DEL30_TRIP_SEL << 30) | (MW_EPWMXBAR17_DEL31_TRIP_SEL << 31);
