TexasInstruments/am26x-hsp/src/am263px_init.c
    group7_epwmxbar[17] = (MW_EPWMXBAR17_DEL0_ACTIVE_SEL << 0) | (MW_EPWMXBAR17_DEL1_ACTIVE_SEL << 1) | (MW_EPWMXBAR17_DEL2_ACTIVE_SEL << 2) | (MW_EPWMXBAR17_DEL3_ACTIVE_SEL << 3) | (MW_EPWMXBAR17_DEL4_ACTIVE_SEL << 4) | (MW_EPWMXBAR17_DEL5_ACTIVE_SEL << 5) | (MW_EPWMXBAR17_DEL6_ACTIVE_SEL << 6) | (MW_EPWMXBAR17_DEL7_ACTIVE_SEL << 7) | (MW_EPWMXBAR17_DEL8_ACTIVE_SEL << 8) | (MW_EPWMXBAR17_DEL9_ACTIVE_SEL << 9) | (MW_EPWMXBAR17_DEL10_ACTIVE_SEL << 10) | (MW_EPWMXBAR17_DEL11_ACTIVE_SEL << 11) | (MW_EPWMXBAR17_DEL12_ACTIVE_SEL << 12) | (MW_EPWMXBAR17_DEL13_ACTIVE_SEL << 13) | (MW_EPWMXBAR17_DEL14_ACTIVE_SEL << 14) | (MW_EPWMXBAR17_DEL15_ACTIVE_SEL << 15) | (MW_EPWMXBAR17_DEL16_ACTIVE_SEL << 16) | (MW_EPWMXBAR17_DEL17_ACTIVE_SEL << 17) | (MW_EPWMXBAR17_DEL18_ACTIVE_SEL << 18) | (MW_EPWMXBAR17_DEL19_ACTIVE_SEL << 19) | (MW_EPWMXBAR17_DEL20_ACTIVE_SEL << 20) | (MW_EPWMXBAR17_DEL21_ACTIVE_SEL << 21) | (MW_EPWMXBAR17_DEL22_ACTIVE_SEL << 22) | (MW_EPWMXBAR17_DEL23_ACTIVE_SEL << 23) | (MW_EPWMXBAR17_DEL24_ACTIVE_SEL << 24) | (MW_EPWMXBAR17_DEL25_ACTIVE_SEL << 25) | (MW_EPWMXBAR17_DEL26_ACTIVE_SEL << 26) | (MW_EPWMXBAR17_DEL27_ACTIVE_SEL << 27) | (MW_EPWMXBAR17_DEL28_ACTIVE_SEL << 28) | (MW_EPWMXBAR17_DEL29_ACTIVE_SEL << 29) | (MW_EPWMXBAR17_DEL30_ACTIVE_SEL << 30) | (MW_EPWMXBAR17_DEL31_ACTIVE_SEL << 31);
    group8_epwmxbar[17] = (MW_EPWMXBAR17_EQEP0_ERR_SEL << 0) | (MW_EPWMXBAR17_EQEP1_ERR_SEL << 1) | (MW_EPWMXBAR17_EQEP2_ERR_SEL << 2) | (MW_EPWMXBAR17_FSIRX0_RX_TRIG0_SEL << 3) | (MW_EPWMXBAR17_FSIRX0_RX_TRIG1_SEL << 4) | (MW_EPWMXBAR17_FSIRX0_RX_TRIG2_SEL << 5) | (MW_EPWMXBAR17_FSIRX0_RX_TRIG3_SEL << 6) | (MW_EPWMXBAR17_FSIRX1_RX_TRIG0_SEL << 7) | (MW_EPWMXBAR17_FSIRX1_RX_TRIG1_SEL << 8) | (MW_EPWMXBAR17_FSIRX1_RX_TRIG2_SEL << 9) | (MW_EPWMXBAR17_FSIRX1_RX_TRIG3_SEL << 10) | (MW_EPWMXBAR17_FSIRX2_RX_TRIG0_SEL << 11) | (MW_EPWMXBAR17_FSIRX2_RX_TRIG1_SEL << 12) | (MW_EPWMXBAR17_FSIRX2_RX_TRIG2_SEL << 13) | (MW_EPWMXBAR17_FSIRX2_RX_TRIG3_SEL << 14) | (MW_EPWMXBAR17_FSIRX3_RX_TRIG0_SEL << 15) | (MW_EPWMXBAR17_FSIRX3_RX_TRIG1_SEL << 16) | (MW_EPWMXBAR17_FSIRX3_RX_TRIG2_SEL << 17) | (MW_EPWMXBAR17_FSIRX3_RX_TRIG3_SEL << 18) | (MW_EPWMXBAR17_ECAP0_TRIPOUT_SEL << 19) | (MW_EPWMXBAR17_ECAP1_TRIPOUT_SEL << 20) | (MW_EPWMXBAR17_ECAP2_TRIPOUT_SEL << 21) | (MW_EPWMXBAR17_ECAP3_TRIPOUT_SEL << 22) | (MW_EPWMXBAR17_ECAP4_TRIPOUT_SEL << 23) | (MW_EPWMXBAR17_ECAP5_TRIPOUT_SEL << 24) | (MW_EPWMXBAR17_ECAP6_TRIPOUT_SEL << 25) | (MW_EPWMXBAR17_ECAP7_TRIPOUT_SEL << 26) | (MW_EPWMXBAR17_ECAP8_TRIPOUT_SEL << 27) | (MW_EPWMXBAR17_ECAP9_TRIPOUT_SEL << 28);
    group0_epwmxbar[18] = (MW_EPWMXBAR18_CMPSSA0_CTRIPL_SEL << 0) | (MW_EPWMXBAR18_CMPSSA0_CTRIPH_SEL << 1) | (MW_EPWMXBAR18_CMPSSA1_CTRIPL_SEL << 2) | (MW_EPWMXBAR18_CMPSSA1_CTRIPH_SEL << 3) | (MW_EPWMXBAR18_CMPSSA2_CTRIPL_SEL << 4) | (MW_EPWMXBAR18_CMPSSA2_CTRIPH_SEL << 5) | (MW_EPWMXBAR18_CMPSSA3_CTRIPL_SEL << 6) | (MW_EPWMXBAR18_CMPSSA3_CTRIPH_SEL << 7) | (MW_EPWMXBAR18_CMPSSA4_CTRIPL_SEL << 8) | (MW_EPWMXBAR18_CMPSSA4_CTRIPH_SEL << 9) | (MW_EPWMXBAR18_CMPSSA5_CTRIPL_SEL << 10) | (MW_EPWMXBAR18_CMPSSA5_CTRIPH_SEL << 11) | (MW_EPWMXBAR18_CMPSSA6_CTRIPL_SEL << 12) | (MW_EPWMXBAR18_CMPSSA6_CTRIPH_SEL << 13) | (MW_EPWMXBAR18_CMPSSA7_CTRIPL_SEL << 14) | (MW_EPWMXBAR18_CMPSSA7_CTRIPH_SEL << 15) | (MW_EPWMXBAR18_CMPSSA8_CTRIPL_SEL << 16) | (MW_EPWMXBAR18_CMPSSA8_CTRIPH_SEL << 17) | (MW_EPWMXBAR18_CMPSSA9_CTRIPL_SEL << 18) | (MW_EPWMXBAR18_CMPSSA9_CTRIPH_SEL << 19);
    group1_epwmxbar[18] = (MW_EPWMXBAR18_CMPSSB0_CTRIPL_SEL << 0) | (MW_EPWMXBAR18_CMPSSB0_CTRIPH_SEL << 1) | (MW_EPWMXBAR18_CMPSSB1_CTRIPL_SEL << 2) | (MW_EPWMXBAR18_CMPSSB1_CTRIPH_SEL << 3) | (MW_EPWMXBAR18_CMPSSB2_CTRIPL_SEL << 4) | (MW_EPWMXBAR18_CMPSSB2_CTRIPH_SEL << 5) | (MW_EPWMXBAR18_CMPSSB3_CTRIPL_SEL << 6) | (MW_EPWMXBAR18_CMPSSB3_CTRIPH_SEL << 7) | (MW_EPWMXBAR18_CMPSSB4_CTRIPL_SEL << 8) | (MW_EPWMXBAR18_CMPSSB4_CTRIPH_SEL << 9) | (MW_EPWMXBAR18_CMPSSB5_CTRIPL_SEL << 10) | (MW_EPWMXBAR18_CMPSSB5_CTRIPH_SEL << 11) | (MW_EPWMXBAR18_CMPSSB6_CTRIPL_SEL << 12) | (MW_EPWMXBAR18_CMPSSB6_CTRIPH_SEL << 13) | (MW_EPWMXBAR18_CMPSSB7_CTRIPL_SEL << 14) | (MW_EPWMXBAR18_CMPSSB7_CTRIPH_SEL << 15) | (MW_EPWMXBAR18_CMPSSB8_CTRIPL_SEL << 16) | (MW_EPWMXBAR18_CMPSSB8_CTRIPH_SEL << 17) | (MW_EPWMXBAR18_CMPSSB9_CTRIPL_SEL << 18) | (MW_EPWMXBAR18_CMPSSB9_CTRIPH_SEL << 19);
    group2_epwmxbar[18] = (MW_EPWMXBAR18_SD0_FILT0_CEVT1_SEL << 0) | (MW_EPWMXBAR18_SD0_FILT0_CEVT2_SEL << 1) | (MW_EPWMXBAR18_SD0_FILT0_CMPHZ_SEL << 2) | (MW_EPWMXBAR18_SD0_FILT1_CEVT1_SEL << 3) | (MW_EPWMXBAR18_SD0_FILT1_CEVT2_SEL << 4) | (MW_EPWMXBAR18_SD0_FILT1_CMPHZ_SEL << 5) | (MW_EPWMXBAR18_SD0_FILT2_CEVT1_SEL << 6) | (MW_EPWMXBAR18_SD0_FILT2_CEVT2_SEL << 7) | (MW_EPWMXBAR18_SD0_FILT2_CMPHZ_SEL << 8) | (MW_EPWMXBAR18_SD0_FILT3_CEVT1_SEL << 9) | (MW_EPWMXBAR18_SD0_FILT3_CEVT2_SEL << 10) | (MW_EPWMXBAR18_SD0_FILT3_CMPHZ_SEL << 11) | (MW_EPWMXBAR18_SD1_FILT0_CEVT1_SEL << 12) | (MW_EPWMXBAR18_SD1_FILT0_CEVT2_SEL << 13) | (MW_EPWMXBAR18_SD1_FILT0_CMPHZ_SEL << 14) | (MW_EPWMXBAR18_SD1_FILT1_CEVT1_SEL << 15) | (MW_EPWMXBAR18_SD1_FILT1_CEVT2_SEL << 16) | (MW_EPWMXBAR18_SD1_FILT1_CMPHZ_SEL << 17) | (MW_EPWMXBAR18_SD1_FILT2_CEVT1_SEL << 18) | (MW_EPWMXBAR18_SD1_FILT2_CEVT2_SEL << 19) | (MW_EPWMXBAR18_SD1_FILT2_CMPHZ_SEL << 20) | (MW_EPWMXBAR18_SD1_FILT3_CEVT1_SEL << 21) | (MW_EPWMXBAR18_SD1_FILT3_CEVT2_SEL << 22) | (MW_EPWMXBAR18_SD1_FILT3_CMPHZ_SEL << 23);
    group3_epwmxbar[18] = (MW_EPWMXBAR18_ADC0_EVT1_SEL << 0) | (MW_EPWMXBAR18_ADC0_EVT2_SEL << 1) | (MW_EPWMXBAR18_ADC0_EVT3_SEL << 2) | (MW_EPWMXBAR18_ADC0_EVT4_SEL << 3) | (MW_EPWMXBAR18_ADC1_EVT1_SEL << 4) | (MW_EPWMXBAR18_ADC1_EVT2_SEL << 5) | (MW_EPWMXBAR18_ADC1_EVT3_SEL << 6) | (MW_EPWMXBAR18_ADC1_EVT4_SEL << 7) | (MW_EPWMXBAR18_ADC2_EVT1_SEL << 8) | (MW_EPWMXBAR18_ADC2_EVT2_SEL << 9) | (MW_EPWMXBAR18_ADC2_EVT3_SEL << 10) | (MW_EPWMXBAR18_ADC2_EVT4_SEL << 11) | (MW_EPWMXBAR18_ADC3_EVT1_SEL << 12) | (MW_EPWMXBAR18_ADC3_EVT2_SEL << 13) | (MW_EPWMXBAR18_ADC3_EVT3_SEL << 14) | (MW_EPWMXBAR18_ADC3_EVT4_SEL << 15) | (MW_EPWMXBAR18_ADC4_EVT1_SEL << 16) | (MW_EPWMXBAR18_ADC4_EVT2_SEL << 17) | (MW_EPWMXBAR18_ADC4_EVT3_SEL << 18) | (MW_EPWMXBAR18_ADC4_EVT4_SEL << 19);
    // if(MW_EPWMXBAR18_GPIO0_SEL == 1 | MW_EPWMXBAR18_GPIO1_SEL == 1 | MW_EPWMXBAR18_GPIO2_SEL == 1 | MW_EPWMXBAR18_GPIO3_SEL == 1 | MW_EPWMXBAR18_GPIO4_SEL == 1 | MW_EPWMXBAR18_GPIO5_SEL == 1 | MW_EPWMXBAR18_GPIO6_SEL == 1 | MW_EPWMXBAR18_GPIO7_SEL == 1| MW_EPWMXBAR18_GPIO8_SEL == 1 | MW_EPWMXBAR18_GPIO9_SEL == 1 | MW_EPWMXBAR18_GPIO10_SEL == 1| MW_EPWMXBAR18_GPIO11_SEL == 1| MW_EPWMXBAR18_GPIO12_SEL == 1 | MW_EPWMXBAR18_GPIO13_SEL == 1 | MW_EPWMXBAR18_GPIO14_SEL == 1 | MW_EPWMXBAR18_GPIO15_SEL == 1 | MW_EPWMXBAR18_GPIO16_SEL == 1 | MW_EPWMXBAR18_GPIO17_SEL == 1 | MW_EPWMXBAR18_GPIO18_SEL == 1 | MW_EPWMXBAR18_GPIO19_SEL == 1 | MW_EPWMXBAR18_GPIO20_SEL == 1 | MW_EPWMXBAR18_GPIO21_SEL == 1 | MW_EPWMXBAR18_GPIO22_SEL == 1 | MW_EPWMXBAR18_GPIO23_SEL == 1 | MW_EPWMXBAR18_GPIO24_SEL == 1 | MW_EPWMXBAR18_GPIO25_SEL == 1 | MW_EPWMXBAR18_GPIO26_SEL == 1 | MW_EPWMXBAR18_GPIO27_SEL == 1 | MW_EPWMXBAR18_GPIO28_SEL == 1 | MW_EPWMXBAR18_GPIO29_SEL == 1 | MW_EPWMXBAR18_GPIO30_SEL == 1 | MW_EPWMXBAR18_GPIO31_SEL == 1 | MW_EPWMXBAR18_GPIO32_SEL == 1 | MW_EPWMXBAR18_GPIO33_SEL == 1 | MW_EPWMXBAR18_GPIO34_SEL == 1 | MW_EPWMXBAR18_GPIO35_SEL == 1 | MW_EPWMXBAR18_GPIO36_SEL == 1 | MW_EPWMXBAR18_GPIO37_SEL == 1 | MW_EPWMXBAR18_GPIO38_SEL == 1 | MW_EPWMXBAR18_GPIO39_SEL == 1 | MW_EPWMXBAR18_GPIO40_SEL == 1 | MW_EPWMXBAR18_GPIO41_SEL == 1 | MW_EPWMXBAR18_GPIO42_SEL == 1 | MW_EPWMXBAR18_GPIO43_SEL == 1 | MW_EPWMXBAR18_GPIO44_SEL == 1 | | MW_EPWMXBAR18_GPIO45_SEL == 1 | MW_EPWMXBAR18_GPIO46_SEL == 1 | MW_EPWMXBAR18_GPIO47_SEL == 1| MW_EPWMXBAR18_GPIO48_SEL == 1 | MW_EPWMXBAR18_GPIO49_SEL == 1 | MW_EPWMXBAR18_GPIO50_SEL == 1 | MW_EPWMXBAR18_GPIO51_SEL == 1 | MW_EPWMXBAR18_GPIO52_SEL == 1 | MW_EPWMXBAR18_GPIO53_SEL == 1 | MW_EPWMXBAR18_GPIO54_SEL == 1 | MW_EPWMXBAR18_GPIO55_SEL == 1 | MW_EPWMXBAR18_GPIO56_SEL == 1 | MW_EPWMXBAR18_GPIO57_SEL == 1| MW_EPWMXBAR18_GPIO58_SEL == 1 | MW_EPWMXBAR18_GPIO59_SEL == 1 | MW_EPWMXBAR18_GPIO60_SEL == 1 | MW_EPWMXBAR18_GPIO61_SEL == 1 | MW_EPWMXBAR18_GPIO62_SEL == 1 | MW_EPWMXBAR18_GPIO63_SEL == 1 | MW_EPWMXBAR18_GPIO64_SEL == 1 | | MW_EPWMXBAR18_GPIO59_SEL == 1 | MW_EPWMXBAR18_GPIO60_SEL == 1 | MW_EPWMXBAR18_GPIO61_SEL == 1 | MW_EPWMXBAR18_GPIO62_SEL == 1 | MW_EPWMXBAR18_GPIO63_SEL == 1 | MW_EPWMXBAR18_GPIO64_SEL == 1 | MW_EPWMXBAR18_GPIO65_SEL == 1 | MW_EPWMXBAR18_GPIO66_SEL == 1 | MW_EPWMXBAR18_GPIO67_SEL == 1 | MW_EPWMXBAR18_GPIO68_SEL == 1 | MW_EPWMXBAR18_GPIO69_SEL == 1 | MW_EPWMXBAR18_GPIO70_SEL == 1 | MW_EPWMXBAR18_GPIO71_SEL == 1 | MW_EPWMXBAR18_GPIO72_SEL == 1 | MW_EPWMXBAR18_GPIO73_SEL == 1 | MW_EPWMXBAR18_GPIO74_SEL == 1 | MW_EPWMXBAR18_GPIO75_SEL == 1 | MW_EPWMXBAR18_GPIO76_SEL == 1 | MW_EPWMXBAR18_GPIO77_SEL == 1 | MW_EPWMXBAR18_GPIO78_SEL == 1 | | MW_EPWMXBAR18_GPIO80_SEL == 1 | MW_EPWMXBAR18_GPIO81_SEL == 1 | MW_EPWMXBAR18_GPIO82_SEL == 1 | MW_EPWMXBAR18_GPIO83_SEL == 1 | MW_EPWMXBAR18_GPIO84_SEL == 1 | MW_EPWMXBAR18_GPIO85_SEL == 1 | MW_EPWMXBAR18_GPIO86_SEL == 1 | MW_EPWMXBAR18_GPIO87_SEL == 1 | MW_EPWMXBAR18_GPIO88_SEL == 1 | MW_EPWMXBAR18_GPIO89_SEL == 1 | MW_EPWMXBAR18_GPIO90_SEL == 1 | MW_EPWMXBAR18_GPIO91_SEL == 1 | MW_EPWMXBAR18_GPIO92_SEL == 1 | MW_EPWMXBAR18_GPIO93_SEL == 1 | MW_EPWMXBAR18_GPIO94_SEL == 1 | MW_EPWMXBAR18_GPIO95_SEL == 1 | MW_EPWMXBAR18_GPIO96_SEL == 1 | MW_EPWMXBAR18_GPIO97_SEL == 1 | MW_EPWMXBAR18_GPIO98_SEL == 1 | MW_EPWMXBAR18_GPIO99_SEL == 1 | MW_EPWMXBAR18_GPIO100_SEL == 1 | MW_EPWMXBAR18_GPIO101_SEL == 1 | MW_EPWMXBAR18_GPIO102_SEL == 1 | MW_EPWMXBAR18_GPIO103_SEL == 1 | MW_EPWMXBAR18_GPIO104_SEL == 1 | MW_EPWMXBAR18_GPIO105_SEL == 1 | MW_EPWMXBAR18_GPIO106_SEL == 1 | MW_EPWMXBAR18_GPIO107_SEL == 1 | | MW_EPWMXBAR18_GPIO108_SEL == 1 | MW_EPWMXBAR18_GPIO109_SEL == 1| MW_EPWMXBAR18_GPIO110_SEL == 1 | MW_EPWMXBAR18_GPIO111_SEL == 1 | MW_EPWMXBAR18_GPIO112_SEL == 1 | MW_EPWMXBAR18_GPIO113_SEL == 1 | MW_EPWMXBAR18_GPIO114_SEL == 1 | MW_EPWMXBAR18_GPIO115_SEL == 1 | MW_EPWMXBAR18_GPIO116_SEL == 1 | MW_EPWMXBAR18_GPIO117_SEL == 1 | MW_EPWMXBAR18_GPIO118_SEL == 1 | MW_EPWMXBAR18_GPIO119_SEL == 1 | MW_EPWMXBAR18_GPIO120_SEL == 1 | MW_EPWMXBAR18_GPIO121_SEL == 1 | MW_EPWMXBAR18_GPIO122_SEL == 1 | MW_EPWMXBAR18_GPIO123_SEL == 1 | MW_EPWMXBAR18_GPIO124_SEL == 1 | MW_EPWMXBAR18_GPIO125_SEL == 1 | MW_EPWMXBAR18_GPIO126_SEL == 1 | MW_EPWMXBAR18_GPIO127_SEL == 1 | MW_EPWMXBAR18_GPIO128_SEL == 1 | MW_EPWMXBAR18_GPIO129_SEL == 1 | MW_EPWMXBAR18_GPIO130_SEL == 1 | MW_EPWMXBAR18_GPIO131_SEL == 1 | MW_EPWMXBAR18_GPIO132_SEL == 1 | MW_EPWMXBAR18_GPIO133_SEL == 1 | MW_EPWMXBAR18_GPIO134_SEL == 1 | MW_EPWMXBAR18_GPIO135_SEL == 1 | MW_EPWMXBAR18_GPIO136_SEL == 1 | MW_EPWMXBAR18_GPIO137_SEL == 1 | MW_EPWMXBAR18_GPIO139_SEL == 1 | MW_EPWMXBAR18_GPIO140_SEL == 1 | MW_EPWMXBAR18_GPIO141_SEL == 1 | MW_EPWMXBAR18_GPIO142_SEL == 1 | MW_EPWMXBAR18_GPIO143_SEL == 1 | MW_EPWMXBAR18_ICSSGPO0_PORT0_SEL == 1 | MW_EPWMXBAR18_ICSSGPO1_PORT0_SEL == 1 | MW_EPWMXBAR18_ICSSGPO2_PORT0_SEL == 1 | MW_EPWMXBAR18_ICSSGPO3_PORT0_SEL == 1 | MW_EPWMXBAR18_ICSSGPO4_PORT0_SEL == 1 | MW_EPWMXBAR18_ICSSGPO5_PORT0_SEL == 1 | MW_EPWMXBAR18_ICSSGPO6_PORT0_SEL == 1 | MW_EPWMXBAR18_ICSSGPO7_PORT0_SEL == 1 | MW_EPWMXBAR18_ICSSGPO8_PORT0_SEL == 1 | MW_EPWMXBAR18_ICSSGPO9_PORT0_SEL == 1 | MW_EPWMXBAR18_ICSSGPO10_PORT0_SEL == 1 | MW_EPWMXBAR18_ICSSGPO11_PORT0_SEL == 1 | MW_EPWMXBAR18_ICSSGPO12_PORT0_SEL == 1 | MW_EPWMXBAR18_ICSSGPO13_PORT0_SEL == 1 | MW_EPWMXBAR18_ICSSGPO14_PORT0_SEL == 1 | MW_EPWMXBAR18_ICSSGPO15_PORT0_SEL == 1 | MW_EPWMXBAR18_ICSSGPO0_PORT1_SEL == 1 | MW_EPWMXBAR18_ICSSGPO1_PORT1_SEL == 1 | MW_EPWMXBAR18_ICSSGPO2_PORT1_SEL == 1 | MW_EPWMXBAR18_ICSSGPO3_PORT1_SEL == 1 | MW_EPWMXBAR18_ICSSGPO4_PORT1_SEL == 1 | MW_EPWMXBAR18_ICSSGPO5_PORT1_SEL == 1 | MW_EPWMXBAR18_ICSSGPO6_PORT1_SEL == 1 | MW_EPWMXBAR18_ICSSGPO7_PORT1_SEL == 1 | MW_EPWMXBAR18_ICSSGPO8_PORT1_SEL == 1 | MW_EPWMXBAR18_ICSSGPO9_PORT1_SEL == 1 | MW_EPWMXBAR18_ICSSGPO10_PORT1_SEL == 1 | MW_EPWMXBAR18_ICSSGPO11_PORT1_SEL == 1 | MW_EPWMXBAR18_ICSSGPO12_PORT1_SEL == 1 | MW_EPWMXBAR18_ICSSGPO13_PORT1_SEL == 1 | MW_EPWMXBAR18_ICSSGPO14_PORT1_SEL == 1 | MW_EPWMXBAR18_ICSSGPO15_PORT1_SEL == 1)
    //     group4_epwmxbar[18] = EPWM_XBAR_18;
    // else
        group4_epwmxbar[18] = 0;
    group5_epwmxbar[18] = (MW_EPWMXBAR18_EPWM0_TRIPOUT_SEL << 0) | (MW_EPWMXBAR18_EPWM1_TRIPOUT_SEL << 1) | (MW_EPWMXBAR18_EPWM2_TRIPOUT_SEL << 2) | (MW_EPWMXBAR18_EPWM3_TRIPOUT_SEL << 3) | (MW_EPWMXBAR18_EPWM4_TRIPOUT_SEL << 4) | (MW_EPWMXBAR18_EPWM5_TRIPOUT_SEL << 5) | (MW_EPWMXBAR18_EPWM6_TRIPOUT_SEL << 6) | (MW_EPWMXBAR18_EPWM7_TRIPOUT_SEL << 7) | (MW_EPWMXBAR18_EPWM8_TRIPOUT_SEL << 8) | (MW_EPWMXBAR18_EPWM9_TRIPOUT_SEL << 9) | (MW_EPWMXBAR18_EPWM10_TRIPOUT_SEL << 10) | (MW_EPWMXBAR18_EPWM11_TRIPOUT_SEL << 11) | (MW_EPWMXBAR18_EPWM12_TRIPOUT_SEL << 12) | (MW_EPWMXBAR18_EPWM13_TRIPOUT_SEL << 13) | (MW_EPWMXBAR18_EPWM14_TRIPOUT_SEL << 14) | (MW_EPWMXBAR18_EPWM15_TRIPOUT_SEL << 15) | (MW_EPWMXBAR18_EPWM16_TRIPOUT_SEL << 16) | (MW_EPWMXBAR18_EPWM17_TRIPOUT_SEL << 17) | (MW_EPWMXBAR18_EPWM18_TRIPOUT_SEL << 18) | (MW_EPWMXBAR18_EPWM19_TRIPOUT_SEL << 19) | (MW_EPWMXBAR18_EPWM20_TRIPOUT_SEL << 20) | (MW_EPWMXBAR18_EPWM21_TRIPOUT_SEL << 21) | (MW_EPWMXBAR18_EPWM22_TRIPOUT_SEL << 22) | (MW_EPWMXBAR18_EPWM23_TRIPOUT_SEL << 23) | (MW_EPWMXBAR18_EPWM24_TRIPOUT_SEL << 24) | (MW_EPWMXBAR18_EPWM25_TRIPOUT_SEL << 25) | (MW_EPWMXBAR18_EPWM26_TRIPOUT_SEL << 26) | (MW_EPWMXBAR18_EPWM27_TRIPOUT_SEL << 27) | (MW_EPWMXBAR18_EPWM28_TRIPOUT_SEL << 28) | (MW_EPWMXBAR18_EPWM29_TRIPOUT_SEL << 29) | (MW_EPWMXBAR18_EPWM30_TRIPOUT_SEL << 30) | (MW_EPWMXBAR18_EPWM31_TRIPOUT_SEL << 31);
    group6_epwmxbar[18] = (MW_EPWMXBAR18_DEL0_TRIP_SEL << 0) | (MW_EPWMXBAR18_DEL1_TRIP_SEL << 1) | (MW_EPWMXBAR18_DEL2_TRIP_SEL << 2) | (MW_EPWMXBAR18_DEL3_TRIP_SEL << 3) | (MW_EPWMXBAR18_DEL4_TRIP_SEL << 4) | (MW_EPWMXBAR18_DEL5_TRIP_SEL << 5) | (MW_EPWMXBAR18_DEL6_TRIP_SEL << 6) | (MW_EPWMXBAR18_DEL7_TRIP_SEL << 7) | (MW_EPWMXBAR18_DEL8_TRIP_SEL << 8) | (MW_EPWMXBAR18_DEL9_TRIP_SEL << 9) | (MW_EPWMXBAR18_DEL10_TRIP_SEL << 10) | (MW_EPWMXBAR18_DEL11_TRIP_SEL << 11) | (MW_EPWMXBAR18_DEL12_TRIP_SEL << 12) | (MW_EPWMXBAR18_DEL13_TRIP_SEL << 13) | (MW_EPWMXBAR18_DEL14_TRIP_SEL << 14) | (MW_EPWMXBAR18_DEL15_TRIP_SEL << 15) | (MW_EPWMXBAR18_DEL16_TRIP_SEL << 16) | (MW_EPWMXBAR18_DEL17_TRIP_SEL << 17) | (MW_EPWMXBAR18_DEL18_TRIP_SEL << 18) | (MW_EPWMXBAR18_DEL19_TRIP_SEL << 19) | (MW_EPWMXBAR18_DEL20_TRIP_SEL << 20) | (MW_EPWMXBAR18_DEL21_TRIP_SEL << 21) | (MW_EPWMXBAR18_DEL22_TRIP_SEL << 22) | (MW_EPWMXBAR18_DEL23_TRIP_SEL << 23) | (MW_EPWMXBAR18_DEL24_TRIP_SEL << 24) | (MW_EPWMXBAR18_DEL25_TRIP_SEL << 25) | (MW_EPWMXBAR18_DEL26_TRIP_SEL << 26) | (MW_EPWMXBAR18_DEL27_TRIP_SEL << 27) | (MW_EPWMXBAR18_DEL28_TRIP_SEL << 28) | (MW_EPWMXBAR18_DEL29_TRIP_SEL << 29) | (MW_EPWMXBAR18_DEL30_TRIP_SEL << 30) | (MW_EPWMXBAR18_DEL31_TRIP_SEL << 31);
    group7_epwmxbar[18] = (MW_EPWMXBAR18_DEL0_ACTIVE_SEL << 0) | (MW_EPWMXBAR18_DEL1_ACTIVE_SEL << 1) | (MW_EPWMXBAR18_DEL2_ACTIVE_SEL << 2) | (MW_EPWMXBAR18_DEL3_ACTIVE_SEL << 3) | (MW_EPWMXBAR18_DEL4_ACTIVE_SEL << 4) | (MW_EPWMXBAR18_DEL5_ACTIVE_SEL << 5) | (MW_EPWMXBAR18_DEL6_ACTIVE_SEL << 6) | (MW_EPWMXBAR18_DEL7_ACTIVE_SEL << 7) | (MW_EPWMXBAR18_DEL8_ACTIVE_SEL << 8) | (MW_EPWMXBAR18_DEL9_ACTIVE_SEL << 9) | (MW_EPWMXBAR18_DEL10_ACTIVE_SEL << 10) | (MW_EPWMXBAR18_DEL11_ACTIVE_SEL << 11) | (MW_EPWMXBAR18_DEL12_ACTIVE_SEL << 12) | (MW_EPWMXBAR18_DEL13_ACTIVE_SEL << 13) | (MW_EPWMXBAR18_DEL14_ACTIVE_SEL << 14) | (MW_EPWMXBAR18_DEL15_ACTIVE_SEL << 15) | (MW_EPWMXBAR18_DEL16_ACTIVE_SEL << 16) | (MW_EPWMXBAR18_DEL17_ACTIVE_SEL << 17) | (MW_EPWMXBAR18_DEL18_ACTIVE_SEL << 18) | (MW_EPWMXBAR18_DEL19_ACTIVE_SEL << 19) | (MW_EPWMXBAR18_DEL20_ACTIVE_SEL << 20) | (MW_EPWMXBAR18_DEL21_ACTIVE_SEL << 21) | (MW_EPWMXBAR18_DEL22_ACTIVE_SEL << 22) | (MW_EPWMXBAR18_DEL23_ACTIVE_SEL << 23) | (MW_EPWMXBAR18_DEL24_ACTIVE_SEL << 24) | (MW_EPWMXBAR18_DEL25_ACTIVE_SEL << 25) | (MW_EPWMXBAR18_DEL26_ACTIVE_SEL << 26) | (MW_EPWMXBAR18_DEL27_ACTIVE_SEL << 27) | (MW_EPWMXBAR18_DEL28_ACTIVE_SEL << 28) | (MW_EPWMXBAR18_DEL29_ACTIVE_SEL << 29) | (MW_EPWMXBAR18_DEL30_ACTIVE_SEL << 30) | (MW_EPWMXBAR18_DEL31_ACTIVE_SEL << 31);
    group8_epwmxbar[18] = (MW_EPWMXBAR18_EQEP0_ERR_SEL << 0) | (MW_EPWMXBAR18_EQEP1_ERR_SEL << 1) | (MW_EPWMXBAR18_EQEP2_ERR_SEL << 2) | (MW_EPWMXBAR18_FSIRX0_RX_TRIG0_SEL << 3) | (MW_EPWMXBAR18_FSIRX0_RX_TRIG1_SEL << 4) | (MW_EPWMXBAR18_FSIRX0_RX_TRIG2_SEL << 5) | (MW_EPWMXBAR18_FSIRX0_RX_TRIG3_SEL << 6) | (MW_EPWMXBAR18_FSIRX1_RX_TRIG0_SEL << 7) | (MW_EPWMXBAR18_FSIRX1_RX_TRIG1_SEL << 8) | (MW_EPWMXBAR18_FSIRX1_RX_TRIG2_SEL << 9) | (MW_EPWMXBAR18_FSIRX1_RX_TRIG3_SEL << 10) | (MW_EPWMXBAR18_FSIRX2_RX_TRIG0_SEL << 11) | (MW_EPWMXBAR18_FSIRX2_RX_TRIG1_SEL << 12) | (MW_EPWMXBAR18_FSIRX2_RX_TRIG2_SEL << 13) | (MW_EPWMXBAR18_FSIRX2_RX_TRIG3_SEL << 14) | (MW_EPWMXBAR18_FSIRX3_RX_TRIG0_SEL << 15) | (MW_EPWMXBAR18_FSIRX3_RX_TRIG1_SEL << 16) | (MW_EPWMXBAR18_FSIRX3_RX_TRIG2_SEL << 17) | (MW_EPWMXBAR18_FSIRX3_RX_TRIG3_SEL << 18) | (MW_EPWMXBAR18_ECAP0_TRIPOUT_SEL << 19) | (MW_EPWMXBAR18_ECAP1_TRIPOUT_SEL << 20) | (MW_EPWMXBAR18_ECAP2_TRIPOUT_SEL << 21) | (MW_EPWMXBAR18_ECAP3_TRIPOUT_SEL << 22) | (MW_EPWMXBAR18_ECAP4_TRIPOUT_SEL << 23) | (MW_EPWMXBAR18_ECAP5_TRIPOUT_SEL << 24) | (MW_EPWMXBAR18_ECAP6_TRIPOUT_SEL << 25) | (MW_EPWMXBAR18_ECAP7_TRIPOUT_SEL << 26) | (MW_EPWMXBAR18_ECAP8_TRIPOUT_SEL << 27) | (MW_EPWMXBAR18_ECAP9_TRIPOUT_SEL << 28);
    group0_epwmxbar[19] = (MW_EPWMXBAR19_CMPSSA0_CTRIPL_SEL << 0) | (MW_EPWMXBAR19_CMPSSA0_CTRIPH_SEL << 1) | (MW_EPWMXBAR19_CMPSSA1_CTRIPL_SEL << 2) | (MW_EPWMXBAR19_CMPSSA1_CTRIPH_SEL << 3) | (MW_EPWMXBAR19_CMPSSA2_CTRIPL_SEL << 4) | (MW_EPWMXBAR19_CMPSSA2_CTRIPH_SEL << 5) | (MW_EPWMXBAR19_CMPSSA3_CTRIPL_SEL << 6) | (MW_EPWMXBAR19_CMPSSA3_CTRIPH_SEL << 7) | (MW_EPWMXBAR19_CMPSSA4_CTRIPL_SEL << 8) | (MW_EPWMXBAR19_CMPSSA4_CTRIPH_SEL << 9) | (MW_EPWMXBAR19_CMPSSA5_CTRIPL_SEL << 10) | (MW_EPWMXBAR19_CMPSSA5_CTRIPH_SEL << 11) | (MW_EPWMXBAR19_CMPSSA6_CTRIPL_SEL << 12) | (MW_EPWMXBAR19_CMPSSA6_CTRIPH_SEL << 13) | (MW_EPWMXBAR19_CMPSSA7_CTRIPL_SEL << 14) | (MW_EPWMXBAR19_CMPSSA7_CTRIPH_SEL << 15) | (MW_EPWMXBAR19_CMPSSA8_CTRIPL_SEL << 16) | (MW_EPWMXBAR19_CMPSSA8_CTRIPH_SEL << 17) | (MW_EPWMXBAR19_CMPSSA9_CTRIPL_SEL << 18) | (MW_EPWMXBAR19_CMPSSA9_CTRIPH_SEL << 19);
    group1_epwmxbar[19] = (MW_EPWMXBAR19_CMPSSB0_CTRIPL_SEL << 0) | (MW_EPWMXBAR19_CMPSSB0_CTRIPH_SEL << 1) | (MW_EPWMXBAR19_CMPSSB1_CTRIPL_SEL << 2) | (MW_EPWMXBAR19_CMPSSB1_CTRIPH_SEL << 3) | (MW_EPWMXBAR19_CMPSSB2_CTRIPL_SEL << 4) | (MW_EPWMXBAR19_CMPSSB2_CTRIPH_SEL << 5) | (MW_EPWMXBAR19_CMPSSB3_CTRIPL_SEL << 6) | (MW_EPWMXBAR19_CMPSSB3_CTRIPH_SEL << 7) | (MW_EPWMXBAR19_CMPSSB4_CTRIPL_SEL << 8) | (MW_EPWMXBAR19_CMPSSB4_CTRIPH_SEL << 9) | (MW_EPWMXBAR19_CMPSSB5_CTRIPL_SEL << 10) | (MW_EPWMXBAR19_CMPSSB5_CTRIPH_SEL << 11) | (MW_EPWMXBAR19_CMPSSB6_CTRIPL_SEL << 12) | (MW_EPWMXBAR19_CMPSSB6_CTRIPH_SEL << 13) | (MW_EPWMXBAR19_CMPSSB7_CTRIPL_SEL << 14) | (MW_EPWMXBAR19_CMPSSB7_CTRIPH_SEL << 15) | (MW_EPWMXBAR19_CMPSSB8_CTRIPL_SEL << 16) | (MW_EPWMXBAR19_CMPSSB8_CTRIPH_SEL << 17) | (MW_EPWMXBAR19_CMPSSB9_CTRIPL_SEL << 18) | (MW_EPWMXBAR19_CMPSSB9_CTRIPH_SEL << 19);
    group2_epwmxbar[19] = (MW_EPWMXBAR19_SD0_FILT0_CEVT1_SEL << 0) | (MW_EPWMXBAR19_SD0_FILT0_CEVT2_SEL << 1) | (MW_EPWMXBAR19_SD0_FILT0_CMPHZ_SEL << 2) | (MW_EPWMXBAR19_SD0_FILT1_CEVT1_SEL << 3) | (MW_EPWMXBAR19_SD0_FILT1_CEVT2_SEL << 4) | (MW_EPWMXBAR19_SD0_FILT1_CMPHZ_SEL << 5) | (MW_EPWMXBAR19_SD0_FILT2_CEVT1_SEL << 6) | (MW_EPWMXBAR19_SD0_FILT2_CEVT2_SEL << 7) | (MW_EPWMXBAR19_SD0_FILT2_CMPHZ_SEL << 8) | (MW_EPWMXBAR19_SD0_FILT3_CEVT1_SEL << 9) | (MW_EPWMXBAR19_SD0_FILT3_CEVT2_SEL << 10) | (MW_EPWMXBAR19_SD0_FILT3_CMPHZ_SEL << 11) | (MW_EPWMXBAR19_SD1_FILT0_CEVT1_SEL << 12) | (MW_EPWMXBAR19_SD1_FILT0_CEVT2_SEL << 13) | (MW_EPWMXBAR19_SD1_FILT0_CMPHZ_SEL << 14) | (MW_EPWMXBAR19_SD1_FILT1_CEVT1_SEL << 15) | (MW_EPWMXBAR19_SD1_FILT1_CEVT2_SEL << 16) | (MW_EPWMXBAR19_SD1_FILT1_CMPHZ_SEL << 17) | (MW_EPWMXBAR19_SD1_FILT2_CEVT1_SEL << 18) | (MW_EPWMXBAR19_SD1_FILT2_CEVT2_SEL << 19) | (MW_EPWMXBAR19_SD1_FILT2_CMPHZ_SEL << 20) | (MW_EPWMXBAR19_SD1_FILT3_CEVT1_SEL << 21) | (MW_EPWMXBAR19_SD1_FILT3_CEVT2_SEL << 22) | (MW_EPWMXBAR19_SD1_FILT3_CMPHZ_SEL << 23);
    group3_epwmxbar[19] = (MW_EPWMXBAR19_ADC0_EVT1_SEL << 0) | (MW_EPWMXBAR19_ADC0_EVT2_SEL << 1) | (MW_EPWMXBAR19_ADC0_EVT3_SEL << 2) | (MW_EPWMXBAR19_ADC0_EVT4_SEL << 3) | (MW_EPWMXBAR19_ADC1_EVT1_SEL << 4) | (MW_EPWMXBAR19_ADC1_EVT2_SEL << 5) | (MW_EPWMXBAR19_ADC1_EVT3_SEL << 6) | (MW_EPWMXBAR19_ADC1_EVT4_SEL << 7) | (MW_EPWMXBAR19_ADC2_EVT1_SEL << 8) | (MW_EPWMXBAR19_ADC2_EVT2_SEL << 9) | (MW_EPWMXBAR19_ADC2_EVT3_SEL << 10) | (MW_EPWMXBAR19_ADC2_EVT4_SEL << 11) | (MW_EPWMXBAR19_ADC3_EVT1_SEL << 12) | (MW_EPWMXBAR19_ADC3_EVT2_SEL << 13) | (MW_EPWMXBAR19_ADC3_EVT3_SEL << 14) | (MW_EPWMXBAR19_ADC3_EVT4_SEL << 15) | (MW_EPWMXBAR19_ADC4_EVT1_SEL << 16) | (MW_EPWMXBAR19_ADC4_EVT2_SEL << 17) | (MW_EPWMXBAR19_ADC4_EVT3_SEL << 18) | (MW_EPWMXBAR19_ADC4_EVT4_SEL << 19);
