TexasInstruments/am26x-hsp/src/am263px_init.c
    // if(MW_EPWMXBAR19_GPIO0_SEL == 1 | MW_EPWMXBAR19_GPIO1_SEL == 1 | MW_EPWMXBAR19_GPIO2_SEL == 1 | MW_EPWMXBAR19_GPIO3_SEL == 1 | MW_EPWMXBAR19_GPIO4_SEL == 1 | MW_EPWMXBAR19_GPIO5_SEL == 1 | MW_EPWMXBAR19_GPIO6_SEL == 1 | MW_EPWMXBAR19_GPIO7_SEL == 1| MW_EPWMXBAR19_GPIO8_SEL == 1 | MW_EPWMXBAR19_GPIO9_SEL == 1 | MW_EPWMXBAR19_GPIO10_SEL == 1| MW_EPWMXBAR19_GPIO11_SEL == 1| MW_EPWMXBAR19_GPIO12_SEL == 1 | MW_EPWMXBAR19_GPIO13_SEL == 1 | MW_EPWMXBAR19_GPIO14_SEL == 1 | MW_EPWMXBAR19_GPIO15_SEL == 1 | MW_EPWMXBAR19_GPIO16_SEL == 1 | MW_EPWMXBAR19_GPIO17_SEL == 1 | MW_EPWMXBAR19_GPIO18_SEL == 1 | MW_EPWMXBAR19_GPIO19_SEL == 1 | MW_EPWMXBAR19_GPIO20_SEL == 1 | MW_EPWMXBAR19_GPIO21_SEL == 1 | MW_EPWMXBAR19_GPIO22_SEL == 1 | MW_EPWMXBAR19_GPIO23_SEL == 1 | MW_EPWMXBAR19_GPIO24_SEL == 1 | MW_EPWMXBAR19_GPIO25_SEL == 1 | MW_EPWMXBAR19_GPIO26_SEL == 1 | MW_EPWMXBAR19_GPIO27_SEL == 1 | MW_EPWMXBAR19_GPIO28_SEL == 1 | MW_EPWMXBAR19_GPIO29_SEL == 1 | MW_EPWMXBAR19_GPIO30_SEL == 1 | MW_EPWMXBAR19_GPIO31_SEL == 1 | MW_EPWMXBAR19_GPIO32_SEL == 1 | MW_EPWMXBAR19_GPIO33_SEL == 1 | MW_EPWMXBAR19_GPIO34_SEL == 1 | MW_EPWMXBAR19_GPIO35_SEL == 1 | MW_EPWMXBAR19_GPIO36_SEL == 1 | MW_EPWMXBAR19_GPIO37_SEL == 1 | MW_EPWMXBAR19_GPIO38_SEL == 1 | MW_EPWMXBAR19_GPIO39_SEL == 1 | MW_EPWMXBAR19_GPIO40_SEL == 1 | MW_EPWMXBAR19_GPIO41_SEL == 1 | MW_EPWMXBAR19_GPIO42_SEL == 1 | MW_EPWMXBAR19_GPIO43_SEL == 1 | MW_EPWMXBAR19_GPIO44_SEL == 1 | | MW_EPWMXBAR19_GPIO45_SEL == 1 | MW_EPWMXBAR19_GPIO46_SEL == 1 | MW_EPWMXBAR19_GPIO47_SEL == 1| MW_EPWMXBAR19_GPIO48_SEL == 1 | MW_EPWMXBAR19_GPIO49_SEL == 1 | MW_EPWMXBAR19_GPIO50_SEL == 1 | MW_EPWMXBAR19_GPIO51_SEL == 1 | MW_EPWMXBAR19_GPIO52_SEL == 1 | MW_EPWMXBAR19_GPIO53_SEL == 1 | MW_EPWMXBAR19_GPIO54_SEL == 1 | MW_EPWMXBAR19_GPIO55_SEL == 1 | MW_EPWMXBAR19_GPIO56_SEL == 1 | MW_EPWMXBAR19_GPIO57_SEL == 1| MW_EPWMXBAR19_GPIO58_SEL == 1 | MW_EPWMXBAR19_GPIO59_SEL == 1 | MW_EPWMXBAR19_GPIO60_SEL == 1 | MW_EPWMXBAR19_GPIO61_SEL == 1 | MW_EPWMXBAR19_GPIO62_SEL == 1 | MW_EPWMXBAR19_GPIO63_SEL == 1 | MW_EPWMXBAR19_GPIO64_SEL == 1 | | MW_EPWMXBAR19_GPIO59_SEL == 1 | MW_EPWMXBAR19_GPIO60_SEL == 1 | MW_EPWMXBAR19_GPIO61_SEL == 1 | MW_EPWMXBAR19_GPIO62_SEL == 1 | MW_EPWMXBAR19_GPIO63_SEL == 1 | MW_EPWMXBAR19_GPIO64_SEL == 1 | MW_EPWMXBAR19_GPIO65_SEL == 1 | MW_EPWMXBAR19_GPIO66_SEL == 1 | MW_EPWMXBAR19_GPIO67_SEL == 1 | MW_EPWMXBAR19_GPIO68_SEL == 1 | MW_EPWMXBAR19_GPIO69_SEL == 1 | MW_EPWMXBAR19_GPIO70_SEL == 1 | MW_EPWMXBAR19_GPIO71_SEL == 1 | MW_EPWMXBAR19_GPIO72_SEL == 1 | MW_EPWMXBAR19_GPIO73_SEL == 1 | MW_EPWMXBAR19_GPIO74_SEL == 1 | MW_EPWMXBAR19_GPIO75_SEL == 1 | MW_EPWMXBAR19_GPIO76_SEL == 1 | MW_EPWMXBAR19_GPIO77_SEL == 1 | MW_EPWMXBAR19_GPIO78_SEL == 1 | | MW_EPWMXBAR19_GPIO80_SEL == 1 | MW_EPWMXBAR19_GPIO81_SEL == 1 | MW_EPWMXBAR19_GPIO82_SEL == 1 | MW_EPWMXBAR19_GPIO83_SEL == 1 | MW_EPWMXBAR19_GPIO84_SEL == 1 | MW_EPWMXBAR19_GPIO85_SEL == 1 | MW_EPWMXBAR19_GPIO86_SEL == 1 | MW_EPWMXBAR19_GPIO87_SEL == 1 | MW_EPWMXBAR19_GPIO88_SEL == 1 | MW_EPWMXBAR19_GPIO89_SEL == 1 | MW_EPWMXBAR19_GPIO90_SEL == 1 | MW_EPWMXBAR19_GPIO91_SEL == 1 | MW_EPWMXBAR19_GPIO92_SEL == 1 | MW_EPWMXBAR19_GPIO93_SEL == 1 | MW_EPWMXBAR19_GPIO94_SEL == 1 | MW_EPWMXBAR19_GPIO95_SEL == 1 | MW_EPWMXBAR19_GPIO96_SEL == 1 | MW_EPWMXBAR19_GPIO97_SEL == 1 | MW_EPWMXBAR19_GPIO98_SEL == 1 | MW_EPWMXBAR19_GPIO99_SEL == 1 | MW_EPWMXBAR19_GPIO100_SEL == 1 | MW_EPWMXBAR19_GPIO101_SEL == 1 | MW_EPWMXBAR19_GPIO102_SEL == 1 | MW_EPWMXBAR19_GPIO103_SEL == 1 | MW_EPWMXBAR19_GPIO104_SEL == 1 | MW_EPWMXBAR19_GPIO105_SEL == 1 | MW_EPWMXBAR19_GPIO106_SEL == 1 | MW_EPWMXBAR19_GPIO107_SEL == 1 | | MW_EPWMXBAR19_GPIO108_SEL == 1 | MW_EPWMXBAR19_GPIO109_SEL == 1| MW_EPWMXBAR19_GPIO110_SEL == 1 | MW_EPWMXBAR19_GPIO111_SEL == 1 | MW_EPWMXBAR19_GPIO112_SEL == 1 | MW_EPWMXBAR19_GPIO113_SEL == 1 | MW_EPWMXBAR19_GPIO114_SEL == 1 | MW_EPWMXBAR19_GPIO115_SEL == 1 | MW_EPWMXBAR19_GPIO116_SEL == 1 | MW_EPWMXBAR19_GPIO117_SEL == 1 | MW_EPWMXBAR19_GPIO118_SEL == 1 | MW_EPWMXBAR19_GPIO119_SEL == 1 | MW_EPWMXBAR19_GPIO120_SEL == 1 | MW_EPWMXBAR19_GPIO121_SEL == 1 | MW_EPWMXBAR19_GPIO122_SEL == 1 | MW_EPWMXBAR19_GPIO123_SEL == 1 | MW_EPWMXBAR19_GPIO124_SEL == 1 | MW_EPWMXBAR19_GPIO125_SEL == 1 | MW_EPWMXBAR19_GPIO126_SEL == 1 | MW_EPWMXBAR19_GPIO127_SEL == 1 | MW_EPWMXBAR19_GPIO128_SEL == 1 | MW_EPWMXBAR19_GPIO129_SEL == 1 | MW_EPWMXBAR19_GPIO130_SEL == 1 | MW_EPWMXBAR19_GPIO131_SEL == 1 | MW_EPWMXBAR19_GPIO132_SEL == 1 | MW_EPWMXBAR19_GPIO133_SEL == 1 | MW_EPWMXBAR19_GPIO134_SEL == 1 | MW_EPWMXBAR19_GPIO135_SEL == 1 | MW_EPWMXBAR19_GPIO136_SEL == 1 | MW_EPWMXBAR19_GPIO137_SEL == 1 | MW_EPWMXBAR19_GPIO139_SEL == 1 | MW_EPWMXBAR19_GPIO140_SEL == 1 | MW_EPWMXBAR19_GPIO141_SEL == 1 | MW_EPWMXBAR19_GPIO142_SEL == 1 | MW_EPWMXBAR19_GPIO143_SEL == 1 | MW_EPWMXBAR19_ICSSGPO0_PORT0_SEL == 1 | MW_EPWMXBAR19_ICSSGPO1_PORT0_SEL == 1 | MW_EPWMXBAR19_ICSSGPO2_PORT0_SEL == 1 | MW_EPWMXBAR19_ICSSGPO3_PORT0_SEL == 1 | MW_EPWMXBAR19_ICSSGPO4_PORT0_SEL == 1 | MW_EPWMXBAR19_ICSSGPO5_PORT0_SEL == 1 | MW_EPWMXBAR19_ICSSGPO6_PORT0_SEL == 1 | MW_EPWMXBAR19_ICSSGPO7_PORT0_SEL == 1 | MW_EPWMXBAR19_ICSSGPO8_PORT0_SEL == 1 | MW_EPWMXBAR19_ICSSGPO9_PORT0_SEL == 1 | MW_EPWMXBAR19_ICSSGPO10_PORT0_SEL == 1 | MW_EPWMXBAR19_ICSSGPO11_PORT0_SEL == 1 | MW_EPWMXBAR19_ICSSGPO12_PORT0_SEL == 1 | MW_EPWMXBAR19_ICSSGPO13_PORT0_SEL == 1 | MW_EPWMXBAR19_ICSSGPO14_PORT0_SEL == 1 | MW_EPWMXBAR19_ICSSGPO15_PORT0_SEL == 1 | MW_EPWMXBAR19_ICSSGPO0_PORT1_SEL == 1 | MW_EPWMXBAR19_ICSSGPO1_PORT1_SEL == 1 | MW_EPWMXBAR19_ICSSGPO2_PORT1_SEL == 1 | MW_EPWMXBAR19_ICSSGPO3_PORT1_SEL == 1 | MW_EPWMXBAR19_ICSSGPO4_PORT1_SEL == 1 | MW_EPWMXBAR19_ICSSGPO5_PORT1_SEL == 1 | MW_EPWMXBAR19_ICSSGPO6_PORT1_SEL == 1 | MW_EPWMXBAR19_ICSSGPO7_PORT1_SEL == 1 | MW_EPWMXBAR19_ICSSGPO8_PORT1_SEL == 1 | MW_EPWMXBAR19_ICSSGPO9_PORT1_SEL == 1 | MW_EPWMXBAR19_ICSSGPO10_PORT1_SEL == 1 | MW_EPWMXBAR19_ICSSGPO11_PORT1_SEL == 1 | MW_EPWMXBAR19_ICSSGPO12_PORT1_SEL == 1 | MW_EPWMXBAR19_ICSSGPO13_PORT1_SEL == 1 | MW_EPWMXBAR19_ICSSGPO14_PORT1_SEL == 1 | MW_EPWMXBAR19_ICSSGPO15_PORT1_SEL == 1)
    //     group4_epwmxbar[19] = EPWM_XBAR_19;
    // else
        group4_epwmxbar[19] = 0;
    group5_epwmxbar[19] = (MW_EPWMXBAR19_EPWM0_TRIPOUT_SEL << 0) | (MW_EPWMXBAR19_EPWM1_TRIPOUT_SEL << 1) | (MW_EPWMXBAR19_EPWM2_TRIPOUT_SEL << 2) | (MW_EPWMXBAR19_EPWM3_TRIPOUT_SEL << 3) | (MW_EPWMXBAR19_EPWM4_TRIPOUT_SEL << 4) | (MW_EPWMXBAR19_EPWM5_TRIPOUT_SEL << 5) | (MW_EPWMXBAR19_EPWM6_TRIPOUT_SEL << 6) | (MW_EPWMXBAR19_EPWM7_TRIPOUT_SEL << 7) | (MW_EPWMXBAR19_EPWM8_TRIPOUT_SEL << 8) | (MW_EPWMXBAR19_EPWM9_TRIPOUT_SEL << 9) | (MW_EPWMXBAR19_EPWM10_TRIPOUT_SEL << 10) | (MW_EPWMXBAR19_EPWM11_TRIPOUT_SEL << 11) | (MW_EPWMXBAR19_EPWM12_TRIPOUT_SEL << 12) | (MW_EPWMXBAR19_EPWM13_TRIPOUT_SEL << 13) | (MW_EPWMXBAR19_EPWM14_TRIPOUT_SEL << 14) | (MW_EPWMXBAR19_EPWM15_TRIPOUT_SEL << 15) | (MW_EPWMXBAR19_EPWM16_TRIPOUT_SEL << 16) | (MW_EPWMXBAR19_EPWM17_TRIPOUT_SEL << 17) | (MW_EPWMXBAR19_EPWM18_TRIPOUT_SEL << 18) | (MW_EPWMXBAR19_EPWM19_TRIPOUT_SEL << 19) | (MW_EPWMXBAR19_EPWM20_TRIPOUT_SEL << 20) | (MW_EPWMXBAR19_EPWM21_TRIPOUT_SEL << 21) | (MW_EPWMXBAR19_EPWM22_TRIPOUT_SEL << 22) | (MW_EPWMXBAR19_EPWM23_TRIPOUT_SEL << 23) | (MW_EPWMXBAR19_EPWM24_TRIPOUT_SEL << 24) | (MW_EPWMXBAR19_EPWM25_TRIPOUT_SEL << 25) | (MW_EPWMXBAR19_EPWM26_TRIPOUT_SEL << 26) | (MW_EPWMXBAR19_EPWM27_TRIPOUT_SEL << 27) | (MW_EPWMXBAR19_EPWM28_TRIPOUT_SEL << 28) | (MW_EPWMXBAR19_EPWM29_TRIPOUT_SEL << 29) | (MW_EPWMXBAR19_EPWM30_TRIPOUT_SEL << 30) | (MW_EPWMXBAR19_EPWM31_TRIPOUT_SEL << 31);
    group6_epwmxbar[19] = (MW_EPWMXBAR19_DEL0_TRIP_SEL << 0) | (MW_EPWMXBAR19_DEL1_TRIP_SEL << 1) | (MW_EPWMXBAR19_DEL2_TRIP_SEL << 2) | (MW_EPWMXBAR19_DEL3_TRIP_SEL << 3) | (MW_EPWMXBAR19_DEL4_TRIP_SEL << 4) | (MW_EPWMXBAR19_DEL5_TRIP_SEL << 5) | (MW_EPWMXBAR19_DEL6_TRIP_SEL << 6) | (MW_EPWMXBAR19_DEL7_TRIP_SEL << 7) | (MW_EPWMXBAR19_DEL8_TRIP_SEL << 8) | (MW_EPWMXBAR19_DEL9_TRIP_SEL << 9) | (MW_EPWMXBAR19_DEL10_TRIP_SEL << 10) | (MW_EPWMXBAR19_DEL11_TRIP_SEL << 11) | (MW_EPWMXBAR19_DEL12_TRIP_SEL << 12) | (MW_EPWMXBAR19_DEL13_TRIP_SEL << 13) | (MW_EPWMXBAR19_DEL14_TRIP_SEL << 14) | (MW_EPWMXBAR19_DEL15_TRIP_SEL << 15) | (MW_EPWMXBAR19_DEL16_TRIP_SEL << 16) | (MW_EPWMXBAR19_DEL17_TRIP_SEL << 17) | (MW_EPWMXBAR19_DEL18_TRIP_SEL << 18) | (MW_EPWMXBAR19_DEL19_TRIP_SEL << 19) | (MW_EPWMXBAR19_DEL20_TRIP_SEL << 20) | (MW_EPWMXBAR19_DEL21_TRIP_SEL << 21) | (MW_EPWMXBAR19_DEL22_TRIP_SEL << 22) | (MW_EPWMXBAR19_DEL23_TRIP_SEL << 23) | (MW_EPWMXBAR19_DEL24_TRIP_SEL << 24) | (MW_EPWMXBAR19_DEL25_TRIP_SEL << 25) | (MW_EPWMXBAR19_DEL26_TRIP_SEL << 26) | (MW_EPWMXBAR19_DEL27_TRIP_SEL << 27) | (MW_EPWMXBAR19_DEL28_TRIP_SEL << 28) | (MW_EPWMXBAR19_DEL29_TRIP_SEL << 29) | (MW_EPWMXBAR19_DEL30_TRIP_SEL << 30) | (MW_EPWMXBAR19_DEL31_TRIP_SEL << 31);
    group7_epwmxbar[19] = (MW_EPWMXBAR19_DEL0_ACTIVE_SEL << 0) | (MW_EPWMXBAR19_DEL1_ACTIVE_SEL << 1) | (MW_EPWMXBAR19_DEL2_ACTIVE_SEL << 2) | (MW_EPWMXBAR19_DEL3_ACTIVE_SEL << 3) | (MW_EPWMXBAR19_DEL4_ACTIVE_SEL << 4) | (MW_EPWMXBAR19_DEL5_ACTIVE_SEL << 5) | (MW_EPWMXBAR19_DEL6_ACTIVE_SEL << 6) | (MW_EPWMXBAR19_DEL7_ACTIVE_SEL << 7) | (MW_EPWMXBAR19_DEL8_ACTIVE_SEL << 8) | (MW_EPWMXBAR19_DEL9_ACTIVE_SEL << 9) | (MW_EPWMXBAR19_DEL10_ACTIVE_SEL << 10) | (MW_EPWMXBAR19_DEL11_ACTIVE_SEL << 11) | (MW_EPWMXBAR19_DEL12_ACTIVE_SEL << 12) | (MW_EPWMXBAR19_DEL13_ACTIVE_SEL << 13) | (MW_EPWMXBAR19_DEL14_ACTIVE_SEL << 14) | (MW_EPWMXBAR19_DEL15_ACTIVE_SEL << 15) | (MW_EPWMXBAR19_DEL16_ACTIVE_SEL << 16) | (MW_EPWMXBAR19_DEL17_ACTIVE_SEL << 17) | (MW_EPWMXBAR19_DEL18_ACTIVE_SEL << 18) | (MW_EPWMXBAR19_DEL19_ACTIVE_SEL << 19) | (MW_EPWMXBAR19_DEL20_ACTIVE_SEL << 20) | (MW_EPWMXBAR19_DEL21_ACTIVE_SEL << 21) | (MW_EPWMXBAR19_DEL22_ACTIVE_SEL << 22) | (MW_EPWMXBAR19_DEL23_ACTIVE_SEL << 23) | (MW_EPWMXBAR19_DEL24_ACTIVE_SEL << 24) | (MW_EPWMXBAR19_DEL25_ACTIVE_SEL << 25) | (MW_EPWMXBAR19_DEL26_ACTIVE_SEL << 26) | (MW_EPWMXBAR19_DEL27_ACTIVE_SEL << 27) | (MW_EPWMXBAR19_DEL28_ACTIVE_SEL << 28) | (MW_EPWMXBAR19_DEL29_ACTIVE_SEL << 29) | (MW_EPWMXBAR19_DEL30_ACTIVE_SEL << 30) | (MW_EPWMXBAR19_DEL31_ACTIVE_SEL << 31);
    group8_epwmxbar[19] = (MW_EPWMXBAR19_EQEP0_ERR_SEL << 0) | (MW_EPWMXBAR19_EQEP1_ERR_SEL << 1) | (MW_EPWMXBAR19_EQEP2_ERR_SEL << 2) | (MW_EPWMXBAR19_FSIRX0_RX_TRIG0_SEL << 3) | (MW_EPWMXBAR19_FSIRX0_RX_TRIG1_SEL << 4) | (MW_EPWMXBAR19_FSIRX0_RX_TRIG2_SEL << 5) | (MW_EPWMXBAR19_FSIRX0_RX_TRIG3_SEL << 6) | (MW_EPWMXBAR19_FSIRX1_RX_TRIG0_SEL << 7) | (MW_EPWMXBAR19_FSIRX1_RX_TRIG1_SEL << 8) | (MW_EPWMXBAR19_FSIRX1_RX_TRIG2_SEL << 9) | (MW_EPWMXBAR19_FSIRX1_RX_TRIG3_SEL << 10) | (MW_EPWMXBAR19_FSIRX2_RX_TRIG0_SEL << 11) | (MW_EPWMXBAR19_FSIRX2_RX_TRIG1_SEL << 12) | (MW_EPWMXBAR19_FSIRX2_RX_TRIG2_SEL << 13) | (MW_EPWMXBAR19_FSIRX2_RX_TRIG3_SEL << 14) | (MW_EPWMXBAR19_FSIRX3_RX_TRIG0_SEL << 15) | (MW_EPWMXBAR19_FSIRX3_RX_TRIG1_SEL << 16) | (MW_EPWMXBAR19_FSIRX3_RX_TRIG2_SEL << 17) | (MW_EPWMXBAR19_FSIRX3_RX_TRIG3_SEL << 18) | (MW_EPWMXBAR19_ECAP0_TRIPOUT_SEL << 19) | (MW_EPWMXBAR19_ECAP1_TRIPOUT_SEL << 20) | (MW_EPWMXBAR19_ECAP2_TRIPOUT_SEL << 21) | (MW_EPWMXBAR19_ECAP3_TRIPOUT_SEL << 22) | (MW_EPWMXBAR19_ECAP4_TRIPOUT_SEL << 23) | (MW_EPWMXBAR19_ECAP5_TRIPOUT_SEL << 24) | (MW_EPWMXBAR19_ECAP6_TRIPOUT_SEL << 25) | (MW_EPWMXBAR19_ECAP7_TRIPOUT_SEL << 26) | (MW_EPWMXBAR19_ECAP8_TRIPOUT_SEL << 27) | (MW_EPWMXBAR19_ECAP9_TRIPOUT_SEL << 28);
    group0_epwmxbar[20] = (MW_EPWMXBAR20_CMPSSA0_CTRIPL_SEL << 0) | (MW_EPWMXBAR20_CMPSSA0_CTRIPH_SEL << 1) | (MW_EPWMXBAR20_CMPSSA1_CTRIPL_SEL << 2) | (MW_EPWMXBAR20_CMPSSA1_CTRIPH_SEL << 3) | (MW_EPWMXBAR20_CMPSSA2_CTRIPL_SEL << 4) | (MW_EPWMXBAR20_CMPSSA2_CTRIPH_SEL << 5) | (MW_EPWMXBAR20_CMPSSA3_CTRIPL_SEL << 6) | (MW_EPWMXBAR20_CMPSSA3_CTRIPH_SEL << 7) | (MW_EPWMXBAR20_CMPSSA4_CTRIPL_SEL << 8) | (MW_EPWMXBAR20_CMPSSA4_CTRIPH_SEL << 9) | (MW_EPWMXBAR20_CMPSSA5_CTRIPL_SEL << 10) | (MW_EPWMXBAR20_CMPSSA5_CTRIPH_SEL << 11) | (MW_EPWMXBAR20_CMPSSA6_CTRIPL_SEL << 12) | (MW_EPWMXBAR20_CMPSSA6_CTRIPH_SEL << 13) | (MW_EPWMXBAR20_CMPSSA7_CTRIPL_SEL << 14) | (MW_EPWMXBAR20_CMPSSA7_CTRIPH_SEL << 15) | (MW_EPWMXBAR20_CMPSSA8_CTRIPL_SEL << 16) | (MW_EPWMXBAR20_CMPSSA8_CTRIPH_SEL << 17) | (MW_EPWMXBAR20_CMPSSA9_CTRIPL_SEL << 18) | (MW_EPWMXBAR20_CMPSSA9_CTRIPH_SEL << 19);
    group1_epwmxbar[20] = (MW_EPWMXBAR20_CMPSSB0_CTRIPL_SEL << 0) | (MW_EPWMXBAR20_CMPSSB0_CTRIPH_SEL << 1) | (MW_EPWMXBAR20_CMPSSB1_CTRIPL_SEL << 2) | (MW_EPWMXBAR20_CMPSSB1_CTRIPH_SEL << 3) | (MW_EPWMXBAR20_CMPSSB2_CTRIPL_SEL << 4) | (MW_EPWMXBAR20_CMPSSB2_CTRIPH_SEL << 5) | (MW_EPWMXBAR20_CMPSSB3_CTRIPL_SEL << 6) | (MW_EPWMXBAR20_CMPSSB3_CTRIPH_SEL << 7) | (MW_EPWMXBAR20_CMPSSB4_CTRIPL_SEL << 8) | (MW_EPWMXBAR20_CMPSSB4_CTRIPH_SEL << 9) | (MW_EPWMXBAR20_CMPSSB5_CTRIPL_SEL << 10) | (MW_EPWMXBAR20_CMPSSB5_CTRIPH_SEL << 11) | (MW_EPWMXBAR20_CMPSSB6_CTRIPL_SEL << 12) | (MW_EPWMXBAR20_CMPSSB6_CTRIPH_SEL << 13) | (MW_EPWMXBAR20_CMPSSB7_CTRIPL_SEL << 14) | (MW_EPWMXBAR20_CMPSSB7_CTRIPH_SEL << 15) | (MW_EPWMXBAR20_CMPSSB8_CTRIPL_SEL << 16) | (MW_EPWMXBAR20_CMPSSB8_CTRIPH_SEL << 17) | (MW_EPWMXBAR20_CMPSSB9_CTRIPL_SEL << 18) | (MW_EPWMXBAR20_CMPSSB9_CTRIPH_SEL << 19);
    group2_epwmxbar[20] = (MW_EPWMXBAR20_SD0_FILT0_CEVT1_SEL << 0) | (MW_EPWMXBAR20_SD0_FILT0_CEVT2_SEL << 1) | (MW_EPWMXBAR20_SD0_FILT0_CMPHZ_SEL << 2) | (MW_EPWMXBAR20_SD0_FILT1_CEVT1_SEL << 3) | (MW_EPWMXBAR20_SD0_FILT1_CEVT2_SEL << 4) | (MW_EPWMXBAR20_SD0_FILT1_CMPHZ_SEL << 5) | (MW_EPWMXBAR20_SD0_FILT2_CEVT1_SEL << 6) | (MW_EPWMXBAR20_SD0_FILT2_CEVT2_SEL << 7) | (MW_EPWMXBAR20_SD0_FILT2_CMPHZ_SEL << 8) | (MW_EPWMXBAR20_SD0_FILT3_CEVT1_SEL << 9) | (MW_EPWMXBAR20_SD0_FILT3_CEVT2_SEL << 10) | (MW_EPWMXBAR20_SD0_FILT3_CMPHZ_SEL << 11) | (MW_EPWMXBAR20_SD1_FILT0_CEVT1_SEL << 12) | (MW_EPWMXBAR20_SD1_FILT0_CEVT2_SEL << 13) | (MW_EPWMXBAR20_SD1_FILT0_CMPHZ_SEL << 14) | (MW_EPWMXBAR20_SD1_FILT1_CEVT1_SEL << 15) | (MW_EPWMXBAR20_SD1_FILT1_CEVT2_SEL << 16) | (MW_EPWMXBAR20_SD1_FILT1_CMPHZ_SEL << 17) | (MW_EPWMXBAR20_SD1_FILT2_CEVT1_SEL << 18) | (MW_EPWMXBAR20_SD1_FILT2_CEVT2_SEL << 19) | (MW_EPWMXBAR20_SD1_FILT2_CMPHZ_SEL << 20) | (MW_EPWMXBAR20_SD1_FILT3_CEVT1_SEL << 21) | (MW_EPWMXBAR20_SD1_FILT3_CEVT2_SEL << 22) | (MW_EPWMXBAR20_SD1_FILT3_CMPHZ_SEL << 23);
    group3_epwmxbar[20] = (MW_EPWMXBAR20_ADC0_EVT1_SEL << 0) | (MW_EPWMXBAR20_ADC0_EVT2_SEL << 1) | (MW_EPWMXBAR20_ADC0_EVT3_SEL << 2) | (MW_EPWMXBAR20_ADC0_EVT4_SEL << 3) | (MW_EPWMXBAR20_ADC1_EVT1_SEL << 4) | (MW_EPWMXBAR20_ADC1_EVT2_SEL << 5) | (MW_EPWMXBAR20_ADC1_EVT3_SEL << 6) | (MW_EPWMXBAR20_ADC1_EVT4_SEL << 7) | (MW_EPWMXBAR20_ADC2_EVT1_SEL << 8) | (MW_EPWMXBAR20_ADC2_EVT2_SEL << 9) | (MW_EPWMXBAR20_ADC2_EVT3_SEL << 10) | (MW_EPWMXBAR20_ADC2_EVT4_SEL << 11) | (MW_EPWMXBAR20_ADC3_EVT1_SEL << 12) | (MW_EPWMXBAR20_ADC3_EVT2_SEL << 13) | (MW_EPWMXBAR20_ADC3_EVT3_SEL << 14) | (MW_EPWMXBAR20_ADC3_EVT4_SEL << 15) | (MW_EPWMXBAR20_ADC4_EVT1_SEL << 16) | (MW_EPWMXBAR20_ADC4_EVT2_SEL << 17) | (MW_EPWMXBAR20_ADC4_EVT3_SEL << 18) | (MW_EPWMXBAR20_ADC4_EVT4_SEL << 19);
    // if(MW_EPWMXBAR20_GPIO0_SEL == 1 | MW_EPWMXBAR20_GPIO1_SEL == 1 | MW_EPWMXBAR20_GPIO2_SEL == 1 | MW_EPWMXBAR20_GPIO3_SEL == 1 | MW_EPWMXBAR20_GPIO4_SEL == 1 | MW_EPWMXBAR20_GPIO5_SEL == 1 | MW_EPWMXBAR20_GPIO6_SEL == 1 | MW_EPWMXBAR20_GPIO7_SEL == 1| MW_EPWMXBAR20_GPIO8_SEL == 1 | MW_EPWMXBAR20_GPIO9_SEL == 1 | MW_EPWMXBAR20_GPIO10_SEL == 1| MW_EPWMXBAR20_GPIO11_SEL == 1| MW_EPWMXBAR20_GPIO12_SEL == 1 | MW_EPWMXBAR20_GPIO13_SEL == 1 | MW_EPWMXBAR20_GPIO14_SEL == 1 | MW_EPWMXBAR20_GPIO15_SEL == 1 | MW_EPWMXBAR20_GPIO16_SEL == 1 | MW_EPWMXBAR20_GPIO17_SEL == 1 | MW_EPWMXBAR20_GPIO18_SEL == 1 | MW_EPWMXBAR20_GPIO19_SEL == 1 | MW_EPWMXBAR20_GPIO20_SEL == 1 | MW_EPWMXBAR20_GPIO21_SEL == 1 | MW_EPWMXBAR20_GPIO22_SEL == 1 | MW_EPWMXBAR20_GPIO23_SEL == 1 | MW_EPWMXBAR20_GPIO24_SEL == 1 | MW_EPWMXBAR20_GPIO25_SEL == 1 | MW_EPWMXBAR20_GPIO26_SEL == 1 | MW_EPWMXBAR20_GPIO27_SEL == 1 | MW_EPWMXBAR20_GPIO28_SEL == 1 | MW_EPWMXBAR20_GPIO29_SEL == 1 | MW_EPWMXBAR20_GPIO30_SEL == 1 | MW_EPWMXBAR20_GPIO31_SEL == 1 | MW_EPWMXBAR20_GPIO32_SEL == 1 | MW_EPWMXBAR20_GPIO33_SEL == 1 | MW_EPWMXBAR20_GPIO34_SEL == 1 | MW_EPWMXBAR20_GPIO35_SEL == 1 | MW_EPWMXBAR20_GPIO36_SEL == 1 | MW_EPWMXBAR20_GPIO37_SEL == 1 | MW_EPWMXBAR20_GPIO38_SEL == 1 | MW_EPWMXBAR20_GPIO39_SEL == 1 | MW_EPWMXBAR20_GPIO40_SEL == 1 | MW_EPWMXBAR20_GPIO41_SEL == 1 | MW_EPWMXBAR20_GPIO42_SEL == 1 | MW_EPWMXBAR20_GPIO43_SEL == 1 | MW_EPWMXBAR20_GPIO44_SEL == 1 | | MW_EPWMXBAR20_GPIO45_SEL == 1 | MW_EPWMXBAR20_GPIO46_SEL == 1 | MW_EPWMXBAR20_GPIO47_SEL == 1| MW_EPWMXBAR20_GPIO48_SEL == 1 | MW_EPWMXBAR20_GPIO49_SEL == 1 | MW_EPWMXBAR20_GPIO50_SEL == 1 | MW_EPWMXBAR20_GPIO51_SEL == 1 | MW_EPWMXBAR20_GPIO52_SEL == 1 | MW_EPWMXBAR20_GPIO53_SEL == 1 | MW_EPWMXBAR20_GPIO54_SEL == 1 | MW_EPWMXBAR20_GPIO55_SEL == 1 | MW_EPWMXBAR20_GPIO56_SEL == 1 | MW_EPWMXBAR20_GPIO57_SEL == 1| MW_EPWMXBAR20_GPIO58_SEL == 1 | MW_EPWMXBAR20_GPIO59_SEL == 1 | MW_EPWMXBAR20_GPIO60_SEL == 1 | MW_EPWMXBAR20_GPIO61_SEL == 1 | MW_EPWMXBAR20_GPIO62_SEL == 1 | MW_EPWMXBAR20_GPIO63_SEL == 1 | MW_EPWMXBAR20_GPIO64_SEL == 1 | | MW_EPWMXBAR20_GPIO59_SEL == 1 | MW_EPWMXBAR20_GPIO60_SEL == 1 | MW_EPWMXBAR20_GPIO61_SEL == 1 | MW_EPWMXBAR20_GPIO62_SEL == 1 | MW_EPWMXBAR20_GPIO63_SEL == 1 | MW_EPWMXBAR20_GPIO64_SEL == 1 | MW_EPWMXBAR20_GPIO65_SEL == 1 | MW_EPWMXBAR20_GPIO66_SEL == 1 | MW_EPWMXBAR20_GPIO67_SEL == 1 | MW_EPWMXBAR20_GPIO68_SEL == 1 | MW_EPWMXBAR20_GPIO69_SEL == 1 | MW_EPWMXBAR20_GPIO70_SEL == 1 | MW_EPWMXBAR20_GPIO71_SEL == 1 | MW_EPWMXBAR20_GPIO72_SEL == 1 | MW_EPWMXBAR20_GPIO73_SEL == 1 | MW_EPWMXBAR20_GPIO74_SEL == 1 | MW_EPWMXBAR20_GPIO75_SEL == 1 | MW_EPWMXBAR20_GPIO76_SEL == 1 | MW_EPWMXBAR20_GPIO77_SEL == 1 | MW_EPWMXBAR20_GPIO78_SEL == 1 | | MW_EPWMXBAR20_GPIO80_SEL == 1 | MW_EPWMXBAR20_GPIO81_SEL == 1 | MW_EPWMXBAR20_GPIO82_SEL == 1 | MW_EPWMXBAR20_GPIO83_SEL == 1 | MW_EPWMXBAR20_GPIO84_SEL == 1 | MW_EPWMXBAR20_GPIO85_SEL == 1 | MW_EPWMXBAR20_GPIO86_SEL == 1 | MW_EPWMXBAR20_GPIO87_SEL == 1 | MW_EPWMXBAR20_GPIO88_SEL == 1 | MW_EPWMXBAR20_GPIO89_SEL == 1 | MW_EPWMXBAR20_GPIO90_SEL == 1 | MW_EPWMXBAR20_GPIO91_SEL == 1 | MW_EPWMXBAR20_GPIO92_SEL == 1 | MW_EPWMXBAR20_GPIO93_SEL == 1 | MW_EPWMXBAR20_GPIO94_SEL == 1 | MW_EPWMXBAR20_GPIO95_SEL == 1 | MW_EPWMXBAR20_GPIO96_SEL == 1 | MW_EPWMXBAR20_GPIO97_SEL == 1 | MW_EPWMXBAR20_GPIO98_SEL == 1 | MW_EPWMXBAR20_GPIO99_SEL == 1 | MW_EPWMXBAR20_GPIO100_SEL == 1 | MW_EPWMXBAR20_GPIO101_SEL == 1 | MW_EPWMXBAR20_GPIO102_SEL == 1 | MW_EPWMXBAR20_GPIO103_SEL == 1 | MW_EPWMXBAR20_GPIO104_SEL == 1 | MW_EPWMXBAR20_GPIO105_SEL == 1 | MW_EPWMXBAR20_GPIO106_SEL == 1 | MW_EPWMXBAR20_GPIO107_SEL == 1 | | MW_EPWMXBAR20_GPIO108_SEL == 1 | MW_EPWMXBAR20_GPIO109_SEL == 1| MW_EPWMXBAR20_GPIO110_SEL == 1 | MW_EPWMXBAR20_GPIO111_SEL == 1 | MW_EPWMXBAR20_GPIO112_SEL == 1 | MW_EPWMXBAR20_GPIO113_SEL == 1 | MW_EPWMXBAR20_GPIO114_SEL == 1 | MW_EPWMXBAR20_GPIO115_SEL == 1 | MW_EPWMXBAR20_GPIO116_SEL == 1 | MW_EPWMXBAR20_GPIO117_SEL == 1 | MW_EPWMXBAR20_GPIO118_SEL == 1 | MW_EPWMXBAR20_GPIO119_SEL == 1 | MW_EPWMXBAR20_GPIO120_SEL == 1 | MW_EPWMXBAR20_GPIO121_SEL == 1 | MW_EPWMXBAR20_GPIO122_SEL == 1 | MW_EPWMXBAR20_GPIO123_SEL == 1 | MW_EPWMXBAR20_GPIO124_SEL == 1 | MW_EPWMXBAR20_GPIO125_SEL == 1 | MW_EPWMXBAR20_GPIO126_SEL == 1 | MW_EPWMXBAR20_GPIO127_SEL == 1 | MW_EPWMXBAR20_GPIO128_SEL == 1 | MW_EPWMXBAR20_GPIO129_SEL == 1 | MW_EPWMXBAR20_GPIO130_SEL == 1 | MW_EPWMXBAR20_GPIO131_SEL == 1 | MW_EPWMXBAR20_GPIO132_SEL == 1 | MW_EPWMXBAR20_GPIO133_SEL == 1 | MW_EPWMXBAR20_GPIO134_SEL == 1 | MW_EPWMXBAR20_GPIO135_SEL == 1 | MW_EPWMXBAR20_GPIO136_SEL == 1 | MW_EPWMXBAR20_GPIO137_SEL == 1 | MW_EPWMXBAR20_GPIO139_SEL == 1 | MW_EPWMXBAR20_GPIO140_SEL == 1 | MW_EPWMXBAR20_GPIO141_SEL == 1 | MW_EPWMXBAR20_GPIO142_SEL == 1 | MW_EPWMXBAR20_GPIO143_SEL == 1 | MW_EPWMXBAR20_ICSSGPO0_PORT0_SEL == 1 | MW_EPWMXBAR20_ICSSGPO1_PORT0_SEL == 1 | MW_EPWMXBAR20_ICSSGPO2_PORT0_SEL == 1 | MW_EPWMXBAR20_ICSSGPO3_PORT0_SEL == 1 | MW_EPWMXBAR20_ICSSGPO4_PORT0_SEL == 1 | MW_EPWMXBAR20_ICSSGPO5_PORT0_SEL == 1 | MW_EPWMXBAR20_ICSSGPO6_PORT0_SEL == 1 | MW_EPWMXBAR20_ICSSGPO7_PORT0_SEL == 1 | MW_EPWMXBAR20_ICSSGPO8_PORT0_SEL == 1 | MW_EPWMXBAR20_ICSSGPO9_PORT0_SEL == 1 | MW_EPWMXBAR20_ICSSGPO10_PORT0_SEL == 1 | MW_EPWMXBAR20_ICSSGPO11_PORT0_SEL == 1 | MW_EPWMXBAR20_ICSSGPO12_PORT0_SEL == 1 | MW_EPWMXBAR20_ICSSGPO13_PORT0_SEL == 1 | MW_EPWMXBAR20_ICSSGPO14_PORT0_SEL == 1 | MW_EPWMXBAR20_ICSSGPO15_PORT0_SEL == 1 | MW_EPWMXBAR20_ICSSGPO0_PORT1_SEL == 1 | MW_EPWMXBAR20_ICSSGPO1_PORT1_SEL == 1 | MW_EPWMXBAR20_ICSSGPO2_PORT1_SEL == 1 | MW_EPWMXBAR20_ICSSGPO3_PORT1_SEL == 1 | MW_EPWMXBAR20_ICSSGPO4_PORT1_SEL == 1 | MW_EPWMXBAR20_ICSSGPO5_PORT1_SEL == 1 | MW_EPWMXBAR20_ICSSGPO6_PORT1_SEL == 1 | MW_EPWMXBAR20_ICSSGPO7_PORT1_SEL == 1 | MW_EPWMXBAR20_ICSSGPO8_PORT1_SEL == 1 | MW_EPWMXBAR20_ICSSGPO9_PORT1_SEL == 1 | MW_EPWMXBAR20_ICSSGPO10_PORT1_SEL == 1 | MW_EPWMXBAR20_ICSSGPO11_PORT1_SEL == 1 | MW_EPWMXBAR20_ICSSGPO12_PORT1_SEL == 1 | MW_EPWMXBAR20_ICSSGPO13_PORT1_SEL == 1 | MW_EPWMXBAR20_ICSSGPO14_PORT1_SEL == 1 | MW_EPWMXBAR20_ICSSGPO15_PORT1_SEL == 1)
    //     group4_epwmxbar[20] = EPWM_XBAR_20;
    // else
        group4_epwmxbar[20] = 0;
    group5_epwmxbar[20] = (MW_EPWMXBAR20_EPWM0_TRIPOUT_SEL << 0) | (MW_EPWMXBAR20_EPWM1_TRIPOUT_SEL << 1) | (MW_EPWMXBAR20_EPWM2_TRIPOUT_SEL << 2) | (MW_EPWMXBAR20_EPWM3_TRIPOUT_SEL << 3) | (MW_EPWMXBAR20_EPWM4_TRIPOUT_SEL << 4) | (MW_EPWMXBAR20_EPWM5_TRIPOUT_SEL << 5) | (MW_EPWMXBAR20_EPWM6_TRIPOUT_SEL << 6) | (MW_EPWMXBAR20_EPWM7_TRIPOUT_SEL << 7) | (MW_EPWMXBAR20_EPWM8_TRIPOUT_SEL << 8) | (MW_EPWMXBAR20_EPWM9_TRIPOUT_SEL << 9) | (MW_EPWMXBAR20_EPWM10_TRIPOUT_SEL << 10) | (MW_EPWMXBAR20_EPWM11_TRIPOUT_SEL << 11) | (MW_EPWMXBAR20_EPWM12_TRIPOUT_SEL << 12) | (MW_EPWMXBAR20_EPWM13_TRIPOUT_SEL << 13) | (MW_EPWMXBAR20_EPWM14_TRIPOUT_SEL << 14) | (MW_EPWMXBAR20_EPWM15_TRIPOUT_SEL << 15) | (MW_EPWMXBAR20_EPWM16_TRIPOUT_SEL << 16) | (MW_EPWMXBAR20_EPWM17_TRIPOUT_SEL << 17) | (MW_EPWMXBAR20_EPWM18_TRIPOUT_SEL << 18) | (MW_EPWMXBAR20_EPWM19_TRIPOUT_SEL << 19) | (MW_EPWMXBAR20_EPWM20_TRIPOUT_SEL << 20) | (MW_EPWMXBAR20_EPWM21_TRIPOUT_SEL << 21) | (MW_EPWMXBAR20_EPWM22_TRIPOUT_SEL << 22) | (MW_EPWMXBAR20_EPWM23_TRIPOUT_SEL << 23) | (MW_EPWMXBAR20_EPWM24_TRIPOUT_SEL << 24) | (MW_EPWMXBAR20_EPWM25_TRIPOUT_SEL << 25) | (MW_EPWMXBAR20_EPWM26_TRIPOUT_SEL << 26) | (MW_EPWMXBAR20_EPWM27_TRIPOUT_SEL << 27) | (MW_EPWMXBAR20_EPWM28_TRIPOUT_SEL << 28) | (MW_EPWMXBAR20_EPWM29_TRIPOUT_SEL << 29) | (MW_EPWMXBAR20_EPWM30_TRIPOUT_SEL << 30) | (MW_EPWMXBAR20_EPWM31_TRIPOUT_SEL << 31);
    group6_epwmxbar[20] = (MW_EPWMXBAR20_DEL0_TRIP_SEL << 0) | (MW_EPWMXBAR20_DEL1_TRIP_SEL << 1) | (MW_EPWMXBAR20_DEL2_TRIP_SEL << 2) | (MW_EPWMXBAR20_DEL3_TRIP_SEL << 3) | (MW_EPWMXBAR20_DEL4_TRIP_SEL << 4) | (MW_EPWMXBAR20_DEL5_TRIP_SEL << 5) | (MW_EPWMXBAR20_DEL6_TRIP_SEL << 6) | (MW_EPWMXBAR20_DEL7_TRIP_SEL << 7) | (MW_EPWMXBAR20_DEL8_TRIP_SEL << 8) | (MW_EPWMXBAR20_DEL9_TRIP_SEL << 9) | (MW_EPWMXBAR20_DEL10_TRIP_SEL << 10) | (MW_EPWMXBAR20_DEL11_TRIP_SEL << 11) | (MW_EPWMXBAR20_DEL12_TRIP_SEL << 12) | (MW_EPWMXBAR20_DEL13_TRIP_SEL << 13) | (MW_EPWMXBAR20_DEL14_TRIP_SEL << 14) | (MW_EPWMXBAR20_DEL15_TRIP_SEL << 15) | (MW_EPWMXBAR20_DEL16_TRIP_SEL << 16) | (MW_EPWMXBAR20_DEL17_TRIP_SEL << 17) | (MW_EPWMXBAR20_DEL18_TRIP_SEL << 18) | (MW_EPWMXBAR20_DEL19_TRIP_SEL << 19) | (MW_EPWMXBAR20_DEL20_TRIP_SEL << 20) | (MW_EPWMXBAR20_DEL21_TRIP_SEL << 21) | (MW_EPWMXBAR20_DEL22_TRIP_SEL << 22) | (MW_EPWMXBAR20_DEL23_TRIP_SEL << 23) | (MW_EPWMXBAR20_DEL24_TRIP_SEL << 24) | (MW_EPWMXBAR20_DEL25_TRIP_SEL << 25) | (MW_EPWMXBAR20_DEL26_TRIP_SEL << 26) | (MW_EPWMXBAR20_DEL27_TRIP_SEL << 27) | (MW_EPWMXBAR20_DEL28_TRIP_SEL << 28) | (MW_EPWMXBAR20_DEL29_TRIP_SEL << 29) | (MW_EPWMXBAR20_DEL30_TRIP_SEL << 30) | (MW_EPWMXBAR20_DEL31_TRIP_SEL << 31);
