TexasInstruments/am26x-hsp/src/am263px_init.c
    group7_epwmxbar[20] = (MW_EPWMXBAR20_DEL0_ACTIVE_SEL << 0) | (MW_EPWMXBAR20_DEL1_ACTIVE_SEL << 1) | (MW_EPWMXBAR20_DEL2_ACTIVE_SEL << 2) | (MW_EPWMXBAR20_DEL3_ACTIVE_SEL << 3) | (MW_EPWMXBAR20_DEL4_ACTIVE_SEL << 4) | (MW_EPWMXBAR20_DEL5_ACTIVE_SEL << 5) | (MW_EPWMXBAR20_DEL6_ACTIVE_SEL << 6) | (MW_EPWMXBAR20_DEL7_ACTIVE_SEL << 7) | (MW_EPWMXBAR20_DEL8_ACTIVE_SEL << 8) | (MW_EPWMXBAR20_DEL9_ACTIVE_SEL << 9) | (MW_EPWMXBAR20_DEL10_ACTIVE_SEL << 10) | (MW_EPWMXBAR20_DEL11_ACTIVE_SEL << 11) | (MW_EPWMXBAR20_DEL12_ACTIVE_SEL << 12) | (MW_EPWMXBAR20_DEL13_ACTIVE_SEL << 13) | (MW_EPWMXBAR20_DEL14_ACTIVE_SEL << 14) | (MW_EPWMXBAR20_DEL15_ACTIVE_SEL << 15) | (MW_EPWMXBAR20_DEL16_ACTIVE_SEL << 16) | (MW_EPWMXBAR20_DEL17_ACTIVE_SEL << 17) | (MW_EPWMXBAR20_DEL18_ACTIVE_SEL << 18) | (MW_EPWMXBAR20_DEL19_ACTIVE_SEL << 19) | (MW_EPWMXBAR20_DEL20_ACTIVE_SEL << 20) | (MW_EPWMXBAR20_DEL21_ACTIVE_SEL << 21) | (MW_EPWMXBAR20_DEL22_ACTIVE_SEL << 22) | (MW_EPWMXBAR20_DEL23_ACTIVE_SEL << 23) | (MW_EPWMXBAR20_DEL24_ACTIVE_SEL << 24) | (MW_EPWMXBAR20_DEL25_ACTIVE_SEL << 25) | (MW_EPWMXBAR20_DEL26_ACTIVE_SEL << 26) | (MW_EPWMXBAR20_DEL27_ACTIVE_SEL << 27) | (MW_EPWMXBAR20_DEL28_ACTIVE_SEL << 28) | (MW_EPWMXBAR20_DEL29_ACTIVE_SEL << 29) | (MW_EPWMXBAR20_DEL30_ACTIVE_SEL << 30) | (MW_EPWMXBAR20_DEL31_ACTIVE_SEL << 31);
    group8_epwmxbar[20] = (MW_EPWMXBAR20_EQEP0_ERR_SEL << 0) | (MW_EPWMXBAR20_EQEP1_ERR_SEL << 1) | (MW_EPWMXBAR20_EQEP2_ERR_SEL << 2) | (MW_EPWMXBAR20_FSIRX0_RX_TRIG0_SEL << 3) | (MW_EPWMXBAR20_FSIRX0_RX_TRIG1_SEL << 4) | (MW_EPWMXBAR20_FSIRX0_RX_TRIG2_SEL << 5) | (MW_EPWMXBAR20_FSIRX0_RX_TRIG3_SEL << 6) | (MW_EPWMXBAR20_FSIRX1_RX_TRIG0_SEL << 7) | (MW_EPWMXBAR20_FSIRX1_RX_TRIG1_SEL << 8) | (MW_EPWMXBAR20_FSIRX1_RX_TRIG2_SEL << 9) | (MW_EPWMXBAR20_FSIRX1_RX_TRIG3_SEL << 10) | (MW_EPWMXBAR20_FSIRX2_RX_TRIG0_SEL << 11) | (MW_EPWMXBAR20_FSIRX2_RX_TRIG1_SEL << 12) | (MW_EPWMXBAR20_FSIRX2_RX_TRIG2_SEL << 13) | (MW_EPWMXBAR20_FSIRX2_RX_TRIG3_SEL << 14) | (MW_EPWMXBAR20_FSIRX3_RX_TRIG0_SEL << 15) | (MW_EPWMXBAR20_FSIRX3_RX_TRIG1_SEL << 16) | (MW_EPWMXBAR20_FSIRX3_RX_TRIG2_SEL << 17) | (MW_EPWMXBAR20_FSIRX3_RX_TRIG3_SEL << 18) | (MW_EPWMXBAR20_ECAP0_TRIPOUT_SEL << 19) | (MW_EPWMXBAR20_ECAP1_TRIPOUT_SEL << 20) | (MW_EPWMXBAR20_ECAP2_TRIPOUT_SEL << 21) | (MW_EPWMXBAR20_ECAP3_TRIPOUT_SEL << 22) | (MW_EPWMXBAR20_ECAP4_TRIPOUT_SEL << 23) | (MW_EPWMXBAR20_ECAP5_TRIPOUT_SEL << 24) | (MW_EPWMXBAR20_ECAP6_TRIPOUT_SEL << 25) | (MW_EPWMXBAR20_ECAP7_TRIPOUT_SEL << 26) | (MW_EPWMXBAR20_ECAP8_TRIPOUT_SEL << 27) | (MW_EPWMXBAR20_ECAP9_TRIPOUT_SEL << 28);
    group0_epwmxbar[21] = (MW_EPWMXBAR21_CMPSSA0_CTRIPL_SEL << 0) | (MW_EPWMXBAR21_CMPSSA0_CTRIPH_SEL << 1) | (MW_EPWMXBAR21_CMPSSA1_CTRIPL_SEL << 2) | (MW_EPWMXBAR21_CMPSSA1_CTRIPH_SEL << 3) | (MW_EPWMXBAR21_CMPSSA2_CTRIPL_SEL << 4) | (MW_EPWMXBAR21_CMPSSA2_CTRIPH_SEL << 5) | (MW_EPWMXBAR21_CMPSSA3_CTRIPL_SEL << 6) | (MW_EPWMXBAR21_CMPSSA3_CTRIPH_SEL << 7) | (MW_EPWMXBAR21_CMPSSA4_CTRIPL_SEL << 8) | (MW_EPWMXBAR21_CMPSSA4_CTRIPH_SEL << 9) | (MW_EPWMXBAR21_CMPSSA5_CTRIPL_SEL << 10) | (MW_EPWMXBAR21_CMPSSA5_CTRIPH_SEL << 11) | (MW_EPWMXBAR21_CMPSSA6_CTRIPL_SEL << 12) | (MW_EPWMXBAR21_CMPSSA6_CTRIPH_SEL << 13) | (MW_EPWMXBAR21_CMPSSA7_CTRIPL_SEL << 14) | (MW_EPWMXBAR21_CMPSSA7_CTRIPH_SEL << 15) | (MW_EPWMXBAR21_CMPSSA8_CTRIPL_SEL << 16) | (MW_EPWMXBAR21_CMPSSA8_CTRIPH_SEL << 17) | (MW_EPWMXBAR21_CMPSSA9_CTRIPL_SEL << 18) | (MW_EPWMXBAR21_CMPSSA9_CTRIPH_SEL << 19);
    group1_epwmxbar[21] = (MW_EPWMXBAR21_CMPSSB0_CTRIPL_SEL << 0) | (MW_EPWMXBAR21_CMPSSB0_CTRIPH_SEL << 1) | (MW_EPWMXBAR21_CMPSSB1_CTRIPL_SEL << 2) | (MW_EPWMXBAR21_CMPSSB1_CTRIPH_SEL << 3) | (MW_EPWMXBAR21_CMPSSB2_CTRIPL_SEL << 4) | (MW_EPWMXBAR21_CMPSSB2_CTRIPH_SEL << 5) | (MW_EPWMXBAR21_CMPSSB3_CTRIPL_SEL << 6) | (MW_EPWMXBAR21_CMPSSB3_CTRIPH_SEL << 7) | (MW_EPWMXBAR21_CMPSSB4_CTRIPL_SEL << 8) | (MW_EPWMXBAR21_CMPSSB4_CTRIPH_SEL << 9) | (MW_EPWMXBAR21_CMPSSB5_CTRIPL_SEL << 10) | (MW_EPWMXBAR21_CMPSSB5_CTRIPH_SEL << 11) | (MW_EPWMXBAR21_CMPSSB6_CTRIPL_SEL << 12) | (MW_EPWMXBAR21_CMPSSB6_CTRIPH_SEL << 13) | (MW_EPWMXBAR21_CMPSSB7_CTRIPL_SEL << 14) | (MW_EPWMXBAR21_CMPSSB7_CTRIPH_SEL << 15) | (MW_EPWMXBAR21_CMPSSB8_CTRIPL_SEL << 16) | (MW_EPWMXBAR21_CMPSSB8_CTRIPH_SEL << 17) | (MW_EPWMXBAR21_CMPSSB9_CTRIPL_SEL << 18) | (MW_EPWMXBAR21_CMPSSB9_CTRIPH_SEL << 19);
    group2_epwmxbar[21] = (MW_EPWMXBAR21_SD0_FILT0_CEVT1_SEL << 0) | (MW_EPWMXBAR21_SD0_FILT0_CEVT2_SEL << 1) | (MW_EPWMXBAR21_SD0_FILT0_CMPHZ_SEL << 2) | (MW_EPWMXBAR21_SD0_FILT1_CEVT1_SEL << 3) | (MW_EPWMXBAR21_SD0_FILT1_CEVT2_SEL << 4) | (MW_EPWMXBAR21_SD0_FILT1_CMPHZ_SEL << 5) | (MW_EPWMXBAR21_SD0_FILT2_CEVT1_SEL << 6) | (MW_EPWMXBAR21_SD0_FILT2_CEVT2_SEL << 7) | (MW_EPWMXBAR21_SD0_FILT2_CMPHZ_SEL << 8) | (MW_EPWMXBAR21_SD0_FILT3_CEVT1_SEL << 9) | (MW_EPWMXBAR21_SD0_FILT3_CEVT2_SEL << 10) | (MW_EPWMXBAR21_SD0_FILT3_CMPHZ_SEL << 11) | (MW_EPWMXBAR21_SD1_FILT0_CEVT1_SEL << 12) | (MW_EPWMXBAR21_SD1_FILT0_CEVT2_SEL << 13) | (MW_EPWMXBAR21_SD1_FILT0_CMPHZ_SEL << 14) | (MW_EPWMXBAR21_SD1_FILT1_CEVT1_SEL << 15) | (MW_EPWMXBAR21_SD1_FILT1_CEVT2_SEL << 16) | (MW_EPWMXBAR21_SD1_FILT1_CMPHZ_SEL << 17) | (MW_EPWMXBAR21_SD1_FILT2_CEVT1_SEL << 18) | (MW_EPWMXBAR21_SD1_FILT2_CEVT2_SEL << 19) | (MW_EPWMXBAR21_SD1_FILT2_CMPHZ_SEL << 20) | (MW_EPWMXBAR21_SD1_FILT3_CEVT1_SEL << 21) | (MW_EPWMXBAR21_SD1_FILT3_CEVT2_SEL << 22) | (MW_EPWMXBAR21_SD1_FILT3_CMPHZ_SEL << 23);
    group3_epwmxbar[21] = (MW_EPWMXBAR21_ADC0_EVT1_SEL << 0) | (MW_EPWMXBAR21_ADC0_EVT2_SEL << 1) | (MW_EPWMXBAR21_ADC0_EVT3_SEL << 2) | (MW_EPWMXBAR21_ADC0_EVT4_SEL << 3) | (MW_EPWMXBAR21_ADC1_EVT1_SEL << 4) | (MW_EPWMXBAR21_ADC1_EVT2_SEL << 5) | (MW_EPWMXBAR21_ADC1_EVT3_SEL << 6) | (MW_EPWMXBAR21_ADC1_EVT4_SEL << 7) | (MW_EPWMXBAR21_ADC2_EVT1_SEL << 8) | (MW_EPWMXBAR21_ADC2_EVT2_SEL << 9) | (MW_EPWMXBAR21_ADC2_EVT3_SEL << 10) | (MW_EPWMXBAR21_ADC2_EVT4_SEL << 11) | (MW_EPWMXBAR21_ADC3_EVT1_SEL << 12) | (MW_EPWMXBAR21_ADC3_EVT2_SEL << 13) | (MW_EPWMXBAR21_ADC3_EVT3_SEL << 14) | (MW_EPWMXBAR21_ADC3_EVT4_SEL << 15) | (MW_EPWMXBAR21_ADC4_EVT1_SEL << 16) | (MW_EPWMXBAR21_ADC4_EVT2_SEL << 17) | (MW_EPWMXBAR21_ADC4_EVT3_SEL << 18) | (MW_EPWMXBAR21_ADC4_EVT4_SEL << 19);
    // if(MW_EPWMXBAR21_GPIO0_SEL == 1 | MW_EPWMXBAR21_GPIO1_SEL == 1 | MW_EPWMXBAR21_GPIO2_SEL == 1 | MW_EPWMXBAR21_GPIO3_SEL == 1 | MW_EPWMXBAR21_GPIO4_SEL == 1 | MW_EPWMXBAR21_GPIO5_SEL == 1 | MW_EPWMXBAR21_GPIO6_SEL == 1 | MW_EPWMXBAR21_GPIO7_SEL == 1| MW_EPWMXBAR21_GPIO8_SEL == 1 | MW_EPWMXBAR21_GPIO9_SEL == 1 | MW_EPWMXBAR21_GPIO10_SEL == 1| MW_EPWMXBAR21_GPIO11_SEL == 1| MW_EPWMXBAR21_GPIO12_SEL == 1 | MW_EPWMXBAR21_GPIO13_SEL == 1 | MW_EPWMXBAR21_GPIO14_SEL == 1 | MW_EPWMXBAR21_GPIO15_SEL == 1 | MW_EPWMXBAR21_GPIO16_SEL == 1 | MW_EPWMXBAR21_GPIO17_SEL == 1 | MW_EPWMXBAR21_GPIO18_SEL == 1 | MW_EPWMXBAR21_GPIO19_SEL == 1 | MW_EPWMXBAR21_GPIO20_SEL == 1 | MW_EPWMXBAR21_GPIO21_SEL == 1 | MW_EPWMXBAR21_GPIO22_SEL == 1 | MW_EPWMXBAR21_GPIO23_SEL == 1 | MW_EPWMXBAR21_GPIO24_SEL == 1 | MW_EPWMXBAR21_GPIO25_SEL == 1 | MW_EPWMXBAR21_GPIO26_SEL == 1 | MW_EPWMXBAR21_GPIO27_SEL == 1 | MW_EPWMXBAR21_GPIO28_SEL == 1 | MW_EPWMXBAR21_GPIO29_SEL == 1 | MW_EPWMXBAR21_GPIO30_SEL == 1 | MW_EPWMXBAR21_GPIO31_SEL == 1 | MW_EPWMXBAR21_GPIO32_SEL == 1 | MW_EPWMXBAR21_GPIO33_SEL == 1 | MW_EPWMXBAR21_GPIO34_SEL == 1 | MW_EPWMXBAR21_GPIO35_SEL == 1 | MW_EPWMXBAR21_GPIO36_SEL == 1 | MW_EPWMXBAR21_GPIO37_SEL == 1 | MW_EPWMXBAR21_GPIO38_SEL == 1 | MW_EPWMXBAR21_GPIO39_SEL == 1 | MW_EPWMXBAR21_GPIO40_SEL == 1 | MW_EPWMXBAR21_GPIO41_SEL == 1 | MW_EPWMXBAR21_GPIO42_SEL == 1 | MW_EPWMXBAR21_GPIO43_SEL == 1 | MW_EPWMXBAR21_GPIO44_SEL == 1 | | MW_EPWMXBAR21_GPIO45_SEL == 1 | MW_EPWMXBAR21_GPIO46_SEL == 1 | MW_EPWMXBAR21_GPIO47_SEL == 1| MW_EPWMXBAR21_GPIO48_SEL == 1 | MW_EPWMXBAR21_GPIO49_SEL == 1 | MW_EPWMXBAR21_GPIO50_SEL == 1 | MW_EPWMXBAR21_GPIO51_SEL == 1 | MW_EPWMXBAR21_GPIO52_SEL == 1 | MW_EPWMXBAR21_GPIO53_SEL == 1 | MW_EPWMXBAR21_GPIO54_SEL == 1 | MW_EPWMXBAR21_GPIO55_SEL == 1 | MW_EPWMXBAR21_GPIO56_SEL == 1 | MW_EPWMXBAR21_GPIO57_SEL == 1| MW_EPWMXBAR21_GPIO58_SEL == 1 | MW_EPWMXBAR21_GPIO59_SEL == 1 | MW_EPWMXBAR21_GPIO60_SEL == 1 | MW_EPWMXBAR21_GPIO61_SEL == 1 | MW_EPWMXBAR21_GPIO62_SEL == 1 | MW_EPWMXBAR21_GPIO63_SEL == 1 | MW_EPWMXBAR21_GPIO64_SEL == 1 | | MW_EPWMXBAR21_GPIO59_SEL == 1 | MW_EPWMXBAR21_GPIO60_SEL == 1 | MW_EPWMXBAR21_GPIO61_SEL == 1 | MW_EPWMXBAR21_GPIO62_SEL == 1 | MW_EPWMXBAR21_GPIO63_SEL == 1 | MW_EPWMXBAR21_GPIO64_SEL == 1 | MW_EPWMXBAR21_GPIO65_SEL == 1 | MW_EPWMXBAR21_GPIO66_SEL == 1 | MW_EPWMXBAR21_GPIO67_SEL == 1 | MW_EPWMXBAR21_GPIO68_SEL == 1 | MW_EPWMXBAR21_GPIO69_SEL == 1 | MW_EPWMXBAR21_GPIO70_SEL == 1 | MW_EPWMXBAR21_GPIO71_SEL == 1 | MW_EPWMXBAR21_GPIO72_SEL == 1 | MW_EPWMXBAR21_GPIO73_SEL == 1 | MW_EPWMXBAR21_GPIO74_SEL == 1 | MW_EPWMXBAR21_GPIO75_SEL == 1 | MW_EPWMXBAR21_GPIO76_SEL == 1 | MW_EPWMXBAR21_GPIO77_SEL == 1 | MW_EPWMXBAR21_GPIO78_SEL == 1 | | MW_EPWMXBAR21_GPIO80_SEL == 1 | MW_EPWMXBAR21_GPIO81_SEL == 1 | MW_EPWMXBAR21_GPIO82_SEL == 1 | MW_EPWMXBAR21_GPIO83_SEL == 1 | MW_EPWMXBAR21_GPIO84_SEL == 1 | MW_EPWMXBAR21_GPIO85_SEL == 1 | MW_EPWMXBAR21_GPIO86_SEL == 1 | MW_EPWMXBAR21_GPIO87_SEL == 1 | MW_EPWMXBAR21_GPIO88_SEL == 1 | MW_EPWMXBAR21_GPIO89_SEL == 1 | MW_EPWMXBAR21_GPIO90_SEL == 1 | MW_EPWMXBAR21_GPIO91_SEL == 1 | MW_EPWMXBAR21_GPIO92_SEL == 1 | MW_EPWMXBAR21_GPIO93_SEL == 1 | MW_EPWMXBAR21_GPIO94_SEL == 1 | MW_EPWMXBAR21_GPIO95_SEL == 1 | MW_EPWMXBAR21_GPIO96_SEL == 1 | MW_EPWMXBAR21_GPIO97_SEL == 1 | MW_EPWMXBAR21_GPIO98_SEL == 1 | MW_EPWMXBAR21_GPIO99_SEL == 1 | MW_EPWMXBAR21_GPIO100_SEL == 1 | MW_EPWMXBAR21_GPIO101_SEL == 1 | MW_EPWMXBAR21_GPIO102_SEL == 1 | MW_EPWMXBAR21_GPIO103_SEL == 1 | MW_EPWMXBAR21_GPIO104_SEL == 1 | MW_EPWMXBAR21_GPIO105_SEL == 1 | MW_EPWMXBAR21_GPIO106_SEL == 1 | MW_EPWMXBAR21_GPIO107_SEL == 1 | | MW_EPWMXBAR21_GPIO108_SEL == 1 | MW_EPWMXBAR21_GPIO109_SEL == 1| MW_EPWMXBAR21_GPIO110_SEL == 1 | MW_EPWMXBAR21_GPIO111_SEL == 1 | MW_EPWMXBAR21_GPIO112_SEL == 1 | MW_EPWMXBAR21_GPIO113_SEL == 1 | MW_EPWMXBAR21_GPIO114_SEL == 1 | MW_EPWMXBAR21_GPIO115_SEL == 1 | MW_EPWMXBAR21_GPIO116_SEL == 1 | MW_EPWMXBAR21_GPIO117_SEL == 1 | MW_EPWMXBAR21_GPIO118_SEL == 1 | MW_EPWMXBAR21_GPIO119_SEL == 1 | MW_EPWMXBAR21_GPIO120_SEL == 1 | MW_EPWMXBAR21_GPIO121_SEL == 1 | MW_EPWMXBAR21_GPIO122_SEL == 1 | MW_EPWMXBAR21_GPIO123_SEL == 1 | MW_EPWMXBAR21_GPIO124_SEL == 1 | MW_EPWMXBAR21_GPIO125_SEL == 1 | MW_EPWMXBAR21_GPIO126_SEL == 1 | MW_EPWMXBAR21_GPIO127_SEL == 1 | MW_EPWMXBAR21_GPIO128_SEL == 1 | MW_EPWMXBAR21_GPIO129_SEL == 1 | MW_EPWMXBAR21_GPIO130_SEL == 1 | MW_EPWMXBAR21_GPIO131_SEL == 1 | MW_EPWMXBAR21_GPIO132_SEL == 1 | MW_EPWMXBAR21_GPIO133_SEL == 1 | MW_EPWMXBAR21_GPIO134_SEL == 1 | MW_EPWMXBAR21_GPIO135_SEL == 1 | MW_EPWMXBAR21_GPIO136_SEL == 1 | MW_EPWMXBAR21_GPIO137_SEL == 1 | MW_EPWMXBAR21_GPIO139_SEL == 1 | MW_EPWMXBAR21_GPIO140_SEL == 1 | MW_EPWMXBAR21_GPIO141_SEL == 1 | MW_EPWMXBAR21_GPIO142_SEL == 1 | MW_EPWMXBAR21_GPIO143_SEL == 1 | MW_EPWMXBAR21_ICSSGPO0_PORT0_SEL == 1 | MW_EPWMXBAR21_ICSSGPO1_PORT0_SEL == 1 | MW_EPWMXBAR21_ICSSGPO2_PORT0_SEL == 1 | MW_EPWMXBAR21_ICSSGPO3_PORT0_SEL == 1 | MW_EPWMXBAR21_ICSSGPO4_PORT0_SEL == 1 | MW_EPWMXBAR21_ICSSGPO5_PORT0_SEL == 1 | MW_EPWMXBAR21_ICSSGPO6_PORT0_SEL == 1 | MW_EPWMXBAR21_ICSSGPO7_PORT0_SEL == 1 | MW_EPWMXBAR21_ICSSGPO8_PORT0_SEL == 1 | MW_EPWMXBAR21_ICSSGPO9_PORT0_SEL == 1 | MW_EPWMXBAR21_ICSSGPO10_PORT0_SEL == 1 | MW_EPWMXBAR21_ICSSGPO11_PORT0_SEL == 1 | MW_EPWMXBAR21_ICSSGPO12_PORT0_SEL == 1 | MW_EPWMXBAR21_ICSSGPO13_PORT0_SEL == 1 | MW_EPWMXBAR21_ICSSGPO14_PORT0_SEL == 1 | MW_EPWMXBAR21_ICSSGPO15_PORT0_SEL == 1 | MW_EPWMXBAR21_ICSSGPO0_PORT1_SEL == 1 | MW_EPWMXBAR21_ICSSGPO1_PORT1_SEL == 1 | MW_EPWMXBAR21_ICSSGPO2_PORT1_SEL == 1 | MW_EPWMXBAR21_ICSSGPO3_PORT1_SEL == 1 | MW_EPWMXBAR21_ICSSGPO4_PORT1_SEL == 1 | MW_EPWMXBAR21_ICSSGPO5_PORT1_SEL == 1 | MW_EPWMXBAR21_ICSSGPO6_PORT1_SEL == 1 | MW_EPWMXBAR21_ICSSGPO7_PORT1_SEL == 1 | MW_EPWMXBAR21_ICSSGPO8_PORT1_SEL == 1 | MW_EPWMXBAR21_ICSSGPO9_PORT1_SEL == 1 | MW_EPWMXBAR21_ICSSGPO10_PORT1_SEL == 1 | MW_EPWMXBAR21_ICSSGPO11_PORT1_SEL == 1 | MW_EPWMXBAR21_ICSSGPO12_PORT1_SEL == 1 | MW_EPWMXBAR21_ICSSGPO13_PORT1_SEL == 1 | MW_EPWMXBAR21_ICSSGPO14_PORT1_SEL == 1 | MW_EPWMXBAR21_ICSSGPO15_PORT1_SEL == 1)
    //     group4_epwmxbar[21] = EPWM_XBAR_21;
    // else
        group4_epwmxbar[21] = 0;
    group5_epwmxbar[21] = (MW_EPWMXBAR21_EPWM0_TRIPOUT_SEL << 0) | (MW_EPWMXBAR21_EPWM1_TRIPOUT_SEL << 1) | (MW_EPWMXBAR21_EPWM2_TRIPOUT_SEL << 2) | (MW_EPWMXBAR21_EPWM3_TRIPOUT_SEL << 3) | (MW_EPWMXBAR21_EPWM4_TRIPOUT_SEL << 4) | (MW_EPWMXBAR21_EPWM5_TRIPOUT_SEL << 5) | (MW_EPWMXBAR21_EPWM6_TRIPOUT_SEL << 6) | (MW_EPWMXBAR21_EPWM7_TRIPOUT_SEL << 7) | (MW_EPWMXBAR21_EPWM8_TRIPOUT_SEL << 8) | (MW_EPWMXBAR21_EPWM9_TRIPOUT_SEL << 9) | (MW_EPWMXBAR21_EPWM10_TRIPOUT_SEL << 10) | (MW_EPWMXBAR21_EPWM11_TRIPOUT_SEL << 11) | (MW_EPWMXBAR21_EPWM12_TRIPOUT_SEL << 12) | (MW_EPWMXBAR21_EPWM13_TRIPOUT_SEL << 13) | (MW_EPWMXBAR21_EPWM14_TRIPOUT_SEL << 14) | (MW_EPWMXBAR21_EPWM15_TRIPOUT_SEL << 15) | (MW_EPWMXBAR21_EPWM16_TRIPOUT_SEL << 16) | (MW_EPWMXBAR21_EPWM17_TRIPOUT_SEL << 17) | (MW_EPWMXBAR21_EPWM18_TRIPOUT_SEL << 18) | (MW_EPWMXBAR21_EPWM19_TRIPOUT_SEL << 19) | (MW_EPWMXBAR21_EPWM20_TRIPOUT_SEL << 20) | (MW_EPWMXBAR21_EPWM21_TRIPOUT_SEL << 21) | (MW_EPWMXBAR21_EPWM22_TRIPOUT_SEL << 22) | (MW_EPWMXBAR21_EPWM23_TRIPOUT_SEL << 23) | (MW_EPWMXBAR21_EPWM24_TRIPOUT_SEL << 24) | (MW_EPWMXBAR21_EPWM25_TRIPOUT_SEL << 25) | (MW_EPWMXBAR21_EPWM26_TRIPOUT_SEL << 26) | (MW_EPWMXBAR21_EPWM27_TRIPOUT_SEL << 27) | (MW_EPWMXBAR21_EPWM28_TRIPOUT_SEL << 28) | (MW_EPWMXBAR21_EPWM29_TRIPOUT_SEL << 29) | (MW_EPWMXBAR21_EPWM30_TRIPOUT_SEL << 30) | (MW_EPWMXBAR21_EPWM31_TRIPOUT_SEL << 31);
    group6_epwmxbar[21] = (MW_EPWMXBAR21_DEL0_TRIP_SEL << 0) | (MW_EPWMXBAR21_DEL1_TRIP_SEL << 1) | (MW_EPWMXBAR21_DEL2_TRIP_SEL << 2) | (MW_EPWMXBAR21_DEL3_TRIP_SEL << 3) | (MW_EPWMXBAR21_DEL4_TRIP_SEL << 4) | (MW_EPWMXBAR21_DEL5_TRIP_SEL << 5) | (MW_EPWMXBAR21_DEL6_TRIP_SEL << 6) | (MW_EPWMXBAR21_DEL7_TRIP_SEL << 7) | (MW_EPWMXBAR21_DEL8_TRIP_SEL << 8) | (MW_EPWMXBAR21_DEL9_TRIP_SEL << 9) | (MW_EPWMXBAR21_DEL10_TRIP_SEL << 10) | (MW_EPWMXBAR21_DEL11_TRIP_SEL << 11) | (MW_EPWMXBAR21_DEL12_TRIP_SEL << 12) | (MW_EPWMXBAR21_DEL13_TRIP_SEL << 13) | (MW_EPWMXBAR21_DEL14_TRIP_SEL << 14) | (MW_EPWMXBAR21_DEL15_TRIP_SEL << 15) | (MW_EPWMXBAR21_DEL16_TRIP_SEL << 16) | (MW_EPWMXBAR21_DEL17_TRIP_SEL << 17) | (MW_EPWMXBAR21_DEL18_TRIP_SEL << 18) | (MW_EPWMXBAR21_DEL19_TRIP_SEL << 19) | (MW_EPWMXBAR21_DEL20_TRIP_SEL << 20) | (MW_EPWMXBAR21_DEL21_TRIP_SEL << 21) | (MW_EPWMXBAR21_DEL22_TRIP_SEL << 22) | (MW_EPWMXBAR21_DEL23_TRIP_SEL << 23) | (MW_EPWMXBAR21_DEL24_TRIP_SEL << 24) | (MW_EPWMXBAR21_DEL25_TRIP_SEL << 25) | (MW_EPWMXBAR21_DEL26_TRIP_SEL << 26) | (MW_EPWMXBAR21_DEL27_TRIP_SEL << 27) | (MW_EPWMXBAR21_DEL28_TRIP_SEL << 28) | (MW_EPWMXBAR21_DEL29_TRIP_SEL << 29) | (MW_EPWMXBAR21_DEL30_TRIP_SEL << 30) | (MW_EPWMXBAR21_DEL31_TRIP_SEL << 31);
    group7_epwmxbar[21] = (MW_EPWMXBAR21_DEL0_ACTIVE_SEL << 0) | (MW_EPWMXBAR21_DEL1_ACTIVE_SEL << 1) | (MW_EPWMXBAR21_DEL2_ACTIVE_SEL << 2) | (MW_EPWMXBAR21_DEL3_ACTIVE_SEL << 3) | (MW_EPWMXBAR21_DEL4_ACTIVE_SEL << 4) | (MW_EPWMXBAR21_DEL5_ACTIVE_SEL << 5) | (MW_EPWMXBAR21_DEL6_ACTIVE_SEL << 6) | (MW_EPWMXBAR21_DEL7_ACTIVE_SEL << 7) | (MW_EPWMXBAR21_DEL8_ACTIVE_SEL << 8) | (MW_EPWMXBAR21_DEL9_ACTIVE_SEL << 9) | (MW_EPWMXBAR21_DEL10_ACTIVE_SEL << 10) | (MW_EPWMXBAR21_DEL11_ACTIVE_SEL << 11) | (MW_EPWMXBAR21_DEL12_ACTIVE_SEL << 12) | (MW_EPWMXBAR21_DEL13_ACTIVE_SEL << 13) | (MW_EPWMXBAR21_DEL14_ACTIVE_SEL << 14) | (MW_EPWMXBAR21_DEL15_ACTIVE_SEL << 15) | (MW_EPWMXBAR21_DEL16_ACTIVE_SEL << 16) | (MW_EPWMXBAR21_DEL17_ACTIVE_SEL << 17) | (MW_EPWMXBAR21_DEL18_ACTIVE_SEL << 18) | (MW_EPWMXBAR21_DEL19_ACTIVE_SEL << 19) | (MW_EPWMXBAR21_DEL20_ACTIVE_SEL << 20) | (MW_EPWMXBAR21_DEL21_ACTIVE_SEL << 21) | (MW_EPWMXBAR21_DEL22_ACTIVE_SEL << 22) | (MW_EPWMXBAR21_DEL23_ACTIVE_SEL << 23) | (MW_EPWMXBAR21_DEL24_ACTIVE_SEL << 24) | (MW_EPWMXBAR21_DEL25_ACTIVE_SEL << 25) | (MW_EPWMXBAR21_DEL26_ACTIVE_SEL << 26) | (MW_EPWMXBAR21_DEL27_ACTIVE_SEL << 27) | (MW_EPWMXBAR21_DEL28_ACTIVE_SEL << 28) | (MW_EPWMXBAR21_DEL29_ACTIVE_SEL << 29) | (MW_EPWMXBAR21_DEL30_ACTIVE_SEL << 30) | (MW_EPWMXBAR21_DEL31_ACTIVE_SEL << 31);
    group8_epwmxbar[21] = (MW_EPWMXBAR21_EQEP0_ERR_SEL << 0) | (MW_EPWMXBAR21_EQEP1_ERR_SEL << 1) | (MW_EPWMXBAR21_EQEP2_ERR_SEL << 2) | (MW_EPWMXBAR21_FSIRX0_RX_TRIG0_SEL << 3) | (MW_EPWMXBAR21_FSIRX0_RX_TRIG1_SEL << 4) | (MW_EPWMXBAR21_FSIRX0_RX_TRIG2_SEL << 5) | (MW_EPWMXBAR21_FSIRX0_RX_TRIG3_SEL << 6) | (MW_EPWMXBAR21_FSIRX1_RX_TRIG0_SEL << 7) | (MW_EPWMXBAR21_FSIRX1_RX_TRIG1_SEL << 8) | (MW_EPWMXBAR21_FSIRX1_RX_TRIG2_SEL << 9) | (MW_EPWMXBAR21_FSIRX1_RX_TRIG3_SEL << 10) | (MW_EPWMXBAR21_FSIRX2_RX_TRIG0_SEL << 11) | (MW_EPWMXBAR21_FSIRX2_RX_TRIG1_SEL << 12) | (MW_EPWMXBAR21_FSIRX2_RX_TRIG2_SEL << 13) | (MW_EPWMXBAR21_FSIRX2_RX_TRIG3_SEL << 14) | (MW_EPWMXBAR21_FSIRX3_RX_TRIG0_SEL << 15) | (MW_EPWMXBAR21_FSIRX3_RX_TRIG1_SEL << 16) | (MW_EPWMXBAR21_FSIRX3_RX_TRIG2_SEL << 17) | (MW_EPWMXBAR21_FSIRX3_RX_TRIG3_SEL << 18) | (MW_EPWMXBAR21_ECAP0_TRIPOUT_SEL << 19) | (MW_EPWMXBAR21_ECAP1_TRIPOUT_SEL << 20) | (MW_EPWMXBAR21_ECAP2_TRIPOUT_SEL << 21) | (MW_EPWMXBAR21_ECAP3_TRIPOUT_SEL << 22) | (MW_EPWMXBAR21_ECAP4_TRIPOUT_SEL << 23) | (MW_EPWMXBAR21_ECAP5_TRIPOUT_SEL << 24) | (MW_EPWMXBAR21_ECAP6_TRIPOUT_SEL << 25) | (MW_EPWMXBAR21_ECAP7_TRIPOUT_SEL << 26) | (MW_EPWMXBAR21_ECAP8_TRIPOUT_SEL << 27) | (MW_EPWMXBAR21_ECAP9_TRIPOUT_SEL << 28);
    group0_epwmxbar[22] = (MW_EPWMXBAR22_CMPSSA0_CTRIPL_SEL << 0) | (MW_EPWMXBAR22_CMPSSA0_CTRIPH_SEL << 1) | (MW_EPWMXBAR22_CMPSSA1_CTRIPL_SEL << 2) | (MW_EPWMXBAR22_CMPSSA1_CTRIPH_SEL << 3) | (MW_EPWMXBAR22_CMPSSA2_CTRIPL_SEL << 4) | (MW_EPWMXBAR22_CMPSSA2_CTRIPH_SEL << 5) | (MW_EPWMXBAR22_CMPSSA3_CTRIPL_SEL << 6) | (MW_EPWMXBAR22_CMPSSA3_CTRIPH_SEL << 7) | (MW_EPWMXBAR22_CMPSSA4_CTRIPL_SEL << 8) | (MW_EPWMXBAR22_CMPSSA4_CTRIPH_SEL << 9) | (MW_EPWMXBAR22_CMPSSA5_CTRIPL_SEL << 10) | (MW_EPWMXBAR22_CMPSSA5_CTRIPH_SEL << 11) | (MW_EPWMXBAR22_CMPSSA6_CTRIPL_SEL << 12) | (MW_EPWMXBAR22_CMPSSA6_CTRIPH_SEL << 13) | (MW_EPWMXBAR22_CMPSSA7_CTRIPL_SEL << 14) | (MW_EPWMXBAR22_CMPSSA7_CTRIPH_SEL << 15) | (MW_EPWMXBAR22_CMPSSA8_CTRIPL_SEL << 16) | (MW_EPWMXBAR22_CMPSSA8_CTRIPH_SEL << 17) | (MW_EPWMXBAR22_CMPSSA9_CTRIPL_SEL << 18) | (MW_EPWMXBAR22_CMPSSA9_CTRIPH_SEL << 19);
    group1_epwmxbar[22] = (MW_EPWMXBAR22_CMPSSB0_CTRIPL_SEL << 0) | (MW_EPWMXBAR22_CMPSSB0_CTRIPH_SEL << 1) | (MW_EPWMXBAR22_CMPSSB1_CTRIPL_SEL << 2) | (MW_EPWMXBAR22_CMPSSB1_CTRIPH_SEL << 3) | (MW_EPWMXBAR22_CMPSSB2_CTRIPL_SEL << 4) | (MW_EPWMXBAR22_CMPSSB2_CTRIPH_SEL << 5) | (MW_EPWMXBAR22_CMPSSB3_CTRIPL_SEL << 6) | (MW_EPWMXBAR22_CMPSSB3_CTRIPH_SEL << 7) | (MW_EPWMXBAR22_CMPSSB4_CTRIPL_SEL << 8) | (MW_EPWMXBAR22_CMPSSB4_CTRIPH_SEL << 9) | (MW_EPWMXBAR22_CMPSSB5_CTRIPL_SEL << 10) | (MW_EPWMXBAR22_CMPSSB5_CTRIPH_SEL << 11) | (MW_EPWMXBAR22_CMPSSB6_CTRIPL_SEL << 12) | (MW_EPWMXBAR22_CMPSSB6_CTRIPH_SEL << 13) | (MW_EPWMXBAR22_CMPSSB7_CTRIPL_SEL << 14) | (MW_EPWMXBAR22_CMPSSB7_CTRIPH_SEL << 15) | (MW_EPWMXBAR22_CMPSSB8_CTRIPL_SEL << 16) | (MW_EPWMXBAR22_CMPSSB8_CTRIPH_SEL << 17) | (MW_EPWMXBAR22_CMPSSB9_CTRIPL_SEL << 18) | (MW_EPWMXBAR22_CMPSSB9_CTRIPH_SEL << 19);
    group2_epwmxbar[22] = (MW_EPWMXBAR22_SD0_FILT0_CEVT1_SEL << 0) | (MW_EPWMXBAR22_SD0_FILT0_CEVT2_SEL << 1) | (MW_EPWMXBAR22_SD0_FILT0_CMPHZ_SEL << 2) | (MW_EPWMXBAR22_SD0_FILT1_CEVT1_SEL << 3) | (MW_EPWMXBAR22_SD0_FILT1_CEVT2_SEL << 4) | (MW_EPWMXBAR22_SD0_FILT1_CMPHZ_SEL << 5) | (MW_EPWMXBAR22_SD0_FILT2_CEVT1_SEL << 6) | (MW_EPWMXBAR22_SD0_FILT2_CEVT2_SEL << 7) | (MW_EPWMXBAR22_SD0_FILT2_CMPHZ_SEL << 8) | (MW_EPWMXBAR22_SD0_FILT3_CEVT1_SEL << 9) | (MW_EPWMXBAR22_SD0_FILT3_CEVT2_SEL << 10) | (MW_EPWMXBAR22_SD0_FILT3_CMPHZ_SEL << 11) | (MW_EPWMXBAR22_SD1_FILT0_CEVT1_SEL << 12) | (MW_EPWMXBAR22_SD1_FILT0_CEVT2_SEL << 13) | (MW_EPWMXBAR22_SD1_FILT0_CMPHZ_SEL << 14) | (MW_EPWMXBAR22_SD1_FILT1_CEVT1_SEL << 15) | (MW_EPWMXBAR22_SD1_FILT1_CEVT2_SEL << 16) | (MW_EPWMXBAR22_SD1_FILT1_CMPHZ_SEL << 17) | (MW_EPWMXBAR22_SD1_FILT2_CEVT1_SEL << 18) | (MW_EPWMXBAR22_SD1_FILT2_CEVT2_SEL << 19) | (MW_EPWMXBAR22_SD1_FILT2_CMPHZ_SEL << 20) | (MW_EPWMXBAR22_SD1_FILT3_CEVT1_SEL << 21) | (MW_EPWMXBAR22_SD1_FILT3_CEVT2_SEL << 22) | (MW_EPWMXBAR22_SD1_FILT3_CMPHZ_SEL << 23);
    group3_epwmxbar[22] = (MW_EPWMXBAR22_ADC0_EVT1_SEL << 0) | (MW_EPWMXBAR22_ADC0_EVT2_SEL << 1) | (MW_EPWMXBAR22_ADC0_EVT3_SEL << 2) | (MW_EPWMXBAR22_ADC0_EVT4_SEL << 3) | (MW_EPWMXBAR22_ADC1_EVT1_SEL << 4) | (MW_EPWMXBAR22_ADC1_EVT2_SEL << 5) | (MW_EPWMXBAR22_ADC1_EVT3_SEL << 6) | (MW_EPWMXBAR22_ADC1_EVT4_SEL << 7) | (MW_EPWMXBAR22_ADC2_EVT1_SEL << 8) | (MW_EPWMXBAR22_ADC2_EVT2_SEL << 9) | (MW_EPWMXBAR22_ADC2_EVT3_SEL << 10) | (MW_EPWMXBAR22_ADC2_EVT4_SEL << 11) | (MW_EPWMXBAR22_ADC3_EVT1_SEL << 12) | (MW_EPWMXBAR22_ADC3_EVT2_SEL << 13) | (MW_EPWMXBAR22_ADC3_EVT3_SEL << 14) | (MW_EPWMXBAR22_ADC3_EVT4_SEL << 15) | (MW_EPWMXBAR22_ADC4_EVT1_SEL << 16) | (MW_EPWMXBAR22_ADC4_EVT2_SEL << 17) | (MW_EPWMXBAR22_ADC4_EVT3_SEL << 18) | (MW_EPWMXBAR22_ADC4_EVT4_SEL << 19);
