TexasInstruments/am26x-hsp/src/am263px_init.c
    // if(MW_EPWMXBAR22_GPIO0_SEL == 1 | MW_EPWMXBAR22_GPIO1_SEL == 1 | MW_EPWMXBAR22_GPIO2_SEL == 1 | MW_EPWMXBAR22_GPIO3_SEL == 1 | MW_EPWMXBAR22_GPIO4_SEL == 1 | MW_EPWMXBAR22_GPIO5_SEL == 1 | MW_EPWMXBAR22_GPIO6_SEL == 1 | MW_EPWMXBAR22_GPIO7_SEL == 1| MW_EPWMXBAR22_GPIO8_SEL == 1 | MW_EPWMXBAR22_GPIO9_SEL == 1 | MW_EPWMXBAR22_GPIO10_SEL == 1| MW_EPWMXBAR22_GPIO11_SEL == 1| MW_EPWMXBAR22_GPIO12_SEL == 1 | MW_EPWMXBAR22_GPIO13_SEL == 1 | MW_EPWMXBAR22_GPIO14_SEL == 1 | MW_EPWMXBAR22_GPIO15_SEL == 1 | MW_EPWMXBAR22_GPIO16_SEL == 1 | MW_EPWMXBAR22_GPIO17_SEL == 1 | MW_EPWMXBAR22_GPIO18_SEL == 1 | MW_EPWMXBAR22_GPIO19_SEL == 1 | MW_EPWMXBAR22_GPIO20_SEL == 1 | MW_EPWMXBAR22_GPIO21_SEL == 1 | MW_EPWMXBAR22_GPIO22_SEL == 1 | MW_EPWMXBAR22_GPIO23_SEL == 1 | MW_EPWMXBAR22_GPIO24_SEL == 1 | MW_EPWMXBAR22_GPIO25_SEL == 1 | MW_EPWMXBAR22_GPIO26_SEL == 1 | MW_EPWMXBAR22_GPIO27_SEL == 1 | MW_EPWMXBAR22_GPIO28_SEL == 1 | MW_EPWMXBAR22_GPIO29_SEL == 1 | MW_EPWMXBAR22_GPIO30_SEL == 1 | MW_EPWMXBAR22_GPIO31_SEL == 1 | MW_EPWMXBAR22_GPIO32_SEL == 1 | MW_EPWMXBAR22_GPIO33_SEL == 1 | MW_EPWMXBAR22_GPIO34_SEL == 1 | MW_EPWMXBAR22_GPIO35_SEL == 1 | MW_EPWMXBAR22_GPIO36_SEL == 1 | MW_EPWMXBAR22_GPIO37_SEL == 1 | MW_EPWMXBAR22_GPIO38_SEL == 1 | MW_EPWMXBAR22_GPIO39_SEL == 1 | MW_EPWMXBAR22_GPIO40_SEL == 1 | MW_EPWMXBAR22_GPIO41_SEL == 1 | MW_EPWMXBAR22_GPIO42_SEL == 1 | MW_EPWMXBAR22_GPIO43_SEL == 1 | MW_EPWMXBAR22_GPIO44_SEL == 1 | | MW_EPWMXBAR22_GPIO45_SEL == 1 | MW_EPWMXBAR22_GPIO46_SEL == 1 | MW_EPWMXBAR22_GPIO47_SEL == 1| MW_EPWMXBAR22_GPIO48_SEL == 1 | MW_EPWMXBAR22_GPIO49_SEL == 1 | MW_EPWMXBAR22_GPIO50_SEL == 1 | MW_EPWMXBAR22_GPIO51_SEL == 1 | MW_EPWMXBAR22_GPIO52_SEL == 1 | MW_EPWMXBAR22_GPIO53_SEL == 1 | MW_EPWMXBAR22_GPIO54_SEL == 1 | MW_EPWMXBAR22_GPIO55_SEL == 1 | MW_EPWMXBAR22_GPIO56_SEL == 1 | MW_EPWMXBAR22_GPIO57_SEL == 1| MW_EPWMXBAR22_GPIO58_SEL == 1 | MW_EPWMXBAR22_GPIO59_SEL == 1 | MW_EPWMXBAR22_GPIO60_SEL == 1 | MW_EPWMXBAR22_GPIO61_SEL == 1 | MW_EPWMXBAR22_GPIO62_SEL == 1 | MW_EPWMXBAR22_GPIO63_SEL == 1 | MW_EPWMXBAR22_GPIO64_SEL == 1 | | MW_EPWMXBAR22_GPIO59_SEL == 1 | MW_EPWMXBAR22_GPIO60_SEL == 1 | MW_EPWMXBAR22_GPIO61_SEL == 1 | MW_EPWMXBAR22_GPIO62_SEL == 1 | MW_EPWMXBAR22_GPIO63_SEL == 1 | MW_EPWMXBAR22_GPIO64_SEL == 1 | MW_EPWMXBAR22_GPIO65_SEL == 1 | MW_EPWMXBAR22_GPIO66_SEL == 1 | MW_EPWMXBAR22_GPIO67_SEL == 1 | MW_EPWMXBAR22_GPIO68_SEL == 1 | MW_EPWMXBAR22_GPIO69_SEL == 1 | MW_EPWMXBAR22_GPIO70_SEL == 1 | MW_EPWMXBAR22_GPIO71_SEL == 1 | MW_EPWMXBAR22_GPIO72_SEL == 1 | MW_EPWMXBAR22_GPIO73_SEL == 1 | MW_EPWMXBAR22_GPIO74_SEL == 1 | MW_EPWMXBAR22_GPIO75_SEL == 1 | MW_EPWMXBAR22_GPIO76_SEL == 1 | MW_EPWMXBAR22_GPIO77_SEL == 1 | MW_EPWMXBAR22_GPIO78_SEL == 1 | | MW_EPWMXBAR22_GPIO80_SEL == 1 | MW_EPWMXBAR22_GPIO81_SEL == 1 | MW_EPWMXBAR22_GPIO82_SEL == 1 | MW_EPWMXBAR22_GPIO83_SEL == 1 | MW_EPWMXBAR22_GPIO84_SEL == 1 | MW_EPWMXBAR22_GPIO85_SEL == 1 | MW_EPWMXBAR22_GPIO86_SEL == 1 | MW_EPWMXBAR22_GPIO87_SEL == 1 | MW_EPWMXBAR22_GPIO88_SEL == 1 | MW_EPWMXBAR22_GPIO89_SEL == 1 | MW_EPWMXBAR22_GPIO90_SEL == 1 | MW_EPWMXBAR22_GPIO91_SEL == 1 | MW_EPWMXBAR22_GPIO92_SEL == 1 | MW_EPWMXBAR22_GPIO93_SEL == 1 | MW_EPWMXBAR22_GPIO94_SEL == 1 | MW_EPWMXBAR22_GPIO95_SEL == 1 | MW_EPWMXBAR22_GPIO96_SEL == 1 | MW_EPWMXBAR22_GPIO97_SEL == 1 | MW_EPWMXBAR22_GPIO98_SEL == 1 | MW_EPWMXBAR22_GPIO99_SEL == 1 | MW_EPWMXBAR22_GPIO100_SEL == 1 | MW_EPWMXBAR22_GPIO101_SEL == 1 | MW_EPWMXBAR22_GPIO102_SEL == 1 | MW_EPWMXBAR22_GPIO103_SEL == 1 | MW_EPWMXBAR22_GPIO104_SEL == 1 | MW_EPWMXBAR22_GPIO105_SEL == 1 | MW_EPWMXBAR22_GPIO106_SEL == 1 | MW_EPWMXBAR22_GPIO107_SEL == 1 | | MW_EPWMXBAR22_GPIO108_SEL == 1 | MW_EPWMXBAR22_GPIO109_SEL == 1| MW_EPWMXBAR22_GPIO110_SEL == 1 | MW_EPWMXBAR22_GPIO111_SEL == 1 | MW_EPWMXBAR22_GPIO112_SEL == 1 | MW_EPWMXBAR22_GPIO113_SEL == 1 | MW_EPWMXBAR22_GPIO114_SEL == 1 | MW_EPWMXBAR22_GPIO115_SEL == 1 | MW_EPWMXBAR22_GPIO116_SEL == 1 | MW_EPWMXBAR22_GPIO117_SEL == 1 | MW_EPWMXBAR22_GPIO118_SEL == 1 | MW_EPWMXBAR22_GPIO119_SEL == 1 | MW_EPWMXBAR22_GPIO120_SEL == 1 | MW_EPWMXBAR22_GPIO121_SEL == 1 | MW_EPWMXBAR22_GPIO122_SEL == 1 | MW_EPWMXBAR22_GPIO123_SEL == 1 | MW_EPWMXBAR22_GPIO124_SEL == 1 | MW_EPWMXBAR22_GPIO125_SEL == 1 | MW_EPWMXBAR22_GPIO126_SEL == 1 | MW_EPWMXBAR22_GPIO127_SEL == 1 | MW_EPWMXBAR22_GPIO128_SEL == 1 | MW_EPWMXBAR22_GPIO129_SEL == 1 | MW_EPWMXBAR22_GPIO130_SEL == 1 | MW_EPWMXBAR22_GPIO131_SEL == 1 | MW_EPWMXBAR22_GPIO132_SEL == 1 | MW_EPWMXBAR22_GPIO133_SEL == 1 | MW_EPWMXBAR22_GPIO134_SEL == 1 | MW_EPWMXBAR22_GPIO135_SEL == 1 | MW_EPWMXBAR22_GPIO136_SEL == 1 | MW_EPWMXBAR22_GPIO137_SEL == 1 | MW_EPWMXBAR22_GPIO139_SEL == 1 | MW_EPWMXBAR22_GPIO140_SEL == 1 | MW_EPWMXBAR22_GPIO141_SEL == 1 | MW_EPWMXBAR22_GPIO142_SEL == 1 | MW_EPWMXBAR22_GPIO143_SEL == 1 | MW_EPWMXBAR22_ICSSGPO0_PORT0_SEL == 1 | MW_EPWMXBAR22_ICSSGPO1_PORT0_SEL == 1 | MW_EPWMXBAR22_ICSSGPO2_PORT0_SEL == 1 | MW_EPWMXBAR22_ICSSGPO3_PORT0_SEL == 1 | MW_EPWMXBAR22_ICSSGPO4_PORT0_SEL == 1 | MW_EPWMXBAR22_ICSSGPO5_PORT0_SEL == 1 | MW_EPWMXBAR22_ICSSGPO6_PORT0_SEL == 1 | MW_EPWMXBAR22_ICSSGPO7_PORT0_SEL == 1 | MW_EPWMXBAR22_ICSSGPO8_PORT0_SEL == 1 | MW_EPWMXBAR22_ICSSGPO9_PORT0_SEL == 1 | MW_EPWMXBAR22_ICSSGPO10_PORT0_SEL == 1 | MW_EPWMXBAR22_ICSSGPO11_PORT0_SEL == 1 | MW_EPWMXBAR22_ICSSGPO12_PORT0_SEL == 1 | MW_EPWMXBAR22_ICSSGPO13_PORT0_SEL == 1 | MW_EPWMXBAR22_ICSSGPO14_PORT0_SEL == 1 | MW_EPWMXBAR22_ICSSGPO15_PORT0_SEL == 1 | MW_EPWMXBAR22_ICSSGPO0_PORT1_SEL == 1 | MW_EPWMXBAR22_ICSSGPO1_PORT1_SEL == 1 | MW_EPWMXBAR22_ICSSGPO2_PORT1_SEL == 1 | MW_EPWMXBAR22_ICSSGPO3_PORT1_SEL == 1 | MW_EPWMXBAR22_ICSSGPO4_PORT1_SEL == 1 | MW_EPWMXBAR22_ICSSGPO5_PORT1_SEL == 1 | MW_EPWMXBAR22_ICSSGPO6_PORT1_SEL == 1 | MW_EPWMXBAR22_ICSSGPO7_PORT1_SEL == 1 | MW_EPWMXBAR22_ICSSGPO8_PORT1_SEL == 1 | MW_EPWMXBAR22_ICSSGPO9_PORT1_SEL == 1 | MW_EPWMXBAR22_ICSSGPO10_PORT1_SEL == 1 | MW_EPWMXBAR22_ICSSGPO11_PORT1_SEL == 1 | MW_EPWMXBAR22_ICSSGPO12_PORT1_SEL == 1 | MW_EPWMXBAR22_ICSSGPO13_PORT1_SEL == 1 | MW_EPWMXBAR22_ICSSGPO14_PORT1_SEL == 1 | MW_EPWMXBAR22_ICSSGPO15_PORT1_SEL == 1)
    //     group4_epwmxbar[22] = EPWM_XBAR_22;
    // else
        group4_epwmxbar[22] = 0;
    group5_epwmxbar[22] = (MW_EPWMXBAR22_EPWM0_TRIPOUT_SEL << 0) | (MW_EPWMXBAR22_EPWM1_TRIPOUT_SEL << 1) | (MW_EPWMXBAR22_EPWM2_TRIPOUT_SEL << 2) | (MW_EPWMXBAR22_EPWM3_TRIPOUT_SEL << 3) | (MW_EPWMXBAR22_EPWM4_TRIPOUT_SEL << 4) | (MW_EPWMXBAR22_EPWM5_TRIPOUT_SEL << 5) | (MW_EPWMXBAR22_EPWM6_TRIPOUT_SEL << 6) | (MW_EPWMXBAR22_EPWM7_TRIPOUT_SEL << 7) | (MW_EPWMXBAR22_EPWM8_TRIPOUT_SEL << 8) | (MW_EPWMXBAR22_EPWM9_TRIPOUT_SEL << 9) | (MW_EPWMXBAR22_EPWM10_TRIPOUT_SEL << 10) | (MW_EPWMXBAR22_EPWM11_TRIPOUT_SEL << 11) | (MW_EPWMXBAR22_EPWM12_TRIPOUT_SEL << 12) | (MW_EPWMXBAR22_EPWM13_TRIPOUT_SEL << 13) | (MW_EPWMXBAR22_EPWM14_TRIPOUT_SEL << 14) | (MW_EPWMXBAR22_EPWM15_TRIPOUT_SEL << 15) | (MW_EPWMXBAR22_EPWM16_TRIPOUT_SEL << 16) | (MW_EPWMXBAR22_EPWM17_TRIPOUT_SEL << 17) | (MW_EPWMXBAR22_EPWM18_TRIPOUT_SEL << 18) | (MW_EPWMXBAR22_EPWM19_TRIPOUT_SEL << 19) | (MW_EPWMXBAR22_EPWM20_TRIPOUT_SEL << 20) | (MW_EPWMXBAR22_EPWM21_TRIPOUT_SEL << 21) | (MW_EPWMXBAR22_EPWM22_TRIPOUT_SEL << 22) | (MW_EPWMXBAR22_EPWM23_TRIPOUT_SEL << 23) | (MW_EPWMXBAR22_EPWM24_TRIPOUT_SEL << 24) | (MW_EPWMXBAR22_EPWM25_TRIPOUT_SEL << 25) | (MW_EPWMXBAR22_EPWM26_TRIPOUT_SEL << 26) | (MW_EPWMXBAR22_EPWM27_TRIPOUT_SEL << 27) | (MW_EPWMXBAR22_EPWM28_TRIPOUT_SEL << 28) | (MW_EPWMXBAR22_EPWM29_TRIPOUT_SEL << 29) | (MW_EPWMXBAR22_EPWM30_TRIPOUT_SEL << 30) | (MW_EPWMXBAR22_EPWM31_TRIPOUT_SEL << 31);
    group6_epwmxbar[22] = (MW_EPWMXBAR22_DEL0_TRIP_SEL << 0) | (MW_EPWMXBAR22_DEL1_TRIP_SEL << 1) | (MW_EPWMXBAR22_DEL2_TRIP_SEL << 2) | (MW_EPWMXBAR22_DEL3_TRIP_SEL << 3) | (MW_EPWMXBAR22_DEL4_TRIP_SEL << 4) | (MW_EPWMXBAR22_DEL5_TRIP_SEL << 5) | (MW_EPWMXBAR22_DEL6_TRIP_SEL << 6) | (MW_EPWMXBAR22_DEL7_TRIP_SEL << 7) | (MW_EPWMXBAR22_DEL8_TRIP_SEL << 8) | (MW_EPWMXBAR22_DEL9_TRIP_SEL << 9) | (MW_EPWMXBAR22_DEL10_TRIP_SEL << 10) | (MW_EPWMXBAR22_DEL11_TRIP_SEL << 11) | (MW_EPWMXBAR22_DEL12_TRIP_SEL << 12) | (MW_EPWMXBAR22_DEL13_TRIP_SEL << 13) | (MW_EPWMXBAR22_DEL14_TRIP_SEL << 14) | (MW_EPWMXBAR22_DEL15_TRIP_SEL << 15) | (MW_EPWMXBAR22_DEL16_TRIP_SEL << 16) | (MW_EPWMXBAR22_DEL17_TRIP_SEL << 17) | (MW_EPWMXBAR22_DEL18_TRIP_SEL << 18) | (MW_EPWMXBAR22_DEL19_TRIP_SEL << 19) | (MW_EPWMXBAR22_DEL20_TRIP_SEL << 20) | (MW_EPWMXBAR22_DEL21_TRIP_SEL << 21) | (MW_EPWMXBAR22_DEL22_TRIP_SEL << 22) | (MW_EPWMXBAR22_DEL23_TRIP_SEL << 23) | (MW_EPWMXBAR22_DEL24_TRIP_SEL << 24) | (MW_EPWMXBAR22_DEL25_TRIP_SEL << 25) | (MW_EPWMXBAR22_DEL26_TRIP_SEL << 26) | (MW_EPWMXBAR22_DEL27_TRIP_SEL << 27) | (MW_EPWMXBAR22_DEL28_TRIP_SEL << 28) | (MW_EPWMXBAR22_DEL29_TRIP_SEL << 29) | (MW_EPWMXBAR22_DEL30_TRIP_SEL << 30) | (MW_EPWMXBAR22_DEL31_TRIP_SEL << 31);
    group7_epwmxbar[22] = (MW_EPWMXBAR22_DEL0_ACTIVE_SEL << 0) | (MW_EPWMXBAR22_DEL1_ACTIVE_SEL << 1) | (MW_EPWMXBAR22_DEL2_ACTIVE_SEL << 2) | (MW_EPWMXBAR22_DEL3_ACTIVE_SEL << 3) | (MW_EPWMXBAR22_DEL4_ACTIVE_SEL << 4) | (MW_EPWMXBAR22_DEL5_ACTIVE_SEL << 5) | (MW_EPWMXBAR22_DEL6_ACTIVE_SEL << 6) | (MW_EPWMXBAR22_DEL7_ACTIVE_SEL << 7) | (MW_EPWMXBAR22_DEL8_ACTIVE_SEL << 8) | (MW_EPWMXBAR22_DEL9_ACTIVE_SEL << 9) | (MW_EPWMXBAR22_DEL10_ACTIVE_SEL << 10) | (MW_EPWMXBAR22_DEL11_ACTIVE_SEL << 11) | (MW_EPWMXBAR22_DEL12_ACTIVE_SEL << 12) | (MW_EPWMXBAR22_DEL13_ACTIVE_SEL << 13) | (MW_EPWMXBAR22_DEL14_ACTIVE_SEL << 14) | (MW_EPWMXBAR22_DEL15_ACTIVE_SEL << 15) | (MW_EPWMXBAR22_DEL16_ACTIVE_SEL << 16) | (MW_EPWMXBAR22_DEL17_ACTIVE_SEL << 17) | (MW_EPWMXBAR22_DEL18_ACTIVE_SEL << 18) | (MW_EPWMXBAR22_DEL19_ACTIVE_SEL << 19) | (MW_EPWMXBAR22_DEL20_ACTIVE_SEL << 20) | (MW_EPWMXBAR22_DEL21_ACTIVE_SEL << 21) | (MW_EPWMXBAR22_DEL22_ACTIVE_SEL << 22) | (MW_EPWMXBAR22_DEL23_ACTIVE_SEL << 23) | (MW_EPWMXBAR22_DEL24_ACTIVE_SEL << 24) | (MW_EPWMXBAR22_DEL25_ACTIVE_SEL << 25) | (MW_EPWMXBAR22_DEL26_ACTIVE_SEL << 26) | (MW_EPWMXBAR22_DEL27_ACTIVE_SEL << 27) | (MW_EPWMXBAR22_DEL28_ACTIVE_SEL << 28) | (MW_EPWMXBAR22_DEL29_ACTIVE_SEL << 29) | (MW_EPWMXBAR22_DEL30_ACTIVE_SEL << 30) | (MW_EPWMXBAR22_DEL31_ACTIVE_SEL << 31);
    group8_epwmxbar[22] = (MW_EPWMXBAR22_EQEP0_ERR_SEL << 0) | (MW_EPWMXBAR22_EQEP1_ERR_SEL << 1) | (MW_EPWMXBAR22_EQEP2_ERR_SEL << 2) | (MW_EPWMXBAR22_FSIRX0_RX_TRIG0_SEL << 3) | (MW_EPWMXBAR22_FSIRX0_RX_TRIG1_SEL << 4) | (MW_EPWMXBAR22_FSIRX0_RX_TRIG2_SEL << 5) | (MW_EPWMXBAR22_FSIRX0_RX_TRIG3_SEL << 6) | (MW_EPWMXBAR22_FSIRX1_RX_TRIG0_SEL << 7) | (MW_EPWMXBAR22_FSIRX1_RX_TRIG1_SEL << 8) | (MW_EPWMXBAR22_FSIRX1_RX_TRIG2_SEL << 9) | (MW_EPWMXBAR22_FSIRX1_RX_TRIG3_SEL << 10) | (MW_EPWMXBAR22_FSIRX2_RX_TRIG0_SEL << 11) | (MW_EPWMXBAR22_FSIRX2_RX_TRIG1_SEL << 12) | (MW_EPWMXBAR22_FSIRX2_RX_TRIG2_SEL << 13) | (MW_EPWMXBAR22_FSIRX2_RX_TRIG3_SEL << 14) | (MW_EPWMXBAR22_FSIRX3_RX_TRIG0_SEL << 15) | (MW_EPWMXBAR22_FSIRX3_RX_TRIG1_SEL << 16) | (MW_EPWMXBAR22_FSIRX3_RX_TRIG2_SEL << 17) | (MW_EPWMXBAR22_FSIRX3_RX_TRIG3_SEL << 18) | (MW_EPWMXBAR22_ECAP0_TRIPOUT_SEL << 19) | (MW_EPWMXBAR22_ECAP1_TRIPOUT_SEL << 20) | (MW_EPWMXBAR22_ECAP2_TRIPOUT_SEL << 21) | (MW_EPWMXBAR22_ECAP3_TRIPOUT_SEL << 22) | (MW_EPWMXBAR22_ECAP4_TRIPOUT_SEL << 23) | (MW_EPWMXBAR22_ECAP5_TRIPOUT_SEL << 24) | (MW_EPWMXBAR22_ECAP6_TRIPOUT_SEL << 25) | (MW_EPWMXBAR22_ECAP7_TRIPOUT_SEL << 26) | (MW_EPWMXBAR22_ECAP8_TRIPOUT_SEL << 27) | (MW_EPWMXBAR22_ECAP9_TRIPOUT_SEL << 28);
    group0_epwmxbar[23] = (MW_EPWMXBAR23_CMPSSA0_CTRIPL_SEL << 0) | (MW_EPWMXBAR23_CMPSSA0_CTRIPH_SEL << 1) | (MW_EPWMXBAR23_CMPSSA1_CTRIPL_SEL << 2) | (MW_EPWMXBAR23_CMPSSA1_CTRIPH_SEL << 3) | (MW_EPWMXBAR23_CMPSSA2_CTRIPL_SEL << 4) | (MW_EPWMXBAR23_CMPSSA2_CTRIPH_SEL << 5) | (MW_EPWMXBAR23_CMPSSA3_CTRIPL_SEL << 6) | (MW_EPWMXBAR23_CMPSSA3_CTRIPH_SEL << 7) | (MW_EPWMXBAR23_CMPSSA4_CTRIPL_SEL << 8) | (MW_EPWMXBAR23_CMPSSA4_CTRIPH_SEL << 9) | (MW_EPWMXBAR23_CMPSSA5_CTRIPL_SEL << 10) | (MW_EPWMXBAR23_CMPSSA5_CTRIPH_SEL << 11) | (MW_EPWMXBAR23_CMPSSA6_CTRIPL_SEL << 12) | (MW_EPWMXBAR23_CMPSSA6_CTRIPH_SEL << 13) | (MW_EPWMXBAR23_CMPSSA7_CTRIPL_SEL << 14) | (MW_EPWMXBAR23_CMPSSA7_CTRIPH_SEL << 15) | (MW_EPWMXBAR23_CMPSSA8_CTRIPL_SEL << 16) | (MW_EPWMXBAR23_CMPSSA8_CTRIPH_SEL << 17) | (MW_EPWMXBAR23_CMPSSA9_CTRIPL_SEL << 18) | (MW_EPWMXBAR23_CMPSSA9_CTRIPH_SEL << 19);
    group1_epwmxbar[23] = (MW_EPWMXBAR23_CMPSSB0_CTRIPL_SEL << 0) | (MW_EPWMXBAR23_CMPSSB0_CTRIPH_SEL << 1) | (MW_EPWMXBAR23_CMPSSB1_CTRIPL_SEL << 2) | (MW_EPWMXBAR23_CMPSSB1_CTRIPH_SEL << 3) | (MW_EPWMXBAR23_CMPSSB2_CTRIPL_SEL << 4) | (MW_EPWMXBAR23_CMPSSB2_CTRIPH_SEL << 5) | (MW_EPWMXBAR23_CMPSSB3_CTRIPL_SEL << 6) | (MW_EPWMXBAR23_CMPSSB3_CTRIPH_SEL << 7) | (MW_EPWMXBAR23_CMPSSB4_CTRIPL_SEL << 8) | (MW_EPWMXBAR23_CMPSSB4_CTRIPH_SEL << 9) | (MW_EPWMXBAR23_CMPSSB5_CTRIPL_SEL << 10) | (MW_EPWMXBAR23_CMPSSB5_CTRIPH_SEL << 11) | (MW_EPWMXBAR23_CMPSSB6_CTRIPL_SEL << 12) | (MW_EPWMXBAR23_CMPSSB6_CTRIPH_SEL << 13) | (MW_EPWMXBAR23_CMPSSB7_CTRIPL_SEL << 14) | (MW_EPWMXBAR23_CMPSSB7_CTRIPH_SEL << 15) | (MW_EPWMXBAR23_CMPSSB8_CTRIPL_SEL << 16) | (MW_EPWMXBAR23_CMPSSB8_CTRIPH_SEL << 17) | (MW_EPWMXBAR23_CMPSSB9_CTRIPL_SEL << 18) | (MW_EPWMXBAR23_CMPSSB9_CTRIPH_SEL << 19);
    group2_epwmxbar[23] = (MW_EPWMXBAR23_SD0_FILT0_CEVT1_SEL << 0) | (MW_EPWMXBAR23_SD0_FILT0_CEVT2_SEL << 1) | (MW_EPWMXBAR23_SD0_FILT0_CMPHZ_SEL << 2) | (MW_EPWMXBAR23_SD0_FILT1_CEVT1_SEL << 3) | (MW_EPWMXBAR23_SD0_FILT1_CEVT2_SEL << 4) | (MW_EPWMXBAR23_SD0_FILT1_CMPHZ_SEL << 5) | (MW_EPWMXBAR23_SD0_FILT2_CEVT1_SEL << 6) | (MW_EPWMXBAR23_SD0_FILT2_CEVT2_SEL << 7) | (MW_EPWMXBAR23_SD0_FILT2_CMPHZ_SEL << 8) | (MW_EPWMXBAR23_SD0_FILT3_CEVT1_SEL << 9) | (MW_EPWMXBAR23_SD0_FILT3_CEVT2_SEL << 10) | (MW_EPWMXBAR23_SD0_FILT3_CMPHZ_SEL << 11) | (MW_EPWMXBAR23_SD1_FILT0_CEVT1_SEL << 12) | (MW_EPWMXBAR23_SD1_FILT0_CEVT2_SEL << 13) | (MW_EPWMXBAR23_SD1_FILT0_CMPHZ_SEL << 14) | (MW_EPWMXBAR23_SD1_FILT1_CEVT1_SEL << 15) | (MW_EPWMXBAR23_SD1_FILT1_CEVT2_SEL << 16) | (MW_EPWMXBAR23_SD1_FILT1_CMPHZ_SEL << 17) | (MW_EPWMXBAR23_SD1_FILT2_CEVT1_SEL << 18) | (MW_EPWMXBAR23_SD1_FILT2_CEVT2_SEL << 19) | (MW_EPWMXBAR23_SD1_FILT2_CMPHZ_SEL << 20) | (MW_EPWMXBAR23_SD1_FILT3_CEVT1_SEL << 21) | (MW_EPWMXBAR23_SD1_FILT3_CEVT2_SEL << 22) | (MW_EPWMXBAR23_SD1_FILT3_CMPHZ_SEL << 23);
    group3_epwmxbar[23] = (MW_EPWMXBAR23_ADC0_EVT1_SEL << 0) | (MW_EPWMXBAR23_ADC0_EVT2_SEL << 1) | (MW_EPWMXBAR23_ADC0_EVT3_SEL << 2) | (MW_EPWMXBAR23_ADC0_EVT4_SEL << 3) | (MW_EPWMXBAR23_ADC1_EVT1_SEL << 4) | (MW_EPWMXBAR23_ADC1_EVT2_SEL << 5) | (MW_EPWMXBAR23_ADC1_EVT3_SEL << 6) | (MW_EPWMXBAR23_ADC1_EVT4_SEL << 7) | (MW_EPWMXBAR23_ADC2_EVT1_SEL << 8) | (MW_EPWMXBAR23_ADC2_EVT2_SEL << 9) | (MW_EPWMXBAR23_ADC2_EVT3_SEL << 10) | (MW_EPWMXBAR23_ADC2_EVT4_SEL << 11) | (MW_EPWMXBAR23_ADC3_EVT1_SEL << 12) | (MW_EPWMXBAR23_ADC3_EVT2_SEL << 13) | (MW_EPWMXBAR23_ADC3_EVT3_SEL << 14) | (MW_EPWMXBAR23_ADC3_EVT4_SEL << 15) | (MW_EPWMXBAR23_ADC4_EVT1_SEL << 16) | (MW_EPWMXBAR23_ADC4_EVT2_SEL << 17) | (MW_EPWMXBAR23_ADC4_EVT3_SEL << 18) | (MW_EPWMXBAR23_ADC4_EVT4_SEL << 19);
    // if(MW_EPWMXBAR23_GPIO0_SEL == 1 | MW_EPWMXBAR23_GPIO1_SEL == 1 | MW_EPWMXBAR23_GPIO2_SEL == 1 | MW_EPWMXBAR23_GPIO3_SEL == 1 | MW_EPWMXBAR23_GPIO4_SEL == 1 | MW_EPWMXBAR23_GPIO5_SEL == 1 | MW_EPWMXBAR23_GPIO6_SEL == 1 | MW_EPWMXBAR23_GPIO7_SEL == 1| MW_EPWMXBAR23_GPIO8_SEL == 1 | MW_EPWMXBAR23_GPIO9_SEL == 1 | MW_EPWMXBAR23_GPIO10_SEL == 1| MW_EPWMXBAR23_GPIO11_SEL == 1| MW_EPWMXBAR23_GPIO12_SEL == 1 | MW_EPWMXBAR23_GPIO13_SEL == 1 | MW_EPWMXBAR23_GPIO14_SEL == 1 | MW_EPWMXBAR23_GPIO15_SEL == 1 | MW_EPWMXBAR23_GPIO16_SEL == 1 | MW_EPWMXBAR23_GPIO17_SEL == 1 | MW_EPWMXBAR23_GPIO18_SEL == 1 | MW_EPWMXBAR23_GPIO19_SEL == 1 | MW_EPWMXBAR23_GPIO20_SEL == 1 | MW_EPWMXBAR23_GPIO21_SEL == 1 | MW_EPWMXBAR23_GPIO22_SEL == 1 | MW_EPWMXBAR23_GPIO23_SEL == 1 | MW_EPWMXBAR23_GPIO24_SEL == 1 | MW_EPWMXBAR23_GPIO25_SEL == 1 | MW_EPWMXBAR23_GPIO26_SEL == 1 | MW_EPWMXBAR23_GPIO27_SEL == 1 | MW_EPWMXBAR23_GPIO28_SEL == 1 | MW_EPWMXBAR23_GPIO29_SEL == 1 | MW_EPWMXBAR23_GPIO30_SEL == 1 | MW_EPWMXBAR23_GPIO31_SEL == 1 | MW_EPWMXBAR23_GPIO32_SEL == 1 | MW_EPWMXBAR23_GPIO33_SEL == 1 | MW_EPWMXBAR23_GPIO34_SEL == 1 | MW_EPWMXBAR23_GPIO35_SEL == 1 | MW_EPWMXBAR23_GPIO36_SEL == 1 | MW_EPWMXBAR23_GPIO37_SEL == 1 | MW_EPWMXBAR23_GPIO38_SEL == 1 | MW_EPWMXBAR23_GPIO39_SEL == 1 | MW_EPWMXBAR23_GPIO40_SEL == 1 | MW_EPWMXBAR23_GPIO41_SEL == 1 | MW_EPWMXBAR23_GPIO42_SEL == 1 | MW_EPWMXBAR23_GPIO43_SEL == 1 | MW_EPWMXBAR23_GPIO44_SEL == 1 | | MW_EPWMXBAR23_GPIO45_SEL == 1 | MW_EPWMXBAR23_GPIO46_SEL == 1 | MW_EPWMXBAR23_GPIO47_SEL == 1| MW_EPWMXBAR23_GPIO48_SEL == 1 | MW_EPWMXBAR23_GPIO49_SEL == 1 | MW_EPWMXBAR23_GPIO50_SEL == 1 | MW_EPWMXBAR23_GPIO51_SEL == 1 | MW_EPWMXBAR23_GPIO52_SEL == 1 | MW_EPWMXBAR23_GPIO53_SEL == 1 | MW_EPWMXBAR23_GPIO54_SEL == 1 | MW_EPWMXBAR23_GPIO55_SEL == 1 | MW_EPWMXBAR23_GPIO56_SEL == 1 | MW_EPWMXBAR23_GPIO57_SEL == 1| MW_EPWMXBAR23_GPIO58_SEL == 1 | MW_EPWMXBAR23_GPIO59_SEL == 1 | MW_EPWMXBAR23_GPIO60_SEL == 1 | MW_EPWMXBAR23_GPIO61_SEL == 1 | MW_EPWMXBAR23_GPIO62_SEL == 1 | MW_EPWMXBAR23_GPIO63_SEL == 1 | MW_EPWMXBAR23_GPIO64_SEL == 1 | | MW_EPWMXBAR23_GPIO59_SEL == 1 | MW_EPWMXBAR23_GPIO60_SEL == 1 | MW_EPWMXBAR23_GPIO61_SEL == 1 | MW_EPWMXBAR23_GPIO62_SEL == 1 | MW_EPWMXBAR23_GPIO63_SEL == 1 | MW_EPWMXBAR23_GPIO64_SEL == 1 | MW_EPWMXBAR23_GPIO65_SEL == 1 | MW_EPWMXBAR23_GPIO66_SEL == 1 | MW_EPWMXBAR23_GPIO67_SEL == 1 | MW_EPWMXBAR23_GPIO68_SEL == 1 | MW_EPWMXBAR23_GPIO69_SEL == 1 | MW_EPWMXBAR23_GPIO70_SEL == 1 | MW_EPWMXBAR23_GPIO71_SEL == 1 | MW_EPWMXBAR23_GPIO72_SEL == 1 | MW_EPWMXBAR23_GPIO73_SEL == 1 | MW_EPWMXBAR23_GPIO74_SEL == 1 | MW_EPWMXBAR23_GPIO75_SEL == 1 | MW_EPWMXBAR23_GPIO76_SEL == 1 | MW_EPWMXBAR23_GPIO77_SEL == 1 | MW_EPWMXBAR23_GPIO78_SEL == 1 | | MW_EPWMXBAR23_GPIO80_SEL == 1 | MW_EPWMXBAR23_GPIO81_SEL == 1 | MW_EPWMXBAR23_GPIO82_SEL == 1 | MW_EPWMXBAR23_GPIO83_SEL == 1 | MW_EPWMXBAR23_GPIO84_SEL == 1 | MW_EPWMXBAR23_GPIO85_SEL == 1 | MW_EPWMXBAR23_GPIO86_SEL == 1 | MW_EPWMXBAR23_GPIO87_SEL == 1 | MW_EPWMXBAR23_GPIO88_SEL == 1 | MW_EPWMXBAR23_GPIO89_SEL == 1 | MW_EPWMXBAR23_GPIO90_SEL == 1 | MW_EPWMXBAR23_GPIO91_SEL == 1 | MW_EPWMXBAR23_GPIO92_SEL == 1 | MW_EPWMXBAR23_GPIO93_SEL == 1 | MW_EPWMXBAR23_GPIO94_SEL == 1 | MW_EPWMXBAR23_GPIO95_SEL == 1 | MW_EPWMXBAR23_GPIO96_SEL == 1 | MW_EPWMXBAR23_GPIO97_SEL == 1 | MW_EPWMXBAR23_GPIO98_SEL == 1 | MW_EPWMXBAR23_GPIO99_SEL == 1 | MW_EPWMXBAR23_GPIO100_SEL == 1 | MW_EPWMXBAR23_GPIO101_SEL == 1 | MW_EPWMXBAR23_GPIO102_SEL == 1 | MW_EPWMXBAR23_GPIO103_SEL == 1 | MW_EPWMXBAR23_GPIO104_SEL == 1 | MW_EPWMXBAR23_GPIO105_SEL == 1 | MW_EPWMXBAR23_GPIO106_SEL == 1 | MW_EPWMXBAR23_GPIO107_SEL == 1 | | MW_EPWMXBAR23_GPIO108_SEL == 1 | MW_EPWMXBAR23_GPIO109_SEL == 1| MW_EPWMXBAR23_GPIO110_SEL == 1 | MW_EPWMXBAR23_GPIO111_SEL == 1 | MW_EPWMXBAR23_GPIO112_SEL == 1 | MW_EPWMXBAR23_GPIO113_SEL == 1 | MW_EPWMXBAR23_GPIO114_SEL == 1 | MW_EPWMXBAR23_GPIO115_SEL == 1 | MW_EPWMXBAR23_GPIO116_SEL == 1 | MW_EPWMXBAR23_GPIO117_SEL == 1 | MW_EPWMXBAR23_GPIO118_SEL == 1 | MW_EPWMXBAR23_GPIO119_SEL == 1 | MW_EPWMXBAR23_GPIO120_SEL == 1 | MW_EPWMXBAR23_GPIO121_SEL == 1 | MW_EPWMXBAR23_GPIO122_SEL == 1 | MW_EPWMXBAR23_GPIO123_SEL == 1 | MW_EPWMXBAR23_GPIO124_SEL == 1 | MW_EPWMXBAR23_GPIO125_SEL == 1 | MW_EPWMXBAR23_GPIO126_SEL == 1 | MW_EPWMXBAR23_GPIO127_SEL == 1 | MW_EPWMXBAR23_GPIO128_SEL == 1 | MW_EPWMXBAR23_GPIO129_SEL == 1 | MW_EPWMXBAR23_GPIO130_SEL == 1 | MW_EPWMXBAR23_GPIO131_SEL == 1 | MW_EPWMXBAR23_GPIO132_SEL == 1 | MW_EPWMXBAR23_GPIO133_SEL == 1 | MW_EPWMXBAR23_GPIO134_SEL == 1 | MW_EPWMXBAR23_GPIO135_SEL == 1 | MW_EPWMXBAR23_GPIO136_SEL == 1 | MW_EPWMXBAR23_GPIO137_SEL == 1 | MW_EPWMXBAR23_GPIO139_SEL == 1 | MW_EPWMXBAR23_GPIO140_SEL == 1 | MW_EPWMXBAR23_GPIO141_SEL == 1 | MW_EPWMXBAR23_GPIO142_SEL == 1 | MW_EPWMXBAR23_GPIO143_SEL == 1 | MW_EPWMXBAR23_ICSSGPO0_PORT0_SEL == 1 | MW_EPWMXBAR23_ICSSGPO1_PORT0_SEL == 1 | MW_EPWMXBAR23_ICSSGPO2_PORT0_SEL == 1 | MW_EPWMXBAR23_ICSSGPO3_PORT0_SEL == 1 | MW_EPWMXBAR23_ICSSGPO4_PORT0_SEL == 1 | MW_EPWMXBAR23_ICSSGPO5_PORT0_SEL == 1 | MW_EPWMXBAR23_ICSSGPO6_PORT0_SEL == 1 | MW_EPWMXBAR23_ICSSGPO7_PORT0_SEL == 1 | MW_EPWMXBAR23_ICSSGPO8_PORT0_SEL == 1 | MW_EPWMXBAR23_ICSSGPO9_PORT0_SEL == 1 | MW_EPWMXBAR23_ICSSGPO10_PORT0_SEL == 1 | MW_EPWMXBAR23_ICSSGPO11_PORT0_SEL == 1 | MW_EPWMXBAR23_ICSSGPO12_PORT0_SEL == 1 | MW_EPWMXBAR23_ICSSGPO13_PORT0_SEL == 1 | MW_EPWMXBAR23_ICSSGPO14_PORT0_SEL == 1 | MW_EPWMXBAR23_ICSSGPO15_PORT0_SEL == 1 | MW_EPWMXBAR23_ICSSGPO0_PORT1_SEL == 1 | MW_EPWMXBAR23_ICSSGPO1_PORT1_SEL == 1 | MW_EPWMXBAR23_ICSSGPO2_PORT1_SEL == 1 | MW_EPWMXBAR23_ICSSGPO3_PORT1_SEL == 1 | MW_EPWMXBAR23_ICSSGPO4_PORT1_SEL == 1 | MW_EPWMXBAR23_ICSSGPO5_PORT1_SEL == 1 | MW_EPWMXBAR23_ICSSGPO6_PORT1_SEL == 1 | MW_EPWMXBAR23_ICSSGPO7_PORT1_SEL == 1 | MW_EPWMXBAR23_ICSSGPO8_PORT1_SEL == 1 | MW_EPWMXBAR23_ICSSGPO9_PORT1_SEL == 1 | MW_EPWMXBAR23_ICSSGPO10_PORT1_SEL == 1 | MW_EPWMXBAR23_ICSSGPO11_PORT1_SEL == 1 | MW_EPWMXBAR23_ICSSGPO12_PORT1_SEL == 1 | MW_EPWMXBAR23_ICSSGPO13_PORT1_SEL == 1 | MW_EPWMXBAR23_ICSSGPO14_PORT1_SEL == 1 | MW_EPWMXBAR23_ICSSGPO15_PORT1_SEL == 1)
    //     group4_epwmxbar[23] = EPWM_XBAR_23;
    // else
        group4_epwmxbar[23] = 0;
    group5_epwmxbar[23] = (MW_EPWMXBAR23_EPWM0_TRIPOUT_SEL << 0) | (MW_EPWMXBAR23_EPWM1_TRIPOUT_SEL << 1) | (MW_EPWMXBAR23_EPWM2_TRIPOUT_SEL << 2) | (MW_EPWMXBAR23_EPWM3_TRIPOUT_SEL << 3) | (MW_EPWMXBAR23_EPWM4_TRIPOUT_SEL << 4) | (MW_EPWMXBAR23_EPWM5_TRIPOUT_SEL << 5) | (MW_EPWMXBAR23_EPWM6_TRIPOUT_SEL << 6) | (MW_EPWMXBAR23_EPWM7_TRIPOUT_SEL << 7) | (MW_EPWMXBAR23_EPWM8_TRIPOUT_SEL << 8) | (MW_EPWMXBAR23_EPWM9_TRIPOUT_SEL << 9) | (MW_EPWMXBAR23_EPWM10_TRIPOUT_SEL << 10) | (MW_EPWMXBAR23_EPWM11_TRIPOUT_SEL << 11) | (MW_EPWMXBAR23_EPWM12_TRIPOUT_SEL << 12) | (MW_EPWMXBAR23_EPWM13_TRIPOUT_SEL << 13) | (MW_EPWMXBAR23_EPWM14_TRIPOUT_SEL << 14) | (MW_EPWMXBAR23_EPWM15_TRIPOUT_SEL << 15) | (MW_EPWMXBAR23_EPWM16_TRIPOUT_SEL << 16) | (MW_EPWMXBAR23_EPWM17_TRIPOUT_SEL << 17) | (MW_EPWMXBAR23_EPWM18_TRIPOUT_SEL << 18) | (MW_EPWMXBAR23_EPWM19_TRIPOUT_SEL << 19) | (MW_EPWMXBAR23_EPWM20_TRIPOUT_SEL << 20) | (MW_EPWMXBAR23_EPWM21_TRIPOUT_SEL << 21) | (MW_EPWMXBAR23_EPWM22_TRIPOUT_SEL << 22) | (MW_EPWMXBAR23_EPWM23_TRIPOUT_SEL << 23) | (MW_EPWMXBAR23_EPWM24_TRIPOUT_SEL << 24) | (MW_EPWMXBAR23_EPWM25_TRIPOUT_SEL << 25) | (MW_EPWMXBAR23_EPWM26_TRIPOUT_SEL << 26) | (MW_EPWMXBAR23_EPWM27_TRIPOUT_SEL << 27) | (MW_EPWMXBAR23_EPWM28_TRIPOUT_SEL << 28) | (MW_EPWMXBAR23_EPWM29_TRIPOUT_SEL << 29) | (MW_EPWMXBAR23_EPWM30_TRIPOUT_SEL << 30) | (MW_EPWMXBAR23_EPWM31_TRIPOUT_SEL << 31);
    group6_epwmxbar[23] = (MW_EPWMXBAR23_DEL0_TRIP_SEL << 0) | (MW_EPWMXBAR23_DEL1_TRIP_SEL << 1) | (MW_EPWMXBAR23_DEL2_TRIP_SEL << 2) | (MW_EPWMXBAR23_DEL3_TRIP_SEL << 3) | (MW_EPWMXBAR23_DEL4_TRIP_SEL << 4) | (MW_EPWMXBAR23_DEL5_TRIP_SEL << 5) | (MW_EPWMXBAR23_DEL6_TRIP_SEL << 6) | (MW_EPWMXBAR23_DEL7_TRIP_SEL << 7) | (MW_EPWMXBAR23_DEL8_TRIP_SEL << 8) | (MW_EPWMXBAR23_DEL9_TRIP_SEL << 9) | (MW_EPWMXBAR23_DEL10_TRIP_SEL << 10) | (MW_EPWMXBAR23_DEL11_TRIP_SEL << 11) | (MW_EPWMXBAR23_DEL12_TRIP_SEL << 12) | (MW_EPWMXBAR23_DEL13_TRIP_SEL << 13) | (MW_EPWMXBAR23_DEL14_TRIP_SEL << 14) | (MW_EPWMXBAR23_DEL15_TRIP_SEL << 15) | (MW_EPWMXBAR23_DEL16_TRIP_SEL << 16) | (MW_EPWMXBAR23_DEL17_TRIP_SEL << 17) | (MW_EPWMXBAR23_DEL18_TRIP_SEL << 18) | (MW_EPWMXBAR23_DEL19_TRIP_SEL << 19) | (MW_EPWMXBAR23_DEL20_TRIP_SEL << 20) | (MW_EPWMXBAR23_DEL21_TRIP_SEL << 21) | (MW_EPWMXBAR23_DEL22_TRIP_SEL << 22) | (MW_EPWMXBAR23_DEL23_TRIP_SEL << 23) | (MW_EPWMXBAR23_DEL24_TRIP_SEL << 24) | (MW_EPWMXBAR23_DEL25_TRIP_SEL << 25) | (MW_EPWMXBAR23_DEL26_TRIP_SEL << 26) | (MW_EPWMXBAR23_DEL27_TRIP_SEL << 27) | (MW_EPWMXBAR23_DEL28_TRIP_SEL << 28) | (MW_EPWMXBAR23_DEL29_TRIP_SEL << 29) | (MW_EPWMXBAR23_DEL30_TRIP_SEL << 30) | (MW_EPWMXBAR23_DEL31_TRIP_SEL << 31);
