TexasInstruments/am26x-hsp/src/am263px_init.c
    group7_epwmxbar[23] = (MW_EPWMXBAR23_DEL0_ACTIVE_SEL << 0) | (MW_EPWMXBAR23_DEL1_ACTIVE_SEL << 1) | (MW_EPWMXBAR23_DEL2_ACTIVE_SEL << 2) | (MW_EPWMXBAR23_DEL3_ACTIVE_SEL << 3) | (MW_EPWMXBAR23_DEL4_ACTIVE_SEL << 4) | (MW_EPWMXBAR23_DEL5_ACTIVE_SEL << 5) | (MW_EPWMXBAR23_DEL6_ACTIVE_SEL << 6) | (MW_EPWMXBAR23_DEL7_ACTIVE_SEL << 7) | (MW_EPWMXBAR23_DEL8_ACTIVE_SEL << 8) | (MW_EPWMXBAR23_DEL9_ACTIVE_SEL << 9) | (MW_EPWMXBAR23_DEL10_ACTIVE_SEL << 10) | (MW_EPWMXBAR23_DEL11_ACTIVE_SEL << 11) | (MW_EPWMXBAR23_DEL12_ACTIVE_SEL << 12) | (MW_EPWMXBAR23_DEL13_ACTIVE_SEL << 13) | (MW_EPWMXBAR23_DEL14_ACTIVE_SEL << 14) | (MW_EPWMXBAR23_DEL15_ACTIVE_SEL << 15) | (MW_EPWMXBAR23_DEL16_ACTIVE_SEL << 16) | (MW_EPWMXBAR23_DEL17_ACTIVE_SEL << 17) | (MW_EPWMXBAR23_DEL18_ACTIVE_SEL << 18) | (MW_EPWMXBAR23_DEL19_ACTIVE_SEL << 19) | (MW_EPWMXBAR23_DEL20_ACTIVE_SEL << 20) | (MW_EPWMXBAR23_DEL21_ACTIVE_SEL << 21) | (MW_EPWMXBAR23_DEL22_ACTIVE_SEL << 22) | (MW_EPWMXBAR23_DEL23_ACTIVE_SEL << 23) | (MW_EPWMXBAR23_DEL24_ACTIVE_SEL << 24) | (MW_EPWMXBAR23_DEL25_ACTIVE_SEL << 25) | (MW_EPWMXBAR23_DEL26_ACTIVE_SEL << 26) | (MW_EPWMXBAR23_DEL27_ACTIVE_SEL << 27) | (MW_EPWMXBAR23_DEL28_ACTIVE_SEL << 28) | (MW_EPWMXBAR23_DEL29_ACTIVE_SEL << 29) | (MW_EPWMXBAR23_DEL30_ACTIVE_SEL << 30) | (MW_EPWMXBAR23_DEL31_ACTIVE_SEL << 31);
    group8_epwmxbar[23] = (MW_EPWMXBAR23_EQEP0_ERR_SEL << 0) | (MW_EPWMXBAR23_EQEP1_ERR_SEL << 1) | (MW_EPWMXBAR23_EQEP2_ERR_SEL << 2) | (MW_EPWMXBAR23_FSIRX0_RX_TRIG0_SEL << 3) | (MW_EPWMXBAR23_FSIRX0_RX_TRIG1_SEL << 4) | (MW_EPWMXBAR23_FSIRX0_RX_TRIG2_SEL << 5) | (MW_EPWMXBAR23_FSIRX0_RX_TRIG3_SEL << 6) | (MW_EPWMXBAR23_FSIRX1_RX_TRIG0_SEL << 7) | (MW_EPWMXBAR23_FSIRX1_RX_TRIG1_SEL << 8) | (MW_EPWMXBAR23_FSIRX1_RX_TRIG2_SEL << 9) | (MW_EPWMXBAR23_FSIRX1_RX_TRIG3_SEL << 10) | (MW_EPWMXBAR23_FSIRX2_RX_TRIG0_SEL << 11) | (MW_EPWMXBAR23_FSIRX2_RX_TRIG1_SEL << 12) | (MW_EPWMXBAR23_FSIRX2_RX_TRIG2_SEL << 13) | (MW_EPWMXBAR23_FSIRX2_RX_TRIG3_SEL << 14) | (MW_EPWMXBAR23_FSIRX3_RX_TRIG0_SEL << 15) | (MW_EPWMXBAR23_FSIRX3_RX_TRIG1_SEL << 16) | (MW_EPWMXBAR23_FSIRX3_RX_TRIG2_SEL << 17) | (MW_EPWMXBAR23_FSIRX3_RX_TRIG3_SEL << 18) | (MW_EPWMXBAR23_ECAP0_TRIPOUT_SEL << 19) | (MW_EPWMXBAR23_ECAP1_TRIPOUT_SEL << 20) | (MW_EPWMXBAR23_ECAP2_TRIPOUT_SEL << 21) | (MW_EPWMXBAR23_ECAP3_TRIPOUT_SEL << 22) | (MW_EPWMXBAR23_ECAP4_TRIPOUT_SEL << 23) | (MW_EPWMXBAR23_ECAP5_TRIPOUT_SEL << 24) | (MW_EPWMXBAR23_ECAP6_TRIPOUT_SEL << 25) | (MW_EPWMXBAR23_ECAP7_TRIPOUT_SEL << 26) | (MW_EPWMXBAR23_ECAP8_TRIPOUT_SEL << 27) | (MW_EPWMXBAR23_ECAP9_TRIPOUT_SEL << 28);
    group0_epwmxbar[24] = (MW_EPWMXBAR24_CMPSSA0_CTRIPL_SEL << 0) | (MW_EPWMXBAR24_CMPSSA0_CTRIPH_SEL << 1) | (MW_EPWMXBAR24_CMPSSA1_CTRIPL_SEL << 2) | (MW_EPWMXBAR24_CMPSSA1_CTRIPH_SEL << 3) | (MW_EPWMXBAR24_CMPSSA2_CTRIPL_SEL << 4) | (MW_EPWMXBAR24_CMPSSA2_CTRIPH_SEL << 5) | (MW_EPWMXBAR24_CMPSSA3_CTRIPL_SEL << 6) | (MW_EPWMXBAR24_CMPSSA3_CTRIPH_SEL << 7) | (MW_EPWMXBAR24_CMPSSA4_CTRIPL_SEL << 8) | (MW_EPWMXBAR24_CMPSSA4_CTRIPH_SEL << 9) | (MW_EPWMXBAR24_CMPSSA5_CTRIPL_SEL << 10) | (MW_EPWMXBAR24_CMPSSA5_CTRIPH_SEL << 11) | (MW_EPWMXBAR24_CMPSSA6_CTRIPL_SEL << 12) | (MW_EPWMXBAR24_CMPSSA6_CTRIPH_SEL << 13) | (MW_EPWMXBAR24_CMPSSA7_CTRIPL_SEL << 14) | (MW_EPWMXBAR24_CMPSSA7_CTRIPH_SEL << 15) | (MW_EPWMXBAR24_CMPSSA8_CTRIPL_SEL << 16) | (MW_EPWMXBAR24_CMPSSA8_CTRIPH_SEL << 17) | (MW_EPWMXBAR24_CMPSSA9_CTRIPL_SEL << 18) | (MW_EPWMXBAR24_CMPSSA9_CTRIPH_SEL << 19);
    group1_epwmxbar[24] = (MW_EPWMXBAR24_CMPSSB0_CTRIPL_SEL << 0) | (MW_EPWMXBAR24_CMPSSB0_CTRIPH_SEL << 1) | (MW_EPWMXBAR24_CMPSSB1_CTRIPL_SEL << 2) | (MW_EPWMXBAR24_CMPSSB1_CTRIPH_SEL << 3) | (MW_EPWMXBAR24_CMPSSB2_CTRIPL_SEL << 4) | (MW_EPWMXBAR24_CMPSSB2_CTRIPH_SEL << 5) | (MW_EPWMXBAR24_CMPSSB3_CTRIPL_SEL << 6) | (MW_EPWMXBAR24_CMPSSB3_CTRIPH_SEL << 7) | (MW_EPWMXBAR24_CMPSSB4_CTRIPL_SEL << 8) | (MW_EPWMXBAR24_CMPSSB4_CTRIPH_SEL << 9) | (MW_EPWMXBAR24_CMPSSB5_CTRIPL_SEL << 10) | (MW_EPWMXBAR24_CMPSSB5_CTRIPH_SEL << 11) | (MW_EPWMXBAR24_CMPSSB6_CTRIPL_SEL << 12) | (MW_EPWMXBAR24_CMPSSB6_CTRIPH_SEL << 13) | (MW_EPWMXBAR24_CMPSSB7_CTRIPL_SEL << 14) | (MW_EPWMXBAR24_CMPSSB7_CTRIPH_SEL << 15) | (MW_EPWMXBAR24_CMPSSB8_CTRIPL_SEL << 16) | (MW_EPWMXBAR24_CMPSSB8_CTRIPH_SEL << 17) | (MW_EPWMXBAR24_CMPSSB9_CTRIPL_SEL << 18) | (MW_EPWMXBAR24_CMPSSB9_CTRIPH_SEL << 19);
    group2_epwmxbar[24] = (MW_EPWMXBAR24_SD0_FILT0_CEVT1_SEL << 0) | (MW_EPWMXBAR24_SD0_FILT0_CEVT2_SEL << 1) | (MW_EPWMXBAR24_SD0_FILT0_CMPHZ_SEL << 2) | (MW_EPWMXBAR24_SD0_FILT1_CEVT1_SEL << 3) | (MW_EPWMXBAR24_SD0_FILT1_CEVT2_SEL << 4) | (MW_EPWMXBAR24_SD0_FILT1_CMPHZ_SEL << 5) | (MW_EPWMXBAR24_SD0_FILT2_CEVT1_SEL << 6) | (MW_EPWMXBAR24_SD0_FILT2_CEVT2_SEL << 7) | (MW_EPWMXBAR24_SD0_FILT2_CMPHZ_SEL << 8) | (MW_EPWMXBAR24_SD0_FILT3_CEVT1_SEL << 9) | (MW_EPWMXBAR24_SD0_FILT3_CEVT2_SEL << 10) | (MW_EPWMXBAR24_SD0_FILT3_CMPHZ_SEL << 11) | (MW_EPWMXBAR24_SD1_FILT0_CEVT1_SEL << 12) | (MW_EPWMXBAR24_SD1_FILT0_CEVT2_SEL << 13) | (MW_EPWMXBAR24_SD1_FILT0_CMPHZ_SEL << 14) | (MW_EPWMXBAR24_SD1_FILT1_CEVT1_SEL << 15) | (MW_EPWMXBAR24_SD1_FILT1_CEVT2_SEL << 16) | (MW_EPWMXBAR24_SD1_FILT1_CMPHZ_SEL << 17) | (MW_EPWMXBAR24_SD1_FILT2_CEVT1_SEL << 18) | (MW_EPWMXBAR24_SD1_FILT2_CEVT2_SEL << 19) | (MW_EPWMXBAR24_SD1_FILT2_CMPHZ_SEL << 20) | (MW_EPWMXBAR24_SD1_FILT3_CEVT1_SEL << 21) | (MW_EPWMXBAR24_SD1_FILT3_CEVT2_SEL << 22) | (MW_EPWMXBAR24_SD1_FILT3_CMPHZ_SEL << 23);
    group3_epwmxbar[24] = (MW_EPWMXBAR24_ADC0_EVT1_SEL << 0) | (MW_EPWMXBAR24_ADC0_EVT2_SEL << 1) | (MW_EPWMXBAR24_ADC0_EVT3_SEL << 2) | (MW_EPWMXBAR24_ADC0_EVT4_SEL << 3) | (MW_EPWMXBAR24_ADC1_EVT1_SEL << 4) | (MW_EPWMXBAR24_ADC1_EVT2_SEL << 5) | (MW_EPWMXBAR24_ADC1_EVT3_SEL << 6) | (MW_EPWMXBAR24_ADC1_EVT4_SEL << 7) | (MW_EPWMXBAR24_ADC2_EVT1_SEL << 8) | (MW_EPWMXBAR24_ADC2_EVT2_SEL << 9) | (MW_EPWMXBAR24_ADC2_EVT3_SEL << 10) | (MW_EPWMXBAR24_ADC2_EVT4_SEL << 11) | (MW_EPWMXBAR24_ADC3_EVT1_SEL << 12) | (MW_EPWMXBAR24_ADC3_EVT2_SEL << 13) | (MW_EPWMXBAR24_ADC3_EVT3_SEL << 14) | (MW_EPWMXBAR24_ADC3_EVT4_SEL << 15) | (MW_EPWMXBAR24_ADC4_EVT1_SEL << 16) | (MW_EPWMXBAR24_ADC4_EVT2_SEL << 17) | (MW_EPWMXBAR24_ADC4_EVT3_SEL << 18) | (MW_EPWMXBAR24_ADC4_EVT4_SEL << 19);
    // if(MW_EPWMXBAR24_GPIO0_SEL == 1 | MW_EPWMXBAR24_GPIO1_SEL == 1 | MW_EPWMXBAR24_GPIO2_SEL == 1 | MW_EPWMXBAR24_GPIO3_SEL == 1 | MW_EPWMXBAR24_GPIO4_SEL == 1 | MW_EPWMXBAR24_GPIO5_SEL == 1 | MW_EPWMXBAR24_GPIO6_SEL == 1 | MW_EPWMXBAR24_GPIO7_SEL == 1| MW_EPWMXBAR24_GPIO8_SEL == 1 | MW_EPWMXBAR24_GPIO9_SEL == 1 | MW_EPWMXBAR24_GPIO10_SEL == 1| MW_EPWMXBAR24_GPIO11_SEL == 1| MW_EPWMXBAR24_GPIO12_SEL == 1 | MW_EPWMXBAR24_GPIO13_SEL == 1 | MW_EPWMXBAR24_GPIO14_SEL == 1 | MW_EPWMXBAR24_GPIO15_SEL == 1 | MW_EPWMXBAR24_GPIO16_SEL == 1 | MW_EPWMXBAR24_GPIO17_SEL == 1 | MW_EPWMXBAR24_GPIO18_SEL == 1 | MW_EPWMXBAR24_GPIO19_SEL == 1 | MW_EPWMXBAR24_GPIO20_SEL == 1 | MW_EPWMXBAR24_GPIO21_SEL == 1 | MW_EPWMXBAR24_GPIO22_SEL == 1 | MW_EPWMXBAR24_GPIO23_SEL == 1 | MW_EPWMXBAR24_GPIO24_SEL == 1 | MW_EPWMXBAR24_GPIO25_SEL == 1 | MW_EPWMXBAR24_GPIO26_SEL == 1 | MW_EPWMXBAR24_GPIO27_SEL == 1 | MW_EPWMXBAR24_GPIO28_SEL == 1 | MW_EPWMXBAR24_GPIO29_SEL == 1 | MW_EPWMXBAR24_GPIO30_SEL == 1 | MW_EPWMXBAR24_GPIO31_SEL == 1 | MW_EPWMXBAR24_GPIO32_SEL == 1 | MW_EPWMXBAR24_GPIO33_SEL == 1 | MW_EPWMXBAR24_GPIO34_SEL == 1 | MW_EPWMXBAR24_GPIO35_SEL == 1 | MW_EPWMXBAR24_GPIO36_SEL == 1 | MW_EPWMXBAR24_GPIO37_SEL == 1 | MW_EPWMXBAR24_GPIO38_SEL == 1 | MW_EPWMXBAR24_GPIO39_SEL == 1 | MW_EPWMXBAR24_GPIO40_SEL == 1 | MW_EPWMXBAR24_GPIO41_SEL == 1 | MW_EPWMXBAR24_GPIO42_SEL == 1 | MW_EPWMXBAR24_GPIO43_SEL == 1 | MW_EPWMXBAR24_GPIO44_SEL == 1 | | MW_EPWMXBAR24_GPIO45_SEL == 1 | MW_EPWMXBAR24_GPIO46_SEL == 1 | MW_EPWMXBAR24_GPIO47_SEL == 1| MW_EPWMXBAR24_GPIO48_SEL == 1 | MW_EPWMXBAR24_GPIO49_SEL == 1 | MW_EPWMXBAR24_GPIO50_SEL == 1 | MW_EPWMXBAR24_GPIO51_SEL == 1 | MW_EPWMXBAR24_GPIO52_SEL == 1 | MW_EPWMXBAR24_GPIO53_SEL == 1 | MW_EPWMXBAR24_GPIO54_SEL == 1 | MW_EPWMXBAR24_GPIO55_SEL == 1 | MW_EPWMXBAR24_GPIO56_SEL == 1 | MW_EPWMXBAR24_GPIO57_SEL == 1| MW_EPWMXBAR24_GPIO58_SEL == 1 | MW_EPWMXBAR24_GPIO59_SEL == 1 | MW_EPWMXBAR24_GPIO60_SEL == 1 | MW_EPWMXBAR24_GPIO61_SEL == 1 | MW_EPWMXBAR24_GPIO62_SEL == 1 | MW_EPWMXBAR24_GPIO63_SEL == 1 | MW_EPWMXBAR24_GPIO64_SEL == 1 | | MW_EPWMXBAR24_GPIO59_SEL == 1 | MW_EPWMXBAR24_GPIO60_SEL == 1 | MW_EPWMXBAR24_GPIO61_SEL == 1 | MW_EPWMXBAR24_GPIO62_SEL == 1 | MW_EPWMXBAR24_GPIO63_SEL == 1 | MW_EPWMXBAR24_GPIO64_SEL == 1 | MW_EPWMXBAR24_GPIO65_SEL == 1 | MW_EPWMXBAR24_GPIO66_SEL == 1 | MW_EPWMXBAR24_GPIO67_SEL == 1 | MW_EPWMXBAR24_GPIO68_SEL == 1 | MW_EPWMXBAR24_GPIO69_SEL == 1 | MW_EPWMXBAR24_GPIO70_SEL == 1 | MW_EPWMXBAR24_GPIO71_SEL == 1 | MW_EPWMXBAR24_GPIO72_SEL == 1 | MW_EPWMXBAR24_GPIO73_SEL == 1 | MW_EPWMXBAR24_GPIO74_SEL == 1 | MW_EPWMXBAR24_GPIO75_SEL == 1 | MW_EPWMXBAR24_GPIO76_SEL == 1 | MW_EPWMXBAR24_GPIO77_SEL == 1 | MW_EPWMXBAR24_GPIO78_SEL == 1 | | MW_EPWMXBAR24_GPIO80_SEL == 1 | MW_EPWMXBAR24_GPIO81_SEL == 1 | MW_EPWMXBAR24_GPIO82_SEL == 1 | MW_EPWMXBAR24_GPIO83_SEL == 1 | MW_EPWMXBAR24_GPIO84_SEL == 1 | MW_EPWMXBAR24_GPIO85_SEL == 1 | MW_EPWMXBAR24_GPIO86_SEL == 1 | MW_EPWMXBAR24_GPIO87_SEL == 1 | MW_EPWMXBAR24_GPIO88_SEL == 1 | MW_EPWMXBAR24_GPIO89_SEL == 1 | MW_EPWMXBAR24_GPIO90_SEL == 1 | MW_EPWMXBAR24_GPIO91_SEL == 1 | MW_EPWMXBAR24_GPIO92_SEL == 1 | MW_EPWMXBAR24_GPIO93_SEL == 1 | MW_EPWMXBAR24_GPIO94_SEL == 1 | MW_EPWMXBAR24_GPIO95_SEL == 1 | MW_EPWMXBAR24_GPIO96_SEL == 1 | MW_EPWMXBAR24_GPIO97_SEL == 1 | MW_EPWMXBAR24_GPIO98_SEL == 1 | MW_EPWMXBAR24_GPIO99_SEL == 1 | MW_EPWMXBAR24_GPIO100_SEL == 1 | MW_EPWMXBAR24_GPIO101_SEL == 1 | MW_EPWMXBAR24_GPIO102_SEL == 1 | MW_EPWMXBAR24_GPIO103_SEL == 1 | MW_EPWMXBAR24_GPIO104_SEL == 1 | MW_EPWMXBAR24_GPIO105_SEL == 1 | MW_EPWMXBAR24_GPIO106_SEL == 1 | MW_EPWMXBAR24_GPIO107_SEL == 1 | | MW_EPWMXBAR24_GPIO108_SEL == 1 | MW_EPWMXBAR24_GPIO109_SEL == 1| MW_EPWMXBAR24_GPIO110_SEL == 1 | MW_EPWMXBAR24_GPIO111_SEL == 1 | MW_EPWMXBAR24_GPIO112_SEL == 1 | MW_EPWMXBAR24_GPIO113_SEL == 1 | MW_EPWMXBAR24_GPIO114_SEL == 1 | MW_EPWMXBAR24_GPIO115_SEL == 1 | MW_EPWMXBAR24_GPIO116_SEL == 1 | MW_EPWMXBAR24_GPIO117_SEL == 1 | MW_EPWMXBAR24_GPIO118_SEL == 1 | MW_EPWMXBAR24_GPIO119_SEL == 1 | MW_EPWMXBAR24_GPIO120_SEL == 1 | MW_EPWMXBAR24_GPIO121_SEL == 1 | MW_EPWMXBAR24_GPIO122_SEL == 1 | MW_EPWMXBAR24_GPIO123_SEL == 1 | MW_EPWMXBAR24_GPIO124_SEL == 1 | MW_EPWMXBAR24_GPIO125_SEL == 1 | MW_EPWMXBAR24_GPIO126_SEL == 1 | MW_EPWMXBAR24_GPIO127_SEL == 1 | MW_EPWMXBAR24_GPIO128_SEL == 1 | MW_EPWMXBAR24_GPIO129_SEL == 1 | MW_EPWMXBAR24_GPIO130_SEL == 1 | MW_EPWMXBAR24_GPIO131_SEL == 1 | MW_EPWMXBAR24_GPIO132_SEL == 1 | MW_EPWMXBAR24_GPIO133_SEL == 1 | MW_EPWMXBAR24_GPIO134_SEL == 1 | MW_EPWMXBAR24_GPIO135_SEL == 1 | MW_EPWMXBAR24_GPIO136_SEL == 1 | MW_EPWMXBAR24_GPIO137_SEL == 1 | MW_EPWMXBAR24_GPIO139_SEL == 1 | MW_EPWMXBAR24_GPIO140_SEL == 1 | MW_EPWMXBAR24_GPIO141_SEL == 1 | MW_EPWMXBAR24_GPIO142_SEL == 1 | MW_EPWMXBAR24_GPIO143_SEL == 1 | MW_EPWMXBAR24_ICSSGPO0_PORT0_SEL == 1 | MW_EPWMXBAR24_ICSSGPO1_PORT0_SEL == 1 | MW_EPWMXBAR24_ICSSGPO2_PORT0_SEL == 1 | MW_EPWMXBAR24_ICSSGPO3_PORT0_SEL == 1 | MW_EPWMXBAR24_ICSSGPO4_PORT0_SEL == 1 | MW_EPWMXBAR24_ICSSGPO5_PORT0_SEL == 1 | MW_EPWMXBAR24_ICSSGPO6_PORT0_SEL == 1 | MW_EPWMXBAR24_ICSSGPO7_PORT0_SEL == 1 | MW_EPWMXBAR24_ICSSGPO8_PORT0_SEL == 1 | MW_EPWMXBAR24_ICSSGPO9_PORT0_SEL == 1 | MW_EPWMXBAR24_ICSSGPO10_PORT0_SEL == 1 | MW_EPWMXBAR24_ICSSGPO11_PORT0_SEL == 1 | MW_EPWMXBAR24_ICSSGPO12_PORT0_SEL == 1 | MW_EPWMXBAR24_ICSSGPO13_PORT0_SEL == 1 | MW_EPWMXBAR24_ICSSGPO14_PORT0_SEL == 1 | MW_EPWMXBAR24_ICSSGPO15_PORT0_SEL == 1 | MW_EPWMXBAR24_ICSSGPO0_PORT1_SEL == 1 | MW_EPWMXBAR24_ICSSGPO1_PORT1_SEL == 1 | MW_EPWMXBAR24_ICSSGPO2_PORT1_SEL == 1 | MW_EPWMXBAR24_ICSSGPO3_PORT1_SEL == 1 | MW_EPWMXBAR24_ICSSGPO4_PORT1_SEL == 1 | MW_EPWMXBAR24_ICSSGPO5_PORT1_SEL == 1 | MW_EPWMXBAR24_ICSSGPO6_PORT1_SEL == 1 | MW_EPWMXBAR24_ICSSGPO7_PORT1_SEL == 1 | MW_EPWMXBAR24_ICSSGPO8_PORT1_SEL == 1 | MW_EPWMXBAR24_ICSSGPO9_PORT1_SEL == 1 | MW_EPWMXBAR24_ICSSGPO10_PORT1_SEL == 1 | MW_EPWMXBAR24_ICSSGPO11_PORT1_SEL == 1 | MW_EPWMXBAR24_ICSSGPO12_PORT1_SEL == 1 | MW_EPWMXBAR24_ICSSGPO13_PORT1_SEL == 1 | MW_EPWMXBAR24_ICSSGPO14_PORT1_SEL == 1 | MW_EPWMXBAR24_ICSSGPO15_PORT1_SEL == 1)
    //     group4_epwmxbar[24] = EPWM_XBAR_24;
    // else
        group4_epwmxbar[24] = 0;
    group5_epwmxbar[24] = (MW_EPWMXBAR24_EPWM0_TRIPOUT_SEL << 0) | (MW_EPWMXBAR24_EPWM1_TRIPOUT_SEL << 1) | (MW_EPWMXBAR24_EPWM2_TRIPOUT_SEL << 2) | (MW_EPWMXBAR24_EPWM3_TRIPOUT_SEL << 3) | (MW_EPWMXBAR24_EPWM4_TRIPOUT_SEL << 4) | (MW_EPWMXBAR24_EPWM5_TRIPOUT_SEL << 5) | (MW_EPWMXBAR24_EPWM6_TRIPOUT_SEL << 6) | (MW_EPWMXBAR24_EPWM7_TRIPOUT_SEL << 7) | (MW_EPWMXBAR24_EPWM8_TRIPOUT_SEL << 8) | (MW_EPWMXBAR24_EPWM9_TRIPOUT_SEL << 9) | (MW_EPWMXBAR24_EPWM10_TRIPOUT_SEL << 10) | (MW_EPWMXBAR24_EPWM11_TRIPOUT_SEL << 11) | (MW_EPWMXBAR24_EPWM12_TRIPOUT_SEL << 12) | (MW_EPWMXBAR24_EPWM13_TRIPOUT_SEL << 13) | (MW_EPWMXBAR24_EPWM14_TRIPOUT_SEL << 14) | (MW_EPWMXBAR24_EPWM15_TRIPOUT_SEL << 15) | (MW_EPWMXBAR24_EPWM16_TRIPOUT_SEL << 16) | (MW_EPWMXBAR24_EPWM17_TRIPOUT_SEL << 17) | (MW_EPWMXBAR24_EPWM18_TRIPOUT_SEL << 18) | (MW_EPWMXBAR24_EPWM19_TRIPOUT_SEL << 19) | (MW_EPWMXBAR24_EPWM20_TRIPOUT_SEL << 20) | (MW_EPWMXBAR24_EPWM21_TRIPOUT_SEL << 21) | (MW_EPWMXBAR24_EPWM22_TRIPOUT_SEL << 22) | (MW_EPWMXBAR24_EPWM23_TRIPOUT_SEL << 23) | (MW_EPWMXBAR24_EPWM24_TRIPOUT_SEL << 24) | (MW_EPWMXBAR24_EPWM25_TRIPOUT_SEL << 25) | (MW_EPWMXBAR24_EPWM26_TRIPOUT_SEL << 26) | (MW_EPWMXBAR24_EPWM27_TRIPOUT_SEL << 27) | (MW_EPWMXBAR24_EPWM28_TRIPOUT_SEL << 28) | (MW_EPWMXBAR24_EPWM29_TRIPOUT_SEL << 29) | (MW_EPWMXBAR24_EPWM30_TRIPOUT_SEL << 30) | (MW_EPWMXBAR24_EPWM31_TRIPOUT_SEL << 31);
    group6_epwmxbar[24] = (MW_EPWMXBAR24_DEL0_TRIP_SEL << 0) | (MW_EPWMXBAR24_DEL1_TRIP_SEL << 1) | (MW_EPWMXBAR24_DEL2_TRIP_SEL << 2) | (MW_EPWMXBAR24_DEL3_TRIP_SEL << 3) | (MW_EPWMXBAR24_DEL4_TRIP_SEL << 4) | (MW_EPWMXBAR24_DEL5_TRIP_SEL << 5) | (MW_EPWMXBAR24_DEL6_TRIP_SEL << 6) | (MW_EPWMXBAR24_DEL7_TRIP_SEL << 7) | (MW_EPWMXBAR24_DEL8_TRIP_SEL << 8) | (MW_EPWMXBAR24_DEL9_TRIP_SEL << 9) | (MW_EPWMXBAR24_DEL10_TRIP_SEL << 10) | (MW_EPWMXBAR24_DEL11_TRIP_SEL << 11) | (MW_EPWMXBAR24_DEL12_TRIP_SEL << 12) | (MW_EPWMXBAR24_DEL13_TRIP_SEL << 13) | (MW_EPWMXBAR24_DEL14_TRIP_SEL << 14) | (MW_EPWMXBAR24_DEL15_TRIP_SEL << 15) | (MW_EPWMXBAR24_DEL16_TRIP_SEL << 16) | (MW_EPWMXBAR24_DEL17_TRIP_SEL << 17) | (MW_EPWMXBAR24_DEL18_TRIP_SEL << 18) | (MW_EPWMXBAR24_DEL19_TRIP_SEL << 19) | (MW_EPWMXBAR24_DEL20_TRIP_SEL << 20) | (MW_EPWMXBAR24_DEL21_TRIP_SEL << 21) | (MW_EPWMXBAR24_DEL22_TRIP_SEL << 22) | (MW_EPWMXBAR24_DEL23_TRIP_SEL << 23) | (MW_EPWMXBAR24_DEL24_TRIP_SEL << 24) | (MW_EPWMXBAR24_DEL25_TRIP_SEL << 25) | (MW_EPWMXBAR24_DEL26_TRIP_SEL << 26) | (MW_EPWMXBAR24_DEL27_TRIP_SEL << 27) | (MW_EPWMXBAR24_DEL28_TRIP_SEL << 28) | (MW_EPWMXBAR24_DEL29_TRIP_SEL << 29) | (MW_EPWMXBAR24_DEL30_TRIP_SEL << 30) | (MW_EPWMXBAR24_DEL31_TRIP_SEL << 31);
    group7_epwmxbar[24] = (MW_EPWMXBAR24_DEL0_ACTIVE_SEL << 0) | (MW_EPWMXBAR24_DEL1_ACTIVE_SEL << 1) | (MW_EPWMXBAR24_DEL2_ACTIVE_SEL << 2) | (MW_EPWMXBAR24_DEL3_ACTIVE_SEL << 3) | (MW_EPWMXBAR24_DEL4_ACTIVE_SEL << 4) | (MW_EPWMXBAR24_DEL5_ACTIVE_SEL << 5) | (MW_EPWMXBAR24_DEL6_ACTIVE_SEL << 6) | (MW_EPWMXBAR24_DEL7_ACTIVE_SEL << 7) | (MW_EPWMXBAR24_DEL8_ACTIVE_SEL << 8) | (MW_EPWMXBAR24_DEL9_ACTIVE_SEL << 9) | (MW_EPWMXBAR24_DEL10_ACTIVE_SEL << 10) | (MW_EPWMXBAR24_DEL11_ACTIVE_SEL << 11) | (MW_EPWMXBAR24_DEL12_ACTIVE_SEL << 12) | (MW_EPWMXBAR24_DEL13_ACTIVE_SEL << 13) | (MW_EPWMXBAR24_DEL14_ACTIVE_SEL << 14) | (MW_EPWMXBAR24_DEL15_ACTIVE_SEL << 15) | (MW_EPWMXBAR24_DEL16_ACTIVE_SEL << 16) | (MW_EPWMXBAR24_DEL17_ACTIVE_SEL << 17) | (MW_EPWMXBAR24_DEL18_ACTIVE_SEL << 18) | (MW_EPWMXBAR24_DEL19_ACTIVE_SEL << 19) | (MW_EPWMXBAR24_DEL20_ACTIVE_SEL << 20) | (MW_EPWMXBAR24_DEL21_ACTIVE_SEL << 21) | (MW_EPWMXBAR24_DEL22_ACTIVE_SEL << 22) | (MW_EPWMXBAR24_DEL23_ACTIVE_SEL << 23) | (MW_EPWMXBAR24_DEL24_ACTIVE_SEL << 24) | (MW_EPWMXBAR24_DEL25_ACTIVE_SEL << 25) | (MW_EPWMXBAR24_DEL26_ACTIVE_SEL << 26) | (MW_EPWMXBAR24_DEL27_ACTIVE_SEL << 27) | (MW_EPWMXBAR24_DEL28_ACTIVE_SEL << 28) | (MW_EPWMXBAR24_DEL29_ACTIVE_SEL << 29) | (MW_EPWMXBAR24_DEL30_ACTIVE_SEL << 30) | (MW_EPWMXBAR24_DEL31_ACTIVE_SEL << 31);
    group8_epwmxbar[24] = (MW_EPWMXBAR24_EQEP0_ERR_SEL << 0) | (MW_EPWMXBAR24_EQEP1_ERR_SEL << 1) | (MW_EPWMXBAR24_EQEP2_ERR_SEL << 2) | (MW_EPWMXBAR24_FSIRX0_RX_TRIG0_SEL << 3) | (MW_EPWMXBAR24_FSIRX0_RX_TRIG1_SEL << 4) | (MW_EPWMXBAR24_FSIRX0_RX_TRIG2_SEL << 5) | (MW_EPWMXBAR24_FSIRX0_RX_TRIG3_SEL << 6) | (MW_EPWMXBAR24_FSIRX1_RX_TRIG0_SEL << 7) | (MW_EPWMXBAR24_FSIRX1_RX_TRIG1_SEL << 8) | (MW_EPWMXBAR24_FSIRX1_RX_TRIG2_SEL << 9) | (MW_EPWMXBAR24_FSIRX1_RX_TRIG3_SEL << 10) | (MW_EPWMXBAR24_FSIRX2_RX_TRIG0_SEL << 11) | (MW_EPWMXBAR24_FSIRX2_RX_TRIG1_SEL << 12) | (MW_EPWMXBAR24_FSIRX2_RX_TRIG2_SEL << 13) | (MW_EPWMXBAR24_FSIRX2_RX_TRIG3_SEL << 14) | (MW_EPWMXBAR24_FSIRX3_RX_TRIG0_SEL << 15) | (MW_EPWMXBAR24_FSIRX3_RX_TRIG1_SEL << 16) | (MW_EPWMXBAR24_FSIRX3_RX_TRIG2_SEL << 17) | (MW_EPWMXBAR24_FSIRX3_RX_TRIG3_SEL << 18) | (MW_EPWMXBAR24_ECAP0_TRIPOUT_SEL << 19) | (MW_EPWMXBAR24_ECAP1_TRIPOUT_SEL << 20) | (MW_EPWMXBAR24_ECAP2_TRIPOUT_SEL << 21) | (MW_EPWMXBAR24_ECAP3_TRIPOUT_SEL << 22) | (MW_EPWMXBAR24_ECAP4_TRIPOUT_SEL << 23) | (MW_EPWMXBAR24_ECAP5_TRIPOUT_SEL << 24) | (MW_EPWMXBAR24_ECAP6_TRIPOUT_SEL << 25) | (MW_EPWMXBAR24_ECAP7_TRIPOUT_SEL << 26) | (MW_EPWMXBAR24_ECAP8_TRIPOUT_SEL << 27) | (MW_EPWMXBAR24_ECAP9_TRIPOUT_SEL << 28);
    group0_epwmxbar[25] = (MW_EPWMXBAR25_CMPSSA0_CTRIPL_SEL << 0) | (MW_EPWMXBAR25_CMPSSA0_CTRIPH_SEL << 1) | (MW_EPWMXBAR25_CMPSSA1_CTRIPL_SEL << 2) | (MW_EPWMXBAR25_CMPSSA1_CTRIPH_SEL << 3) | (MW_EPWMXBAR25_CMPSSA2_CTRIPL_SEL << 4) | (MW_EPWMXBAR25_CMPSSA2_CTRIPH_SEL << 5) | (MW_EPWMXBAR25_CMPSSA3_CTRIPL_SEL << 6) | (MW_EPWMXBAR25_CMPSSA3_CTRIPH_SEL << 7) | (MW_EPWMXBAR25_CMPSSA4_CTRIPL_SEL << 8) | (MW_EPWMXBAR25_CMPSSA4_CTRIPH_SEL << 9) | (MW_EPWMXBAR25_CMPSSA5_CTRIPL_SEL << 10) | (MW_EPWMXBAR25_CMPSSA5_CTRIPH_SEL << 11) | (MW_EPWMXBAR25_CMPSSA6_CTRIPL_SEL << 12) | (MW_EPWMXBAR25_CMPSSA6_CTRIPH_SEL << 13) | (MW_EPWMXBAR25_CMPSSA7_CTRIPL_SEL << 14) | (MW_EPWMXBAR25_CMPSSA7_CTRIPH_SEL << 15) | (MW_EPWMXBAR25_CMPSSA8_CTRIPL_SEL << 16) | (MW_EPWMXBAR25_CMPSSA8_CTRIPH_SEL << 17) | (MW_EPWMXBAR25_CMPSSA9_CTRIPL_SEL << 18) | (MW_EPWMXBAR25_CMPSSA9_CTRIPH_SEL << 19);
    group1_epwmxbar[25] = (MW_EPWMXBAR25_CMPSSB0_CTRIPL_SEL << 0) | (MW_EPWMXBAR25_CMPSSB0_CTRIPH_SEL << 1) | (MW_EPWMXBAR25_CMPSSB1_CTRIPL_SEL << 2) | (MW_EPWMXBAR25_CMPSSB1_CTRIPH_SEL << 3) | (MW_EPWMXBAR25_CMPSSB2_CTRIPL_SEL << 4) | (MW_EPWMXBAR25_CMPSSB2_CTRIPH_SEL << 5) | (MW_EPWMXBAR25_CMPSSB3_CTRIPL_SEL << 6) | (MW_EPWMXBAR25_CMPSSB3_CTRIPH_SEL << 7) | (MW_EPWMXBAR25_CMPSSB4_CTRIPL_SEL << 8) | (MW_EPWMXBAR25_CMPSSB4_CTRIPH_SEL << 9) | (MW_EPWMXBAR25_CMPSSB5_CTRIPL_SEL << 10) | (MW_EPWMXBAR25_CMPSSB5_CTRIPH_SEL << 11) | (MW_EPWMXBAR25_CMPSSB6_CTRIPL_SEL << 12) | (MW_EPWMXBAR25_CMPSSB6_CTRIPH_SEL << 13) | (MW_EPWMXBAR25_CMPSSB7_CTRIPL_SEL << 14) | (MW_EPWMXBAR25_CMPSSB7_CTRIPH_SEL << 15) | (MW_EPWMXBAR25_CMPSSB8_CTRIPL_SEL << 16) | (MW_EPWMXBAR25_CMPSSB8_CTRIPH_SEL << 17) | (MW_EPWMXBAR25_CMPSSB9_CTRIPL_SEL << 18) | (MW_EPWMXBAR25_CMPSSB9_CTRIPH_SEL << 19);
    group2_epwmxbar[25] = (MW_EPWMXBAR25_SD0_FILT0_CEVT1_SEL << 0) | (MW_EPWMXBAR25_SD0_FILT0_CEVT2_SEL << 1) | (MW_EPWMXBAR25_SD0_FILT0_CMPHZ_SEL << 2) | (MW_EPWMXBAR25_SD0_FILT1_CEVT1_SEL << 3) | (MW_EPWMXBAR25_SD0_FILT1_CEVT2_SEL << 4) | (MW_EPWMXBAR25_SD0_FILT1_CMPHZ_SEL << 5) | (MW_EPWMXBAR25_SD0_FILT2_CEVT1_SEL << 6) | (MW_EPWMXBAR25_SD0_FILT2_CEVT2_SEL << 7) | (MW_EPWMXBAR25_SD0_FILT2_CMPHZ_SEL << 8) | (MW_EPWMXBAR25_SD0_FILT3_CEVT1_SEL << 9) | (MW_EPWMXBAR25_SD0_FILT3_CEVT2_SEL << 10) | (MW_EPWMXBAR25_SD0_FILT3_CMPHZ_SEL << 11) | (MW_EPWMXBAR25_SD1_FILT0_CEVT1_SEL << 12) | (MW_EPWMXBAR25_SD1_FILT0_CEVT2_SEL << 13) | (MW_EPWMXBAR25_SD1_FILT0_CMPHZ_SEL << 14) | (MW_EPWMXBAR25_SD1_FILT1_CEVT1_SEL << 15) | (MW_EPWMXBAR25_SD1_FILT1_CEVT2_SEL << 16) | (MW_EPWMXBAR25_SD1_FILT1_CMPHZ_SEL << 17) | (MW_EPWMXBAR25_SD1_FILT2_CEVT1_SEL << 18) | (MW_EPWMXBAR25_SD1_FILT2_CEVT2_SEL << 19) | (MW_EPWMXBAR25_SD1_FILT2_CMPHZ_SEL << 20) | (MW_EPWMXBAR25_SD1_FILT3_CEVT1_SEL << 21) | (MW_EPWMXBAR25_SD1_FILT3_CEVT2_SEL << 22) | (MW_EPWMXBAR25_SD1_FILT3_CMPHZ_SEL << 23);
    group3_epwmxbar[25] = (MW_EPWMXBAR25_ADC0_EVT1_SEL << 0) | (MW_EPWMXBAR25_ADC0_EVT2_SEL << 1) | (MW_EPWMXBAR25_ADC0_EVT3_SEL << 2) | (MW_EPWMXBAR25_ADC0_EVT4_SEL << 3) | (MW_EPWMXBAR25_ADC1_EVT1_SEL << 4) | (MW_EPWMXBAR25_ADC1_EVT2_SEL << 5) | (MW_EPWMXBAR25_ADC1_EVT3_SEL << 6) | (MW_EPWMXBAR25_ADC1_EVT4_SEL << 7) | (MW_EPWMXBAR25_ADC2_EVT1_SEL << 8) | (MW_EPWMXBAR25_ADC2_EVT2_SEL << 9) | (MW_EPWMXBAR25_ADC2_EVT3_SEL << 10) | (MW_EPWMXBAR25_ADC2_EVT4_SEL << 11) | (MW_EPWMXBAR25_ADC3_EVT1_SEL << 12) | (MW_EPWMXBAR25_ADC3_EVT2_SEL << 13) | (MW_EPWMXBAR25_ADC3_EVT3_SEL << 14) | (MW_EPWMXBAR25_ADC3_EVT4_SEL << 15) | (MW_EPWMXBAR25_ADC4_EVT1_SEL << 16) | (MW_EPWMXBAR25_ADC4_EVT2_SEL << 17) | (MW_EPWMXBAR25_ADC4_EVT3_SEL << 18) | (MW_EPWMXBAR25_ADC4_EVT4_SEL << 19);
