TexasInstruments/am26x-hsp/src/am263px_init.c
    // if(MW_EPWMXBAR25_GPIO0_SEL == 1 | MW_EPWMXBAR25_GPIO1_SEL == 1 | MW_EPWMXBAR25_GPIO2_SEL == 1 | MW_EPWMXBAR25_GPIO3_SEL == 1 | MW_EPWMXBAR25_GPIO4_SEL == 1 | MW_EPWMXBAR25_GPIO5_SEL == 1 | MW_EPWMXBAR25_GPIO6_SEL == 1 | MW_EPWMXBAR25_GPIO7_SEL == 1| MW_EPWMXBAR25_GPIO8_SEL == 1 | MW_EPWMXBAR25_GPIO9_SEL == 1 | MW_EPWMXBAR25_GPIO10_SEL == 1| MW_EPWMXBAR25_GPIO11_SEL == 1| MW_EPWMXBAR25_GPIO12_SEL == 1 | MW_EPWMXBAR25_GPIO13_SEL == 1 | MW_EPWMXBAR25_GPIO14_SEL == 1 | MW_EPWMXBAR25_GPIO15_SEL == 1 | MW_EPWMXBAR25_GPIO16_SEL == 1 | MW_EPWMXBAR25_GPIO17_SEL == 1 | MW_EPWMXBAR25_GPIO18_SEL == 1 | MW_EPWMXBAR25_GPIO19_SEL == 1 | MW_EPWMXBAR25_GPIO20_SEL == 1 | MW_EPWMXBAR25_GPIO21_SEL == 1 | MW_EPWMXBAR25_GPIO22_SEL == 1 | MW_EPWMXBAR25_GPIO23_SEL == 1 | MW_EPWMXBAR25_GPIO24_SEL == 1 | MW_EPWMXBAR25_GPIO25_SEL == 1 | MW_EPWMXBAR25_GPIO26_SEL == 1 | MW_EPWMXBAR25_GPIO27_SEL == 1 | MW_EPWMXBAR25_GPIO28_SEL == 1 | MW_EPWMXBAR25_GPIO29_SEL == 1 | MW_EPWMXBAR25_GPIO30_SEL == 1 | MW_EPWMXBAR25_GPIO31_SEL == 1 | MW_EPWMXBAR25_GPIO32_SEL == 1 | MW_EPWMXBAR25_GPIO33_SEL == 1 | MW_EPWMXBAR25_GPIO34_SEL == 1 | MW_EPWMXBAR25_GPIO35_SEL == 1 | MW_EPWMXBAR25_GPIO36_SEL == 1 | MW_EPWMXBAR25_GPIO37_SEL == 1 | MW_EPWMXBAR25_GPIO38_SEL == 1 | MW_EPWMXBAR25_GPIO39_SEL == 1 | MW_EPWMXBAR25_GPIO40_SEL == 1 | MW_EPWMXBAR25_GPIO41_SEL == 1 | MW_EPWMXBAR25_GPIO42_SEL == 1 | MW_EPWMXBAR25_GPIO43_SEL == 1 | MW_EPWMXBAR25_GPIO44_SEL == 1 | | MW_EPWMXBAR25_GPIO45_SEL == 1 | MW_EPWMXBAR25_GPIO46_SEL == 1 | MW_EPWMXBAR25_GPIO47_SEL == 1| MW_EPWMXBAR25_GPIO48_SEL == 1 | MW_EPWMXBAR25_GPIO49_SEL == 1 | MW_EPWMXBAR25_GPIO50_SEL == 1 | MW_EPWMXBAR25_GPIO51_SEL == 1 | MW_EPWMXBAR25_GPIO52_SEL == 1 | MW_EPWMXBAR25_GPIO53_SEL == 1 | MW_EPWMXBAR25_GPIO54_SEL == 1 | MW_EPWMXBAR25_GPIO55_SEL == 1 | MW_EPWMXBAR25_GPIO56_SEL == 1 | MW_EPWMXBAR25_GPIO57_SEL == 1| MW_EPWMXBAR25_GPIO58_SEL == 1 | MW_EPWMXBAR25_GPIO59_SEL == 1 | MW_EPWMXBAR25_GPIO60_SEL == 1 | MW_EPWMXBAR25_GPIO61_SEL == 1 | MW_EPWMXBAR25_GPIO62_SEL == 1 | MW_EPWMXBAR25_GPIO63_SEL == 1 | MW_EPWMXBAR25_GPIO64_SEL == 1 | | MW_EPWMXBAR25_GPIO59_SEL == 1 | MW_EPWMXBAR25_GPIO60_SEL == 1 | MW_EPWMXBAR25_GPIO61_SEL == 1 | MW_EPWMXBAR25_GPIO62_SEL == 1 | MW_EPWMXBAR25_GPIO63_SEL == 1 | MW_EPWMXBAR25_GPIO64_SEL == 1 | MW_EPWMXBAR25_GPIO65_SEL == 1 | MW_EPWMXBAR25_GPIO66_SEL == 1 | MW_EPWMXBAR25_GPIO67_SEL == 1 | MW_EPWMXBAR25_GPIO68_SEL == 1 | MW_EPWMXBAR25_GPIO69_SEL == 1 | MW_EPWMXBAR25_GPIO70_SEL == 1 | MW_EPWMXBAR25_GPIO71_SEL == 1 | MW_EPWMXBAR25_GPIO72_SEL == 1 | MW_EPWMXBAR25_GPIO73_SEL == 1 | MW_EPWMXBAR25_GPIO74_SEL == 1 | MW_EPWMXBAR25_GPIO75_SEL == 1 | MW_EPWMXBAR25_GPIO76_SEL == 1 | MW_EPWMXBAR25_GPIO77_SEL == 1 | MW_EPWMXBAR25_GPIO78_SEL == 1 | | MW_EPWMXBAR25_GPIO80_SEL == 1 | MW_EPWMXBAR25_GPIO81_SEL == 1 | MW_EPWMXBAR25_GPIO82_SEL == 1 | MW_EPWMXBAR25_GPIO83_SEL == 1 | MW_EPWMXBAR25_GPIO84_SEL == 1 | MW_EPWMXBAR25_GPIO85_SEL == 1 | MW_EPWMXBAR25_GPIO86_SEL == 1 | MW_EPWMXBAR25_GPIO87_SEL == 1 | MW_EPWMXBAR25_GPIO88_SEL == 1 | MW_EPWMXBAR25_GPIO89_SEL == 1 | MW_EPWMXBAR25_GPIO90_SEL == 1 | MW_EPWMXBAR25_GPIO91_SEL == 1 | MW_EPWMXBAR25_GPIO92_SEL == 1 | MW_EPWMXBAR25_GPIO93_SEL == 1 | MW_EPWMXBAR25_GPIO94_SEL == 1 | MW_EPWMXBAR25_GPIO95_SEL == 1 | MW_EPWMXBAR25_GPIO96_SEL == 1 | MW_EPWMXBAR25_GPIO97_SEL == 1 | MW_EPWMXBAR25_GPIO98_SEL == 1 | MW_EPWMXBAR25_GPIO99_SEL == 1 | MW_EPWMXBAR25_GPIO100_SEL == 1 | MW_EPWMXBAR25_GPIO101_SEL == 1 | MW_EPWMXBAR25_GPIO102_SEL == 1 | MW_EPWMXBAR25_GPIO103_SEL == 1 | MW_EPWMXBAR25_GPIO104_SEL == 1 | MW_EPWMXBAR25_GPIO105_SEL == 1 | MW_EPWMXBAR25_GPIO106_SEL == 1 | MW_EPWMXBAR25_GPIO107_SEL == 1 | | MW_EPWMXBAR25_GPIO108_SEL == 1 | MW_EPWMXBAR25_GPIO109_SEL == 1| MW_EPWMXBAR25_GPIO110_SEL == 1 | MW_EPWMXBAR25_GPIO111_SEL == 1 | MW_EPWMXBAR25_GPIO112_SEL == 1 | MW_EPWMXBAR25_GPIO113_SEL == 1 | MW_EPWMXBAR25_GPIO114_SEL == 1 | MW_EPWMXBAR25_GPIO115_SEL == 1 | MW_EPWMXBAR25_GPIO116_SEL == 1 | MW_EPWMXBAR25_GPIO117_SEL == 1 | MW_EPWMXBAR25_GPIO118_SEL == 1 | MW_EPWMXBAR25_GPIO119_SEL == 1 | MW_EPWMXBAR25_GPIO120_SEL == 1 | MW_EPWMXBAR25_GPIO121_SEL == 1 | MW_EPWMXBAR25_GPIO122_SEL == 1 | MW_EPWMXBAR25_GPIO123_SEL == 1 | MW_EPWMXBAR25_GPIO124_SEL == 1 | MW_EPWMXBAR25_GPIO125_SEL == 1 | MW_EPWMXBAR25_GPIO126_SEL == 1 | MW_EPWMXBAR25_GPIO127_SEL == 1 | MW_EPWMXBAR25_GPIO128_SEL == 1 | MW_EPWMXBAR25_GPIO129_SEL == 1 | MW_EPWMXBAR25_GPIO130_SEL == 1 | MW_EPWMXBAR25_GPIO131_SEL == 1 | MW_EPWMXBAR25_GPIO132_SEL == 1 | MW_EPWMXBAR25_GPIO133_SEL == 1 | MW_EPWMXBAR25_GPIO134_SEL == 1 | MW_EPWMXBAR25_GPIO135_SEL == 1 | MW_EPWMXBAR25_GPIO136_SEL == 1 | MW_EPWMXBAR25_GPIO137_SEL == 1 | MW_EPWMXBAR25_GPIO139_SEL == 1 | MW_EPWMXBAR25_GPIO140_SEL == 1 | MW_EPWMXBAR25_GPIO141_SEL == 1 | MW_EPWMXBAR25_GPIO142_SEL == 1 | MW_EPWMXBAR25_GPIO143_SEL == 1 | MW_EPWMXBAR25_ICSSGPO0_PORT0_SEL == 1 | MW_EPWMXBAR25_ICSSGPO1_PORT0_SEL == 1 | MW_EPWMXBAR25_ICSSGPO2_PORT0_SEL == 1 | MW_EPWMXBAR25_ICSSGPO3_PORT0_SEL == 1 | MW_EPWMXBAR25_ICSSGPO4_PORT0_SEL == 1 | MW_EPWMXBAR25_ICSSGPO5_PORT0_SEL == 1 | MW_EPWMXBAR25_ICSSGPO6_PORT0_SEL == 1 | MW_EPWMXBAR25_ICSSGPO7_PORT0_SEL == 1 | MW_EPWMXBAR25_ICSSGPO8_PORT0_SEL == 1 | MW_EPWMXBAR25_ICSSGPO9_PORT0_SEL == 1 | MW_EPWMXBAR25_ICSSGPO10_PORT0_SEL == 1 | MW_EPWMXBAR25_ICSSGPO11_PORT0_SEL == 1 | MW_EPWMXBAR25_ICSSGPO12_PORT0_SEL == 1 | MW_EPWMXBAR25_ICSSGPO13_PORT0_SEL == 1 | MW_EPWMXBAR25_ICSSGPO14_PORT0_SEL == 1 | MW_EPWMXBAR25_ICSSGPO15_PORT0_SEL == 1 | MW_EPWMXBAR25_ICSSGPO0_PORT1_SEL == 1 | MW_EPWMXBAR25_ICSSGPO1_PORT1_SEL == 1 | MW_EPWMXBAR25_ICSSGPO2_PORT1_SEL == 1 | MW_EPWMXBAR25_ICSSGPO3_PORT1_SEL == 1 | MW_EPWMXBAR25_ICSSGPO4_PORT1_SEL == 1 | MW_EPWMXBAR25_ICSSGPO5_PORT1_SEL == 1 | MW_EPWMXBAR25_ICSSGPO6_PORT1_SEL == 1 | MW_EPWMXBAR25_ICSSGPO7_PORT1_SEL == 1 | MW_EPWMXBAR25_ICSSGPO8_PORT1_SEL == 1 | MW_EPWMXBAR25_ICSSGPO9_PORT1_SEL == 1 | MW_EPWMXBAR25_ICSSGPO10_PORT1_SEL == 1 | MW_EPWMXBAR25_ICSSGPO11_PORT1_SEL == 1 | MW_EPWMXBAR25_ICSSGPO12_PORT1_SEL == 1 | MW_EPWMXBAR25_ICSSGPO13_PORT1_SEL == 1 | MW_EPWMXBAR25_ICSSGPO14_PORT1_SEL == 1 | MW_EPWMXBAR25_ICSSGPO15_PORT1_SEL == 1)
    //     group4_epwmxbar[25] = EPWM_XBAR_25;
    // else
        group4_epwmxbar[25] = 0;
    group5_epwmxbar[25] = (MW_EPWMXBAR25_EPWM0_TRIPOUT_SEL << 0) | (MW_EPWMXBAR25_EPWM1_TRIPOUT_SEL << 1) | (MW_EPWMXBAR25_EPWM2_TRIPOUT_SEL << 2) | (MW_EPWMXBAR25_EPWM3_TRIPOUT_SEL << 3) | (MW_EPWMXBAR25_EPWM4_TRIPOUT_SEL << 4) | (MW_EPWMXBAR25_EPWM5_TRIPOUT_SEL << 5) | (MW_EPWMXBAR25_EPWM6_TRIPOUT_SEL << 6) | (MW_EPWMXBAR25_EPWM7_TRIPOUT_SEL << 7) | (MW_EPWMXBAR25_EPWM8_TRIPOUT_SEL << 8) | (MW_EPWMXBAR25_EPWM9_TRIPOUT_SEL << 9) | (MW_EPWMXBAR25_EPWM10_TRIPOUT_SEL << 10) | (MW_EPWMXBAR25_EPWM11_TRIPOUT_SEL << 11) | (MW_EPWMXBAR25_EPWM12_TRIPOUT_SEL << 12) | (MW_EPWMXBAR25_EPWM13_TRIPOUT_SEL << 13) | (MW_EPWMXBAR25_EPWM14_TRIPOUT_SEL << 14) | (MW_EPWMXBAR25_EPWM15_TRIPOUT_SEL << 15) | (MW_EPWMXBAR25_EPWM16_TRIPOUT_SEL << 16) | (MW_EPWMXBAR25_EPWM17_TRIPOUT_SEL << 17) | (MW_EPWMXBAR25_EPWM18_TRIPOUT_SEL << 18) | (MW_EPWMXBAR25_EPWM19_TRIPOUT_SEL << 19) | (MW_EPWMXBAR25_EPWM20_TRIPOUT_SEL << 20) | (MW_EPWMXBAR25_EPWM21_TRIPOUT_SEL << 21) | (MW_EPWMXBAR25_EPWM22_TRIPOUT_SEL << 22) | (MW_EPWMXBAR25_EPWM23_TRIPOUT_SEL << 23) | (MW_EPWMXBAR25_EPWM24_TRIPOUT_SEL << 24) | (MW_EPWMXBAR25_EPWM25_TRIPOUT_SEL << 25) | (MW_EPWMXBAR25_EPWM26_TRIPOUT_SEL << 26) | (MW_EPWMXBAR25_EPWM27_TRIPOUT_SEL << 27) | (MW_EPWMXBAR25_EPWM28_TRIPOUT_SEL << 28) | (MW_EPWMXBAR25_EPWM29_TRIPOUT_SEL << 29) | (MW_EPWMXBAR25_EPWM30_TRIPOUT_SEL << 30) | (MW_EPWMXBAR25_EPWM31_TRIPOUT_SEL << 31);
    group6_epwmxbar[25] = (MW_EPWMXBAR25_DEL0_TRIP_SEL << 0) | (MW_EPWMXBAR25_DEL1_TRIP_SEL << 1) | (MW_EPWMXBAR25_DEL2_TRIP_SEL << 2) | (MW_EPWMXBAR25_DEL3_TRIP_SEL << 3) | (MW_EPWMXBAR25_DEL4_TRIP_SEL << 4) | (MW_EPWMXBAR25_DEL5_TRIP_SEL << 5) | (MW_EPWMXBAR25_DEL6_TRIP_SEL << 6) | (MW_EPWMXBAR25_DEL7_TRIP_SEL << 7) | (MW_EPWMXBAR25_DEL8_TRIP_SEL << 8) | (MW_EPWMXBAR25_DEL9_TRIP_SEL << 9) | (MW_EPWMXBAR25_DEL10_TRIP_SEL << 10) | (MW_EPWMXBAR25_DEL11_TRIP_SEL << 11) | (MW_EPWMXBAR25_DEL12_TRIP_SEL << 12) | (MW_EPWMXBAR25_DEL13_TRIP_SEL << 13) | (MW_EPWMXBAR25_DEL14_TRIP_SEL << 14) | (MW_EPWMXBAR25_DEL15_TRIP_SEL << 15) | (MW_EPWMXBAR25_DEL16_TRIP_SEL << 16) | (MW_EPWMXBAR25_DEL17_TRIP_SEL << 17) | (MW_EPWMXBAR25_DEL18_TRIP_SEL << 18) | (MW_EPWMXBAR25_DEL19_TRIP_SEL << 19) | (MW_EPWMXBAR25_DEL20_TRIP_SEL << 20) | (MW_EPWMXBAR25_DEL21_TRIP_SEL << 21) | (MW_EPWMXBAR25_DEL22_TRIP_SEL << 22) | (MW_EPWMXBAR25_DEL23_TRIP_SEL << 23) | (MW_EPWMXBAR25_DEL24_TRIP_SEL << 24) | (MW_EPWMXBAR25_DEL25_TRIP_SEL << 25) | (MW_EPWMXBAR25_DEL26_TRIP_SEL << 26) | (MW_EPWMXBAR25_DEL27_TRIP_SEL << 27) | (MW_EPWMXBAR25_DEL28_TRIP_SEL << 28) | (MW_EPWMXBAR25_DEL29_TRIP_SEL << 29) | (MW_EPWMXBAR25_DEL30_TRIP_SEL << 30) | (MW_EPWMXBAR25_DEL31_TRIP_SEL << 31);
    group7_epwmxbar[25] = (MW_EPWMXBAR25_DEL0_ACTIVE_SEL << 0) | (MW_EPWMXBAR25_DEL1_ACTIVE_SEL << 1) | (MW_EPWMXBAR25_DEL2_ACTIVE_SEL << 2) | (MW_EPWMXBAR25_DEL3_ACTIVE_SEL << 3) | (MW_EPWMXBAR25_DEL4_ACTIVE_SEL << 4) | (MW_EPWMXBAR25_DEL5_ACTIVE_SEL << 5) | (MW_EPWMXBAR25_DEL6_ACTIVE_SEL << 6) | (MW_EPWMXBAR25_DEL7_ACTIVE_SEL << 7) | (MW_EPWMXBAR25_DEL8_ACTIVE_SEL << 8) | (MW_EPWMXBAR25_DEL9_ACTIVE_SEL << 9) | (MW_EPWMXBAR25_DEL10_ACTIVE_SEL << 10) | (MW_EPWMXBAR25_DEL11_ACTIVE_SEL << 11) | (MW_EPWMXBAR25_DEL12_ACTIVE_SEL << 12) | (MW_EPWMXBAR25_DEL13_ACTIVE_SEL << 13) | (MW_EPWMXBAR25_DEL14_ACTIVE_SEL << 14) | (MW_EPWMXBAR25_DEL15_ACTIVE_SEL << 15) | (MW_EPWMXBAR25_DEL16_ACTIVE_SEL << 16) | (MW_EPWMXBAR25_DEL17_ACTIVE_SEL << 17) | (MW_EPWMXBAR25_DEL18_ACTIVE_SEL << 18) | (MW_EPWMXBAR25_DEL19_ACTIVE_SEL << 19) | (MW_EPWMXBAR25_DEL20_ACTIVE_SEL << 20) | (MW_EPWMXBAR25_DEL21_ACTIVE_SEL << 21) | (MW_EPWMXBAR25_DEL22_ACTIVE_SEL << 22) | (MW_EPWMXBAR25_DEL23_ACTIVE_SEL << 23) | (MW_EPWMXBAR25_DEL24_ACTIVE_SEL << 24) | (MW_EPWMXBAR25_DEL25_ACTIVE_SEL << 25) | (MW_EPWMXBAR25_DEL26_ACTIVE_SEL << 26) | (MW_EPWMXBAR25_DEL27_ACTIVE_SEL << 27) | (MW_EPWMXBAR25_DEL28_ACTIVE_SEL << 28) | (MW_EPWMXBAR25_DEL29_ACTIVE_SEL << 29) | (MW_EPWMXBAR25_DEL30_ACTIVE_SEL << 30) | (MW_EPWMXBAR25_DEL31_ACTIVE_SEL << 31);
    group8_epwmxbar[25] = (MW_EPWMXBAR25_EQEP0_ERR_SEL << 0) | (MW_EPWMXBAR25_EQEP1_ERR_SEL << 1) | (MW_EPWMXBAR25_EQEP2_ERR_SEL << 2) | (MW_EPWMXBAR25_FSIRX0_RX_TRIG0_SEL << 3) | (MW_EPWMXBAR25_FSIRX0_RX_TRIG1_SEL << 4) | (MW_EPWMXBAR25_FSIRX0_RX_TRIG2_SEL << 5) | (MW_EPWMXBAR25_FSIRX0_RX_TRIG3_SEL << 6) | (MW_EPWMXBAR25_FSIRX1_RX_TRIG0_SEL << 7) | (MW_EPWMXBAR25_FSIRX1_RX_TRIG1_SEL << 8) | (MW_EPWMXBAR25_FSIRX1_RX_TRIG2_SEL << 9) | (MW_EPWMXBAR25_FSIRX1_RX_TRIG3_SEL << 10) | (MW_EPWMXBAR25_FSIRX2_RX_TRIG0_SEL << 11) | (MW_EPWMXBAR25_FSIRX2_RX_TRIG1_SEL << 12) | (MW_EPWMXBAR25_FSIRX2_RX_TRIG2_SEL << 13) | (MW_EPWMXBAR25_FSIRX2_RX_TRIG3_SEL << 14) | (MW_EPWMXBAR25_FSIRX3_RX_TRIG0_SEL << 15) | (MW_EPWMXBAR25_FSIRX3_RX_TRIG1_SEL << 16) | (MW_EPWMXBAR25_FSIRX3_RX_TRIG2_SEL << 17) | (MW_EPWMXBAR25_FSIRX3_RX_TRIG3_SEL << 18) | (MW_EPWMXBAR25_ECAP0_TRIPOUT_SEL << 19) | (MW_EPWMXBAR25_ECAP1_TRIPOUT_SEL << 20) | (MW_EPWMXBAR25_ECAP2_TRIPOUT_SEL << 21) | (MW_EPWMXBAR25_ECAP3_TRIPOUT_SEL << 22) | (MW_EPWMXBAR25_ECAP4_TRIPOUT_SEL << 23) | (MW_EPWMXBAR25_ECAP5_TRIPOUT_SEL << 24) | (MW_EPWMXBAR25_ECAP6_TRIPOUT_SEL << 25) | (MW_EPWMXBAR25_ECAP7_TRIPOUT_SEL << 26) | (MW_EPWMXBAR25_ECAP8_TRIPOUT_SEL << 27) | (MW_EPWMXBAR25_ECAP9_TRIPOUT_SEL << 28);
    group0_epwmxbar[26] = (MW_EPWMXBAR26_CMPSSA0_CTRIPL_SEL << 0) | (MW_EPWMXBAR26_CMPSSA0_CTRIPH_SEL << 1) | (MW_EPWMXBAR26_CMPSSA1_CTRIPL_SEL << 2) | (MW_EPWMXBAR26_CMPSSA1_CTRIPH_SEL << 3) | (MW_EPWMXBAR26_CMPSSA2_CTRIPL_SEL << 4) | (MW_EPWMXBAR26_CMPSSA2_CTRIPH_SEL << 5) | (MW_EPWMXBAR26_CMPSSA3_CTRIPL_SEL << 6) | (MW_EPWMXBAR26_CMPSSA3_CTRIPH_SEL << 7) | (MW_EPWMXBAR26_CMPSSA4_CTRIPL_SEL << 8) | (MW_EPWMXBAR26_CMPSSA4_CTRIPH_SEL << 9) | (MW_EPWMXBAR26_CMPSSA5_CTRIPL_SEL << 10) | (MW_EPWMXBAR26_CMPSSA5_CTRIPH_SEL << 11) | (MW_EPWMXBAR26_CMPSSA6_CTRIPL_SEL << 12) | (MW_EPWMXBAR26_CMPSSA6_CTRIPH_SEL << 13) | (MW_EPWMXBAR26_CMPSSA7_CTRIPL_SEL << 14) | (MW_EPWMXBAR26_CMPSSA7_CTRIPH_SEL << 15) | (MW_EPWMXBAR26_CMPSSA8_CTRIPL_SEL << 16) | (MW_EPWMXBAR26_CMPSSA8_CTRIPH_SEL << 17) | (MW_EPWMXBAR26_CMPSSA9_CTRIPL_SEL << 18) | (MW_EPWMXBAR26_CMPSSA9_CTRIPH_SEL << 19);
    group1_epwmxbar[26] = (MW_EPWMXBAR26_CMPSSB0_CTRIPL_SEL << 0) | (MW_EPWMXBAR26_CMPSSB0_CTRIPH_SEL << 1) | (MW_EPWMXBAR26_CMPSSB1_CTRIPL_SEL << 2) | (MW_EPWMXBAR26_CMPSSB1_CTRIPH_SEL << 3) | (MW_EPWMXBAR26_CMPSSB2_CTRIPL_SEL << 4) | (MW_EPWMXBAR26_CMPSSB2_CTRIPH_SEL << 5) | (MW_EPWMXBAR26_CMPSSB3_CTRIPL_SEL << 6) | (MW_EPWMXBAR26_CMPSSB3_CTRIPH_SEL << 7) | (MW_EPWMXBAR26_CMPSSB4_CTRIPL_SEL << 8) | (MW_EPWMXBAR26_CMPSSB4_CTRIPH_SEL << 9) | (MW_EPWMXBAR26_CMPSSB5_CTRIPL_SEL << 10) | (MW_EPWMXBAR26_CMPSSB5_CTRIPH_SEL << 11) | (MW_EPWMXBAR26_CMPSSB6_CTRIPL_SEL << 12) | (MW_EPWMXBAR26_CMPSSB6_CTRIPH_SEL << 13) | (MW_EPWMXBAR26_CMPSSB7_CTRIPL_SEL << 14) | (MW_EPWMXBAR26_CMPSSB7_CTRIPH_SEL << 15) | (MW_EPWMXBAR26_CMPSSB8_CTRIPL_SEL << 16) | (MW_EPWMXBAR26_CMPSSB8_CTRIPH_SEL << 17) | (MW_EPWMXBAR26_CMPSSB9_CTRIPL_SEL << 18) | (MW_EPWMXBAR26_CMPSSB9_CTRIPH_SEL << 19);
    group2_epwmxbar[26] = (MW_EPWMXBAR26_SD0_FILT0_CEVT1_SEL << 0) | (MW_EPWMXBAR26_SD0_FILT0_CEVT2_SEL << 1) | (MW_EPWMXBAR26_SD0_FILT0_CMPHZ_SEL << 2) | (MW_EPWMXBAR26_SD0_FILT1_CEVT1_SEL << 3) | (MW_EPWMXBAR26_SD0_FILT1_CEVT2_SEL << 4) | (MW_EPWMXBAR26_SD0_FILT1_CMPHZ_SEL << 5) | (MW_EPWMXBAR26_SD0_FILT2_CEVT1_SEL << 6) | (MW_EPWMXBAR26_SD0_FILT2_CEVT2_SEL << 7) | (MW_EPWMXBAR26_SD0_FILT2_CMPHZ_SEL << 8) | (MW_EPWMXBAR26_SD0_FILT3_CEVT1_SEL << 9) | (MW_EPWMXBAR26_SD0_FILT3_CEVT2_SEL << 10) | (MW_EPWMXBAR26_SD0_FILT3_CMPHZ_SEL << 11) | (MW_EPWMXBAR26_SD1_FILT0_CEVT1_SEL << 12) | (MW_EPWMXBAR26_SD1_FILT0_CEVT2_SEL << 13) | (MW_EPWMXBAR26_SD1_FILT0_CMPHZ_SEL << 14) | (MW_EPWMXBAR26_SD1_FILT1_CEVT1_SEL << 15) | (MW_EPWMXBAR26_SD1_FILT1_CEVT2_SEL << 16) | (MW_EPWMXBAR26_SD1_FILT1_CMPHZ_SEL << 17) | (MW_EPWMXBAR26_SD1_FILT2_CEVT1_SEL << 18) | (MW_EPWMXBAR26_SD1_FILT2_CEVT2_SEL << 19) | (MW_EPWMXBAR26_SD1_FILT2_CMPHZ_SEL << 20) | (MW_EPWMXBAR26_SD1_FILT3_CEVT1_SEL << 21) | (MW_EPWMXBAR26_SD1_FILT3_CEVT2_SEL << 22) | (MW_EPWMXBAR26_SD1_FILT3_CMPHZ_SEL << 23);
    group3_epwmxbar[26] = (MW_EPWMXBAR26_ADC0_EVT1_SEL << 0) | (MW_EPWMXBAR26_ADC0_EVT2_SEL << 1) | (MW_EPWMXBAR26_ADC0_EVT3_SEL << 2) | (MW_EPWMXBAR26_ADC0_EVT4_SEL << 3) | (MW_EPWMXBAR26_ADC1_EVT1_SEL << 4) | (MW_EPWMXBAR26_ADC1_EVT2_SEL << 5) | (MW_EPWMXBAR26_ADC1_EVT3_SEL << 6) | (MW_EPWMXBAR26_ADC1_EVT4_SEL << 7) | (MW_EPWMXBAR26_ADC2_EVT1_SEL << 8) | (MW_EPWMXBAR26_ADC2_EVT2_SEL << 9) | (MW_EPWMXBAR26_ADC2_EVT3_SEL << 10) | (MW_EPWMXBAR26_ADC2_EVT4_SEL << 11) | (MW_EPWMXBAR26_ADC3_EVT1_SEL << 12) | (MW_EPWMXBAR26_ADC3_EVT2_SEL << 13) | (MW_EPWMXBAR26_ADC3_EVT3_SEL << 14) | (MW_EPWMXBAR26_ADC3_EVT4_SEL << 15) | (MW_EPWMXBAR26_ADC4_EVT1_SEL << 16) | (MW_EPWMXBAR26_ADC4_EVT2_SEL << 17) | (MW_EPWMXBAR26_ADC4_EVT3_SEL << 18) | (MW_EPWMXBAR26_ADC4_EVT4_SEL << 19);
    // if(MW_EPWMXBAR26_GPIO0_SEL == 1 | MW_EPWMXBAR26_GPIO1_SEL == 1 | MW_EPWMXBAR26_GPIO2_SEL == 1 | MW_EPWMXBAR26_GPIO3_SEL == 1 | MW_EPWMXBAR26_GPIO4_SEL == 1 | MW_EPWMXBAR26_GPIO5_SEL == 1 | MW_EPWMXBAR26_GPIO6_SEL == 1 | MW_EPWMXBAR26_GPIO7_SEL == 1| MW_EPWMXBAR26_GPIO8_SEL == 1 | MW_EPWMXBAR26_GPIO9_SEL == 1 | MW_EPWMXBAR26_GPIO10_SEL == 1| MW_EPWMXBAR26_GPIO11_SEL == 1| MW_EPWMXBAR26_GPIO12_SEL == 1 | MW_EPWMXBAR26_GPIO13_SEL == 1 | MW_EPWMXBAR26_GPIO14_SEL == 1 | MW_EPWMXBAR26_GPIO15_SEL == 1 | MW_EPWMXBAR26_GPIO16_SEL == 1 | MW_EPWMXBAR26_GPIO17_SEL == 1 | MW_EPWMXBAR26_GPIO18_SEL == 1 | MW_EPWMXBAR26_GPIO19_SEL == 1 | MW_EPWMXBAR26_GPIO20_SEL == 1 | MW_EPWMXBAR26_GPIO21_SEL == 1 | MW_EPWMXBAR26_GPIO22_SEL == 1 | MW_EPWMXBAR26_GPIO23_SEL == 1 | MW_EPWMXBAR26_GPIO24_SEL == 1 | MW_EPWMXBAR26_GPIO25_SEL == 1 | MW_EPWMXBAR26_GPIO26_SEL == 1 | MW_EPWMXBAR26_GPIO27_SEL == 1 | MW_EPWMXBAR26_GPIO28_SEL == 1 | MW_EPWMXBAR26_GPIO29_SEL == 1 | MW_EPWMXBAR26_GPIO30_SEL == 1 | MW_EPWMXBAR26_GPIO31_SEL == 1 | MW_EPWMXBAR26_GPIO32_SEL == 1 | MW_EPWMXBAR26_GPIO33_SEL == 1 | MW_EPWMXBAR26_GPIO34_SEL == 1 | MW_EPWMXBAR26_GPIO35_SEL == 1 | MW_EPWMXBAR26_GPIO36_SEL == 1 | MW_EPWMXBAR26_GPIO37_SEL == 1 | MW_EPWMXBAR26_GPIO38_SEL == 1 | MW_EPWMXBAR26_GPIO39_SEL == 1 | MW_EPWMXBAR26_GPIO40_SEL == 1 | MW_EPWMXBAR26_GPIO41_SEL == 1 | MW_EPWMXBAR26_GPIO42_SEL == 1 | MW_EPWMXBAR26_GPIO43_SEL == 1 | MW_EPWMXBAR26_GPIO44_SEL == 1 | | MW_EPWMXBAR26_GPIO45_SEL == 1 | MW_EPWMXBAR26_GPIO46_SEL == 1 | MW_EPWMXBAR26_GPIO47_SEL == 1| MW_EPWMXBAR26_GPIO48_SEL == 1 | MW_EPWMXBAR26_GPIO49_SEL == 1 | MW_EPWMXBAR26_GPIO50_SEL == 1 | MW_EPWMXBAR26_GPIO51_SEL == 1 | MW_EPWMXBAR26_GPIO52_SEL == 1 | MW_EPWMXBAR26_GPIO53_SEL == 1 | MW_EPWMXBAR26_GPIO54_SEL == 1 | MW_EPWMXBAR26_GPIO55_SEL == 1 | MW_EPWMXBAR26_GPIO56_SEL == 1 | MW_EPWMXBAR26_GPIO57_SEL == 1| MW_EPWMXBAR26_GPIO58_SEL == 1 | MW_EPWMXBAR26_GPIO59_SEL == 1 | MW_EPWMXBAR26_GPIO60_SEL == 1 | MW_EPWMXBAR26_GPIO61_SEL == 1 | MW_EPWMXBAR26_GPIO62_SEL == 1 | MW_EPWMXBAR26_GPIO63_SEL == 1 | MW_EPWMXBAR26_GPIO64_SEL == 1 | | MW_EPWMXBAR26_GPIO59_SEL == 1 | MW_EPWMXBAR26_GPIO60_SEL == 1 | MW_EPWMXBAR26_GPIO61_SEL == 1 | MW_EPWMXBAR26_GPIO62_SEL == 1 | MW_EPWMXBAR26_GPIO63_SEL == 1 | MW_EPWMXBAR26_GPIO64_SEL == 1 | MW_EPWMXBAR26_GPIO65_SEL == 1 | MW_EPWMXBAR26_GPIO66_SEL == 1 | MW_EPWMXBAR26_GPIO67_SEL == 1 | MW_EPWMXBAR26_GPIO68_SEL == 1 | MW_EPWMXBAR26_GPIO69_SEL == 1 | MW_EPWMXBAR26_GPIO70_SEL == 1 | MW_EPWMXBAR26_GPIO71_SEL == 1 | MW_EPWMXBAR26_GPIO72_SEL == 1 | MW_EPWMXBAR26_GPIO73_SEL == 1 | MW_EPWMXBAR26_GPIO74_SEL == 1 | MW_EPWMXBAR26_GPIO75_SEL == 1 | MW_EPWMXBAR26_GPIO76_SEL == 1 | MW_EPWMXBAR26_GPIO77_SEL == 1 | MW_EPWMXBAR26_GPIO78_SEL == 1 | | MW_EPWMXBAR26_GPIO80_SEL == 1 | MW_EPWMXBAR26_GPIO81_SEL == 1 | MW_EPWMXBAR26_GPIO82_SEL == 1 | MW_EPWMXBAR26_GPIO83_SEL == 1 | MW_EPWMXBAR26_GPIO84_SEL == 1 | MW_EPWMXBAR26_GPIO85_SEL == 1 | MW_EPWMXBAR26_GPIO86_SEL == 1 | MW_EPWMXBAR26_GPIO87_SEL == 1 | MW_EPWMXBAR26_GPIO88_SEL == 1 | MW_EPWMXBAR26_GPIO89_SEL == 1 | MW_EPWMXBAR26_GPIO90_SEL == 1 | MW_EPWMXBAR26_GPIO91_SEL == 1 | MW_EPWMXBAR26_GPIO92_SEL == 1 | MW_EPWMXBAR26_GPIO93_SEL == 1 | MW_EPWMXBAR26_GPIO94_SEL == 1 | MW_EPWMXBAR26_GPIO95_SEL == 1 | MW_EPWMXBAR26_GPIO96_SEL == 1 | MW_EPWMXBAR26_GPIO97_SEL == 1 | MW_EPWMXBAR26_GPIO98_SEL == 1 | MW_EPWMXBAR26_GPIO99_SEL == 1 | MW_EPWMXBAR26_GPIO100_SEL == 1 | MW_EPWMXBAR26_GPIO101_SEL == 1 | MW_EPWMXBAR26_GPIO102_SEL == 1 | MW_EPWMXBAR26_GPIO103_SEL == 1 | MW_EPWMXBAR26_GPIO104_SEL == 1 | MW_EPWMXBAR26_GPIO105_SEL == 1 | MW_EPWMXBAR26_GPIO106_SEL == 1 | MW_EPWMXBAR26_GPIO107_SEL == 1 | | MW_EPWMXBAR26_GPIO108_SEL == 1 | MW_EPWMXBAR26_GPIO109_SEL == 1| MW_EPWMXBAR26_GPIO110_SEL == 1 | MW_EPWMXBAR26_GPIO111_SEL == 1 | MW_EPWMXBAR26_GPIO112_SEL == 1 | MW_EPWMXBAR26_GPIO113_SEL == 1 | MW_EPWMXBAR26_GPIO114_SEL == 1 | MW_EPWMXBAR26_GPIO115_SEL == 1 | MW_EPWMXBAR26_GPIO116_SEL == 1 | MW_EPWMXBAR26_GPIO117_SEL == 1 | MW_EPWMXBAR26_GPIO118_SEL == 1 | MW_EPWMXBAR26_GPIO119_SEL == 1 | MW_EPWMXBAR26_GPIO120_SEL == 1 | MW_EPWMXBAR26_GPIO121_SEL == 1 | MW_EPWMXBAR26_GPIO122_SEL == 1 | MW_EPWMXBAR26_GPIO123_SEL == 1 | MW_EPWMXBAR26_GPIO124_SEL == 1 | MW_EPWMXBAR26_GPIO125_SEL == 1 | MW_EPWMXBAR26_GPIO126_SEL == 1 | MW_EPWMXBAR26_GPIO127_SEL == 1 | MW_EPWMXBAR26_GPIO128_SEL == 1 | MW_EPWMXBAR26_GPIO129_SEL == 1 | MW_EPWMXBAR26_GPIO130_SEL == 1 | MW_EPWMXBAR26_GPIO131_SEL == 1 | MW_EPWMXBAR26_GPIO132_SEL == 1 | MW_EPWMXBAR26_GPIO133_SEL == 1 | MW_EPWMXBAR26_GPIO134_SEL == 1 | MW_EPWMXBAR26_GPIO135_SEL == 1 | MW_EPWMXBAR26_GPIO136_SEL == 1 | MW_EPWMXBAR26_GPIO137_SEL == 1 | MW_EPWMXBAR26_GPIO139_SEL == 1 | MW_EPWMXBAR26_GPIO140_SEL == 1 | MW_EPWMXBAR26_GPIO141_SEL == 1 | MW_EPWMXBAR26_GPIO142_SEL == 1 | MW_EPWMXBAR26_GPIO143_SEL == 1 | MW_EPWMXBAR26_ICSSGPO0_PORT0_SEL == 1 | MW_EPWMXBAR26_ICSSGPO1_PORT0_SEL == 1 | MW_EPWMXBAR26_ICSSGPO2_PORT0_SEL == 1 | MW_EPWMXBAR26_ICSSGPO3_PORT0_SEL == 1 | MW_EPWMXBAR26_ICSSGPO4_PORT0_SEL == 1 | MW_EPWMXBAR26_ICSSGPO5_PORT0_SEL == 1 | MW_EPWMXBAR26_ICSSGPO6_PORT0_SEL == 1 | MW_EPWMXBAR26_ICSSGPO7_PORT0_SEL == 1 | MW_EPWMXBAR26_ICSSGPO8_PORT0_SEL == 1 | MW_EPWMXBAR26_ICSSGPO9_PORT0_SEL == 1 | MW_EPWMXBAR26_ICSSGPO10_PORT0_SEL == 1 | MW_EPWMXBAR26_ICSSGPO11_PORT0_SEL == 1 | MW_EPWMXBAR26_ICSSGPO12_PORT0_SEL == 1 | MW_EPWMXBAR26_ICSSGPO13_PORT0_SEL == 1 | MW_EPWMXBAR26_ICSSGPO14_PORT0_SEL == 1 | MW_EPWMXBAR26_ICSSGPO15_PORT0_SEL == 1 | MW_EPWMXBAR26_ICSSGPO0_PORT1_SEL == 1 | MW_EPWMXBAR26_ICSSGPO1_PORT1_SEL == 1 | MW_EPWMXBAR26_ICSSGPO2_PORT1_SEL == 1 | MW_EPWMXBAR26_ICSSGPO3_PORT1_SEL == 1 | MW_EPWMXBAR26_ICSSGPO4_PORT1_SEL == 1 | MW_EPWMXBAR26_ICSSGPO5_PORT1_SEL == 1 | MW_EPWMXBAR26_ICSSGPO6_PORT1_SEL == 1 | MW_EPWMXBAR26_ICSSGPO7_PORT1_SEL == 1 | MW_EPWMXBAR26_ICSSGPO8_PORT1_SEL == 1 | MW_EPWMXBAR26_ICSSGPO9_PORT1_SEL == 1 | MW_EPWMXBAR26_ICSSGPO10_PORT1_SEL == 1 | MW_EPWMXBAR26_ICSSGPO11_PORT1_SEL == 1 | MW_EPWMXBAR26_ICSSGPO12_PORT1_SEL == 1 | MW_EPWMXBAR26_ICSSGPO13_PORT1_SEL == 1 | MW_EPWMXBAR26_ICSSGPO14_PORT1_SEL == 1 | MW_EPWMXBAR26_ICSSGPO15_PORT1_SEL == 1)
    //     group4_epwmxbar[26] = EPWM_XBAR_26;
    // else
        group4_epwmxbar[26] = 0;
    group5_epwmxbar[26] = (MW_EPWMXBAR26_EPWM0_TRIPOUT_SEL << 0) | (MW_EPWMXBAR26_EPWM1_TRIPOUT_SEL << 1) | (MW_EPWMXBAR26_EPWM2_TRIPOUT_SEL << 2) | (MW_EPWMXBAR26_EPWM3_TRIPOUT_SEL << 3) | (MW_EPWMXBAR26_EPWM4_TRIPOUT_SEL << 4) | (MW_EPWMXBAR26_EPWM5_TRIPOUT_SEL << 5) | (MW_EPWMXBAR26_EPWM6_TRIPOUT_SEL << 6) | (MW_EPWMXBAR26_EPWM7_TRIPOUT_SEL << 7) | (MW_EPWMXBAR26_EPWM8_TRIPOUT_SEL << 8) | (MW_EPWMXBAR26_EPWM9_TRIPOUT_SEL << 9) | (MW_EPWMXBAR26_EPWM10_TRIPOUT_SEL << 10) | (MW_EPWMXBAR26_EPWM11_TRIPOUT_SEL << 11) | (MW_EPWMXBAR26_EPWM12_TRIPOUT_SEL << 12) | (MW_EPWMXBAR26_EPWM13_TRIPOUT_SEL << 13) | (MW_EPWMXBAR26_EPWM14_TRIPOUT_SEL << 14) | (MW_EPWMXBAR26_EPWM15_TRIPOUT_SEL << 15) | (MW_EPWMXBAR26_EPWM16_TRIPOUT_SEL << 16) | (MW_EPWMXBAR26_EPWM17_TRIPOUT_SEL << 17) | (MW_EPWMXBAR26_EPWM18_TRIPOUT_SEL << 18) | (MW_EPWMXBAR26_EPWM19_TRIPOUT_SEL << 19) | (MW_EPWMXBAR26_EPWM20_TRIPOUT_SEL << 20) | (MW_EPWMXBAR26_EPWM21_TRIPOUT_SEL << 21) | (MW_EPWMXBAR26_EPWM22_TRIPOUT_SEL << 22) | (MW_EPWMXBAR26_EPWM23_TRIPOUT_SEL << 23) | (MW_EPWMXBAR26_EPWM24_TRIPOUT_SEL << 24) | (MW_EPWMXBAR26_EPWM25_TRIPOUT_SEL << 25) | (MW_EPWMXBAR26_EPWM26_TRIPOUT_SEL << 26) | (MW_EPWMXBAR26_EPWM27_TRIPOUT_SEL << 27) | (MW_EPWMXBAR26_EPWM28_TRIPOUT_SEL << 28) | (MW_EPWMXBAR26_EPWM29_TRIPOUT_SEL << 29) | (MW_EPWMXBAR26_EPWM30_TRIPOUT_SEL << 30) | (MW_EPWMXBAR26_EPWM31_TRIPOUT_SEL << 31);
    group6_epwmxbar[26] = (MW_EPWMXBAR26_DEL0_TRIP_SEL << 0) | (MW_EPWMXBAR26_DEL1_TRIP_SEL << 1) | (MW_EPWMXBAR26_DEL2_TRIP_SEL << 2) | (MW_EPWMXBAR26_DEL3_TRIP_SEL << 3) | (MW_EPWMXBAR26_DEL4_TRIP_SEL << 4) | (MW_EPWMXBAR26_DEL5_TRIP_SEL << 5) | (MW_EPWMXBAR26_DEL6_TRIP_SEL << 6) | (MW_EPWMXBAR26_DEL7_TRIP_SEL << 7) | (MW_EPWMXBAR26_DEL8_TRIP_SEL << 8) | (MW_EPWMXBAR26_DEL9_TRIP_SEL << 9) | (MW_EPWMXBAR26_DEL10_TRIP_SEL << 10) | (MW_EPWMXBAR26_DEL11_TRIP_SEL << 11) | (MW_EPWMXBAR26_DEL12_TRIP_SEL << 12) | (MW_EPWMXBAR26_DEL13_TRIP_SEL << 13) | (MW_EPWMXBAR26_DEL14_TRIP_SEL << 14) | (MW_EPWMXBAR26_DEL15_TRIP_SEL << 15) | (MW_EPWMXBAR26_DEL16_TRIP_SEL << 16) | (MW_EPWMXBAR26_DEL17_TRIP_SEL << 17) | (MW_EPWMXBAR26_DEL18_TRIP_SEL << 18) | (MW_EPWMXBAR26_DEL19_TRIP_SEL << 19) | (MW_EPWMXBAR26_DEL20_TRIP_SEL << 20) | (MW_EPWMXBAR26_DEL21_TRIP_SEL << 21) | (MW_EPWMXBAR26_DEL22_TRIP_SEL << 22) | (MW_EPWMXBAR26_DEL23_TRIP_SEL << 23) | (MW_EPWMXBAR26_DEL24_TRIP_SEL << 24) | (MW_EPWMXBAR26_DEL25_TRIP_SEL << 25) | (MW_EPWMXBAR26_DEL26_TRIP_SEL << 26) | (MW_EPWMXBAR26_DEL27_TRIP_SEL << 27) | (MW_EPWMXBAR26_DEL28_TRIP_SEL << 28) | (MW_EPWMXBAR26_DEL29_TRIP_SEL << 29) | (MW_EPWMXBAR26_DEL30_TRIP_SEL << 30) | (MW_EPWMXBAR26_DEL31_TRIP_SEL << 31);
