TexasInstruments/am26x-hsp/src/am263px_init.c
    group7_epwmxbar[26] = (MW_EPWMXBAR26_DEL0_ACTIVE_SEL << 0) | (MW_EPWMXBAR26_DEL1_ACTIVE_SEL << 1) | (MW_EPWMXBAR26_DEL2_ACTIVE_SEL << 2) | (MW_EPWMXBAR26_DEL3_ACTIVE_SEL << 3) | (MW_EPWMXBAR26_DEL4_ACTIVE_SEL << 4) | (MW_EPWMXBAR26_DEL5_ACTIVE_SEL << 5) | (MW_EPWMXBAR26_DEL6_ACTIVE_SEL << 6) | (MW_EPWMXBAR26_DEL7_ACTIVE_SEL << 7) | (MW_EPWMXBAR26_DEL8_ACTIVE_SEL << 8) | (MW_EPWMXBAR26_DEL9_ACTIVE_SEL << 9) | (MW_EPWMXBAR26_DEL10_ACTIVE_SEL << 10) | (MW_EPWMXBAR26_DEL11_ACTIVE_SEL << 11) | (MW_EPWMXBAR26_DEL12_ACTIVE_SEL << 12) | (MW_EPWMXBAR26_DEL13_ACTIVE_SEL << 13) | (MW_EPWMXBAR26_DEL14_ACTIVE_SEL << 14) | (MW_EPWMXBAR26_DEL15_ACTIVE_SEL << 15) | (MW_EPWMXBAR26_DEL16_ACTIVE_SEL << 16) | (MW_EPWMXBAR26_DEL17_ACTIVE_SEL << 17) | (MW_EPWMXBAR26_DEL18_ACTIVE_SEL << 18) | (MW_EPWMXBAR26_DEL19_ACTIVE_SEL << 19) | (MW_EPWMXBAR26_DEL20_ACTIVE_SEL << 20) | (MW_EPWMXBAR26_DEL21_ACTIVE_SEL << 21) | (MW_EPWMXBAR26_DEL22_ACTIVE_SEL << 22) | (MW_EPWMXBAR26_DEL23_ACTIVE_SEL << 23) | (MW_EPWMXBAR26_DEL24_ACTIVE_SEL << 24) | (MW_EPWMXBAR26_DEL25_ACTIVE_SEL << 25) | (MW_EPWMXBAR26_DEL26_ACTIVE_SEL << 26) | (MW_EPWMXBAR26_DEL27_ACTIVE_SEL << 27) | (MW_EPWMXBAR26_DEL28_ACTIVE_SEL << 28) | (MW_EPWMXBAR26_DEL29_ACTIVE_SEL << 29) | (MW_EPWMXBAR26_DEL30_ACTIVE_SEL << 30) | (MW_EPWMXBAR26_DEL31_ACTIVE_SEL << 31);
    group8_epwmxbar[26] = (MW_EPWMXBAR26_EQEP0_ERR_SEL << 0) | (MW_EPWMXBAR26_EQEP1_ERR_SEL << 1) | (MW_EPWMXBAR26_EQEP2_ERR_SEL << 2) | (MW_EPWMXBAR26_FSIRX0_RX_TRIG0_SEL << 3) | (MW_EPWMXBAR26_FSIRX0_RX_TRIG1_SEL << 4) | (MW_EPWMXBAR26_FSIRX0_RX_TRIG2_SEL << 5) | (MW_EPWMXBAR26_FSIRX0_RX_TRIG3_SEL << 6) | (MW_EPWMXBAR26_FSIRX1_RX_TRIG0_SEL << 7) | (MW_EPWMXBAR26_FSIRX1_RX_TRIG1_SEL << 8) | (MW_EPWMXBAR26_FSIRX1_RX_TRIG2_SEL << 9) | (MW_EPWMXBAR26_FSIRX1_RX_TRIG3_SEL << 10) | (MW_EPWMXBAR26_FSIRX2_RX_TRIG0_SEL << 11) | (MW_EPWMXBAR26_FSIRX2_RX_TRIG1_SEL << 12) | (MW_EPWMXBAR26_FSIRX2_RX_TRIG2_SEL << 13) | (MW_EPWMXBAR26_FSIRX2_RX_TRIG3_SEL << 14) | (MW_EPWMXBAR26_FSIRX3_RX_TRIG0_SEL << 15) | (MW_EPWMXBAR26_FSIRX3_RX_TRIG1_SEL << 16) | (MW_EPWMXBAR26_FSIRX3_RX_TRIG2_SEL << 17) | (MW_EPWMXBAR26_FSIRX3_RX_TRIG3_SEL << 18) | (MW_EPWMXBAR26_ECAP0_TRIPOUT_SEL << 19) | (MW_EPWMXBAR26_ECAP1_TRIPOUT_SEL << 20) | (MW_EPWMXBAR26_ECAP2_TRIPOUT_SEL << 21) | (MW_EPWMXBAR26_ECAP3_TRIPOUT_SEL << 22) | (MW_EPWMXBAR26_ECAP4_TRIPOUT_SEL << 23) | (MW_EPWMXBAR26_ECAP5_TRIPOUT_SEL << 24) | (MW_EPWMXBAR26_ECAP6_TRIPOUT_SEL << 25) | (MW_EPWMXBAR26_ECAP7_TRIPOUT_SEL << 26) | (MW_EPWMXBAR26_ECAP8_TRIPOUT_SEL << 27) | (MW_EPWMXBAR26_ECAP9_TRIPOUT_SEL << 28);
    group0_epwmxbar[27] = (MW_EPWMXBAR27_CMPSSA0_CTRIPL_SEL << 0) | (MW_EPWMXBAR27_CMPSSA0_CTRIPH_SEL << 1) | (MW_EPWMXBAR27_CMPSSA1_CTRIPL_SEL << 2) | (MW_EPWMXBAR27_CMPSSA1_CTRIPH_SEL << 3) | (MW_EPWMXBAR27_CMPSSA2_CTRIPL_SEL << 4) | (MW_EPWMXBAR27_CMPSSA2_CTRIPH_SEL << 5) | (MW_EPWMXBAR27_CMPSSA3_CTRIPL_SEL << 6) | (MW_EPWMXBAR27_CMPSSA3_CTRIPH_SEL << 7) | (MW_EPWMXBAR27_CMPSSA4_CTRIPL_SEL << 8) | (MW_EPWMXBAR27_CMPSSA4_CTRIPH_SEL << 9) | (MW_EPWMXBAR27_CMPSSA5_CTRIPL_SEL << 10) | (MW_EPWMXBAR27_CMPSSA5_CTRIPH_SEL << 11) | (MW_EPWMXBAR27_CMPSSA6_CTRIPL_SEL << 12) | (MW_EPWMXBAR27_CMPSSA6_CTRIPH_SEL << 13) | (MW_EPWMXBAR27_CMPSSA7_CTRIPL_SEL << 14) | (MW_EPWMXBAR27_CMPSSA7_CTRIPH_SEL << 15) | (MW_EPWMXBAR27_CMPSSA8_CTRIPL_SEL << 16) | (MW_EPWMXBAR27_CMPSSA8_CTRIPH_SEL << 17) | (MW_EPWMXBAR27_CMPSSA9_CTRIPL_SEL << 18) | (MW_EPWMXBAR27_CMPSSA9_CTRIPH_SEL << 19);
    group1_epwmxbar[27] = (MW_EPWMXBAR27_CMPSSB0_CTRIPL_SEL << 0) | (MW_EPWMXBAR27_CMPSSB0_CTRIPH_SEL << 1) | (MW_EPWMXBAR27_CMPSSB1_CTRIPL_SEL << 2) | (MW_EPWMXBAR27_CMPSSB1_CTRIPH_SEL << 3) | (MW_EPWMXBAR27_CMPSSB2_CTRIPL_SEL << 4) | (MW_EPWMXBAR27_CMPSSB2_CTRIPH_SEL << 5) | (MW_EPWMXBAR27_CMPSSB3_CTRIPL_SEL << 6) | (MW_EPWMXBAR27_CMPSSB3_CTRIPH_SEL << 7) | (MW_EPWMXBAR27_CMPSSB4_CTRIPL_SEL << 8) | (MW_EPWMXBAR27_CMPSSB4_CTRIPH_SEL << 9) | (MW_EPWMXBAR27_CMPSSB5_CTRIPL_SEL << 10) | (MW_EPWMXBAR27_CMPSSB5_CTRIPH_SEL << 11) | (MW_EPWMXBAR27_CMPSSB6_CTRIPL_SEL << 12) | (MW_EPWMXBAR27_CMPSSB6_CTRIPH_SEL << 13) | (MW_EPWMXBAR27_CMPSSB7_CTRIPL_SEL << 14) | (MW_EPWMXBAR27_CMPSSB7_CTRIPH_SEL << 15) | (MW_EPWMXBAR27_CMPSSB8_CTRIPL_SEL << 16) | (MW_EPWMXBAR27_CMPSSB8_CTRIPH_SEL << 17) | (MW_EPWMXBAR27_CMPSSB9_CTRIPL_SEL << 18) | (MW_EPWMXBAR27_CMPSSB9_CTRIPH_SEL << 19);
    group2_epwmxbar[27] = (MW_EPWMXBAR27_SD0_FILT0_CEVT1_SEL << 0) | (MW_EPWMXBAR27_SD0_FILT0_CEVT2_SEL << 1) | (MW_EPWMXBAR27_SD0_FILT0_CMPHZ_SEL << 2) | (MW_EPWMXBAR27_SD0_FILT1_CEVT1_SEL << 3) | (MW_EPWMXBAR27_SD0_FILT1_CEVT2_SEL << 4) | (MW_EPWMXBAR27_SD0_FILT1_CMPHZ_SEL << 5) | (MW_EPWMXBAR27_SD0_FILT2_CEVT1_SEL << 6) | (MW_EPWMXBAR27_SD0_FILT2_CEVT2_SEL << 7) | (MW_EPWMXBAR27_SD0_FILT2_CMPHZ_SEL << 8) | (MW_EPWMXBAR27_SD0_FILT3_CEVT1_SEL << 9) | (MW_EPWMXBAR27_SD0_FILT3_CEVT2_SEL << 10) | (MW_EPWMXBAR27_SD0_FILT3_CMPHZ_SEL << 11) | (MW_EPWMXBAR27_SD1_FILT0_CEVT1_SEL << 12) | (MW_EPWMXBAR27_SD1_FILT0_CEVT2_SEL << 13) | (MW_EPWMXBAR27_SD1_FILT0_CMPHZ_SEL << 14) | (MW_EPWMXBAR27_SD1_FILT1_CEVT1_SEL << 15) | (MW_EPWMXBAR27_SD1_FILT1_CEVT2_SEL << 16) | (MW_EPWMXBAR27_SD1_FILT1_CMPHZ_SEL << 17) | (MW_EPWMXBAR27_SD1_FILT2_CEVT1_SEL << 18) | (MW_EPWMXBAR27_SD1_FILT2_CEVT2_SEL << 19) | (MW_EPWMXBAR27_SD1_FILT2_CMPHZ_SEL << 20) | (MW_EPWMXBAR27_SD1_FILT3_CEVT1_SEL << 21) | (MW_EPWMXBAR27_SD1_FILT3_CEVT2_SEL << 22) | (MW_EPWMXBAR27_SD1_FILT3_CMPHZ_SEL << 23);
    group3_epwmxbar[27] = (MW_EPWMXBAR27_ADC0_EVT1_SEL << 0) | (MW_EPWMXBAR27_ADC0_EVT2_SEL << 1) | (MW_EPWMXBAR27_ADC0_EVT3_SEL << 2) | (MW_EPWMXBAR27_ADC0_EVT4_SEL << 3) | (MW_EPWMXBAR27_ADC1_EVT1_SEL << 4) | (MW_EPWMXBAR27_ADC1_EVT2_SEL << 5) | (MW_EPWMXBAR27_ADC1_EVT3_SEL << 6) | (MW_EPWMXBAR27_ADC1_EVT4_SEL << 7) | (MW_EPWMXBAR27_ADC2_EVT1_SEL << 8) | (MW_EPWMXBAR27_ADC2_EVT2_SEL << 9) | (MW_EPWMXBAR27_ADC2_EVT3_SEL << 10) | (MW_EPWMXBAR27_ADC2_EVT4_SEL << 11) | (MW_EPWMXBAR27_ADC3_EVT1_SEL << 12) | (MW_EPWMXBAR27_ADC3_EVT2_SEL << 13) | (MW_EPWMXBAR27_ADC3_EVT3_SEL << 14) | (MW_EPWMXBAR27_ADC3_EVT4_SEL << 15) | (MW_EPWMXBAR27_ADC4_EVT1_SEL << 16) | (MW_EPWMXBAR27_ADC4_EVT2_SEL << 17) | (MW_EPWMXBAR27_ADC4_EVT3_SEL << 18) | (MW_EPWMXBAR27_ADC4_EVT4_SEL << 19);
    // if(MW_EPWMXBAR27_GPIO0_SEL == 1 | MW_EPWMXBAR27_GPIO1_SEL == 1 | MW_EPWMXBAR27_GPIO2_SEL == 1 | MW_EPWMXBAR27_GPIO3_SEL == 1 | MW_EPWMXBAR27_GPIO4_SEL == 1 | MW_EPWMXBAR27_GPIO5_SEL == 1 | MW_EPWMXBAR27_GPIO6_SEL == 1 | MW_EPWMXBAR27_GPIO7_SEL == 1| MW_EPWMXBAR27_GPIO8_SEL == 1 | MW_EPWMXBAR27_GPIO9_SEL == 1 | MW_EPWMXBAR27_GPIO10_SEL == 1| MW_EPWMXBAR27_GPIO11_SEL == 1| MW_EPWMXBAR27_GPIO12_SEL == 1 | MW_EPWMXBAR27_GPIO13_SEL == 1 | MW_EPWMXBAR27_GPIO14_SEL == 1 | MW_EPWMXBAR27_GPIO15_SEL == 1 | MW_EPWMXBAR27_GPIO16_SEL == 1 | MW_EPWMXBAR27_GPIO17_SEL == 1 | MW_EPWMXBAR27_GPIO18_SEL == 1 | MW_EPWMXBAR27_GPIO19_SEL == 1 | MW_EPWMXBAR27_GPIO20_SEL == 1 | MW_EPWMXBAR27_GPIO21_SEL == 1 | MW_EPWMXBAR27_GPIO22_SEL == 1 | MW_EPWMXBAR27_GPIO23_SEL == 1 | MW_EPWMXBAR27_GPIO24_SEL == 1 | MW_EPWMXBAR27_GPIO25_SEL == 1 | MW_EPWMXBAR27_GPIO26_SEL == 1 | MW_EPWMXBAR27_GPIO27_SEL == 1 | MW_EPWMXBAR27_GPIO28_SEL == 1 | MW_EPWMXBAR27_GPIO29_SEL == 1 | MW_EPWMXBAR27_GPIO30_SEL == 1 | MW_EPWMXBAR27_GPIO31_SEL == 1 | MW_EPWMXBAR27_GPIO32_SEL == 1 | MW_EPWMXBAR27_GPIO33_SEL == 1 | MW_EPWMXBAR27_GPIO34_SEL == 1 | MW_EPWMXBAR27_GPIO35_SEL == 1 | MW_EPWMXBAR27_GPIO36_SEL == 1 | MW_EPWMXBAR27_GPIO37_SEL == 1 | MW_EPWMXBAR27_GPIO38_SEL == 1 | MW_EPWMXBAR27_GPIO39_SEL == 1 | MW_EPWMXBAR27_GPIO40_SEL == 1 | MW_EPWMXBAR27_GPIO41_SEL == 1 | MW_EPWMXBAR27_GPIO42_SEL == 1 | MW_EPWMXBAR27_GPIO43_SEL == 1 | MW_EPWMXBAR27_GPIO44_SEL == 1 | | MW_EPWMXBAR27_GPIO45_SEL == 1 | MW_EPWMXBAR27_GPIO46_SEL == 1 | MW_EPWMXBAR27_GPIO47_SEL == 1| MW_EPWMXBAR27_GPIO48_SEL == 1 | MW_EPWMXBAR27_GPIO49_SEL == 1 | MW_EPWMXBAR27_GPIO50_SEL == 1 | MW_EPWMXBAR27_GPIO51_SEL == 1 | MW_EPWMXBAR27_GPIO52_SEL == 1 | MW_EPWMXBAR27_GPIO53_SEL == 1 | MW_EPWMXBAR27_GPIO54_SEL == 1 | MW_EPWMXBAR27_GPIO55_SEL == 1 | MW_EPWMXBAR27_GPIO56_SEL == 1 | MW_EPWMXBAR27_GPIO57_SEL == 1| MW_EPWMXBAR27_GPIO58_SEL == 1 | MW_EPWMXBAR27_GPIO59_SEL == 1 | MW_EPWMXBAR27_GPIO60_SEL == 1 | MW_EPWMXBAR27_GPIO61_SEL == 1 | MW_EPWMXBAR27_GPIO62_SEL == 1 | MW_EPWMXBAR27_GPIO63_SEL == 1 | MW_EPWMXBAR27_GPIO64_SEL == 1 | | MW_EPWMXBAR27_GPIO59_SEL == 1 | MW_EPWMXBAR27_GPIO60_SEL == 1 | MW_EPWMXBAR27_GPIO61_SEL == 1 | MW_EPWMXBAR27_GPIO62_SEL == 1 | MW_EPWMXBAR27_GPIO63_SEL == 1 | MW_EPWMXBAR27_GPIO64_SEL == 1 | MW_EPWMXBAR27_GPIO65_SEL == 1 | MW_EPWMXBAR27_GPIO66_SEL == 1 | MW_EPWMXBAR27_GPIO67_SEL == 1 | MW_EPWMXBAR27_GPIO68_SEL == 1 | MW_EPWMXBAR27_GPIO69_SEL == 1 | MW_EPWMXBAR27_GPIO70_SEL == 1 | MW_EPWMXBAR27_GPIO71_SEL == 1 | MW_EPWMXBAR27_GPIO72_SEL == 1 | MW_EPWMXBAR27_GPIO73_SEL == 1 | MW_EPWMXBAR27_GPIO74_SEL == 1 | MW_EPWMXBAR27_GPIO75_SEL == 1 | MW_EPWMXBAR27_GPIO76_SEL == 1 | MW_EPWMXBAR27_GPIO77_SEL == 1 | MW_EPWMXBAR27_GPIO78_SEL == 1 | | MW_EPWMXBAR27_GPIO80_SEL == 1 | MW_EPWMXBAR27_GPIO81_SEL == 1 | MW_EPWMXBAR27_GPIO82_SEL == 1 | MW_EPWMXBAR27_GPIO83_SEL == 1 | MW_EPWMXBAR27_GPIO84_SEL == 1 | MW_EPWMXBAR27_GPIO85_SEL == 1 | MW_EPWMXBAR27_GPIO86_SEL == 1 | MW_EPWMXBAR27_GPIO87_SEL == 1 | MW_EPWMXBAR27_GPIO88_SEL == 1 | MW_EPWMXBAR27_GPIO89_SEL == 1 | MW_EPWMXBAR27_GPIO90_SEL == 1 | MW_EPWMXBAR27_GPIO91_SEL == 1 | MW_EPWMXBAR27_GPIO92_SEL == 1 | MW_EPWMXBAR27_GPIO93_SEL == 1 | MW_EPWMXBAR27_GPIO94_SEL == 1 | MW_EPWMXBAR27_GPIO95_SEL == 1 | MW_EPWMXBAR27_GPIO96_SEL == 1 | MW_EPWMXBAR27_GPIO97_SEL == 1 | MW_EPWMXBAR27_GPIO98_SEL == 1 | MW_EPWMXBAR27_GPIO99_SEL == 1 | MW_EPWMXBAR27_GPIO100_SEL == 1 | MW_EPWMXBAR27_GPIO101_SEL == 1 | MW_EPWMXBAR27_GPIO102_SEL == 1 | MW_EPWMXBAR27_GPIO103_SEL == 1 | MW_EPWMXBAR27_GPIO104_SEL == 1 | MW_EPWMXBAR27_GPIO105_SEL == 1 | MW_EPWMXBAR27_GPIO106_SEL == 1 | MW_EPWMXBAR27_GPIO107_SEL == 1 | | MW_EPWMXBAR27_GPIO108_SEL == 1 | MW_EPWMXBAR27_GPIO109_SEL == 1| MW_EPWMXBAR27_GPIO110_SEL == 1 | MW_EPWMXBAR27_GPIO111_SEL == 1 | MW_EPWMXBAR27_GPIO112_SEL == 1 | MW_EPWMXBAR27_GPIO113_SEL == 1 | MW_EPWMXBAR27_GPIO114_SEL == 1 | MW_EPWMXBAR27_GPIO115_SEL == 1 | MW_EPWMXBAR27_GPIO116_SEL == 1 | MW_EPWMXBAR27_GPIO117_SEL == 1 | MW_EPWMXBAR27_GPIO118_SEL == 1 | MW_EPWMXBAR27_GPIO119_SEL == 1 | MW_EPWMXBAR27_GPIO120_SEL == 1 | MW_EPWMXBAR27_GPIO121_SEL == 1 | MW_EPWMXBAR27_GPIO122_SEL == 1 | MW_EPWMXBAR27_GPIO123_SEL == 1 | MW_EPWMXBAR27_GPIO124_SEL == 1 | MW_EPWMXBAR27_GPIO125_SEL == 1 | MW_EPWMXBAR27_GPIO126_SEL == 1 | MW_EPWMXBAR27_GPIO127_SEL == 1 | MW_EPWMXBAR27_GPIO128_SEL == 1 | MW_EPWMXBAR27_GPIO129_SEL == 1 | MW_EPWMXBAR27_GPIO130_SEL == 1 | MW_EPWMXBAR27_GPIO131_SEL == 1 | MW_EPWMXBAR27_GPIO132_SEL == 1 | MW_EPWMXBAR27_GPIO133_SEL == 1 | MW_EPWMXBAR27_GPIO134_SEL == 1 | MW_EPWMXBAR27_GPIO135_SEL == 1 | MW_EPWMXBAR27_GPIO136_SEL == 1 | MW_EPWMXBAR27_GPIO137_SEL == 1 | MW_EPWMXBAR27_GPIO139_SEL == 1 | MW_EPWMXBAR27_GPIO140_SEL == 1 | MW_EPWMXBAR27_GPIO141_SEL == 1 | MW_EPWMXBAR27_GPIO142_SEL == 1 | MW_EPWMXBAR27_GPIO143_SEL == 1 | MW_EPWMXBAR27_ICSSGPO0_PORT0_SEL == 1 | MW_EPWMXBAR27_ICSSGPO1_PORT0_SEL == 1 | MW_EPWMXBAR27_ICSSGPO2_PORT0_SEL == 1 | MW_EPWMXBAR27_ICSSGPO3_PORT0_SEL == 1 | MW_EPWMXBAR27_ICSSGPO4_PORT0_SEL == 1 | MW_EPWMXBAR27_ICSSGPO5_PORT0_SEL == 1 | MW_EPWMXBAR27_ICSSGPO6_PORT0_SEL == 1 | MW_EPWMXBAR27_ICSSGPO7_PORT0_SEL == 1 | MW_EPWMXBAR27_ICSSGPO8_PORT0_SEL == 1 | MW_EPWMXBAR27_ICSSGPO9_PORT0_SEL == 1 | MW_EPWMXBAR27_ICSSGPO10_PORT0_SEL == 1 | MW_EPWMXBAR27_ICSSGPO11_PORT0_SEL == 1 | MW_EPWMXBAR27_ICSSGPO12_PORT0_SEL == 1 | MW_EPWMXBAR27_ICSSGPO13_PORT0_SEL == 1 | MW_EPWMXBAR27_ICSSGPO14_PORT0_SEL == 1 | MW_EPWMXBAR27_ICSSGPO15_PORT0_SEL == 1 | MW_EPWMXBAR27_ICSSGPO0_PORT1_SEL == 1 | MW_EPWMXBAR27_ICSSGPO1_PORT1_SEL == 1 | MW_EPWMXBAR27_ICSSGPO2_PORT1_SEL == 1 | MW_EPWMXBAR27_ICSSGPO3_PORT1_SEL == 1 | MW_EPWMXBAR27_ICSSGPO4_PORT1_SEL == 1 | MW_EPWMXBAR27_ICSSGPO5_PORT1_SEL == 1 | MW_EPWMXBAR27_ICSSGPO6_PORT1_SEL == 1 | MW_EPWMXBAR27_ICSSGPO7_PORT1_SEL == 1 | MW_EPWMXBAR27_ICSSGPO8_PORT1_SEL == 1 | MW_EPWMXBAR27_ICSSGPO9_PORT1_SEL == 1 | MW_EPWMXBAR27_ICSSGPO10_PORT1_SEL == 1 | MW_EPWMXBAR27_ICSSGPO11_PORT1_SEL == 1 | MW_EPWMXBAR27_ICSSGPO12_PORT1_SEL == 1 | MW_EPWMXBAR27_ICSSGPO13_PORT1_SEL == 1 | MW_EPWMXBAR27_ICSSGPO14_PORT1_SEL == 1 | MW_EPWMXBAR27_ICSSGPO15_PORT1_SEL == 1)
    //     group4_epwmxbar[27] = EPWM_XBAR_27;
    // else
        group4_epwmxbar[27] = 0;
    group5_epwmxbar[27] = (MW_EPWMXBAR27_EPWM0_TRIPOUT_SEL << 0) | (MW_EPWMXBAR27_EPWM1_TRIPOUT_SEL << 1) | (MW_EPWMXBAR27_EPWM2_TRIPOUT_SEL << 2) | (MW_EPWMXBAR27_EPWM3_TRIPOUT_SEL << 3) | (MW_EPWMXBAR27_EPWM4_TRIPOUT_SEL << 4) | (MW_EPWMXBAR27_EPWM5_TRIPOUT_SEL << 5) | (MW_EPWMXBAR27_EPWM6_TRIPOUT_SEL << 6) | (MW_EPWMXBAR27_EPWM7_TRIPOUT_SEL << 7) | (MW_EPWMXBAR27_EPWM8_TRIPOUT_SEL << 8) | (MW_EPWMXBAR27_EPWM9_TRIPOUT_SEL << 9) | (MW_EPWMXBAR27_EPWM10_TRIPOUT_SEL << 10) | (MW_EPWMXBAR27_EPWM11_TRIPOUT_SEL << 11) | (MW_EPWMXBAR27_EPWM12_TRIPOUT_SEL << 12) | (MW_EPWMXBAR27_EPWM13_TRIPOUT_SEL << 13) | (MW_EPWMXBAR27_EPWM14_TRIPOUT_SEL << 14) | (MW_EPWMXBAR27_EPWM15_TRIPOUT_SEL << 15) | (MW_EPWMXBAR27_EPWM16_TRIPOUT_SEL << 16) | (MW_EPWMXBAR27_EPWM17_TRIPOUT_SEL << 17) | (MW_EPWMXBAR27_EPWM18_TRIPOUT_SEL << 18) | (MW_EPWMXBAR27_EPWM19_TRIPOUT_SEL << 19) | (MW_EPWMXBAR27_EPWM20_TRIPOUT_SEL << 20) | (MW_EPWMXBAR27_EPWM21_TRIPOUT_SEL << 21) | (MW_EPWMXBAR27_EPWM22_TRIPOUT_SEL << 22) | (MW_EPWMXBAR27_EPWM23_TRIPOUT_SEL << 23) | (MW_EPWMXBAR27_EPWM24_TRIPOUT_SEL << 24) | (MW_EPWMXBAR27_EPWM25_TRIPOUT_SEL << 25) | (MW_EPWMXBAR27_EPWM26_TRIPOUT_SEL << 26) | (MW_EPWMXBAR27_EPWM27_TRIPOUT_SEL << 27) | (MW_EPWMXBAR27_EPWM28_TRIPOUT_SEL << 28) | (MW_EPWMXBAR27_EPWM29_TRIPOUT_SEL << 29) | (MW_EPWMXBAR27_EPWM30_TRIPOUT_SEL << 30) | (MW_EPWMXBAR27_EPWM31_TRIPOUT_SEL << 31);
    group6_epwmxbar[27] = (MW_EPWMXBAR27_DEL0_TRIP_SEL << 0) | (MW_EPWMXBAR27_DEL1_TRIP_SEL << 1) | (MW_EPWMXBAR27_DEL2_TRIP_SEL << 2) | (MW_EPWMXBAR27_DEL3_TRIP_SEL << 3) | (MW_EPWMXBAR27_DEL4_TRIP_SEL << 4) | (MW_EPWMXBAR27_DEL5_TRIP_SEL << 5) | (MW_EPWMXBAR27_DEL6_TRIP_SEL << 6) | (MW_EPWMXBAR27_DEL7_TRIP_SEL << 7) | (MW_EPWMXBAR27_DEL8_TRIP_SEL << 8) | (MW_EPWMXBAR27_DEL9_TRIP_SEL << 9) | (MW_EPWMXBAR27_DEL10_TRIP_SEL << 10) | (MW_EPWMXBAR27_DEL11_TRIP_SEL << 11) | (MW_EPWMXBAR27_DEL12_TRIP_SEL << 12) | (MW_EPWMXBAR27_DEL13_TRIP_SEL << 13) | (MW_EPWMXBAR27_DEL14_TRIP_SEL << 14) | (MW_EPWMXBAR27_DEL15_TRIP_SEL << 15) | (MW_EPWMXBAR27_DEL16_TRIP_SEL << 16) | (MW_EPWMXBAR27_DEL17_TRIP_SEL << 17) | (MW_EPWMXBAR27_DEL18_TRIP_SEL << 18) | (MW_EPWMXBAR27_DEL19_TRIP_SEL << 19) | (MW_EPWMXBAR27_DEL20_TRIP_SEL << 20) | (MW_EPWMXBAR27_DEL21_TRIP_SEL << 21) | (MW_EPWMXBAR27_DEL22_TRIP_SEL << 22) | (MW_EPWMXBAR27_DEL23_TRIP_SEL << 23) | (MW_EPWMXBAR27_DEL24_TRIP_SEL << 24) | (MW_EPWMXBAR27_DEL25_TRIP_SEL << 25) | (MW_EPWMXBAR27_DEL26_TRIP_SEL << 26) | (MW_EPWMXBAR27_DEL27_TRIP_SEL << 27) | (MW_EPWMXBAR27_DEL28_TRIP_SEL << 28) | (MW_EPWMXBAR27_DEL29_TRIP_SEL << 29) | (MW_EPWMXBAR27_DEL30_TRIP_SEL << 30) | (MW_EPWMXBAR27_DEL31_TRIP_SEL << 31);
    group7_epwmxbar[27] = (MW_EPWMXBAR27_DEL0_ACTIVE_SEL << 0) | (MW_EPWMXBAR27_DEL1_ACTIVE_SEL << 1) | (MW_EPWMXBAR27_DEL2_ACTIVE_SEL << 2) | (MW_EPWMXBAR27_DEL3_ACTIVE_SEL << 3) | (MW_EPWMXBAR27_DEL4_ACTIVE_SEL << 4) | (MW_EPWMXBAR27_DEL5_ACTIVE_SEL << 5) | (MW_EPWMXBAR27_DEL6_ACTIVE_SEL << 6) | (MW_EPWMXBAR27_DEL7_ACTIVE_SEL << 7) | (MW_EPWMXBAR27_DEL8_ACTIVE_SEL << 8) | (MW_EPWMXBAR27_DEL9_ACTIVE_SEL << 9) | (MW_EPWMXBAR27_DEL10_ACTIVE_SEL << 10) | (MW_EPWMXBAR27_DEL11_ACTIVE_SEL << 11) | (MW_EPWMXBAR27_DEL12_ACTIVE_SEL << 12) | (MW_EPWMXBAR27_DEL13_ACTIVE_SEL << 13) | (MW_EPWMXBAR27_DEL14_ACTIVE_SEL << 14) | (MW_EPWMXBAR27_DEL15_ACTIVE_SEL << 15) | (MW_EPWMXBAR27_DEL16_ACTIVE_SEL << 16) | (MW_EPWMXBAR27_DEL17_ACTIVE_SEL << 17) | (MW_EPWMXBAR27_DEL18_ACTIVE_SEL << 18) | (MW_EPWMXBAR27_DEL19_ACTIVE_SEL << 19) | (MW_EPWMXBAR27_DEL20_ACTIVE_SEL << 20) | (MW_EPWMXBAR27_DEL21_ACTIVE_SEL << 21) | (MW_EPWMXBAR27_DEL22_ACTIVE_SEL << 22) | (MW_EPWMXBAR27_DEL23_ACTIVE_SEL << 23) | (MW_EPWMXBAR27_DEL24_ACTIVE_SEL << 24) | (MW_EPWMXBAR27_DEL25_ACTIVE_SEL << 25) | (MW_EPWMXBAR27_DEL26_ACTIVE_SEL << 26) | (MW_EPWMXBAR27_DEL27_ACTIVE_SEL << 27) | (MW_EPWMXBAR27_DEL28_ACTIVE_SEL << 28) | (MW_EPWMXBAR27_DEL29_ACTIVE_SEL << 29) | (MW_EPWMXBAR27_DEL30_ACTIVE_SEL << 30) | (MW_EPWMXBAR27_DEL31_ACTIVE_SEL << 31);
    group8_epwmxbar[27] = (MW_EPWMXBAR27_EQEP0_ERR_SEL << 0) | (MW_EPWMXBAR27_EQEP1_ERR_SEL << 1) | (MW_EPWMXBAR27_EQEP2_ERR_SEL << 2) | (MW_EPWMXBAR27_FSIRX0_RX_TRIG0_SEL << 3) | (MW_EPWMXBAR27_FSIRX0_RX_TRIG1_SEL << 4) | (MW_EPWMXBAR27_FSIRX0_RX_TRIG2_SEL << 5) | (MW_EPWMXBAR27_FSIRX0_RX_TRIG3_SEL << 6) | (MW_EPWMXBAR27_FSIRX1_RX_TRIG0_SEL << 7) | (MW_EPWMXBAR27_FSIRX1_RX_TRIG1_SEL << 8) | (MW_EPWMXBAR27_FSIRX1_RX_TRIG2_SEL << 9) | (MW_EPWMXBAR27_FSIRX1_RX_TRIG3_SEL << 10) | (MW_EPWMXBAR27_FSIRX2_RX_TRIG0_SEL << 11) | (MW_EPWMXBAR27_FSIRX2_RX_TRIG1_SEL << 12) | (MW_EPWMXBAR27_FSIRX2_RX_TRIG2_SEL << 13) | (MW_EPWMXBAR27_FSIRX2_RX_TRIG3_SEL << 14) | (MW_EPWMXBAR27_FSIRX3_RX_TRIG0_SEL << 15) | (MW_EPWMXBAR27_FSIRX3_RX_TRIG1_SEL << 16) | (MW_EPWMXBAR27_FSIRX3_RX_TRIG2_SEL << 17) | (MW_EPWMXBAR27_FSIRX3_RX_TRIG3_SEL << 18) | (MW_EPWMXBAR27_ECAP0_TRIPOUT_SEL << 19) | (MW_EPWMXBAR27_ECAP1_TRIPOUT_SEL << 20) | (MW_EPWMXBAR27_ECAP2_TRIPOUT_SEL << 21) | (MW_EPWMXBAR27_ECAP3_TRIPOUT_SEL << 22) | (MW_EPWMXBAR27_ECAP4_TRIPOUT_SEL << 23) | (MW_EPWMXBAR27_ECAP5_TRIPOUT_SEL << 24) | (MW_EPWMXBAR27_ECAP6_TRIPOUT_SEL << 25) | (MW_EPWMXBAR27_ECAP7_TRIPOUT_SEL << 26) | (MW_EPWMXBAR27_ECAP8_TRIPOUT_SEL << 27) | (MW_EPWMXBAR27_ECAP9_TRIPOUT_SEL << 28);
    group0_epwmxbar[28] = (MW_EPWMXBAR28_CMPSSA0_CTRIPL_SEL << 0) | (MW_EPWMXBAR28_CMPSSA0_CTRIPH_SEL << 1) | (MW_EPWMXBAR28_CMPSSA1_CTRIPL_SEL << 2) | (MW_EPWMXBAR28_CMPSSA1_CTRIPH_SEL << 3) | (MW_EPWMXBAR28_CMPSSA2_CTRIPL_SEL << 4) | (MW_EPWMXBAR28_CMPSSA2_CTRIPH_SEL << 5) | (MW_EPWMXBAR28_CMPSSA3_CTRIPL_SEL << 6) | (MW_EPWMXBAR28_CMPSSA3_CTRIPH_SEL << 7) | (MW_EPWMXBAR28_CMPSSA4_CTRIPL_SEL << 8) | (MW_EPWMXBAR28_CMPSSA4_CTRIPH_SEL << 9) | (MW_EPWMXBAR28_CMPSSA5_CTRIPL_SEL << 10) | (MW_EPWMXBAR28_CMPSSA5_CTRIPH_SEL << 11) | (MW_EPWMXBAR28_CMPSSA6_CTRIPL_SEL << 12) | (MW_EPWMXBAR28_CMPSSA6_CTRIPH_SEL << 13) | (MW_EPWMXBAR28_CMPSSA7_CTRIPL_SEL << 14) | (MW_EPWMXBAR28_CMPSSA7_CTRIPH_SEL << 15) | (MW_EPWMXBAR28_CMPSSA8_CTRIPL_SEL << 16) | (MW_EPWMXBAR28_CMPSSA8_CTRIPH_SEL << 17) | (MW_EPWMXBAR28_CMPSSA9_CTRIPL_SEL << 18) | (MW_EPWMXBAR28_CMPSSA9_CTRIPH_SEL << 19);
    group1_epwmxbar[28] = (MW_EPWMXBAR28_CMPSSB0_CTRIPL_SEL << 0) | (MW_EPWMXBAR28_CMPSSB0_CTRIPH_SEL << 1) | (MW_EPWMXBAR28_CMPSSB1_CTRIPL_SEL << 2) | (MW_EPWMXBAR28_CMPSSB1_CTRIPH_SEL << 3) | (MW_EPWMXBAR28_CMPSSB2_CTRIPL_SEL << 4) | (MW_EPWMXBAR28_CMPSSB2_CTRIPH_SEL << 5) | (MW_EPWMXBAR28_CMPSSB3_CTRIPL_SEL << 6) | (MW_EPWMXBAR28_CMPSSB3_CTRIPH_SEL << 7) | (MW_EPWMXBAR28_CMPSSB4_CTRIPL_SEL << 8) | (MW_EPWMXBAR28_CMPSSB4_CTRIPH_SEL << 9) | (MW_EPWMXBAR28_CMPSSB5_CTRIPL_SEL << 10) | (MW_EPWMXBAR28_CMPSSB5_CTRIPH_SEL << 11) | (MW_EPWMXBAR28_CMPSSB6_CTRIPL_SEL << 12) | (MW_EPWMXBAR28_CMPSSB6_CTRIPH_SEL << 13) | (MW_EPWMXBAR28_CMPSSB7_CTRIPL_SEL << 14) | (MW_EPWMXBAR28_CMPSSB7_CTRIPH_SEL << 15) | (MW_EPWMXBAR28_CMPSSB8_CTRIPL_SEL << 16) | (MW_EPWMXBAR28_CMPSSB8_CTRIPH_SEL << 17) | (MW_EPWMXBAR28_CMPSSB9_CTRIPL_SEL << 18) | (MW_EPWMXBAR28_CMPSSB9_CTRIPH_SEL << 19);
    group2_epwmxbar[28] = (MW_EPWMXBAR28_SD0_FILT0_CEVT1_SEL << 0) | (MW_EPWMXBAR28_SD0_FILT0_CEVT2_SEL << 1) | (MW_EPWMXBAR28_SD0_FILT0_CMPHZ_SEL << 2) | (MW_EPWMXBAR28_SD0_FILT1_CEVT1_SEL << 3) | (MW_EPWMXBAR28_SD0_FILT1_CEVT2_SEL << 4) | (MW_EPWMXBAR28_SD0_FILT1_CMPHZ_SEL << 5) | (MW_EPWMXBAR28_SD0_FILT2_CEVT1_SEL << 6) | (MW_EPWMXBAR28_SD0_FILT2_CEVT2_SEL << 7) | (MW_EPWMXBAR28_SD0_FILT2_CMPHZ_SEL << 8) | (MW_EPWMXBAR28_SD0_FILT3_CEVT1_SEL << 9) | (MW_EPWMXBAR28_SD0_FILT3_CEVT2_SEL << 10) | (MW_EPWMXBAR28_SD0_FILT3_CMPHZ_SEL << 11) | (MW_EPWMXBAR28_SD1_FILT0_CEVT1_SEL << 12) | (MW_EPWMXBAR28_SD1_FILT0_CEVT2_SEL << 13) | (MW_EPWMXBAR28_SD1_FILT0_CMPHZ_SEL << 14) | (MW_EPWMXBAR28_SD1_FILT1_CEVT1_SEL << 15) | (MW_EPWMXBAR28_SD1_FILT1_CEVT2_SEL << 16) | (MW_EPWMXBAR28_SD1_FILT1_CMPHZ_SEL << 17) | (MW_EPWMXBAR28_SD1_FILT2_CEVT1_SEL << 18) | (MW_EPWMXBAR28_SD1_FILT2_CEVT2_SEL << 19) | (MW_EPWMXBAR28_SD1_FILT2_CMPHZ_SEL << 20) | (MW_EPWMXBAR28_SD1_FILT3_CEVT1_SEL << 21) | (MW_EPWMXBAR28_SD1_FILT3_CEVT2_SEL << 22) | (MW_EPWMXBAR28_SD1_FILT3_CMPHZ_SEL << 23);
    group3_epwmxbar[28] = (MW_EPWMXBAR28_ADC0_EVT1_SEL << 0) | (MW_EPWMXBAR28_ADC0_EVT2_SEL << 1) | (MW_EPWMXBAR28_ADC0_EVT3_SEL << 2) | (MW_EPWMXBAR28_ADC0_EVT4_SEL << 3) | (MW_EPWMXBAR28_ADC1_EVT1_SEL << 4) | (MW_EPWMXBAR28_ADC1_EVT2_SEL << 5) | (MW_EPWMXBAR28_ADC1_EVT3_SEL << 6) | (MW_EPWMXBAR28_ADC1_EVT4_SEL << 7) | (MW_EPWMXBAR28_ADC2_EVT1_SEL << 8) | (MW_EPWMXBAR28_ADC2_EVT2_SEL << 9) | (MW_EPWMXBAR28_ADC2_EVT3_SEL << 10) | (MW_EPWMXBAR28_ADC2_EVT4_SEL << 11) | (MW_EPWMXBAR28_ADC3_EVT1_SEL << 12) | (MW_EPWMXBAR28_ADC3_EVT2_SEL << 13) | (MW_EPWMXBAR28_ADC3_EVT3_SEL << 14) | (MW_EPWMXBAR28_ADC3_EVT4_SEL << 15) | (MW_EPWMXBAR28_ADC4_EVT1_SEL << 16) | (MW_EPWMXBAR28_ADC4_EVT2_SEL << 17) | (MW_EPWMXBAR28_ADC4_EVT3_SEL << 18) | (MW_EPWMXBAR28_ADC4_EVT4_SEL << 19);
