TexasInstruments/am26x-hsp/src/am263px_init.c
    // if(MW_EPWMXBAR28_GPIO0_SEL == 1 | MW_EPWMXBAR28_GPIO1_SEL == 1 | MW_EPWMXBAR28_GPIO2_SEL == 1 | MW_EPWMXBAR28_GPIO3_SEL == 1 | MW_EPWMXBAR28_GPIO4_SEL == 1 | MW_EPWMXBAR28_GPIO5_SEL == 1 | MW_EPWMXBAR28_GPIO6_SEL == 1 | MW_EPWMXBAR28_GPIO7_SEL == 1| MW_EPWMXBAR28_GPIO8_SEL == 1 | MW_EPWMXBAR28_GPIO9_SEL == 1 | MW_EPWMXBAR28_GPIO10_SEL == 1| MW_EPWMXBAR28_GPIO11_SEL == 1| MW_EPWMXBAR28_GPIO12_SEL == 1 | MW_EPWMXBAR28_GPIO13_SEL == 1 | MW_EPWMXBAR28_GPIO14_SEL == 1 | MW_EPWMXBAR28_GPIO15_SEL == 1 | MW_EPWMXBAR28_GPIO16_SEL == 1 | MW_EPWMXBAR28_GPIO17_SEL == 1 | MW_EPWMXBAR28_GPIO18_SEL == 1 | MW_EPWMXBAR28_GPIO19_SEL == 1 | MW_EPWMXBAR28_GPIO20_SEL == 1 | MW_EPWMXBAR28_GPIO21_SEL == 1 | MW_EPWMXBAR28_GPIO22_SEL == 1 | MW_EPWMXBAR28_GPIO23_SEL == 1 | MW_EPWMXBAR28_GPIO24_SEL == 1 | MW_EPWMXBAR28_GPIO25_SEL == 1 | MW_EPWMXBAR28_GPIO26_SEL == 1 | MW_EPWMXBAR28_GPIO27_SEL == 1 | MW_EPWMXBAR28_GPIO28_SEL == 1 | MW_EPWMXBAR28_GPIO29_SEL == 1 | MW_EPWMXBAR28_GPIO30_SEL == 1 | MW_EPWMXBAR28_GPIO31_SEL == 1 | MW_EPWMXBAR28_GPIO32_SEL == 1 | MW_EPWMXBAR28_GPIO33_SEL == 1 | MW_EPWMXBAR28_GPIO34_SEL == 1 | MW_EPWMXBAR28_GPIO35_SEL == 1 | MW_EPWMXBAR28_GPIO36_SEL == 1 | MW_EPWMXBAR28_GPIO37_SEL == 1 | MW_EPWMXBAR28_GPIO38_SEL == 1 | MW_EPWMXBAR28_GPIO39_SEL == 1 | MW_EPWMXBAR28_GPIO40_SEL == 1 | MW_EPWMXBAR28_GPIO41_SEL == 1 | MW_EPWMXBAR28_GPIO42_SEL == 1 | MW_EPWMXBAR28_GPIO43_SEL == 1 | MW_EPWMXBAR28_GPIO44_SEL == 1 | | MW_EPWMXBAR28_GPIO45_SEL == 1 | MW_EPWMXBAR28_GPIO46_SEL == 1 | MW_EPWMXBAR28_GPIO47_SEL == 1| MW_EPWMXBAR28_GPIO48_SEL == 1 | MW_EPWMXBAR28_GPIO49_SEL == 1 | MW_EPWMXBAR28_GPIO50_SEL == 1 | MW_EPWMXBAR28_GPIO51_SEL == 1 | MW_EPWMXBAR28_GPIO52_SEL == 1 | MW_EPWMXBAR28_GPIO53_SEL == 1 | MW_EPWMXBAR28_GPIO54_SEL == 1 | MW_EPWMXBAR28_GPIO55_SEL == 1 | MW_EPWMXBAR28_GPIO56_SEL == 1 | MW_EPWMXBAR28_GPIO57_SEL == 1| MW_EPWMXBAR28_GPIO58_SEL == 1 | MW_EPWMXBAR28_GPIO59_SEL == 1 | MW_EPWMXBAR28_GPIO60_SEL == 1 | MW_EPWMXBAR28_GPIO61_SEL == 1 | MW_EPWMXBAR28_GPIO62_SEL == 1 | MW_EPWMXBAR28_GPIO63_SEL == 1 | MW_EPWMXBAR28_GPIO64_SEL == 1 | | MW_EPWMXBAR28_GPIO59_SEL == 1 | MW_EPWMXBAR28_GPIO60_SEL == 1 | MW_EPWMXBAR28_GPIO61_SEL == 1 | MW_EPWMXBAR28_GPIO62_SEL == 1 | MW_EPWMXBAR28_GPIO63_SEL == 1 | MW_EPWMXBAR28_GPIO64_SEL == 1 | MW_EPWMXBAR28_GPIO65_SEL == 1 | MW_EPWMXBAR28_GPIO66_SEL == 1 | MW_EPWMXBAR28_GPIO67_SEL == 1 | MW_EPWMXBAR28_GPIO68_SEL == 1 | MW_EPWMXBAR28_GPIO69_SEL == 1 | MW_EPWMXBAR28_GPIO70_SEL == 1 | MW_EPWMXBAR28_GPIO71_SEL == 1 | MW_EPWMXBAR28_GPIO72_SEL == 1 | MW_EPWMXBAR28_GPIO73_SEL == 1 | MW_EPWMXBAR28_GPIO74_SEL == 1 | MW_EPWMXBAR28_GPIO75_SEL == 1 | MW_EPWMXBAR28_GPIO76_SEL == 1 | MW_EPWMXBAR28_GPIO77_SEL == 1 | MW_EPWMXBAR28_GPIO78_SEL == 1 | | MW_EPWMXBAR28_GPIO80_SEL == 1 | MW_EPWMXBAR28_GPIO81_SEL == 1 | MW_EPWMXBAR28_GPIO82_SEL == 1 | MW_EPWMXBAR28_GPIO83_SEL == 1 | MW_EPWMXBAR28_GPIO84_SEL == 1 | MW_EPWMXBAR28_GPIO85_SEL == 1 | MW_EPWMXBAR28_GPIO86_SEL == 1 | MW_EPWMXBAR28_GPIO87_SEL == 1 | MW_EPWMXBAR28_GPIO88_SEL == 1 | MW_EPWMXBAR28_GPIO89_SEL == 1 | MW_EPWMXBAR28_GPIO90_SEL == 1 | MW_EPWMXBAR28_GPIO91_SEL == 1 | MW_EPWMXBAR28_GPIO92_SEL == 1 | MW_EPWMXBAR28_GPIO93_SEL == 1 | MW_EPWMXBAR28_GPIO94_SEL == 1 | MW_EPWMXBAR28_GPIO95_SEL == 1 | MW_EPWMXBAR28_GPIO96_SEL == 1 | MW_EPWMXBAR28_GPIO97_SEL == 1 | MW_EPWMXBAR28_GPIO98_SEL == 1 | MW_EPWMXBAR28_GPIO99_SEL == 1 | MW_EPWMXBAR28_GPIO100_SEL == 1 | MW_EPWMXBAR28_GPIO101_SEL == 1 | MW_EPWMXBAR28_GPIO102_SEL == 1 | MW_EPWMXBAR28_GPIO103_SEL == 1 | MW_EPWMXBAR28_GPIO104_SEL == 1 | MW_EPWMXBAR28_GPIO105_SEL == 1 | MW_EPWMXBAR28_GPIO106_SEL == 1 | MW_EPWMXBAR28_GPIO107_SEL == 1 | | MW_EPWMXBAR28_GPIO108_SEL == 1 | MW_EPWMXBAR28_GPIO109_SEL == 1| MW_EPWMXBAR28_GPIO110_SEL == 1 | MW_EPWMXBAR28_GPIO111_SEL == 1 | MW_EPWMXBAR28_GPIO112_SEL == 1 | MW_EPWMXBAR28_GPIO113_SEL == 1 | MW_EPWMXBAR28_GPIO114_SEL == 1 | MW_EPWMXBAR28_GPIO115_SEL == 1 | MW_EPWMXBAR28_GPIO116_SEL == 1 | MW_EPWMXBAR28_GPIO117_SEL == 1 | MW_EPWMXBAR28_GPIO118_SEL == 1 | MW_EPWMXBAR28_GPIO119_SEL == 1 | MW_EPWMXBAR28_GPIO120_SEL == 1 | MW_EPWMXBAR28_GPIO121_SEL == 1 | MW_EPWMXBAR28_GPIO122_SEL == 1 | MW_EPWMXBAR28_GPIO123_SEL == 1 | MW_EPWMXBAR28_GPIO124_SEL == 1 | MW_EPWMXBAR28_GPIO125_SEL == 1 | MW_EPWMXBAR28_GPIO126_SEL == 1 | MW_EPWMXBAR28_GPIO127_SEL == 1 | MW_EPWMXBAR28_GPIO128_SEL == 1 | MW_EPWMXBAR28_GPIO129_SEL == 1 | MW_EPWMXBAR28_GPIO130_SEL == 1 | MW_EPWMXBAR28_GPIO131_SEL == 1 | MW_EPWMXBAR28_GPIO132_SEL == 1 | MW_EPWMXBAR28_GPIO133_SEL == 1 | MW_EPWMXBAR28_GPIO134_SEL == 1 | MW_EPWMXBAR28_GPIO135_SEL == 1 | MW_EPWMXBAR28_GPIO136_SEL == 1 | MW_EPWMXBAR28_GPIO137_SEL == 1 | MW_EPWMXBAR28_GPIO139_SEL == 1 | MW_EPWMXBAR28_GPIO140_SEL == 1 | MW_EPWMXBAR28_GPIO141_SEL == 1 | MW_EPWMXBAR28_GPIO142_SEL == 1 | MW_EPWMXBAR28_GPIO143_SEL == 1 | MW_EPWMXBAR28_ICSSGPO0_PORT0_SEL == 1 | MW_EPWMXBAR28_ICSSGPO1_PORT0_SEL == 1 | MW_EPWMXBAR28_ICSSGPO2_PORT0_SEL == 1 | MW_EPWMXBAR28_ICSSGPO3_PORT0_SEL == 1 | MW_EPWMXBAR28_ICSSGPO4_PORT0_SEL == 1 | MW_EPWMXBAR28_ICSSGPO5_PORT0_SEL == 1 | MW_EPWMXBAR28_ICSSGPO6_PORT0_SEL == 1 | MW_EPWMXBAR28_ICSSGPO7_PORT0_SEL == 1 | MW_EPWMXBAR28_ICSSGPO8_PORT0_SEL == 1 | MW_EPWMXBAR28_ICSSGPO9_PORT0_SEL == 1 | MW_EPWMXBAR28_ICSSGPO10_PORT0_SEL == 1 | MW_EPWMXBAR28_ICSSGPO11_PORT0_SEL == 1 | MW_EPWMXBAR28_ICSSGPO12_PORT0_SEL == 1 | MW_EPWMXBAR28_ICSSGPO13_PORT0_SEL == 1 | MW_EPWMXBAR28_ICSSGPO14_PORT0_SEL == 1 | MW_EPWMXBAR28_ICSSGPO15_PORT0_SEL == 1 | MW_EPWMXBAR28_ICSSGPO0_PORT1_SEL == 1 | MW_EPWMXBAR28_ICSSGPO1_PORT1_SEL == 1 | MW_EPWMXBAR28_ICSSGPO2_PORT1_SEL == 1 | MW_EPWMXBAR28_ICSSGPO3_PORT1_SEL == 1 | MW_EPWMXBAR28_ICSSGPO4_PORT1_SEL == 1 | MW_EPWMXBAR28_ICSSGPO5_PORT1_SEL == 1 | MW_EPWMXBAR28_ICSSGPO6_PORT1_SEL == 1 | MW_EPWMXBAR28_ICSSGPO7_PORT1_SEL == 1 | MW_EPWMXBAR28_ICSSGPO8_PORT1_SEL == 1 | MW_EPWMXBAR28_ICSSGPO9_PORT1_SEL == 1 | MW_EPWMXBAR28_ICSSGPO10_PORT1_SEL == 1 | MW_EPWMXBAR28_ICSSGPO11_PORT1_SEL == 1 | MW_EPWMXBAR28_ICSSGPO12_PORT1_SEL == 1 | MW_EPWMXBAR28_ICSSGPO13_PORT1_SEL == 1 | MW_EPWMXBAR28_ICSSGPO14_PORT1_SEL == 1 | MW_EPWMXBAR28_ICSSGPO15_PORT1_SEL == 1)
    //     group4_epwmxbar[28] = EPWM_XBAR_28;
    // else
        group4_epwmxbar[28] = 0;
    group5_epwmxbar[28] = (MW_EPWMXBAR28_EPWM0_TRIPOUT_SEL << 0) | (MW_EPWMXBAR28_EPWM1_TRIPOUT_SEL << 1) | (MW_EPWMXBAR28_EPWM2_TRIPOUT_SEL << 2) | (MW_EPWMXBAR28_EPWM3_TRIPOUT_SEL << 3) | (MW_EPWMXBAR28_EPWM4_TRIPOUT_SEL << 4) | (MW_EPWMXBAR28_EPWM5_TRIPOUT_SEL << 5) | (MW_EPWMXBAR28_EPWM6_TRIPOUT_SEL << 6) | (MW_EPWMXBAR28_EPWM7_TRIPOUT_SEL << 7) | (MW_EPWMXBAR28_EPWM8_TRIPOUT_SEL << 8) | (MW_EPWMXBAR28_EPWM9_TRIPOUT_SEL << 9) | (MW_EPWMXBAR28_EPWM10_TRIPOUT_SEL << 10) | (MW_EPWMXBAR28_EPWM11_TRIPOUT_SEL << 11) | (MW_EPWMXBAR28_EPWM12_TRIPOUT_SEL << 12) | (MW_EPWMXBAR28_EPWM13_TRIPOUT_SEL << 13) | (MW_EPWMXBAR28_EPWM14_TRIPOUT_SEL << 14) | (MW_EPWMXBAR28_EPWM15_TRIPOUT_SEL << 15) | (MW_EPWMXBAR28_EPWM16_TRIPOUT_SEL << 16) | (MW_EPWMXBAR28_EPWM17_TRIPOUT_SEL << 17) | (MW_EPWMXBAR28_EPWM18_TRIPOUT_SEL << 18) | (MW_EPWMXBAR28_EPWM19_TRIPOUT_SEL << 19) | (MW_EPWMXBAR28_EPWM20_TRIPOUT_SEL << 20) | (MW_EPWMXBAR28_EPWM21_TRIPOUT_SEL << 21) | (MW_EPWMXBAR28_EPWM22_TRIPOUT_SEL << 22) | (MW_EPWMXBAR28_EPWM23_TRIPOUT_SEL << 23) | (MW_EPWMXBAR28_EPWM24_TRIPOUT_SEL << 24) | (MW_EPWMXBAR28_EPWM25_TRIPOUT_SEL << 25) | (MW_EPWMXBAR28_EPWM26_TRIPOUT_SEL << 26) | (MW_EPWMXBAR28_EPWM27_TRIPOUT_SEL << 27) | (MW_EPWMXBAR28_EPWM28_TRIPOUT_SEL << 28) | (MW_EPWMXBAR28_EPWM29_TRIPOUT_SEL << 29) | (MW_EPWMXBAR28_EPWM30_TRIPOUT_SEL << 30) | (MW_EPWMXBAR28_EPWM31_TRIPOUT_SEL << 31);
    group6_epwmxbar[28] = (MW_EPWMXBAR28_DEL0_TRIP_SEL << 0) | (MW_EPWMXBAR28_DEL1_TRIP_SEL << 1) | (MW_EPWMXBAR28_DEL2_TRIP_SEL << 2) | (MW_EPWMXBAR28_DEL3_TRIP_SEL << 3) | (MW_EPWMXBAR28_DEL4_TRIP_SEL << 4) | (MW_EPWMXBAR28_DEL5_TRIP_SEL << 5) | (MW_EPWMXBAR28_DEL6_TRIP_SEL << 6) | (MW_EPWMXBAR28_DEL7_TRIP_SEL << 7) | (MW_EPWMXBAR28_DEL8_TRIP_SEL << 8) | (MW_EPWMXBAR28_DEL9_TRIP_SEL << 9) | (MW_EPWMXBAR28_DEL10_TRIP_SEL << 10) | (MW_EPWMXBAR28_DEL11_TRIP_SEL << 11) | (MW_EPWMXBAR28_DEL12_TRIP_SEL << 12) | (MW_EPWMXBAR28_DEL13_TRIP_SEL << 13) | (MW_EPWMXBAR28_DEL14_TRIP_SEL << 14) | (MW_EPWMXBAR28_DEL15_TRIP_SEL << 15) | (MW_EPWMXBAR28_DEL16_TRIP_SEL << 16) | (MW_EPWMXBAR28_DEL17_TRIP_SEL << 17) | (MW_EPWMXBAR28_DEL18_TRIP_SEL << 18) | (MW_EPWMXBAR28_DEL19_TRIP_SEL << 19) | (MW_EPWMXBAR28_DEL20_TRIP_SEL << 20) | (MW_EPWMXBAR28_DEL21_TRIP_SEL << 21) | (MW_EPWMXBAR28_DEL22_TRIP_SEL << 22) | (MW_EPWMXBAR28_DEL23_TRIP_SEL << 23) | (MW_EPWMXBAR28_DEL24_TRIP_SEL << 24) | (MW_EPWMXBAR28_DEL25_TRIP_SEL << 25) | (MW_EPWMXBAR28_DEL26_TRIP_SEL << 26) | (MW_EPWMXBAR28_DEL27_TRIP_SEL << 27) | (MW_EPWMXBAR28_DEL28_TRIP_SEL << 28) | (MW_EPWMXBAR28_DEL29_TRIP_SEL << 29) | (MW_EPWMXBAR28_DEL30_TRIP_SEL << 30) | (MW_EPWMXBAR28_DEL31_TRIP_SEL << 31);
    group7_epwmxbar[28] = (MW_EPWMXBAR28_DEL0_ACTIVE_SEL << 0) | (MW_EPWMXBAR28_DEL1_ACTIVE_SEL << 1) | (MW_EPWMXBAR28_DEL2_ACTIVE_SEL << 2) | (MW_EPWMXBAR28_DEL3_ACTIVE_SEL << 3) | (MW_EPWMXBAR28_DEL4_ACTIVE_SEL << 4) | (MW_EPWMXBAR28_DEL5_ACTIVE_SEL << 5) | (MW_EPWMXBAR28_DEL6_ACTIVE_SEL << 6) | (MW_EPWMXBAR28_DEL7_ACTIVE_SEL << 7) | (MW_EPWMXBAR28_DEL8_ACTIVE_SEL << 8) | (MW_EPWMXBAR28_DEL9_ACTIVE_SEL << 9) | (MW_EPWMXBAR28_DEL10_ACTIVE_SEL << 10) | (MW_EPWMXBAR28_DEL11_ACTIVE_SEL << 11) | (MW_EPWMXBAR28_DEL12_ACTIVE_SEL << 12) | (MW_EPWMXBAR28_DEL13_ACTIVE_SEL << 13) | (MW_EPWMXBAR28_DEL14_ACTIVE_SEL << 14) | (MW_EPWMXBAR28_DEL15_ACTIVE_SEL << 15) | (MW_EPWMXBAR28_DEL16_ACTIVE_SEL << 16) | (MW_EPWMXBAR28_DEL17_ACTIVE_SEL << 17) | (MW_EPWMXBAR28_DEL18_ACTIVE_SEL << 18) | (MW_EPWMXBAR28_DEL19_ACTIVE_SEL << 19) | (MW_EPWMXBAR28_DEL20_ACTIVE_SEL << 20) | (MW_EPWMXBAR28_DEL21_ACTIVE_SEL << 21) | (MW_EPWMXBAR28_DEL22_ACTIVE_SEL << 22) | (MW_EPWMXBAR28_DEL23_ACTIVE_SEL << 23) | (MW_EPWMXBAR28_DEL24_ACTIVE_SEL << 24) | (MW_EPWMXBAR28_DEL25_ACTIVE_SEL << 25) | (MW_EPWMXBAR28_DEL26_ACTIVE_SEL << 26) | (MW_EPWMXBAR28_DEL27_ACTIVE_SEL << 27) | (MW_EPWMXBAR28_DEL28_ACTIVE_SEL << 28) | (MW_EPWMXBAR28_DEL29_ACTIVE_SEL << 29) | (MW_EPWMXBAR28_DEL30_ACTIVE_SEL << 30) | (MW_EPWMXBAR28_DEL31_ACTIVE_SEL << 31);
    group8_epwmxbar[28] = (MW_EPWMXBAR28_EQEP0_ERR_SEL << 0) | (MW_EPWMXBAR28_EQEP1_ERR_SEL << 1) | (MW_EPWMXBAR28_EQEP2_ERR_SEL << 2) | (MW_EPWMXBAR28_FSIRX0_RX_TRIG0_SEL << 3) | (MW_EPWMXBAR28_FSIRX0_RX_TRIG1_SEL << 4) | (MW_EPWMXBAR28_FSIRX0_RX_TRIG2_SEL << 5) | (MW_EPWMXBAR28_FSIRX0_RX_TRIG3_SEL << 6) | (MW_EPWMXBAR28_FSIRX1_RX_TRIG0_SEL << 7) | (MW_EPWMXBAR28_FSIRX1_RX_TRIG1_SEL << 8) | (MW_EPWMXBAR28_FSIRX1_RX_TRIG2_SEL << 9) | (MW_EPWMXBAR28_FSIRX1_RX_TRIG3_SEL << 10) | (MW_EPWMXBAR28_FSIRX2_RX_TRIG0_SEL << 11) | (MW_EPWMXBAR28_FSIRX2_RX_TRIG1_SEL << 12) | (MW_EPWMXBAR28_FSIRX2_RX_TRIG2_SEL << 13) | (MW_EPWMXBAR28_FSIRX2_RX_TRIG3_SEL << 14) | (MW_EPWMXBAR28_FSIRX3_RX_TRIG0_SEL << 15) | (MW_EPWMXBAR28_FSIRX3_RX_TRIG1_SEL << 16) | (MW_EPWMXBAR28_FSIRX3_RX_TRIG2_SEL << 17) | (MW_EPWMXBAR28_FSIRX3_RX_TRIG3_SEL << 18) | (MW_EPWMXBAR28_ECAP0_TRIPOUT_SEL << 19) | (MW_EPWMXBAR28_ECAP1_TRIPOUT_SEL << 20) | (MW_EPWMXBAR28_ECAP2_TRIPOUT_SEL << 21) | (MW_EPWMXBAR28_ECAP3_TRIPOUT_SEL << 22) | (MW_EPWMXBAR28_ECAP4_TRIPOUT_SEL << 23) | (MW_EPWMXBAR28_ECAP5_TRIPOUT_SEL << 24) | (MW_EPWMXBAR28_ECAP6_TRIPOUT_SEL << 25) | (MW_EPWMXBAR28_ECAP7_TRIPOUT_SEL << 26) | (MW_EPWMXBAR28_ECAP8_TRIPOUT_SEL << 27) | (MW_EPWMXBAR28_ECAP9_TRIPOUT_SEL << 28);
    group0_epwmxbar[29] = (MW_EPWMXBAR29_CMPSSA0_CTRIPL_SEL << 0) | (MW_EPWMXBAR29_CMPSSA0_CTRIPH_SEL << 1) | (MW_EPWMXBAR29_CMPSSA1_CTRIPL_SEL << 2) | (MW_EPWMXBAR29_CMPSSA1_CTRIPH_SEL << 3) | (MW_EPWMXBAR29_CMPSSA2_CTRIPL_SEL << 4) | (MW_EPWMXBAR29_CMPSSA2_CTRIPH_SEL << 5) | (MW_EPWMXBAR29_CMPSSA3_CTRIPL_SEL << 6) | (MW_EPWMXBAR29_CMPSSA3_CTRIPH_SEL << 7) | (MW_EPWMXBAR29_CMPSSA4_CTRIPL_SEL << 8) | (MW_EPWMXBAR29_CMPSSA4_CTRIPH_SEL << 9) | (MW_EPWMXBAR29_CMPSSA5_CTRIPL_SEL << 10) | (MW_EPWMXBAR29_CMPSSA5_CTRIPH_SEL << 11) | (MW_EPWMXBAR29_CMPSSA6_CTRIPL_SEL << 12) | (MW_EPWMXBAR29_CMPSSA6_CTRIPH_SEL << 13) | (MW_EPWMXBAR29_CMPSSA7_CTRIPL_SEL << 14) | (MW_EPWMXBAR29_CMPSSA7_CTRIPH_SEL << 15) | (MW_EPWMXBAR29_CMPSSA8_CTRIPL_SEL << 16) | (MW_EPWMXBAR29_CMPSSA8_CTRIPH_SEL << 17) | (MW_EPWMXBAR29_CMPSSA9_CTRIPL_SEL << 18) | (MW_EPWMXBAR29_CMPSSA9_CTRIPH_SEL << 19);
    group1_epwmxbar[29] = (MW_EPWMXBAR29_CMPSSB0_CTRIPL_SEL << 0) | (MW_EPWMXBAR29_CMPSSB0_CTRIPH_SEL << 1) | (MW_EPWMXBAR29_CMPSSB1_CTRIPL_SEL << 2) | (MW_EPWMXBAR29_CMPSSB1_CTRIPH_SEL << 3) | (MW_EPWMXBAR29_CMPSSB2_CTRIPL_SEL << 4) | (MW_EPWMXBAR29_CMPSSB2_CTRIPH_SEL << 5) | (MW_EPWMXBAR29_CMPSSB3_CTRIPL_SEL << 6) | (MW_EPWMXBAR29_CMPSSB3_CTRIPH_SEL << 7) | (MW_EPWMXBAR29_CMPSSB4_CTRIPL_SEL << 8) | (MW_EPWMXBAR29_CMPSSB4_CTRIPH_SEL << 9) | (MW_EPWMXBAR29_CMPSSB5_CTRIPL_SEL << 10) | (MW_EPWMXBAR29_CMPSSB5_CTRIPH_SEL << 11) | (MW_EPWMXBAR29_CMPSSB6_CTRIPL_SEL << 12) | (MW_EPWMXBAR29_CMPSSB6_CTRIPH_SEL << 13) | (MW_EPWMXBAR29_CMPSSB7_CTRIPL_SEL << 14) | (MW_EPWMXBAR29_CMPSSB7_CTRIPH_SEL << 15) | (MW_EPWMXBAR29_CMPSSB8_CTRIPL_SEL << 16) | (MW_EPWMXBAR29_CMPSSB8_CTRIPH_SEL << 17) | (MW_EPWMXBAR29_CMPSSB9_CTRIPL_SEL << 18) | (MW_EPWMXBAR29_CMPSSB9_CTRIPH_SEL << 19);
    group2_epwmxbar[29] = (MW_EPWMXBAR29_SD0_FILT0_CEVT1_SEL << 0) | (MW_EPWMXBAR29_SD0_FILT0_CEVT2_SEL << 1) | (MW_EPWMXBAR29_SD0_FILT0_CMPHZ_SEL << 2) | (MW_EPWMXBAR29_SD0_FILT1_CEVT1_SEL << 3) | (MW_EPWMXBAR29_SD0_FILT1_CEVT2_SEL << 4) | (MW_EPWMXBAR29_SD0_FILT1_CMPHZ_SEL << 5) | (MW_EPWMXBAR29_SD0_FILT2_CEVT1_SEL << 6) | (MW_EPWMXBAR29_SD0_FILT2_CEVT2_SEL << 7) | (MW_EPWMXBAR29_SD0_FILT2_CMPHZ_SEL << 8) | (MW_EPWMXBAR29_SD0_FILT3_CEVT1_SEL << 9) | (MW_EPWMXBAR29_SD0_FILT3_CEVT2_SEL << 10) | (MW_EPWMXBAR29_SD0_FILT3_CMPHZ_SEL << 11) | (MW_EPWMXBAR29_SD1_FILT0_CEVT1_SEL << 12) | (MW_EPWMXBAR29_SD1_FILT0_CEVT2_SEL << 13) | (MW_EPWMXBAR29_SD1_FILT0_CMPHZ_SEL << 14) | (MW_EPWMXBAR29_SD1_FILT1_CEVT1_SEL << 15) | (MW_EPWMXBAR29_SD1_FILT1_CEVT2_SEL << 16) | (MW_EPWMXBAR29_SD1_FILT1_CMPHZ_SEL << 17) | (MW_EPWMXBAR29_SD1_FILT2_CEVT1_SEL << 18) | (MW_EPWMXBAR29_SD1_FILT2_CEVT2_SEL << 19) | (MW_EPWMXBAR29_SD1_FILT2_CMPHZ_SEL << 20) | (MW_EPWMXBAR29_SD1_FILT3_CEVT1_SEL << 21) | (MW_EPWMXBAR29_SD1_FILT3_CEVT2_SEL << 22) | (MW_EPWMXBAR29_SD1_FILT3_CMPHZ_SEL << 23);
    group3_epwmxbar[29] = (MW_EPWMXBAR29_ADC0_EVT1_SEL << 0) | (MW_EPWMXBAR29_ADC0_EVT2_SEL << 1) | (MW_EPWMXBAR29_ADC0_EVT3_SEL << 2) | (MW_EPWMXBAR29_ADC0_EVT4_SEL << 3) | (MW_EPWMXBAR29_ADC1_EVT1_SEL << 4) | (MW_EPWMXBAR29_ADC1_EVT2_SEL << 5) | (MW_EPWMXBAR29_ADC1_EVT3_SEL << 6) | (MW_EPWMXBAR29_ADC1_EVT4_SEL << 7) | (MW_EPWMXBAR29_ADC2_EVT1_SEL << 8) | (MW_EPWMXBAR29_ADC2_EVT2_SEL << 9) | (MW_EPWMXBAR29_ADC2_EVT3_SEL << 10) | (MW_EPWMXBAR29_ADC2_EVT4_SEL << 11) | (MW_EPWMXBAR29_ADC3_EVT1_SEL << 12) | (MW_EPWMXBAR29_ADC3_EVT2_SEL << 13) | (MW_EPWMXBAR29_ADC3_EVT3_SEL << 14) | (MW_EPWMXBAR29_ADC3_EVT4_SEL << 15) | (MW_EPWMXBAR29_ADC4_EVT1_SEL << 16) | (MW_EPWMXBAR29_ADC4_EVT2_SEL << 17) | (MW_EPWMXBAR29_ADC4_EVT3_SEL << 18) | (MW_EPWMXBAR29_ADC4_EVT4_SEL << 19);
    // if(MW_EPWMXBAR29_GPIO0_SEL == 1 | MW_EPWMXBAR29_GPIO1_SEL == 1 | MW_EPWMXBAR29_GPIO2_SEL == 1 | MW_EPWMXBAR29_GPIO3_SEL == 1 | MW_EPWMXBAR29_GPIO4_SEL == 1 | MW_EPWMXBAR29_GPIO5_SEL == 1 | MW_EPWMXBAR29_GPIO6_SEL == 1 | MW_EPWMXBAR29_GPIO7_SEL == 1| MW_EPWMXBAR29_GPIO8_SEL == 1 | MW_EPWMXBAR29_GPIO9_SEL == 1 | MW_EPWMXBAR29_GPIO10_SEL == 1| MW_EPWMXBAR29_GPIO11_SEL == 1| MW_EPWMXBAR29_GPIO12_SEL == 1 | MW_EPWMXBAR29_GPIO13_SEL == 1 | MW_EPWMXBAR29_GPIO14_SEL == 1 | MW_EPWMXBAR29_GPIO15_SEL == 1 | MW_EPWMXBAR29_GPIO16_SEL == 1 | MW_EPWMXBAR29_GPIO17_SEL == 1 | MW_EPWMXBAR29_GPIO18_SEL == 1 | MW_EPWMXBAR29_GPIO19_SEL == 1 | MW_EPWMXBAR29_GPIO20_SEL == 1 | MW_EPWMXBAR29_GPIO21_SEL == 1 | MW_EPWMXBAR29_GPIO22_SEL == 1 | MW_EPWMXBAR29_GPIO23_SEL == 1 | MW_EPWMXBAR29_GPIO24_SEL == 1 | MW_EPWMXBAR29_GPIO25_SEL == 1 | MW_EPWMXBAR29_GPIO26_SEL == 1 | MW_EPWMXBAR29_GPIO27_SEL == 1 | MW_EPWMXBAR29_GPIO28_SEL == 1 | MW_EPWMXBAR29_GPIO29_SEL == 1 | MW_EPWMXBAR29_GPIO30_SEL == 1 | MW_EPWMXBAR29_GPIO31_SEL == 1 | MW_EPWMXBAR29_GPIO32_SEL == 1 | MW_EPWMXBAR29_GPIO33_SEL == 1 | MW_EPWMXBAR29_GPIO34_SEL == 1 | MW_EPWMXBAR29_GPIO35_SEL == 1 | MW_EPWMXBAR29_GPIO36_SEL == 1 | MW_EPWMXBAR29_GPIO37_SEL == 1 | MW_EPWMXBAR29_GPIO38_SEL == 1 | MW_EPWMXBAR29_GPIO39_SEL == 1 | MW_EPWMXBAR29_GPIO40_SEL == 1 | MW_EPWMXBAR29_GPIO41_SEL == 1 | MW_EPWMXBAR29_GPIO42_SEL == 1 | MW_EPWMXBAR29_GPIO43_SEL == 1 | MW_EPWMXBAR29_GPIO44_SEL == 1 | | MW_EPWMXBAR29_GPIO45_SEL == 1 | MW_EPWMXBAR29_GPIO46_SEL == 1 | MW_EPWMXBAR29_GPIO47_SEL == 1| MW_EPWMXBAR29_GPIO48_SEL == 1 | MW_EPWMXBAR29_GPIO49_SEL == 1 | MW_EPWMXBAR29_GPIO50_SEL == 1 | MW_EPWMXBAR29_GPIO51_SEL == 1 | MW_EPWMXBAR29_GPIO52_SEL == 1 | MW_EPWMXBAR29_GPIO53_SEL == 1 | MW_EPWMXBAR29_GPIO54_SEL == 1 | MW_EPWMXBAR29_GPIO55_SEL == 1 | MW_EPWMXBAR29_GPIO56_SEL == 1 | MW_EPWMXBAR29_GPIO57_SEL == 1| MW_EPWMXBAR29_GPIO58_SEL == 1 | MW_EPWMXBAR29_GPIO59_SEL == 1 | MW_EPWMXBAR29_GPIO60_SEL == 1 | MW_EPWMXBAR29_GPIO61_SEL == 1 | MW_EPWMXBAR29_GPIO62_SEL == 1 | MW_EPWMXBAR29_GPIO63_SEL == 1 | MW_EPWMXBAR29_GPIO64_SEL == 1 | | MW_EPWMXBAR29_GPIO59_SEL == 1 | MW_EPWMXBAR29_GPIO60_SEL == 1 | MW_EPWMXBAR29_GPIO61_SEL == 1 | MW_EPWMXBAR29_GPIO62_SEL == 1 | MW_EPWMXBAR29_GPIO63_SEL == 1 | MW_EPWMXBAR29_GPIO64_SEL == 1 | MW_EPWMXBAR29_GPIO65_SEL == 1 | MW_EPWMXBAR29_GPIO66_SEL == 1 | MW_EPWMXBAR29_GPIO67_SEL == 1 | MW_EPWMXBAR29_GPIO68_SEL == 1 | MW_EPWMXBAR29_GPIO69_SEL == 1 | MW_EPWMXBAR29_GPIO70_SEL == 1 | MW_EPWMXBAR29_GPIO71_SEL == 1 | MW_EPWMXBAR29_GPIO72_SEL == 1 | MW_EPWMXBAR29_GPIO73_SEL == 1 | MW_EPWMXBAR29_GPIO74_SEL == 1 | MW_EPWMXBAR29_GPIO75_SEL == 1 | MW_EPWMXBAR29_GPIO76_SEL == 1 | MW_EPWMXBAR29_GPIO77_SEL == 1 | MW_EPWMXBAR29_GPIO78_SEL == 1 | | MW_EPWMXBAR29_GPIO80_SEL == 1 | MW_EPWMXBAR29_GPIO81_SEL == 1 | MW_EPWMXBAR29_GPIO82_SEL == 1 | MW_EPWMXBAR29_GPIO83_SEL == 1 | MW_EPWMXBAR29_GPIO84_SEL == 1 | MW_EPWMXBAR29_GPIO85_SEL == 1 | MW_EPWMXBAR29_GPIO86_SEL == 1 | MW_EPWMXBAR29_GPIO87_SEL == 1 | MW_EPWMXBAR29_GPIO88_SEL == 1 | MW_EPWMXBAR29_GPIO89_SEL == 1 | MW_EPWMXBAR29_GPIO90_SEL == 1 | MW_EPWMXBAR29_GPIO91_SEL == 1 | MW_EPWMXBAR29_GPIO92_SEL == 1 | MW_EPWMXBAR29_GPIO93_SEL == 1 | MW_EPWMXBAR29_GPIO94_SEL == 1 | MW_EPWMXBAR29_GPIO95_SEL == 1 | MW_EPWMXBAR29_GPIO96_SEL == 1 | MW_EPWMXBAR29_GPIO97_SEL == 1 | MW_EPWMXBAR29_GPIO98_SEL == 1 | MW_EPWMXBAR29_GPIO99_SEL == 1 | MW_EPWMXBAR29_GPIO100_SEL == 1 | MW_EPWMXBAR29_GPIO101_SEL == 1 | MW_EPWMXBAR29_GPIO102_SEL == 1 | MW_EPWMXBAR29_GPIO103_SEL == 1 | MW_EPWMXBAR29_GPIO104_SEL == 1 | MW_EPWMXBAR29_GPIO105_SEL == 1 | MW_EPWMXBAR29_GPIO106_SEL == 1 | MW_EPWMXBAR29_GPIO107_SEL == 1 | | MW_EPWMXBAR29_GPIO108_SEL == 1 | MW_EPWMXBAR29_GPIO109_SEL == 1| MW_EPWMXBAR29_GPIO110_SEL == 1 | MW_EPWMXBAR29_GPIO111_SEL == 1 | MW_EPWMXBAR29_GPIO112_SEL == 1 | MW_EPWMXBAR29_GPIO113_SEL == 1 | MW_EPWMXBAR29_GPIO114_SEL == 1 | MW_EPWMXBAR29_GPIO115_SEL == 1 | MW_EPWMXBAR29_GPIO116_SEL == 1 | MW_EPWMXBAR29_GPIO117_SEL == 1 | MW_EPWMXBAR29_GPIO118_SEL == 1 | MW_EPWMXBAR29_GPIO119_SEL == 1 | MW_EPWMXBAR29_GPIO120_SEL == 1 | MW_EPWMXBAR29_GPIO121_SEL == 1 | MW_EPWMXBAR29_GPIO122_SEL == 1 | MW_EPWMXBAR29_GPIO123_SEL == 1 | MW_EPWMXBAR29_GPIO124_SEL == 1 | MW_EPWMXBAR29_GPIO125_SEL == 1 | MW_EPWMXBAR29_GPIO126_SEL == 1 | MW_EPWMXBAR29_GPIO127_SEL == 1 | MW_EPWMXBAR29_GPIO128_SEL == 1 | MW_EPWMXBAR29_GPIO129_SEL == 1 | MW_EPWMXBAR29_GPIO130_SEL == 1 | MW_EPWMXBAR29_GPIO131_SEL == 1 | MW_EPWMXBAR29_GPIO132_SEL == 1 | MW_EPWMXBAR29_GPIO133_SEL == 1 | MW_EPWMXBAR29_GPIO134_SEL == 1 | MW_EPWMXBAR29_GPIO135_SEL == 1 | MW_EPWMXBAR29_GPIO136_SEL == 1 | MW_EPWMXBAR29_GPIO137_SEL == 1 | MW_EPWMXBAR29_GPIO139_SEL == 1 | MW_EPWMXBAR29_GPIO140_SEL == 1 | MW_EPWMXBAR29_GPIO141_SEL == 1 | MW_EPWMXBAR29_GPIO142_SEL == 1 | MW_EPWMXBAR29_GPIO143_SEL == 1 | MW_EPWMXBAR29_ICSSGPO0_PORT0_SEL == 1 | MW_EPWMXBAR29_ICSSGPO1_PORT0_SEL == 1 | MW_EPWMXBAR29_ICSSGPO2_PORT0_SEL == 1 | MW_EPWMXBAR29_ICSSGPO3_PORT0_SEL == 1 | MW_EPWMXBAR29_ICSSGPO4_PORT0_SEL == 1 | MW_EPWMXBAR29_ICSSGPO5_PORT0_SEL == 1 | MW_EPWMXBAR29_ICSSGPO6_PORT0_SEL == 1 | MW_EPWMXBAR29_ICSSGPO7_PORT0_SEL == 1 | MW_EPWMXBAR29_ICSSGPO8_PORT0_SEL == 1 | MW_EPWMXBAR29_ICSSGPO9_PORT0_SEL == 1 | MW_EPWMXBAR29_ICSSGPO10_PORT0_SEL == 1 | MW_EPWMXBAR29_ICSSGPO11_PORT0_SEL == 1 | MW_EPWMXBAR29_ICSSGPO12_PORT0_SEL == 1 | MW_EPWMXBAR29_ICSSGPO13_PORT0_SEL == 1 | MW_EPWMXBAR29_ICSSGPO14_PORT0_SEL == 1 | MW_EPWMXBAR29_ICSSGPO15_PORT0_SEL == 1 | MW_EPWMXBAR29_ICSSGPO0_PORT1_SEL == 1 | MW_EPWMXBAR29_ICSSGPO1_PORT1_SEL == 1 | MW_EPWMXBAR29_ICSSGPO2_PORT1_SEL == 1 | MW_EPWMXBAR29_ICSSGPO3_PORT1_SEL == 1 | MW_EPWMXBAR29_ICSSGPO4_PORT1_SEL == 1 | MW_EPWMXBAR29_ICSSGPO5_PORT1_SEL == 1 | MW_EPWMXBAR29_ICSSGPO6_PORT1_SEL == 1 | MW_EPWMXBAR29_ICSSGPO7_PORT1_SEL == 1 | MW_EPWMXBAR29_ICSSGPO8_PORT1_SEL == 1 | MW_EPWMXBAR29_ICSSGPO9_PORT1_SEL == 1 | MW_EPWMXBAR29_ICSSGPO10_PORT1_SEL == 1 | MW_EPWMXBAR29_ICSSGPO11_PORT1_SEL == 1 | MW_EPWMXBAR29_ICSSGPO12_PORT1_SEL == 1 | MW_EPWMXBAR29_ICSSGPO13_PORT1_SEL == 1 | MW_EPWMXBAR29_ICSSGPO14_PORT1_SEL == 1 | MW_EPWMXBAR29_ICSSGPO15_PORT1_SEL == 1)
    //     group4_epwmxbar[29] = EPWM_XBAR_29;
    // else
        group4_epwmxbar[29] = 0;
    group5_epwmxbar[29] = (MW_EPWMXBAR29_EPWM0_TRIPOUT_SEL << 0) | (MW_EPWMXBAR29_EPWM1_TRIPOUT_SEL << 1) | (MW_EPWMXBAR29_EPWM2_TRIPOUT_SEL << 2) | (MW_EPWMXBAR29_EPWM3_TRIPOUT_SEL << 3) | (MW_EPWMXBAR29_EPWM4_TRIPOUT_SEL << 4) | (MW_EPWMXBAR29_EPWM5_TRIPOUT_SEL << 5) | (MW_EPWMXBAR29_EPWM6_TRIPOUT_SEL << 6) | (MW_EPWMXBAR29_EPWM7_TRIPOUT_SEL << 7) | (MW_EPWMXBAR29_EPWM8_TRIPOUT_SEL << 8) | (MW_EPWMXBAR29_EPWM9_TRIPOUT_SEL << 9) | (MW_EPWMXBAR29_EPWM10_TRIPOUT_SEL << 10) | (MW_EPWMXBAR29_EPWM11_TRIPOUT_SEL << 11) | (MW_EPWMXBAR29_EPWM12_TRIPOUT_SEL << 12) | (MW_EPWMXBAR29_EPWM13_TRIPOUT_SEL << 13) | (MW_EPWMXBAR29_EPWM14_TRIPOUT_SEL << 14) | (MW_EPWMXBAR29_EPWM15_TRIPOUT_SEL << 15) | (MW_EPWMXBAR29_EPWM16_TRIPOUT_SEL << 16) | (MW_EPWMXBAR29_EPWM17_TRIPOUT_SEL << 17) | (MW_EPWMXBAR29_EPWM18_TRIPOUT_SEL << 18) | (MW_EPWMXBAR29_EPWM19_TRIPOUT_SEL << 19) | (MW_EPWMXBAR29_EPWM20_TRIPOUT_SEL << 20) | (MW_EPWMXBAR29_EPWM21_TRIPOUT_SEL << 21) | (MW_EPWMXBAR29_EPWM22_TRIPOUT_SEL << 22) | (MW_EPWMXBAR29_EPWM23_TRIPOUT_SEL << 23) | (MW_EPWMXBAR29_EPWM24_TRIPOUT_SEL << 24) | (MW_EPWMXBAR29_EPWM25_TRIPOUT_SEL << 25) | (MW_EPWMXBAR29_EPWM26_TRIPOUT_SEL << 26) | (MW_EPWMXBAR29_EPWM27_TRIPOUT_SEL << 27) | (MW_EPWMXBAR29_EPWM28_TRIPOUT_SEL << 28) | (MW_EPWMXBAR29_EPWM29_TRIPOUT_SEL << 29) | (MW_EPWMXBAR29_EPWM30_TRIPOUT_SEL << 30) | (MW_EPWMXBAR29_EPWM31_TRIPOUT_SEL << 31);
    group6_epwmxbar[29] = (MW_EPWMXBAR29_DEL0_TRIP_SEL << 0) | (MW_EPWMXBAR29_DEL1_TRIP_SEL << 1) | (MW_EPWMXBAR29_DEL2_TRIP_SEL << 2) | (MW_EPWMXBAR29_DEL3_TRIP_SEL << 3) | (MW_EPWMXBAR29_DEL4_TRIP_SEL << 4) | (MW_EPWMXBAR29_DEL5_TRIP_SEL << 5) | (MW_EPWMXBAR29_DEL6_TRIP_SEL << 6) | (MW_EPWMXBAR29_DEL7_TRIP_SEL << 7) | (MW_EPWMXBAR29_DEL8_TRIP_SEL << 8) | (MW_EPWMXBAR29_DEL9_TRIP_SEL << 9) | (MW_EPWMXBAR29_DEL10_TRIP_SEL << 10) | (MW_EPWMXBAR29_DEL11_TRIP_SEL << 11) | (MW_EPWMXBAR29_DEL12_TRIP_SEL << 12) | (MW_EPWMXBAR29_DEL13_TRIP_SEL << 13) | (MW_EPWMXBAR29_DEL14_TRIP_SEL << 14) | (MW_EPWMXBAR29_DEL15_TRIP_SEL << 15) | (MW_EPWMXBAR29_DEL16_TRIP_SEL << 16) | (MW_EPWMXBAR29_DEL17_TRIP_SEL << 17) | (MW_EPWMXBAR29_DEL18_TRIP_SEL << 18) | (MW_EPWMXBAR29_DEL19_TRIP_SEL << 19) | (MW_EPWMXBAR29_DEL20_TRIP_SEL << 20) | (MW_EPWMXBAR29_DEL21_TRIP_SEL << 21) | (MW_EPWMXBAR29_DEL22_TRIP_SEL << 22) | (MW_EPWMXBAR29_DEL23_TRIP_SEL << 23) | (MW_EPWMXBAR29_DEL24_TRIP_SEL << 24) | (MW_EPWMXBAR29_DEL25_TRIP_SEL << 25) | (MW_EPWMXBAR29_DEL26_TRIP_SEL << 26) | (MW_EPWMXBAR29_DEL27_TRIP_SEL << 27) | (MW_EPWMXBAR29_DEL28_TRIP_SEL << 28) | (MW_EPWMXBAR29_DEL29_TRIP_SEL << 29) | (MW_EPWMXBAR29_DEL30_TRIP_SEL << 30) | (MW_EPWMXBAR29_DEL31_TRIP_SEL << 31);
