TexasInstruments/am26x-hsp/src/am263px_init.c
    group7_epwmxbar[29] = (MW_EPWMXBAR29_DEL0_ACTIVE_SEL << 0) | (MW_EPWMXBAR29_DEL1_ACTIVE_SEL << 1) | (MW_EPWMXBAR29_DEL2_ACTIVE_SEL << 2) | (MW_EPWMXBAR29_DEL3_ACTIVE_SEL << 3) | (MW_EPWMXBAR29_DEL4_ACTIVE_SEL << 4) | (MW_EPWMXBAR29_DEL5_ACTIVE_SEL << 5) | (MW_EPWMXBAR29_DEL6_ACTIVE_SEL << 6) | (MW_EPWMXBAR29_DEL7_ACTIVE_SEL << 7) | (MW_EPWMXBAR29_DEL8_ACTIVE_SEL << 8) | (MW_EPWMXBAR29_DEL9_ACTIVE_SEL << 9) | (MW_EPWMXBAR29_DEL10_ACTIVE_SEL << 10) | (MW_EPWMXBAR29_DEL11_ACTIVE_SEL << 11) | (MW_EPWMXBAR29_DEL12_ACTIVE_SEL << 12) | (MW_EPWMXBAR29_DEL13_ACTIVE_SEL << 13) | (MW_EPWMXBAR29_DEL14_ACTIVE_SEL << 14) | (MW_EPWMXBAR29_DEL15_ACTIVE_SEL << 15) | (MW_EPWMXBAR29_DEL16_ACTIVE_SEL << 16) | (MW_EPWMXBAR29_DEL17_ACTIVE_SEL << 17) | (MW_EPWMXBAR29_DEL18_ACTIVE_SEL << 18) | (MW_EPWMXBAR29_DEL19_ACTIVE_SEL << 19) | (MW_EPWMXBAR29_DEL20_ACTIVE_SEL << 20) | (MW_EPWMXBAR29_DEL21_ACTIVE_SEL << 21) | (MW_EPWMXBAR29_DEL22_ACTIVE_SEL << 22) | (MW_EPWMXBAR29_DEL23_ACTIVE_SEL << 23) | (MW_EPWMXBAR29_DEL24_ACTIVE_SEL << 24) | (MW_EPWMXBAR29_DEL25_ACTIVE_SEL << 25) | (MW_EPWMXBAR29_DEL26_ACTIVE_SEL << 26) | (MW_EPWMXBAR29_DEL27_ACTIVE_SEL << 27) | (MW_EPWMXBAR29_DEL28_ACTIVE_SEL << 28) | (MW_EPWMXBAR29_DEL29_ACTIVE_SEL << 29) | (MW_EPWMXBAR29_DEL30_ACTIVE_SEL << 30) | (MW_EPWMXBAR29_DEL31_ACTIVE_SEL << 31);
    group8_epwmxbar[29] = (MW_EPWMXBAR29_EQEP0_ERR_SEL << 0) | (MW_EPWMXBAR29_EQEP1_ERR_SEL << 1) | (MW_EPWMXBAR29_EQEP2_ERR_SEL << 2) | (MW_EPWMXBAR29_FSIRX0_RX_TRIG0_SEL << 3) | (MW_EPWMXBAR29_FSIRX0_RX_TRIG1_SEL << 4) | (MW_EPWMXBAR29_FSIRX0_RX_TRIG2_SEL << 5) | (MW_EPWMXBAR29_FSIRX0_RX_TRIG3_SEL << 6) | (MW_EPWMXBAR29_FSIRX1_RX_TRIG0_SEL << 7) | (MW_EPWMXBAR29_FSIRX1_RX_TRIG1_SEL << 8) | (MW_EPWMXBAR29_FSIRX1_RX_TRIG2_SEL << 9) | (MW_EPWMXBAR29_FSIRX1_RX_TRIG3_SEL << 10) | (MW_EPWMXBAR29_FSIRX2_RX_TRIG0_SEL << 11) | (MW_EPWMXBAR29_FSIRX2_RX_TRIG1_SEL << 12) | (MW_EPWMXBAR29_FSIRX2_RX_TRIG2_SEL << 13) | (MW_EPWMXBAR29_FSIRX2_RX_TRIG3_SEL << 14) | (MW_EPWMXBAR29_FSIRX3_RX_TRIG0_SEL << 15) | (MW_EPWMXBAR29_FSIRX3_RX_TRIG1_SEL << 16) | (MW_EPWMXBAR29_FSIRX3_RX_TRIG2_SEL << 17) | (MW_EPWMXBAR29_FSIRX3_RX_TRIG3_SEL << 18) | (MW_EPWMXBAR29_ECAP0_TRIPOUT_SEL << 19) | (MW_EPWMXBAR29_ECAP1_TRIPOUT_SEL << 20) | (MW_EPWMXBAR29_ECAP2_TRIPOUT_SEL << 21) | (MW_EPWMXBAR29_ECAP3_TRIPOUT_SEL << 22) | (MW_EPWMXBAR29_ECAP4_TRIPOUT_SEL << 23) | (MW_EPWMXBAR29_ECAP5_TRIPOUT_SEL << 24) | (MW_EPWMXBAR29_ECAP6_TRIPOUT_SEL << 25) | (MW_EPWMXBAR29_ECAP7_TRIPOUT_SEL << 26) | (MW_EPWMXBAR29_ECAP8_TRIPOUT_SEL << 27) | (MW_EPWMXBAR29_ECAP9_TRIPOUT_SEL << 28);

    latch = (MW_EPWMXBAR0_INV_OUT_LATCH_SEL << 0) | (MW_EPWMXBAR1_INV_OUT_LATCH_SEL << 1) | (MW_EPWMXBAR2_INV_OUT_LATCH_SEL << 2) | (MW_EPWMXBAR3_INV_OUT_LATCH_SEL << 3) | (MW_EPWMXBAR4_INV_OUT_LATCH_SEL << 4) | (MW_EPWMXBAR5_INV_OUT_LATCH_SEL << 5) | (MW_EPWMXBAR6_INV_OUT_LATCH_SEL << 6) | (MW_EPWMXBAR7_INV_OUT_LATCH_SEL << 7) | (MW_EPWMXBAR8_INV_OUT_LATCH_SEL << 8) | (MW_EPWMXBAR9_INV_OUT_LATCH_SEL << 9) | (MW_EPWMXBAR10_INV_OUT_LATCH_SEL << 10) | (MW_EPWMXBAR11_INV_OUT_LATCH_SEL << 11) | (MW_EPWMXBAR12_INV_OUT_LATCH_SEL << 12) | (MW_EPWMXBAR13_INV_OUT_LATCH_SEL << 13) | (MW_EPWMXBAR14_INV_OUT_LATCH_SEL << 14) | (MW_EPWMXBAR15_INV_OUT_LATCH_SEL << 15) | (MW_EPWMXBAR16_INV_OUT_LATCH_SEL << 16) | (MW_EPWMXBAR17_INV_OUT_LATCH_SEL << 17) | (MW_EPWMXBAR18_INV_OUT_LATCH_SEL << 18) | (MW_EPWMXBAR19_INV_OUT_LATCH_SEL << 19) | (MW_EPWMXBAR20_INV_OUT_LATCH_SEL << 20) | (MW_EPWMXBAR21_INV_OUT_LATCH_SEL << 21) | (MW_EPWMXBAR22_INV_OUT_LATCH_SEL << 22) | (MW_EPWMXBAR23_INV_OUT_LATCH_SEL << 23) | (MW_EPWMXBAR24_INV_OUT_LATCH_SEL << 24) | (MW_EPWMXBAR25_INV_OUT_LATCH_SEL << 25) | (MW_EPWMXBAR26_INV_OUT_LATCH_SEL << 26) | (MW_EPWMXBAR27_INV_OUT_LATCH_SEL << 27) | (MW_EPWMXBAR28_INV_OUT_LATCH_SEL << 28) | (MW_EPWMXBAR29_INV_OUT_LATCH_SEL << 29);

    for(uint8_t i = 0; i< 30; i++)
    {
        SOC_xbarSelectPWMXBarInputSource(CSL_CONTROLSS_PWMXBAR_U_BASE, i, group0_epwmxbar[i], group1_epwmxbar[i], group2_epwmxbar[i], group3_epwmxbar[i], group4_epwmxbar[i], group5_epwmxbar[i], group6_epwmxbar[i], group7_epwmxbar[i], group8_epwmxbar[i]);
    }

    SOC_xbarInvertPWMXBarOutputSignalBeforeLatch(CSL_CONTROLSS_PWMXBAR_U_BASE, latch);

}

void Drivers_outputXbarOpen(void)
{
    uint32_t group0_outputxbar[16];
    uint32_t group1_outputxbar[16];
    uint32_t group2_outputxbar[16];
    uint32_t group3_outputxbar[16];
    uint32_t group4_outputxbar[16];
    uint32_t group5_outputxbar[16];
    uint32_t group6_outputxbar[16];
    uint32_t group7_outputxbar[16];
    uint32_t group8_outputxbar[16];
    uint32_t group9_outputxbar[16];
    uint32_t group10_outputxbar[16];

    uint32_t invertOutputBeforeLatch[16];
    uint32_t invertOutput[16];
    uint32_t latchSignalSource[16];
    uint32_t stretchedPulseOutput[16];
    uint32_t stretchedPulseLength[16];

    group0_outputxbar[0] = (MW_OUTPUTXBAR0_EPWM0_TRIPOUT_SEL<<0) | (MW_OUTPUTXBAR0_EPWM1_TRIPOUT_SEL<<1) | (MW_OUTPUTXBAR0_EPWM2_TRIPOUT_SEL<<2) | (MW_OUTPUTXBAR0_EPWM3_TRIPOUT_SEL<<3) | (MW_OUTPUTXBAR0_EPWM4_TRIPOUT_SEL<<4) | (MW_OUTPUTXBAR0_EPWM5_TRIPOUT_SEL<<5) | (MW_OUTPUTXBAR0_EPWM6_TRIPOUT_SEL<<6) | (MW_OUTPUTXBAR0_EPWM7_TRIPOUT_SEL<<7) | (MW_OUTPUTXBAR0_EPWM8_TRIPOUT_SEL<<8) | (MW_OUTPUTXBAR0_EPWM9_TRIPOUT_SEL<<9) | (MW_OUTPUTXBAR0_EPWM10_TRIPOUT_SEL<<10) | (MW_OUTPUTXBAR0_EPWM11_TRIPOUT_SEL<<11) | (MW_OUTPUTXBAR0_EPWM12_TRIPOUT_SEL<<12) | (MW_OUTPUTXBAR0_EPWM13_TRIPOUT_SEL<<13) | (MW_OUTPUTXBAR0_EPWM14_TRIPOUT_SEL<<14) | (MW_OUTPUTXBAR0_EPWM15_TRIPOUT_SEL<<15) | (MW_OUTPUTXBAR0_EPWM16_TRIPOUT_SEL<<16) | (MW_OUTPUTXBAR0_EPWM17_TRIPOUT_SEL<<17) | (MW_OUTPUTXBAR0_EPWM18_TRIPOUT_SEL<<18) | (MW_OUTPUTXBAR0_EPWM19_TRIPOUT_SEL<<19) | (MW_OUTPUTXBAR0_EPWM20_TRIPOUT_SEL<<20) | (MW_OUTPUTXBAR0_EPWM21_TRIPOUT_SEL<<21) | (MW_OUTPUTXBAR0_EPWM22_TRIPOUT_SEL<<22) | (MW_OUTPUTXBAR0_EPWM23_TRIPOUT_SEL<<23) | (MW_OUTPUTXBAR0_EPWM24_TRIPOUT_SEL<<24) | (MW_OUTPUTXBAR0_EPWM25_TRIPOUT_SEL<<25) | (MW_OUTPUTXBAR0_EPWM26_TRIPOUT_SEL<<26) | (MW_OUTPUTXBAR0_EPWM27_TRIPOUT_SEL<<27) | (MW_OUTPUTXBAR0_EPWM28_TRIPOUT_SEL<<28) | (MW_OUTPUTXBAR0_EPWM29_TRIPOUT_SEL<<29) | (MW_OUTPUTXBAR0_EPWM30_TRIPOUT_SEL<<30) | (MW_OUTPUTXBAR0_EPWM31_TRIPOUT_SEL<<31);
    group1_outputxbar[0] = (MW_OUTPUTXBAR0_EPWM0_SOCA_SEL<<0) | (MW_OUTPUTXBAR0_EPWM1_SOCA_SEL<<1) | (MW_OUTPUTXBAR0_EPWM2_SOCA_SEL<<2) | (MW_OUTPUTXBAR0_EPWM3_SOCA_SEL<<3) | (MW_OUTPUTXBAR0_EPWM4_SOCA_SEL<<4) | (MW_OUTPUTXBAR0_EPWM5_SOCA_SEL<<5) | (MW_OUTPUTXBAR0_EPWM6_SOCA_SEL<<6) | (MW_OUTPUTXBAR0_EPWM7_SOCA_SEL<<7) | (MW_OUTPUTXBAR0_EPWM8_SOCA_SEL<<8) | (MW_OUTPUTXBAR0_EPWM9_SOCA_SEL<<9) | (MW_OUTPUTXBAR0_EPWM10_SOCA_SEL<<10) | (MW_OUTPUTXBAR0_EPWM11_SOCA_SEL<<11) | (MW_OUTPUTXBAR0_EPWM12_SOCA_SEL<<12) | (MW_OUTPUTXBAR0_EPWM13_SOCA_SEL<<13) | (MW_OUTPUTXBAR0_EPWM14_SOCA_SEL<<14) | (MW_OUTPUTXBAR0_EPWM15_SOCA_SEL<<15) | (MW_OUTPUTXBAR0_EPWM16_SOCA_SEL<<16) | (MW_OUTPUTXBAR0_EPWM17_SOCA_SEL<<17) | (MW_OUTPUTXBAR0_EPWM18_SOCA_SEL<<18) | (MW_OUTPUTXBAR0_EPWM19_SOCA_SEL<<19) | (MW_OUTPUTXBAR0_EPWM20_SOCA_SEL<<20) | (MW_OUTPUTXBAR0_EPWM21_SOCA_SEL<<21) | (MW_OUTPUTXBAR0_EPWM22_SOCA_SEL<<22) | (MW_OUTPUTXBAR0_EPWM23_SOCA_SEL<<23) | (MW_OUTPUTXBAR0_EPWM24_SOCA_SEL<<24) | (MW_OUTPUTXBAR0_EPWM25_SOCA_SEL<<25) | (MW_OUTPUTXBAR0_EPWM26_SOCA_SEL<<26) | (MW_OUTPUTXBAR0_EPWM27_SOCA_SEL<<27) | (MW_OUTPUTXBAR0_EPWM28_SOCA_SEL<<28) | (MW_OUTPUTXBAR0_EPWM29_SOCA_SEL<<29) | (MW_OUTPUTXBAR0_EPWM30_SOCA_SEL<<30) | (MW_OUTPUTXBAR0_EPWM31_SOCA_SEL<<31);
    group2_outputxbar[0] = (MW_OUTPUTXBAR0_EPWM0_SOCB_SEL<<0) | (MW_OUTPUTXBAR0_EPWM1_SOCB_SEL<<1) | (MW_OUTPUTXBAR0_EPWM2_SOCB_SEL<<2) | (MW_OUTPUTXBAR0_EPWM3_SOCB_SEL<<3) | (MW_OUTPUTXBAR0_EPWM4_SOCB_SEL<<4) | (MW_OUTPUTXBAR0_EPWM5_SOCB_SEL<<5) | (MW_OUTPUTXBAR0_EPWM6_SOCB_SEL<<6) | (MW_OUTPUTXBAR0_EPWM7_SOCB_SEL<<7) | (MW_OUTPUTXBAR0_EPWM8_SOCB_SEL<<8) | (MW_OUTPUTXBAR0_EPWM9_SOCB_SEL<<9) | (MW_OUTPUTXBAR0_EPWM10_SOCB_SEL<<10) | (MW_OUTPUTXBAR0_EPWM11_SOCB_SEL<<11) | (MW_OUTPUTXBAR0_EPWM12_SOCB_SEL<<12) | (MW_OUTPUTXBAR0_EPWM13_SOCB_SEL<<13) | (MW_OUTPUTXBAR0_EPWM14_SOCB_SEL<<14) | (MW_OUTPUTXBAR0_EPWM15_SOCB_SEL<<15) | (MW_OUTPUTXBAR0_EPWM16_SOCB_SEL<<16) | (MW_OUTPUTXBAR0_EPWM17_SOCB_SEL<<17) | (MW_OUTPUTXBAR0_EPWM18_SOCB_SEL<<18) | (MW_OUTPUTXBAR0_EPWM19_SOCB_SEL<<19) | (MW_OUTPUTXBAR0_EPWM20_SOCB_SEL<<20) | (MW_OUTPUTXBAR0_EPWM21_SOCB_SEL<<21) | (MW_OUTPUTXBAR0_EPWM22_SOCB_SEL<<22) | (MW_OUTPUTXBAR0_EPWM23_SOCB_SEL<<23) | (MW_OUTPUTXBAR0_EPWM24_SOCB_SEL<<24) | (MW_OUTPUTXBAR0_EPWM25_SOCB_SEL<<25) | (MW_OUTPUTXBAR0_EPWM26_SOCB_SEL<<26) | (MW_OUTPUTXBAR0_EPWM27_SOCB_SEL<<27) | (MW_OUTPUTXBAR0_EPWM28_SOCB_SEL<<28) | (MW_OUTPUTXBAR0_EPWM29_SOCB_SEL<<29) | (MW_OUTPUTXBAR0_EPWM30_SOCB_SEL<<30) | (MW_OUTPUTXBAR0_EPWM31_SOCB_SEL<<31);
    group3_outputxbar[0] = (MW_OUTPUTXBAR0_DEL0_ACTIVE_SEL<<0) | (MW_OUTPUTXBAR0_DEL1_ACTIVE_SEL<<1) | (MW_OUTPUTXBAR0_DEL2_ACTIVE_SEL<<2) | (MW_OUTPUTXBAR0_DEL3_ACTIVE_SEL<<3) | (MW_OUTPUTXBAR0_DEL4_ACTIVE_SEL<<4) | (MW_OUTPUTXBAR0_DEL5_ACTIVE_SEL<<5) | (MW_OUTPUTXBAR0_DEL6_ACTIVE_SEL<<6) | (MW_OUTPUTXBAR0_DEL7_ACTIVE_SEL<<7) | (MW_OUTPUTXBAR0_DEL8_ACTIVE_SEL<<8) | (MW_OUTPUTXBAR0_DEL9_ACTIVE_SEL<<9) | (MW_OUTPUTXBAR0_DEL10_ACTIVE_SEL<<10) | (MW_OUTPUTXBAR0_DEL11_ACTIVE_SEL<<11) | (MW_OUTPUTXBAR0_DEL12_ACTIVE_SEL<<12) | (MW_OUTPUTXBAR0_DEL13_ACTIVE_SEL<<13) | (MW_OUTPUTXBAR0_DEL14_ACTIVE_SEL<<14) | (MW_OUTPUTXBAR0_DEL15_ACTIVE_SEL<<15) | (MW_OUTPUTXBAR0_DEL16_ACTIVE_SEL<<16) | (MW_OUTPUTXBAR0_DEL17_ACTIVE_SEL<<17) | (MW_OUTPUTXBAR0_DEL18_ACTIVE_SEL<<18) | (MW_OUTPUTXBAR0_DEL19_ACTIVE_SEL<<19) | (MW_OUTPUTXBAR0_DEL20_ACTIVE_SEL<<20) | (MW_OUTPUTXBAR0_DEL21_ACTIVE_SEL<<21) | (MW_OUTPUTXBAR0_DEL22_ACTIVE_SEL<<22) | (MW_OUTPUTXBAR0_DEL23_ACTIVE_SEL<<23) | (MW_OUTPUTXBAR0_DEL24_ACTIVE_SEL<<24) | (MW_OUTPUTXBAR0_DEL25_ACTIVE_SEL<<25) | (MW_OUTPUTXBAR0_DEL26_ACTIVE_SEL<<26) | (MW_OUTPUTXBAR0_DEL27_ACTIVE_SEL<<27) | (MW_OUTPUTXBAR0_DEL28_ACTIVE_SEL<<28) | (MW_OUTPUTXBAR0_DEL29_ACTIVE_SEL<<29) | (MW_OUTPUTXBAR0_DEL30_ACTIVE_SEL<<30) | (MW_OUTPUTXBAR0_DEL31_ACTIVE_SEL<<31);
    group4_outputxbar[0] = (MW_OUTPUTXBAR0_DEL0_TRIP_SEL<<0) | (MW_OUTPUTXBAR0_DEL1_TRIP_SEL<<1) | (MW_OUTPUTXBAR0_DEL2_TRIP_SEL<<2) | (MW_OUTPUTXBAR0_DEL3_TRIP_SEL<<3) | (MW_OUTPUTXBAR0_DEL4_TRIP_SEL<<4) | (MW_OUTPUTXBAR0_DEL5_TRIP_SEL<<5) | (MW_OUTPUTXBAR0_DEL6_TRIP_SEL<<6) | (MW_OUTPUTXBAR0_DEL7_TRIP_SEL<<7) | (MW_OUTPUTXBAR0_DEL8_TRIP_SEL<<8) | (MW_OUTPUTXBAR0_DEL9_TRIP_SEL<<9) | (MW_OUTPUTXBAR0_DEL10_TRIP_SEL<<10) | (MW_OUTPUTXBAR0_DEL11_TRIP_SEL<<11) | (MW_OUTPUTXBAR0_DEL12_TRIP_SEL<<12) | (MW_OUTPUTXBAR0_DEL13_TRIP_SEL<<13) | (MW_OUTPUTXBAR0_DEL14_TRIP_SEL<<14) | (MW_OUTPUTXBAR0_DEL15_TRIP_SEL<<15) | (MW_OUTPUTXBAR0_DEL16_TRIP_SEL<<16) | (MW_OUTPUTXBAR0_DEL17_TRIP_SEL<<17) | (MW_OUTPUTXBAR0_DEL18_TRIP_SEL<<18) | (MW_OUTPUTXBAR0_DEL19_TRIP_SEL<<19) | (MW_OUTPUTXBAR0_DEL20_TRIP_SEL<<20) | (MW_OUTPUTXBAR0_DEL21_TRIP_SEL<<21) | (MW_OUTPUTXBAR0_DEL22_TRIP_SEL<<22) | (MW_OUTPUTXBAR0_DEL23_TRIP_SEL<<23) | (MW_OUTPUTXBAR0_DEL24_TRIP_SEL<<24) | (MW_OUTPUTXBAR0_DEL25_TRIP_SEL<<25) | (MW_OUTPUTXBAR0_DEL26_TRIP_SEL<<26) | (MW_OUTPUTXBAR0_DEL27_TRIP_SEL<<27) | (MW_OUTPUTXBAR0_DEL28_TRIP_SEL<<28) | (MW_OUTPUTXBAR0_DEL29_TRIP_SEL<<29) | (MW_OUTPUTXBAR0_DEL30_TRIP_SEL<<30) | (MW_OUTPUTXBAR0_DEL31_TRIP_SEL<<31);
    group5_outputxbar[0] = (MW_OUTPUTXBAR0_SD0_FILT0_CEVT1_SEL<<0) | (MW_OUTPUTXBAR0_SD0_FILT0_CEVT2_SEL<<1) | (MW_OUTPUTXBAR0_SD0_FILT0_CMPHZ_SEL<<2) | (MW_OUTPUTXBAR0_SD0_FILT1_CEVT1_SEL<<3) | (MW_OUTPUTXBAR0_SD0_FILT1_CEVT2_SEL<<4) | (MW_OUTPUTXBAR0_SD0_FILT1_CMPHZ_SEL<<5) | (MW_OUTPUTXBAR0_SD0_FILT2_CEVT1_SEL<<6) | (MW_OUTPUTXBAR0_SD0_FILT2_CEVT2_SEL<<7) | (MW_OUTPUTXBAR0_SD0_FILT2_CMPHZ_SEL<<8) | (MW_OUTPUTXBAR0_SD0_FILT3_CEVT1_SEL<<9) | (MW_OUTPUTXBAR0_SD0_FILT3_CEVT2_SEL<<10) | (MW_OUTPUTXBAR0_SD0_FILT3_CMPHZ_SEL<<11) | (MW_OUTPUTXBAR0_SD1_FILT0_CEVT1_SEL<<12) | (MW_OUTPUTXBAR0_SD1_FILT0_CEVT2_SEL<<13) | (MW_OUTPUTXBAR0_SD1_FILT0_CMPHZ_SEL<<14) | (MW_OUTPUTXBAR0_SD1_FILT1_CEVT1_SEL<<15) | (MW_OUTPUTXBAR0_SD1_FILT1_CEVT2_SEL<<16) | (MW_OUTPUTXBAR0_SD1_FILT1_CMPHZ_SEL<<17) | (MW_OUTPUTXBAR0_SD1_FILT2_CEVT1_SEL<<18) | (MW_OUTPUTXBAR0_SD1_FILT2_CEVT2_SEL<<19) | (MW_OUTPUTXBAR0_SD1_FILT2_CMPHZ_SEL<<20) | (MW_OUTPUTXBAR0_SD1_FILT3_CEVT1_SEL<<21) | (MW_OUTPUTXBAR0_SD1_FILT3_CEVT2_SEL<<22) | (MW_OUTPUTXBAR0_SD1_FILT3_CMPHZ_SEL<<23);
    group6_outputxbar[0] = (MW_OUTPUTXBAR0_CMPSSA0_CTRIPL_SEL<<0) | (MW_OUTPUTXBAR0_CMPSSA0_CTRIPH_SEL<<1) | (MW_OUTPUTXBAR0_CMPSSA1_CTRIPL_SEL<<2) | (MW_OUTPUTXBAR0_CMPSSA1_CTRIPH_SEL<<3) | (MW_OUTPUTXBAR0_CMPSSA2_CTRIPL_SEL<<4) | (MW_OUTPUTXBAR0_CMPSSA2_CTRIPH_SEL<<5) | (MW_OUTPUTXBAR0_CMPSSA3_CTRIPL_SEL<<6) | (MW_OUTPUTXBAR0_CMPSSA3_CTRIPH_SEL<<7) | (MW_OUTPUTXBAR0_CMPSSA4_CTRIPL_SEL<<8) | (MW_OUTPUTXBAR0_CMPSSA4_CTRIPH_SEL<<9) | (MW_OUTPUTXBAR0_CMPSSA5_CTRIPL_SEL<<10) | (MW_OUTPUTXBAR0_CMPSSA5_CTRIPH_SEL<<11) | (MW_OUTPUTXBAR0_CMPSSA6_CTRIPL_SEL<<12) | (MW_OUTPUTXBAR0_CMPSSA6_CTRIPH_SEL<<13) | (MW_OUTPUTXBAR0_CMPSSA7_CTRIPL_SEL<<14) | (MW_OUTPUTXBAR0_CMPSSA7_CTRIPH_SEL<<15) | (MW_OUTPUTXBAR0_CMPSSA8_CTRIPL_SEL<<16) | (MW_OUTPUTXBAR0_CMPSSA8_CTRIPH_SEL<<17) | (MW_OUTPUTXBAR0_CMPSSA9_CTRIPL_SEL<<18) | (MW_OUTPUTXBAR0_CMPSSA9_CTRIPH_SEL<<19);
    group7_outputxbar[0] = (MW_OUTPUTXBAR0_CMPSSB0_CTRIPL_SEL<<0) | (MW_OUTPUTXBAR0_CMPSSB0_CTRIPH_SEL<<1) | (MW_OUTPUTXBAR0_CMPSSB1_CTRIPL_SEL<<2) | (MW_OUTPUTXBAR0_CMPSSB1_CTRIPH_SEL<<3) | (MW_OUTPUTXBAR0_CMPSSB2_CTRIPL_SEL<<4) | (MW_OUTPUTXBAR0_CMPSSB2_CTRIPH_SEL<<5) | (MW_OUTPUTXBAR0_CMPSSB3_CTRIPL_SEL<<6) | (MW_OUTPUTXBAR0_CMPSSB3_CTRIPH_SEL<<7) | (MW_OUTPUTXBAR0_CMPSSB4_CTRIPL_SEL<<8) | (MW_OUTPUTXBAR0_CMPSSB4_CTRIPH_SEL<<9) | (MW_OUTPUTXBAR0_CMPSSB5_CTRIPL_SEL<<10) | (MW_OUTPUTXBAR0_CMPSSB5_CTRIPH_SEL<<11) | (MW_OUTPUTXBAR0_CMPSSB6_CTRIPL_SEL<<12) | (MW_OUTPUTXBAR0_CMPSSB6_CTRIPH_SEL<<13) | (MW_OUTPUTXBAR0_CMPSSB7_CTRIPL_SEL<<14) | (MW_OUTPUTXBAR0_CMPSSB7_CTRIPH_SEL<<15) | (MW_OUTPUTXBAR0_CMPSSB8_CTRIPL_SEL<<16) | (MW_OUTPUTXBAR0_CMPSSB8_CTRIPH_SEL<<17) | (MW_OUTPUTXBAR0_CMPSSB9_CTRIPL_SEL<<18) | (MW_OUTPUTXBAR0_CMPSSB9_CTRIPH_SEL<<19);
    group8_outputxbar[0] = (MW_OUTPUTXBAR0_ADC0_EVT1_SEL<<0) | (MW_OUTPUTXBAR0_ADC0_EVT2_SEL<<1) | (MW_OUTPUTXBAR0_ADC0_EVT3_SEL<<2) | (MW_OUTPUTXBAR0_ADC0_EVT4_SEL<<3) | (MW_OUTPUTXBAR0_ADC1_EVT1_SEL<<4) | (MW_OUTPUTXBAR0_ADC1_EVT2_SEL<<5) | (MW_OUTPUTXBAR0_ADC1_EVT3_SEL<<6) | (MW_OUTPUTXBAR0_ADC1_EVT4_SEL<<7) | (MW_OUTPUTXBAR0_ADC2_EVT1_SEL<<8) | (MW_OUTPUTXBAR0_ADC2_EVT2_SEL<<9) | (MW_OUTPUTXBAR0_ADC2_EVT3_SEL<<10) | (MW_OUTPUTXBAR0_ADC2_EVT4_SEL<<11) | (MW_OUTPUTXBAR0_ADC3_EVT1_SEL<<12) | (MW_OUTPUTXBAR0_ADC3_EVT2_SEL<<13) | (MW_OUTPUTXBAR0_ADC3_EVT3_SEL<<14) | (MW_OUTPUTXBAR0_ADC3_EVT4_SEL<<15) | (MW_OUTPUTXBAR0_ADC4_EVT1_SEL<<16) | (MW_OUTPUTXBAR0_ADC4_EVT2_SEL<<17) | (MW_OUTPUTXBAR0_ADC4_EVT3_SEL<<18) | (MW_OUTPUTXBAR0_ADC4_EVT4_SEL<<19);
    group9_outputxbar[0] = (MW_OUTPUTXBAR0_EPWM0SYNCOUT_INSTANCE_SEL<<0) | ( MW_OUTPUTXBAR0_EPWM1SYNCOUT_INSTANCE_SEL<<1) | ( MW_OUTPUTXBAR0_EPWM2SYNCOUT_INSTANCE_SEL<<2) | ( MW_OUTPUTXBAR0_EPWM3SYNCOUT_INSTANCE_SEL<<3) | (MW_OUTPUTXBAR0_EQEP0_I_OUT_SEL<<4) | (MW_OUTPUTXBAR0_EQEP0_S_OUT_SEL<<5) | (MW_OUTPUTXBAR0_EQEP1_I_OUT_SEL<<6) | (MW_OUTPUTXBAR0_EQEP1_S_OUT_SEL<<7) | (MW_OUTPUTXBAR0_EQEP2_I_OUT_SEL<<8) | (MW_OUTPUTXBAR0_EQEP2_S_OUT_SEL<<9) | (MW_OUTPUTXBAR0_ECAP0_SEL<<10) | (MW_OUTPUTXBAR0_ECAP1_SEL<<11) | (MW_OUTPUTXBAR0_ECAP2_SEL<<12) | (MW_OUTPUTXBAR0_ECAP3_SEL<<13) | (MW_OUTPUTXBAR0_ECAP4_SEL<<14) | (MW_OUTPUTXBAR0_ECAP5_SEL<<15) | (MW_OUTPUTXBAR0_ECAP6_SEL<<16) | (MW_OUTPUTXBAR0_ECAP7_SEL<<17) | (MW_OUTPUTXBAR0_ECAP8_SEL<<18) | (MW_OUTPUTXBAR0_ECAP9_SEL<<19);
    group10_outputxbar[0] =  (MW_OUTPUTXBAR0_FSIRX0_RX_TRIG0_SEL<<0) | (MW_OUTPUTXBAR0_FSIRX0_RX_TRIG1_SEL<<1) | (MW_OUTPUTXBAR0_FSIRX0_RX_TRIG2_SEL<<2) | (MW_OUTPUTXBAR0_FSIRX0_RX_TRIG3_SEL<<3) | (MW_OUTPUTXBAR0_FSIRX1_RX_TRIG0_SEL<<4) | (MW_OUTPUTXBAR0_FSIRX1_RX_TRIG1_SEL<<5) | (MW_OUTPUTXBAR0_FSIRX1_RX_TRIG2_SEL<<6) | (MW_OUTPUTXBAR0_FSIRX1_RX_TRIG3_SEL<<7) | (MW_OUTPUTXBAR0_FSIRX2_RX_TRIG0_SEL<<8) | (MW_OUTPUTXBAR0_FSIRX2_RX_TRIG1_SEL<<9) | (MW_OUTPUTXBAR0_FSIRX2_RX_TRIG2_SEL<<10) | (MW_OUTPUTXBAR0_FSIRX2_RX_TRIG3_SEL<<11) | (MW_OUTPUTXBAR0_FSIRX3_RX_TRIG0_SEL<<12) | (MW_OUTPUTXBAR0_FSIRX3_RX_TRIG1_SEL<<13) | (MW_OUTPUTXBAR0_FSIRX3_RX_TRIG2_SEL<<14) | (MW_OUTPUTXBAR0_FSIRX3_RX_TRIG3_SEL<<15);
    group0_outputxbar[1] = (MW_OUTPUTXBAR1_EPWM0_TRIPOUT_SEL<<0) | (MW_OUTPUTXBAR1_EPWM1_TRIPOUT_SEL<<1) | (MW_OUTPUTXBAR1_EPWM2_TRIPOUT_SEL<<2) | (MW_OUTPUTXBAR1_EPWM3_TRIPOUT_SEL<<3) | (MW_OUTPUTXBAR1_EPWM4_TRIPOUT_SEL<<4) | (MW_OUTPUTXBAR1_EPWM5_TRIPOUT_SEL<<5) | (MW_OUTPUTXBAR1_EPWM6_TRIPOUT_SEL<<6) | (MW_OUTPUTXBAR1_EPWM7_TRIPOUT_SEL<<7) | (MW_OUTPUTXBAR1_EPWM8_TRIPOUT_SEL<<8) | (MW_OUTPUTXBAR1_EPWM9_TRIPOUT_SEL<<9) | (MW_OUTPUTXBAR1_EPWM10_TRIPOUT_SEL<<10) | (MW_OUTPUTXBAR1_EPWM11_TRIPOUT_SEL<<11) | (MW_OUTPUTXBAR1_EPWM12_TRIPOUT_SEL<<12) | (MW_OUTPUTXBAR1_EPWM13_TRIPOUT_SEL<<13) | (MW_OUTPUTXBAR1_EPWM14_TRIPOUT_SEL<<14) | (MW_OUTPUTXBAR1_EPWM15_TRIPOUT_SEL<<15) | (MW_OUTPUTXBAR1_EPWM16_TRIPOUT_SEL<<16) | (MW_OUTPUTXBAR1_EPWM17_TRIPOUT_SEL<<17) | (MW_OUTPUTXBAR1_EPWM18_TRIPOUT_SEL<<18) | (MW_OUTPUTXBAR1_EPWM19_TRIPOUT_SEL<<19) | (MW_OUTPUTXBAR1_EPWM20_TRIPOUT_SEL<<20) | (MW_OUTPUTXBAR1_EPWM21_TRIPOUT_SEL<<21) | (MW_OUTPUTXBAR1_EPWM22_TRIPOUT_SEL<<22) | (MW_OUTPUTXBAR1_EPWM23_TRIPOUT_SEL<<23) | (MW_OUTPUTXBAR1_EPWM24_TRIPOUT_SEL<<24) | (MW_OUTPUTXBAR1_EPWM25_TRIPOUT_SEL<<25) | (MW_OUTPUTXBAR1_EPWM26_TRIPOUT_SEL<<26) | (MW_OUTPUTXBAR1_EPWM27_TRIPOUT_SEL<<27) | (MW_OUTPUTXBAR1_EPWM28_TRIPOUT_SEL<<28) | (MW_OUTPUTXBAR1_EPWM29_TRIPOUT_SEL<<29) | (MW_OUTPUTXBAR1_EPWM30_TRIPOUT_SEL<<30) | (MW_OUTPUTXBAR1_EPWM31_TRIPOUT_SEL<<31);
    group1_outputxbar[1] = (MW_OUTPUTXBAR1_EPWM0_SOCA_SEL<<0) | (MW_OUTPUTXBAR1_EPWM1_SOCA_SEL<<1) | (MW_OUTPUTXBAR1_EPWM2_SOCA_SEL<<2) | (MW_OUTPUTXBAR1_EPWM3_SOCA_SEL<<3) | (MW_OUTPUTXBAR1_EPWM4_SOCA_SEL<<4) | (MW_OUTPUTXBAR1_EPWM5_SOCA_SEL<<5) | (MW_OUTPUTXBAR1_EPWM6_SOCA_SEL<<6) | (MW_OUTPUTXBAR1_EPWM7_SOCA_SEL<<7) | (MW_OUTPUTXBAR1_EPWM8_SOCA_SEL<<8) | (MW_OUTPUTXBAR1_EPWM9_SOCA_SEL<<9) | (MW_OUTPUTXBAR1_EPWM10_SOCA_SEL<<10) | (MW_OUTPUTXBAR1_EPWM11_SOCA_SEL<<11) | (MW_OUTPUTXBAR1_EPWM12_SOCA_SEL<<12) | (MW_OUTPUTXBAR1_EPWM13_SOCA_SEL<<13) | (MW_OUTPUTXBAR1_EPWM14_SOCA_SEL<<14) | (MW_OUTPUTXBAR1_EPWM15_SOCA_SEL<<15) | (MW_OUTPUTXBAR1_EPWM16_SOCA_SEL<<16) | (MW_OUTPUTXBAR1_EPWM17_SOCA_SEL<<17) | (MW_OUTPUTXBAR1_EPWM18_SOCA_SEL<<18) | (MW_OUTPUTXBAR1_EPWM19_SOCA_SEL<<19) | (MW_OUTPUTXBAR1_EPWM20_SOCA_SEL<<20) | (MW_OUTPUTXBAR1_EPWM21_SOCA_SEL<<21) | (MW_OUTPUTXBAR1_EPWM22_SOCA_SEL<<22) | (MW_OUTPUTXBAR1_EPWM23_SOCA_SEL<<23) | (MW_OUTPUTXBAR1_EPWM24_SOCA_SEL<<24) | (MW_OUTPUTXBAR1_EPWM25_SOCA_SEL<<25) | (MW_OUTPUTXBAR1_EPWM26_SOCA_SEL<<26) | (MW_OUTPUTXBAR1_EPWM27_SOCA_SEL<<27) | (MW_OUTPUTXBAR1_EPWM28_SOCA_SEL<<28) | (MW_OUTPUTXBAR1_EPWM29_SOCA_SEL<<29) | (MW_OUTPUTXBAR1_EPWM30_SOCA_SEL<<30) | (MW_OUTPUTXBAR1_EPWM31_SOCA_SEL<<31);
    group2_outputxbar[1] = (MW_OUTPUTXBAR1_EPWM0_SOCB_SEL<<0) | (MW_OUTPUTXBAR1_EPWM1_SOCB_SEL<<1) | (MW_OUTPUTXBAR1_EPWM2_SOCB_SEL<<2) | (MW_OUTPUTXBAR1_EPWM3_SOCB_SEL<<3) | (MW_OUTPUTXBAR1_EPWM4_SOCB_SEL<<4) | (MW_OUTPUTXBAR1_EPWM5_SOCB_SEL<<5) | (MW_OUTPUTXBAR1_EPWM6_SOCB_SEL<<6) | (MW_OUTPUTXBAR1_EPWM7_SOCB_SEL<<7) | (MW_OUTPUTXBAR1_EPWM8_SOCB_SEL<<8) | (MW_OUTPUTXBAR1_EPWM9_SOCB_SEL<<9) | (MW_OUTPUTXBAR1_EPWM10_SOCB_SEL<<10) | (MW_OUTPUTXBAR1_EPWM11_SOCB_SEL<<11) | (MW_OUTPUTXBAR1_EPWM12_SOCB_SEL<<12) | (MW_OUTPUTXBAR1_EPWM13_SOCB_SEL<<13) | (MW_OUTPUTXBAR1_EPWM14_SOCB_SEL<<14) | (MW_OUTPUTXBAR1_EPWM15_SOCB_SEL<<15) | (MW_OUTPUTXBAR1_EPWM16_SOCB_SEL<<16) | (MW_OUTPUTXBAR1_EPWM17_SOCB_SEL<<17) | (MW_OUTPUTXBAR1_EPWM18_SOCB_SEL<<18) | (MW_OUTPUTXBAR1_EPWM19_SOCB_SEL<<19) | (MW_OUTPUTXBAR1_EPWM20_SOCB_SEL<<20) | (MW_OUTPUTXBAR1_EPWM21_SOCB_SEL<<21) | (MW_OUTPUTXBAR1_EPWM22_SOCB_SEL<<22) | (MW_OUTPUTXBAR1_EPWM23_SOCB_SEL<<23) | (MW_OUTPUTXBAR1_EPWM24_SOCB_SEL<<24) | (MW_OUTPUTXBAR1_EPWM25_SOCB_SEL<<25) | (MW_OUTPUTXBAR1_EPWM26_SOCB_SEL<<26) | (MW_OUTPUTXBAR1_EPWM27_SOCB_SEL<<27) | (MW_OUTPUTXBAR1_EPWM28_SOCB_SEL<<28) | (MW_OUTPUTXBAR1_EPWM29_SOCB_SEL<<29) | (MW_OUTPUTXBAR1_EPWM30_SOCB_SEL<<30) | (MW_OUTPUTXBAR1_EPWM31_SOCB_SEL<<31);
    group3_outputxbar[1] = (MW_OUTPUTXBAR1_DEL0_ACTIVE_SEL<<0) | (MW_OUTPUTXBAR1_DEL1_ACTIVE_SEL<<1) | (MW_OUTPUTXBAR1_DEL2_ACTIVE_SEL<<2) | (MW_OUTPUTXBAR1_DEL3_ACTIVE_SEL<<3) | (MW_OUTPUTXBAR1_DEL4_ACTIVE_SEL<<4) | (MW_OUTPUTXBAR1_DEL5_ACTIVE_SEL<<5) | (MW_OUTPUTXBAR1_DEL6_ACTIVE_SEL<<6) | (MW_OUTPUTXBAR1_DEL7_ACTIVE_SEL<<7) | (MW_OUTPUTXBAR1_DEL8_ACTIVE_SEL<<8) | (MW_OUTPUTXBAR1_DEL9_ACTIVE_SEL<<9) | (MW_OUTPUTXBAR1_DEL10_ACTIVE_SEL<<10) | (MW_OUTPUTXBAR1_DEL11_ACTIVE_SEL<<11) | (MW_OUTPUTXBAR1_DEL12_ACTIVE_SEL<<12) | (MW_OUTPUTXBAR1_DEL13_ACTIVE_SEL<<13) | (MW_OUTPUTXBAR1_DEL14_ACTIVE_SEL<<14) | (MW_OUTPUTXBAR1_DEL15_ACTIVE_SEL<<15) | (MW_OUTPUTXBAR1_DEL16_ACTIVE_SEL<<16) | (MW_OUTPUTXBAR1_DEL17_ACTIVE_SEL<<17) | (MW_OUTPUTXBAR1_DEL18_ACTIVE_SEL<<18) | (MW_OUTPUTXBAR1_DEL19_ACTIVE_SEL<<19) | (MW_OUTPUTXBAR1_DEL20_ACTIVE_SEL<<20) | (MW_OUTPUTXBAR1_DEL21_ACTIVE_SEL<<21) | (MW_OUTPUTXBAR1_DEL22_ACTIVE_SEL<<22) | (MW_OUTPUTXBAR1_DEL23_ACTIVE_SEL<<23) | (MW_OUTPUTXBAR1_DEL24_ACTIVE_SEL<<24) | (MW_OUTPUTXBAR1_DEL25_ACTIVE_SEL<<25) | (MW_OUTPUTXBAR1_DEL26_ACTIVE_SEL<<26) | (MW_OUTPUTXBAR1_DEL27_ACTIVE_SEL<<27) | (MW_OUTPUTXBAR1_DEL28_ACTIVE_SEL<<28) | (MW_OUTPUTXBAR1_DEL29_ACTIVE_SEL<<29) | (MW_OUTPUTXBAR1_DEL30_ACTIVE_SEL<<30) | (MW_OUTPUTXBAR1_DEL31_ACTIVE_SEL<<31);
    group4_outputxbar[1] = (MW_OUTPUTXBAR1_DEL0_TRIP_SEL<<0) | (MW_OUTPUTXBAR1_DEL1_TRIP_SEL<<1) | (MW_OUTPUTXBAR1_DEL2_TRIP_SEL<<2) | (MW_OUTPUTXBAR1_DEL3_TRIP_SEL<<3) | (MW_OUTPUTXBAR1_DEL4_TRIP_SEL<<4) | (MW_OUTPUTXBAR1_DEL5_TRIP_SEL<<5) | (MW_OUTPUTXBAR1_DEL6_TRIP_SEL<<6) | (MW_OUTPUTXBAR1_DEL7_TRIP_SEL<<7) | (MW_OUTPUTXBAR1_DEL8_TRIP_SEL<<8) | (MW_OUTPUTXBAR1_DEL9_TRIP_SEL<<9) | (MW_OUTPUTXBAR1_DEL10_TRIP_SEL<<10) | (MW_OUTPUTXBAR1_DEL11_TRIP_SEL<<11) | (MW_OUTPUTXBAR1_DEL12_TRIP_SEL<<12) | (MW_OUTPUTXBAR1_DEL13_TRIP_SEL<<13) | (MW_OUTPUTXBAR1_DEL14_TRIP_SEL<<14) | (MW_OUTPUTXBAR1_DEL15_TRIP_SEL<<15) | (MW_OUTPUTXBAR1_DEL16_TRIP_SEL<<16) | (MW_OUTPUTXBAR1_DEL17_TRIP_SEL<<17) | (MW_OUTPUTXBAR1_DEL18_TRIP_SEL<<18) | (MW_OUTPUTXBAR1_DEL19_TRIP_SEL<<19) | (MW_OUTPUTXBAR1_DEL20_TRIP_SEL<<20) | (MW_OUTPUTXBAR1_DEL21_TRIP_SEL<<21) | (MW_OUTPUTXBAR1_DEL22_TRIP_SEL<<22) | (MW_OUTPUTXBAR1_DEL23_TRIP_SEL<<23) | (MW_OUTPUTXBAR1_DEL24_TRIP_SEL<<24) | (MW_OUTPUTXBAR1_DEL25_TRIP_SEL<<25) | (MW_OUTPUTXBAR1_DEL26_TRIP_SEL<<26) | (MW_OUTPUTXBAR1_DEL27_TRIP_SEL<<27) | (MW_OUTPUTXBAR1_DEL28_TRIP_SEL<<28) | (MW_OUTPUTXBAR1_DEL29_TRIP_SEL<<29) | (MW_OUTPUTXBAR1_DEL30_TRIP_SEL<<30) | (MW_OUTPUTXBAR1_DEL31_TRIP_SEL<<31);
    group5_outputxbar[1] = (MW_OUTPUTXBAR1_SD0_FILT0_CEVT1_SEL<<0) | (MW_OUTPUTXBAR1_SD0_FILT0_CEVT2_SEL<<1) | (MW_OUTPUTXBAR1_SD0_FILT0_CMPHZ_SEL<<2) | (MW_OUTPUTXBAR1_SD0_FILT1_CEVT1_SEL<<3) | (MW_OUTPUTXBAR1_SD0_FILT1_CEVT2_SEL<<4) | (MW_OUTPUTXBAR1_SD0_FILT1_CMPHZ_SEL<<5) | (MW_OUTPUTXBAR1_SD0_FILT2_CEVT1_SEL<<6) | (MW_OUTPUTXBAR1_SD0_FILT2_CEVT2_SEL<<7) | (MW_OUTPUTXBAR1_SD0_FILT2_CMPHZ_SEL<<8) | (MW_OUTPUTXBAR1_SD0_FILT3_CEVT1_SEL<<9) | (MW_OUTPUTXBAR1_SD0_FILT3_CEVT2_SEL<<10) | (MW_OUTPUTXBAR1_SD0_FILT3_CMPHZ_SEL<<11) | (MW_OUTPUTXBAR1_SD1_FILT0_CEVT1_SEL<<12) | (MW_OUTPUTXBAR1_SD1_FILT0_CEVT2_SEL<<13) | (MW_OUTPUTXBAR1_SD1_FILT0_CMPHZ_SEL<<14) | (MW_OUTPUTXBAR1_SD1_FILT1_CEVT1_SEL<<15) | (MW_OUTPUTXBAR1_SD1_FILT1_CEVT2_SEL<<16) | (MW_OUTPUTXBAR1_SD1_FILT1_CMPHZ_SEL<<17) | (MW_OUTPUTXBAR1_SD1_FILT2_CEVT1_SEL<<18) | (MW_OUTPUTXBAR1_SD1_FILT2_CEVT2_SEL<<19) | (MW_OUTPUTXBAR1_SD1_FILT2_CMPHZ_SEL<<20) | (MW_OUTPUTXBAR1_SD1_FILT3_CEVT1_SEL<<21) | (MW_OUTPUTXBAR1_SD1_FILT3_CEVT2_SEL<<22) | (MW_OUTPUTXBAR1_SD1_FILT3_CMPHZ_SEL<<23);
