TexasInstruments/am26x-hsp/src/am263px_init.c
    group6_outputxbar[1] = (MW_OUTPUTXBAR1_CMPSSA0_CTRIPL_SEL<<0) | (MW_OUTPUTXBAR1_CMPSSA0_CTRIPH_SEL<<1) | (MW_OUTPUTXBAR1_CMPSSA1_CTRIPL_SEL<<2) | (MW_OUTPUTXBAR1_CMPSSA1_CTRIPH_SEL<<3) | (MW_OUTPUTXBAR1_CMPSSA2_CTRIPL_SEL<<4) | (MW_OUTPUTXBAR1_CMPSSA2_CTRIPH_SEL<<5) | (MW_OUTPUTXBAR1_CMPSSA3_CTRIPL_SEL<<6) | (MW_OUTPUTXBAR1_CMPSSA3_CTRIPH_SEL<<7) | (MW_OUTPUTXBAR1_CMPSSA4_CTRIPL_SEL<<8) | (MW_OUTPUTXBAR1_CMPSSA4_CTRIPH_SEL<<9) | (MW_OUTPUTXBAR1_CMPSSA5_CTRIPL_SEL<<10) | (MW_OUTPUTXBAR1_CMPSSA5_CTRIPH_SEL<<11) | (MW_OUTPUTXBAR1_CMPSSA6_CTRIPL_SEL<<12) | (MW_OUTPUTXBAR1_CMPSSA6_CTRIPH_SEL<<13) | (MW_OUTPUTXBAR1_CMPSSA7_CTRIPL_SEL<<14) | (MW_OUTPUTXBAR1_CMPSSA7_CTRIPH_SEL<<15) | (MW_OUTPUTXBAR1_CMPSSA8_CTRIPL_SEL<<16) | (MW_OUTPUTXBAR1_CMPSSA8_CTRIPH_SEL<<17) | (MW_OUTPUTXBAR1_CMPSSA9_CTRIPL_SEL<<18) | (MW_OUTPUTXBAR1_CMPSSA9_CTRIPH_SEL<<19);
    group7_outputxbar[1] = (MW_OUTPUTXBAR1_CMPSSB0_CTRIPL_SEL<<0) | (MW_OUTPUTXBAR1_CMPSSB0_CTRIPH_SEL<<1) | (MW_OUTPUTXBAR1_CMPSSB1_CTRIPL_SEL<<2) | (MW_OUTPUTXBAR1_CMPSSB1_CTRIPH_SEL<<3) | (MW_OUTPUTXBAR1_CMPSSB2_CTRIPL_SEL<<4) | (MW_OUTPUTXBAR1_CMPSSB2_CTRIPH_SEL<<5) | (MW_OUTPUTXBAR1_CMPSSB3_CTRIPL_SEL<<6) | (MW_OUTPUTXBAR1_CMPSSB3_CTRIPH_SEL<<7) | (MW_OUTPUTXBAR1_CMPSSB4_CTRIPL_SEL<<8) | (MW_OUTPUTXBAR1_CMPSSB4_CTRIPH_SEL<<9) | (MW_OUTPUTXBAR1_CMPSSB5_CTRIPL_SEL<<10) | (MW_OUTPUTXBAR1_CMPSSB5_CTRIPH_SEL<<11) | (MW_OUTPUTXBAR1_CMPSSB6_CTRIPL_SEL<<12) | (MW_OUTPUTXBAR1_CMPSSB6_CTRIPH_SEL<<13) | (MW_OUTPUTXBAR1_CMPSSB7_CTRIPL_SEL<<14) | (MW_OUTPUTXBAR1_CMPSSB7_CTRIPH_SEL<<15) | (MW_OUTPUTXBAR1_CMPSSB8_CTRIPL_SEL<<16) | (MW_OUTPUTXBAR1_CMPSSB8_CTRIPH_SEL<<17) | (MW_OUTPUTXBAR1_CMPSSB9_CTRIPL_SEL<<18) | (MW_OUTPUTXBAR1_CMPSSB9_CTRIPH_SEL<<19);
    group8_outputxbar[1] = (MW_OUTPUTXBAR1_ADC0_EVT1_SEL<<0) | (MW_OUTPUTXBAR1_ADC0_EVT2_SEL<<1) | (MW_OUTPUTXBAR1_ADC0_EVT3_SEL<<2) | (MW_OUTPUTXBAR1_ADC0_EVT4_SEL<<3) | (MW_OUTPUTXBAR1_ADC1_EVT1_SEL<<4) | (MW_OUTPUTXBAR1_ADC1_EVT2_SEL<<5) | (MW_OUTPUTXBAR1_ADC1_EVT3_SEL<<6) | (MW_OUTPUTXBAR1_ADC1_EVT4_SEL<<7) | (MW_OUTPUTXBAR1_ADC2_EVT1_SEL<<8) | (MW_OUTPUTXBAR1_ADC2_EVT2_SEL<<9) | (MW_OUTPUTXBAR1_ADC2_EVT3_SEL<<10) | (MW_OUTPUTXBAR1_ADC2_EVT4_SEL<<11) | (MW_OUTPUTXBAR1_ADC3_EVT1_SEL<<12) | (MW_OUTPUTXBAR1_ADC3_EVT2_SEL<<13) | (MW_OUTPUTXBAR1_ADC3_EVT3_SEL<<14) | (MW_OUTPUTXBAR1_ADC3_EVT4_SEL<<15) | (MW_OUTPUTXBAR1_ADC4_EVT1_SEL<<16) | (MW_OUTPUTXBAR1_ADC4_EVT2_SEL<<17) | (MW_OUTPUTXBAR1_ADC4_EVT3_SEL<<18) | (MW_OUTPUTXBAR1_ADC4_EVT4_SEL<<19);
    group9_outputxbar[1] = (MW_OUTPUTXBAR1_EPWM0SYNCOUT_INSTANCE_SEL<<0) | ( MW_OUTPUTXBAR1_EPWM1SYNCOUT_INSTANCE_SEL<<1) | ( MW_OUTPUTXBAR1_EPWM2SYNCOUT_INSTANCE_SEL<<2) | ( MW_OUTPUTXBAR1_EPWM3SYNCOUT_INSTANCE_SEL<<3) | (MW_OUTPUTXBAR1_EQEP0_I_OUT_SEL<<4) | (MW_OUTPUTXBAR1_EQEP0_S_OUT_SEL<<5) | (MW_OUTPUTXBAR1_EQEP1_I_OUT_SEL<<6) | (MW_OUTPUTXBAR1_EQEP1_S_OUT_SEL<<7) | (MW_OUTPUTXBAR1_EQEP2_I_OUT_SEL<<8) | (MW_OUTPUTXBAR1_EQEP2_S_OUT_SEL<<9) | (MW_OUTPUTXBAR1_ECAP0_SEL<<10) | (MW_OUTPUTXBAR1_ECAP1_SEL<<11) | (MW_OUTPUTXBAR1_ECAP2_SEL<<12) | (MW_OUTPUTXBAR1_ECAP3_SEL<<13) | (MW_OUTPUTXBAR1_ECAP4_SEL<<14) | (MW_OUTPUTXBAR1_ECAP5_SEL<<15) | (MW_OUTPUTXBAR1_ECAP6_SEL<<16) | (MW_OUTPUTXBAR1_ECAP7_SEL<<17) | (MW_OUTPUTXBAR1_ECAP8_SEL<<18) | (MW_OUTPUTXBAR1_ECAP9_SEL<<19);
    group10_outputxbar[1] =  (MW_OUTPUTXBAR1_FSIRX0_RX_TRIG0_SEL<<0) | (MW_OUTPUTXBAR1_FSIRX0_RX_TRIG1_SEL<<1) | (MW_OUTPUTXBAR1_FSIRX0_RX_TRIG2_SEL<<2) | (MW_OUTPUTXBAR1_FSIRX0_RX_TRIG3_SEL<<3) | (MW_OUTPUTXBAR1_FSIRX1_RX_TRIG0_SEL<<4) | (MW_OUTPUTXBAR1_FSIRX1_RX_TRIG1_SEL<<5) | (MW_OUTPUTXBAR1_FSIRX1_RX_TRIG2_SEL<<6) | (MW_OUTPUTXBAR1_FSIRX1_RX_TRIG3_SEL<<7) | (MW_OUTPUTXBAR1_FSIRX2_RX_TRIG0_SEL<<8) | (MW_OUTPUTXBAR1_FSIRX2_RX_TRIG1_SEL<<9) | (MW_OUTPUTXBAR1_FSIRX2_RX_TRIG2_SEL<<10) | (MW_OUTPUTXBAR1_FSIRX2_RX_TRIG3_SEL<<11) | (MW_OUTPUTXBAR1_FSIRX3_RX_TRIG0_SEL<<12) | (MW_OUTPUTXBAR1_FSIRX3_RX_TRIG1_SEL<<13) | (MW_OUTPUTXBAR1_FSIRX3_RX_TRIG2_SEL<<14) | (MW_OUTPUTXBAR1_FSIRX3_RX_TRIG3_SEL<<15);
    group0_outputxbar[2] = (MW_OUTPUTXBAR2_EPWM0_TRIPOUT_SEL<<0) | (MW_OUTPUTXBAR2_EPWM1_TRIPOUT_SEL<<1) | (MW_OUTPUTXBAR2_EPWM2_TRIPOUT_SEL<<2) | (MW_OUTPUTXBAR2_EPWM3_TRIPOUT_SEL<<3) | (MW_OUTPUTXBAR2_EPWM4_TRIPOUT_SEL<<4) | (MW_OUTPUTXBAR2_EPWM5_TRIPOUT_SEL<<5) | (MW_OUTPUTXBAR2_EPWM6_TRIPOUT_SEL<<6) | (MW_OUTPUTXBAR2_EPWM7_TRIPOUT_SEL<<7) | (MW_OUTPUTXBAR2_EPWM8_TRIPOUT_SEL<<8) | (MW_OUTPUTXBAR2_EPWM9_TRIPOUT_SEL<<9) | (MW_OUTPUTXBAR2_EPWM10_TRIPOUT_SEL<<10) | (MW_OUTPUTXBAR2_EPWM11_TRIPOUT_SEL<<11) | (MW_OUTPUTXBAR2_EPWM12_TRIPOUT_SEL<<12) | (MW_OUTPUTXBAR2_EPWM13_TRIPOUT_SEL<<13) | (MW_OUTPUTXBAR2_EPWM14_TRIPOUT_SEL<<14) | (MW_OUTPUTXBAR2_EPWM15_TRIPOUT_SEL<<15) | (MW_OUTPUTXBAR2_EPWM16_TRIPOUT_SEL<<16) | (MW_OUTPUTXBAR2_EPWM17_TRIPOUT_SEL<<17) | (MW_OUTPUTXBAR2_EPWM18_TRIPOUT_SEL<<18) | (MW_OUTPUTXBAR2_EPWM19_TRIPOUT_SEL<<19) | (MW_OUTPUTXBAR2_EPWM20_TRIPOUT_SEL<<20) | (MW_OUTPUTXBAR2_EPWM21_TRIPOUT_SEL<<21) | (MW_OUTPUTXBAR2_EPWM22_TRIPOUT_SEL<<22) | (MW_OUTPUTXBAR2_EPWM23_TRIPOUT_SEL<<23) | (MW_OUTPUTXBAR2_EPWM24_TRIPOUT_SEL<<24) | (MW_OUTPUTXBAR2_EPWM25_TRIPOUT_SEL<<25) | (MW_OUTPUTXBAR2_EPWM26_TRIPOUT_SEL<<26) | (MW_OUTPUTXBAR2_EPWM27_TRIPOUT_SEL<<27) | (MW_OUTPUTXBAR2_EPWM28_TRIPOUT_SEL<<28) | (MW_OUTPUTXBAR2_EPWM29_TRIPOUT_SEL<<29) | (MW_OUTPUTXBAR2_EPWM30_TRIPOUT_SEL<<30) | (MW_OUTPUTXBAR2_EPWM31_TRIPOUT_SEL<<31);
    group1_outputxbar[2] = (MW_OUTPUTXBAR2_EPWM0_SOCA_SEL<<0) | (MW_OUTPUTXBAR2_EPWM1_SOCA_SEL<<1) | (MW_OUTPUTXBAR2_EPWM2_SOCA_SEL<<2) | (MW_OUTPUTXBAR2_EPWM3_SOCA_SEL<<3) | (MW_OUTPUTXBAR2_EPWM4_SOCA_SEL<<4) | (MW_OUTPUTXBAR2_EPWM5_SOCA_SEL<<5) | (MW_OUTPUTXBAR2_EPWM6_SOCA_SEL<<6) | (MW_OUTPUTXBAR2_EPWM7_SOCA_SEL<<7) | (MW_OUTPUTXBAR2_EPWM8_SOCA_SEL<<8) | (MW_OUTPUTXBAR2_EPWM9_SOCA_SEL<<9) | (MW_OUTPUTXBAR2_EPWM10_SOCA_SEL<<10) | (MW_OUTPUTXBAR2_EPWM11_SOCA_SEL<<11) | (MW_OUTPUTXBAR2_EPWM12_SOCA_SEL<<12) | (MW_OUTPUTXBAR2_EPWM13_SOCA_SEL<<13) | (MW_OUTPUTXBAR2_EPWM14_SOCA_SEL<<14) | (MW_OUTPUTXBAR2_EPWM15_SOCA_SEL<<15) | (MW_OUTPUTXBAR2_EPWM16_SOCA_SEL<<16) | (MW_OUTPUTXBAR2_EPWM17_SOCA_SEL<<17) | (MW_OUTPUTXBAR2_EPWM18_SOCA_SEL<<18) | (MW_OUTPUTXBAR2_EPWM19_SOCA_SEL<<19) | (MW_OUTPUTXBAR2_EPWM20_SOCA_SEL<<20) | (MW_OUTPUTXBAR2_EPWM21_SOCA_SEL<<21) | (MW_OUTPUTXBAR2_EPWM22_SOCA_SEL<<22) | (MW_OUTPUTXBAR2_EPWM23_SOCA_SEL<<23) | (MW_OUTPUTXBAR2_EPWM24_SOCA_SEL<<24) | (MW_OUTPUTXBAR2_EPWM25_SOCA_SEL<<25) | (MW_OUTPUTXBAR2_EPWM26_SOCA_SEL<<26) | (MW_OUTPUTXBAR2_EPWM27_SOCA_SEL<<27) | (MW_OUTPUTXBAR2_EPWM28_SOCA_SEL<<28) | (MW_OUTPUTXBAR2_EPWM29_SOCA_SEL<<29) | (MW_OUTPUTXBAR2_EPWM30_SOCA_SEL<<30) | (MW_OUTPUTXBAR2_EPWM31_SOCA_SEL<<31);
    group2_outputxbar[2] = (MW_OUTPUTXBAR2_EPWM0_SOCB_SEL<<0) | (MW_OUTPUTXBAR2_EPWM1_SOCB_SEL<<1) | (MW_OUTPUTXBAR2_EPWM2_SOCB_SEL<<2) | (MW_OUTPUTXBAR2_EPWM3_SOCB_SEL<<3) | (MW_OUTPUTXBAR2_EPWM4_SOCB_SEL<<4) | (MW_OUTPUTXBAR2_EPWM5_SOCB_SEL<<5) | (MW_OUTPUTXBAR2_EPWM6_SOCB_SEL<<6) | (MW_OUTPUTXBAR2_EPWM7_SOCB_SEL<<7) | (MW_OUTPUTXBAR2_EPWM8_SOCB_SEL<<8) | (MW_OUTPUTXBAR2_EPWM9_SOCB_SEL<<9) | (MW_OUTPUTXBAR2_EPWM10_SOCB_SEL<<10) | (MW_OUTPUTXBAR2_EPWM11_SOCB_SEL<<11) | (MW_OUTPUTXBAR2_EPWM12_SOCB_SEL<<12) | (MW_OUTPUTXBAR2_EPWM13_SOCB_SEL<<13) | (MW_OUTPUTXBAR2_EPWM14_SOCB_SEL<<14) | (MW_OUTPUTXBAR2_EPWM15_SOCB_SEL<<15) | (MW_OUTPUTXBAR2_EPWM16_SOCB_SEL<<16) | (MW_OUTPUTXBAR2_EPWM17_SOCB_SEL<<17) | (MW_OUTPUTXBAR2_EPWM18_SOCB_SEL<<18) | (MW_OUTPUTXBAR2_EPWM19_SOCB_SEL<<19) | (MW_OUTPUTXBAR2_EPWM20_SOCB_SEL<<20) | (MW_OUTPUTXBAR2_EPWM21_SOCB_SEL<<21) | (MW_OUTPUTXBAR2_EPWM22_SOCB_SEL<<22) | (MW_OUTPUTXBAR2_EPWM23_SOCB_SEL<<23) | (MW_OUTPUTXBAR2_EPWM24_SOCB_SEL<<24) | (MW_OUTPUTXBAR2_EPWM25_SOCB_SEL<<25) | (MW_OUTPUTXBAR2_EPWM26_SOCB_SEL<<26) | (MW_OUTPUTXBAR2_EPWM27_SOCB_SEL<<27) | (MW_OUTPUTXBAR2_EPWM28_SOCB_SEL<<28) | (MW_OUTPUTXBAR2_EPWM29_SOCB_SEL<<29) | (MW_OUTPUTXBAR2_EPWM30_SOCB_SEL<<30) | (MW_OUTPUTXBAR2_EPWM31_SOCB_SEL<<31);
    group3_outputxbar[2] = (MW_OUTPUTXBAR2_DEL0_ACTIVE_SEL<<0) | (MW_OUTPUTXBAR2_DEL1_ACTIVE_SEL<<1) | (MW_OUTPUTXBAR2_DEL2_ACTIVE_SEL<<2) | (MW_OUTPUTXBAR2_DEL3_ACTIVE_SEL<<3) | (MW_OUTPUTXBAR2_DEL4_ACTIVE_SEL<<4) | (MW_OUTPUTXBAR2_DEL5_ACTIVE_SEL<<5) | (MW_OUTPUTXBAR2_DEL6_ACTIVE_SEL<<6) | (MW_OUTPUTXBAR2_DEL7_ACTIVE_SEL<<7) | (MW_OUTPUTXBAR2_DEL8_ACTIVE_SEL<<8) | (MW_OUTPUTXBAR2_DEL9_ACTIVE_SEL<<9) | (MW_OUTPUTXBAR2_DEL10_ACTIVE_SEL<<10) | (MW_OUTPUTXBAR2_DEL11_ACTIVE_SEL<<11) | (MW_OUTPUTXBAR2_DEL12_ACTIVE_SEL<<12) | (MW_OUTPUTXBAR2_DEL13_ACTIVE_SEL<<13) | (MW_OUTPUTXBAR2_DEL14_ACTIVE_SEL<<14) | (MW_OUTPUTXBAR2_DEL15_ACTIVE_SEL<<15) | (MW_OUTPUTXBAR2_DEL16_ACTIVE_SEL<<16) | (MW_OUTPUTXBAR2_DEL17_ACTIVE_SEL<<17) | (MW_OUTPUTXBAR2_DEL18_ACTIVE_SEL<<18) | (MW_OUTPUTXBAR2_DEL19_ACTIVE_SEL<<19) | (MW_OUTPUTXBAR2_DEL20_ACTIVE_SEL<<20) | (MW_OUTPUTXBAR2_DEL21_ACTIVE_SEL<<21) | (MW_OUTPUTXBAR2_DEL22_ACTIVE_SEL<<22) | (MW_OUTPUTXBAR2_DEL23_ACTIVE_SEL<<23) | (MW_OUTPUTXBAR2_DEL24_ACTIVE_SEL<<24) | (MW_OUTPUTXBAR2_DEL25_ACTIVE_SEL<<25) | (MW_OUTPUTXBAR2_DEL26_ACTIVE_SEL<<26) | (MW_OUTPUTXBAR2_DEL27_ACTIVE_SEL<<27) | (MW_OUTPUTXBAR2_DEL28_ACTIVE_SEL<<28) | (MW_OUTPUTXBAR2_DEL29_ACTIVE_SEL<<29) | (MW_OUTPUTXBAR2_DEL30_ACTIVE_SEL<<30) | (MW_OUTPUTXBAR2_DEL31_ACTIVE_SEL<<31);
    group4_outputxbar[2] = (MW_OUTPUTXBAR2_DEL0_TRIP_SEL<<0) | (MW_OUTPUTXBAR2_DEL1_TRIP_SEL<<1) | (MW_OUTPUTXBAR2_DEL2_TRIP_SEL<<2) | (MW_OUTPUTXBAR2_DEL3_TRIP_SEL<<3) | (MW_OUTPUTXBAR2_DEL4_TRIP_SEL<<4) | (MW_OUTPUTXBAR2_DEL5_TRIP_SEL<<5) | (MW_OUTPUTXBAR2_DEL6_TRIP_SEL<<6) | (MW_OUTPUTXBAR2_DEL7_TRIP_SEL<<7) | (MW_OUTPUTXBAR2_DEL8_TRIP_SEL<<8) | (MW_OUTPUTXBAR2_DEL9_TRIP_SEL<<9) | (MW_OUTPUTXBAR2_DEL10_TRIP_SEL<<10) | (MW_OUTPUTXBAR2_DEL11_TRIP_SEL<<11) | (MW_OUTPUTXBAR2_DEL12_TRIP_SEL<<12) | (MW_OUTPUTXBAR2_DEL13_TRIP_SEL<<13) | (MW_OUTPUTXBAR2_DEL14_TRIP_SEL<<14) | (MW_OUTPUTXBAR2_DEL15_TRIP_SEL<<15) | (MW_OUTPUTXBAR2_DEL16_TRIP_SEL<<16) | (MW_OUTPUTXBAR2_DEL17_TRIP_SEL<<17) | (MW_OUTPUTXBAR2_DEL18_TRIP_SEL<<18) | (MW_OUTPUTXBAR2_DEL19_TRIP_SEL<<19) | (MW_OUTPUTXBAR2_DEL20_TRIP_SEL<<20) | (MW_OUTPUTXBAR2_DEL21_TRIP_SEL<<21) | (MW_OUTPUTXBAR2_DEL22_TRIP_SEL<<22) | (MW_OUTPUTXBAR2_DEL23_TRIP_SEL<<23) | (MW_OUTPUTXBAR2_DEL24_TRIP_SEL<<24) | (MW_OUTPUTXBAR2_DEL25_TRIP_SEL<<25) | (MW_OUTPUTXBAR2_DEL26_TRIP_SEL<<26) | (MW_OUTPUTXBAR2_DEL27_TRIP_SEL<<27) | (MW_OUTPUTXBAR2_DEL28_TRIP_SEL<<28) | (MW_OUTPUTXBAR2_DEL29_TRIP_SEL<<29) | (MW_OUTPUTXBAR2_DEL30_TRIP_SEL<<30) | (MW_OUTPUTXBAR2_DEL31_TRIP_SEL<<31);
    group5_outputxbar[2] = (MW_OUTPUTXBAR2_SD0_FILT0_CEVT1_SEL<<0) | (MW_OUTPUTXBAR2_SD0_FILT0_CEVT2_SEL<<1) | (MW_OUTPUTXBAR2_SD0_FILT0_CMPHZ_SEL<<2) | (MW_OUTPUTXBAR2_SD0_FILT1_CEVT1_SEL<<3) | (MW_OUTPUTXBAR2_SD0_FILT1_CEVT2_SEL<<4) | (MW_OUTPUTXBAR2_SD0_FILT1_CMPHZ_SEL<<5) | (MW_OUTPUTXBAR2_SD0_FILT2_CEVT1_SEL<<6) | (MW_OUTPUTXBAR2_SD0_FILT2_CEVT2_SEL<<7) | (MW_OUTPUTXBAR2_SD0_FILT2_CMPHZ_SEL<<8) | (MW_OUTPUTXBAR2_SD0_FILT3_CEVT1_SEL<<9) | (MW_OUTPUTXBAR2_SD0_FILT3_CEVT2_SEL<<10) | (MW_OUTPUTXBAR2_SD0_FILT3_CMPHZ_SEL<<11) | (MW_OUTPUTXBAR2_SD1_FILT0_CEVT1_SEL<<12) | (MW_OUTPUTXBAR2_SD1_FILT0_CEVT2_SEL<<13) | (MW_OUTPUTXBAR2_SD1_FILT0_CMPHZ_SEL<<14) | (MW_OUTPUTXBAR2_SD1_FILT1_CEVT1_SEL<<15) | (MW_OUTPUTXBAR2_SD1_FILT1_CEVT2_SEL<<16) | (MW_OUTPUTXBAR2_SD1_FILT1_CMPHZ_SEL<<17) | (MW_OUTPUTXBAR2_SD1_FILT2_CEVT1_SEL<<18) | (MW_OUTPUTXBAR2_SD1_FILT2_CEVT2_SEL<<19) | (MW_OUTPUTXBAR2_SD1_FILT2_CMPHZ_SEL<<20) | (MW_OUTPUTXBAR2_SD1_FILT3_CEVT1_SEL<<21) | (MW_OUTPUTXBAR2_SD1_FILT3_CEVT2_SEL<<22) | (MW_OUTPUTXBAR2_SD1_FILT3_CMPHZ_SEL<<23);
    group6_outputxbar[2] = (MW_OUTPUTXBAR2_CMPSSA0_CTRIPL_SEL<<0) | (MW_OUTPUTXBAR2_CMPSSA0_CTRIPH_SEL<<1) | (MW_OUTPUTXBAR2_CMPSSA1_CTRIPL_SEL<<2) | (MW_OUTPUTXBAR2_CMPSSA1_CTRIPH_SEL<<3) | (MW_OUTPUTXBAR2_CMPSSA2_CTRIPL_SEL<<4) | (MW_OUTPUTXBAR2_CMPSSA2_CTRIPH_SEL<<5) | (MW_OUTPUTXBAR2_CMPSSA3_CTRIPL_SEL<<6) | (MW_OUTPUTXBAR2_CMPSSA3_CTRIPH_SEL<<7) | (MW_OUTPUTXBAR2_CMPSSA4_CTRIPL_SEL<<8) | (MW_OUTPUTXBAR2_CMPSSA4_CTRIPH_SEL<<9) | (MW_OUTPUTXBAR2_CMPSSA5_CTRIPL_SEL<<10) | (MW_OUTPUTXBAR2_CMPSSA5_CTRIPH_SEL<<11) | (MW_OUTPUTXBAR2_CMPSSA6_CTRIPL_SEL<<12) | (MW_OUTPUTXBAR2_CMPSSA6_CTRIPH_SEL<<13) | (MW_OUTPUTXBAR2_CMPSSA7_CTRIPL_SEL<<14) | (MW_OUTPUTXBAR2_CMPSSA7_CTRIPH_SEL<<15) | (MW_OUTPUTXBAR2_CMPSSA8_CTRIPL_SEL<<16) | (MW_OUTPUTXBAR2_CMPSSA8_CTRIPH_SEL<<17) | (MW_OUTPUTXBAR2_CMPSSA9_CTRIPL_SEL<<18) | (MW_OUTPUTXBAR2_CMPSSA9_CTRIPH_SEL<<19);
    group7_outputxbar[2] = (MW_OUTPUTXBAR2_CMPSSB0_CTRIPL_SEL<<0) | (MW_OUTPUTXBAR2_CMPSSB0_CTRIPH_SEL<<1) | (MW_OUTPUTXBAR2_CMPSSB1_CTRIPL_SEL<<2) | (MW_OUTPUTXBAR2_CMPSSB1_CTRIPH_SEL<<3) | (MW_OUTPUTXBAR2_CMPSSB2_CTRIPL_SEL<<4) | (MW_OUTPUTXBAR2_CMPSSB2_CTRIPH_SEL<<5) | (MW_OUTPUTXBAR2_CMPSSB3_CTRIPL_SEL<<6) | (MW_OUTPUTXBAR2_CMPSSB3_CTRIPH_SEL<<7) | (MW_OUTPUTXBAR2_CMPSSB4_CTRIPL_SEL<<8) | (MW_OUTPUTXBAR2_CMPSSB4_CTRIPH_SEL<<9) | (MW_OUTPUTXBAR2_CMPSSB5_CTRIPL_SEL<<10) | (MW_OUTPUTXBAR2_CMPSSB5_CTRIPH_SEL<<11) | (MW_OUTPUTXBAR2_CMPSSB6_CTRIPL_SEL<<12) | (MW_OUTPUTXBAR2_CMPSSB6_CTRIPH_SEL<<13) | (MW_OUTPUTXBAR2_CMPSSB7_CTRIPL_SEL<<14) | (MW_OUTPUTXBAR2_CMPSSB7_CTRIPH_SEL<<15) | (MW_OUTPUTXBAR2_CMPSSB8_CTRIPL_SEL<<16) | (MW_OUTPUTXBAR2_CMPSSB8_CTRIPH_SEL<<17) | (MW_OUTPUTXBAR2_CMPSSB9_CTRIPL_SEL<<18) | (MW_OUTPUTXBAR2_CMPSSB9_CTRIPH_SEL<<19);
    group8_outputxbar[2] = (MW_OUTPUTXBAR2_ADC0_EVT1_SEL<<0) | (MW_OUTPUTXBAR2_ADC0_EVT2_SEL<<1) | (MW_OUTPUTXBAR2_ADC0_EVT3_SEL<<2) | (MW_OUTPUTXBAR2_ADC0_EVT4_SEL<<3) | (MW_OUTPUTXBAR2_ADC1_EVT1_SEL<<4) | (MW_OUTPUTXBAR2_ADC1_EVT2_SEL<<5) | (MW_OUTPUTXBAR2_ADC1_EVT3_SEL<<6) | (MW_OUTPUTXBAR2_ADC1_EVT4_SEL<<7) | (MW_OUTPUTXBAR2_ADC2_EVT1_SEL<<8) | (MW_OUTPUTXBAR2_ADC2_EVT2_SEL<<9) | (MW_OUTPUTXBAR2_ADC2_EVT3_SEL<<10) | (MW_OUTPUTXBAR2_ADC2_EVT4_SEL<<11) | (MW_OUTPUTXBAR2_ADC3_EVT1_SEL<<12) | (MW_OUTPUTXBAR2_ADC3_EVT2_SEL<<13) | (MW_OUTPUTXBAR2_ADC3_EVT3_SEL<<14) | (MW_OUTPUTXBAR2_ADC3_EVT4_SEL<<15) | (MW_OUTPUTXBAR2_ADC4_EVT1_SEL<<16) | (MW_OUTPUTXBAR2_ADC4_EVT2_SEL<<17) | (MW_OUTPUTXBAR2_ADC4_EVT3_SEL<<18) | (MW_OUTPUTXBAR2_ADC4_EVT4_SEL<<19);
    group9_outputxbar[2] = (MW_OUTPUTXBAR2_EPWM0SYNCOUT_INSTANCE_SEL<<0) | ( MW_OUTPUTXBAR2_EPWM1SYNCOUT_INSTANCE_SEL<<1) | ( MW_OUTPUTXBAR2_EPWM2SYNCOUT_INSTANCE_SEL<<2) | ( MW_OUTPUTXBAR2_EPWM3SYNCOUT_INSTANCE_SEL<<3) | (MW_OUTPUTXBAR2_EQEP0_I_OUT_SEL<<4) | (MW_OUTPUTXBAR2_EQEP0_S_OUT_SEL<<5) | (MW_OUTPUTXBAR2_EQEP1_I_OUT_SEL<<6) | (MW_OUTPUTXBAR2_EQEP1_S_OUT_SEL<<7) | (MW_OUTPUTXBAR2_EQEP2_I_OUT_SEL<<8) | (MW_OUTPUTXBAR2_EQEP2_S_OUT_SEL<<9) | (MW_OUTPUTXBAR2_ECAP0_SEL<<10) | (MW_OUTPUTXBAR2_ECAP1_SEL<<11) | (MW_OUTPUTXBAR2_ECAP2_SEL<<12) | (MW_OUTPUTXBAR2_ECAP3_SEL<<13) | (MW_OUTPUTXBAR2_ECAP4_SEL<<14) | (MW_OUTPUTXBAR2_ECAP5_SEL<<15) | (MW_OUTPUTXBAR2_ECAP6_SEL<<16) | (MW_OUTPUTXBAR2_ECAP7_SEL<<17) | (MW_OUTPUTXBAR2_ECAP8_SEL<<18) | (MW_OUTPUTXBAR2_ECAP9_SEL<<19);
    group10_outputxbar[2] =  (MW_OUTPUTXBAR2_FSIRX0_RX_TRIG0_SEL<<0) | (MW_OUTPUTXBAR2_FSIRX0_RX_TRIG1_SEL<<1) | (MW_OUTPUTXBAR2_FSIRX0_RX_TRIG2_SEL<<2) | (MW_OUTPUTXBAR2_FSIRX0_RX_TRIG3_SEL<<3) | (MW_OUTPUTXBAR2_FSIRX1_RX_TRIG0_SEL<<4) | (MW_OUTPUTXBAR2_FSIRX1_RX_TRIG1_SEL<<5) | (MW_OUTPUTXBAR2_FSIRX1_RX_TRIG2_SEL<<6) | (MW_OUTPUTXBAR2_FSIRX1_RX_TRIG3_SEL<<7) | (MW_OUTPUTXBAR2_FSIRX2_RX_TRIG0_SEL<<8) | (MW_OUTPUTXBAR2_FSIRX2_RX_TRIG1_SEL<<9) | (MW_OUTPUTXBAR2_FSIRX2_RX_TRIG2_SEL<<10) | (MW_OUTPUTXBAR2_FSIRX2_RX_TRIG3_SEL<<11) | (MW_OUTPUTXBAR2_FSIRX3_RX_TRIG0_SEL<<12) | (MW_OUTPUTXBAR2_FSIRX3_RX_TRIG1_SEL<<13) | (MW_OUTPUTXBAR2_FSIRX3_RX_TRIG2_SEL<<14) | (MW_OUTPUTXBAR2_FSIRX3_RX_TRIG3_SEL<<15);
    group0_outputxbar[3] = (MW_OUTPUTXBAR3_EPWM0_TRIPOUT_SEL<<0) | (MW_OUTPUTXBAR3_EPWM1_TRIPOUT_SEL<<1) | (MW_OUTPUTXBAR3_EPWM2_TRIPOUT_SEL<<2) | (MW_OUTPUTXBAR3_EPWM3_TRIPOUT_SEL<<3) | (MW_OUTPUTXBAR3_EPWM4_TRIPOUT_SEL<<4) | (MW_OUTPUTXBAR3_EPWM5_TRIPOUT_SEL<<5) | (MW_OUTPUTXBAR3_EPWM6_TRIPOUT_SEL<<6) | (MW_OUTPUTXBAR3_EPWM7_TRIPOUT_SEL<<7) | (MW_OUTPUTXBAR3_EPWM8_TRIPOUT_SEL<<8) | (MW_OUTPUTXBAR3_EPWM9_TRIPOUT_SEL<<9) | (MW_OUTPUTXBAR3_EPWM10_TRIPOUT_SEL<<10) | (MW_OUTPUTXBAR3_EPWM11_TRIPOUT_SEL<<11) | (MW_OUTPUTXBAR3_EPWM12_TRIPOUT_SEL<<12) | (MW_OUTPUTXBAR3_EPWM13_TRIPOUT_SEL<<13) | (MW_OUTPUTXBAR3_EPWM14_TRIPOUT_SEL<<14) | (MW_OUTPUTXBAR3_EPWM15_TRIPOUT_SEL<<15) | (MW_OUTPUTXBAR3_EPWM16_TRIPOUT_SEL<<16) | (MW_OUTPUTXBAR3_EPWM17_TRIPOUT_SEL<<17) | (MW_OUTPUTXBAR3_EPWM18_TRIPOUT_SEL<<18) | (MW_OUTPUTXBAR3_EPWM19_TRIPOUT_SEL<<19) | (MW_OUTPUTXBAR3_EPWM20_TRIPOUT_SEL<<20) | (MW_OUTPUTXBAR3_EPWM21_TRIPOUT_SEL<<21) | (MW_OUTPUTXBAR3_EPWM22_TRIPOUT_SEL<<22) | (MW_OUTPUTXBAR3_EPWM23_TRIPOUT_SEL<<23) | (MW_OUTPUTXBAR3_EPWM24_TRIPOUT_SEL<<24) | (MW_OUTPUTXBAR3_EPWM25_TRIPOUT_SEL<<25) | (MW_OUTPUTXBAR3_EPWM26_TRIPOUT_SEL<<26) | (MW_OUTPUTXBAR3_EPWM27_TRIPOUT_SEL<<27) | (MW_OUTPUTXBAR3_EPWM28_TRIPOUT_SEL<<28) | (MW_OUTPUTXBAR3_EPWM29_TRIPOUT_SEL<<29) | (MW_OUTPUTXBAR3_EPWM30_TRIPOUT_SEL<<30) | (MW_OUTPUTXBAR3_EPWM31_TRIPOUT_SEL<<31);
    group1_outputxbar[3] = (MW_OUTPUTXBAR3_EPWM0_SOCA_SEL<<0) | (MW_OUTPUTXBAR3_EPWM1_SOCA_SEL<<1) | (MW_OUTPUTXBAR3_EPWM2_SOCA_SEL<<2) | (MW_OUTPUTXBAR3_EPWM3_SOCA_SEL<<3) | (MW_OUTPUTXBAR3_EPWM4_SOCA_SEL<<4) | (MW_OUTPUTXBAR3_EPWM5_SOCA_SEL<<5) | (MW_OUTPUTXBAR3_EPWM6_SOCA_SEL<<6) | (MW_OUTPUTXBAR3_EPWM7_SOCA_SEL<<7) | (MW_OUTPUTXBAR3_EPWM8_SOCA_SEL<<8) | (MW_OUTPUTXBAR3_EPWM9_SOCA_SEL<<9) | (MW_OUTPUTXBAR3_EPWM10_SOCA_SEL<<10) | (MW_OUTPUTXBAR3_EPWM11_SOCA_SEL<<11) | (MW_OUTPUTXBAR3_EPWM12_SOCA_SEL<<12) | (MW_OUTPUTXBAR3_EPWM13_SOCA_SEL<<13) | (MW_OUTPUTXBAR3_EPWM14_SOCA_SEL<<14) | (MW_OUTPUTXBAR3_EPWM15_SOCA_SEL<<15) | (MW_OUTPUTXBAR3_EPWM16_SOCA_SEL<<16) | (MW_OUTPUTXBAR3_EPWM17_SOCA_SEL<<17) | (MW_OUTPUTXBAR3_EPWM18_SOCA_SEL<<18) | (MW_OUTPUTXBAR3_EPWM19_SOCA_SEL<<19) | (MW_OUTPUTXBAR3_EPWM20_SOCA_SEL<<20) | (MW_OUTPUTXBAR3_EPWM21_SOCA_SEL<<21) | (MW_OUTPUTXBAR3_EPWM22_SOCA_SEL<<22) | (MW_OUTPUTXBAR3_EPWM23_SOCA_SEL<<23) | (MW_OUTPUTXBAR3_EPWM24_SOCA_SEL<<24) | (MW_OUTPUTXBAR3_EPWM25_SOCA_SEL<<25) | (MW_OUTPUTXBAR3_EPWM26_SOCA_SEL<<26) | (MW_OUTPUTXBAR3_EPWM27_SOCA_SEL<<27) | (MW_OUTPUTXBAR3_EPWM28_SOCA_SEL<<28) | (MW_OUTPUTXBAR3_EPWM29_SOCA_SEL<<29) | (MW_OUTPUTXBAR3_EPWM30_SOCA_SEL<<30) | (MW_OUTPUTXBAR3_EPWM31_SOCA_SEL<<31);
    group2_outputxbar[3] = (MW_OUTPUTXBAR3_EPWM0_SOCB_SEL<<0) | (MW_OUTPUTXBAR3_EPWM1_SOCB_SEL<<1) | (MW_OUTPUTXBAR3_EPWM2_SOCB_SEL<<2) | (MW_OUTPUTXBAR3_EPWM3_SOCB_SEL<<3) | (MW_OUTPUTXBAR3_EPWM4_SOCB_SEL<<4) | (MW_OUTPUTXBAR3_EPWM5_SOCB_SEL<<5) | (MW_OUTPUTXBAR3_EPWM6_SOCB_SEL<<6) | (MW_OUTPUTXBAR3_EPWM7_SOCB_SEL<<7) | (MW_OUTPUTXBAR3_EPWM8_SOCB_SEL<<8) | (MW_OUTPUTXBAR3_EPWM9_SOCB_SEL<<9) | (MW_OUTPUTXBAR3_EPWM10_SOCB_SEL<<10) | (MW_OUTPUTXBAR3_EPWM11_SOCB_SEL<<11) | (MW_OUTPUTXBAR3_EPWM12_SOCB_SEL<<12) | (MW_OUTPUTXBAR3_EPWM13_SOCB_SEL<<13) | (MW_OUTPUTXBAR3_EPWM14_SOCB_SEL<<14) | (MW_OUTPUTXBAR3_EPWM15_SOCB_SEL<<15) | (MW_OUTPUTXBAR3_EPWM16_SOCB_SEL<<16) | (MW_OUTPUTXBAR3_EPWM17_SOCB_SEL<<17) | (MW_OUTPUTXBAR3_EPWM18_SOCB_SEL<<18) | (MW_OUTPUTXBAR3_EPWM19_SOCB_SEL<<19) | (MW_OUTPUTXBAR3_EPWM20_SOCB_SEL<<20) | (MW_OUTPUTXBAR3_EPWM21_SOCB_SEL<<21) | (MW_OUTPUTXBAR3_EPWM22_SOCB_SEL<<22) | (MW_OUTPUTXBAR3_EPWM23_SOCB_SEL<<23) | (MW_OUTPUTXBAR3_EPWM24_SOCB_SEL<<24) | (MW_OUTPUTXBAR3_EPWM25_SOCB_SEL<<25) | (MW_OUTPUTXBAR3_EPWM26_SOCB_SEL<<26) | (MW_OUTPUTXBAR3_EPWM27_SOCB_SEL<<27) | (MW_OUTPUTXBAR3_EPWM28_SOCB_SEL<<28) | (MW_OUTPUTXBAR3_EPWM29_SOCB_SEL<<29) | (MW_OUTPUTXBAR3_EPWM30_SOCB_SEL<<30) | (MW_OUTPUTXBAR3_EPWM31_SOCB_SEL<<31);
    group3_outputxbar[3] = (MW_OUTPUTXBAR3_DEL0_ACTIVE_SEL<<0) | (MW_OUTPUTXBAR3_DEL1_ACTIVE_SEL<<1) | (MW_OUTPUTXBAR3_DEL2_ACTIVE_SEL<<2) | (MW_OUTPUTXBAR3_DEL3_ACTIVE_SEL<<3) | (MW_OUTPUTXBAR3_DEL4_ACTIVE_SEL<<4) | (MW_OUTPUTXBAR3_DEL5_ACTIVE_SEL<<5) | (MW_OUTPUTXBAR3_DEL6_ACTIVE_SEL<<6) | (MW_OUTPUTXBAR3_DEL7_ACTIVE_SEL<<7) | (MW_OUTPUTXBAR3_DEL8_ACTIVE_SEL<<8) | (MW_OUTPUTXBAR3_DEL9_ACTIVE_SEL<<9) | (MW_OUTPUTXBAR3_DEL10_ACTIVE_SEL<<10) | (MW_OUTPUTXBAR3_DEL11_ACTIVE_SEL<<11) | (MW_OUTPUTXBAR3_DEL12_ACTIVE_SEL<<12) | (MW_OUTPUTXBAR3_DEL13_ACTIVE_SEL<<13) | (MW_OUTPUTXBAR3_DEL14_ACTIVE_SEL<<14) | (MW_OUTPUTXBAR3_DEL15_ACTIVE_SEL<<15) | (MW_OUTPUTXBAR3_DEL16_ACTIVE_SEL<<16) | (MW_OUTPUTXBAR3_DEL17_ACTIVE_SEL<<17) | (MW_OUTPUTXBAR3_DEL18_ACTIVE_SEL<<18) | (MW_OUTPUTXBAR3_DEL19_ACTIVE_SEL<<19) | (MW_OUTPUTXBAR3_DEL20_ACTIVE_SEL<<20) | (MW_OUTPUTXBAR3_DEL21_ACTIVE_SEL<<21) | (MW_OUTPUTXBAR3_DEL22_ACTIVE_SEL<<22) | (MW_OUTPUTXBAR3_DEL23_ACTIVE_SEL<<23) | (MW_OUTPUTXBAR3_DEL24_ACTIVE_SEL<<24) | (MW_OUTPUTXBAR3_DEL25_ACTIVE_SEL<<25) | (MW_OUTPUTXBAR3_DEL26_ACTIVE_SEL<<26) | (MW_OUTPUTXBAR3_DEL27_ACTIVE_SEL<<27) | (MW_OUTPUTXBAR3_DEL28_ACTIVE_SEL<<28) | (MW_OUTPUTXBAR3_DEL29_ACTIVE_SEL<<29) | (MW_OUTPUTXBAR3_DEL30_ACTIVE_SEL<<30) | (MW_OUTPUTXBAR3_DEL31_ACTIVE_SEL<<31);
    group4_outputxbar[3] = (MW_OUTPUTXBAR3_DEL0_TRIP_SEL<<0) | (MW_OUTPUTXBAR3_DEL1_TRIP_SEL<<1) | (MW_OUTPUTXBAR3_DEL2_TRIP_SEL<<2) | (MW_OUTPUTXBAR3_DEL3_TRIP_SEL<<3) | (MW_OUTPUTXBAR3_DEL4_TRIP_SEL<<4) | (MW_OUTPUTXBAR3_DEL5_TRIP_SEL<<5) | (MW_OUTPUTXBAR3_DEL6_TRIP_SEL<<6) | (MW_OUTPUTXBAR3_DEL7_TRIP_SEL<<7) | (MW_OUTPUTXBAR3_DEL8_TRIP_SEL<<8) | (MW_OUTPUTXBAR3_DEL9_TRIP_SEL<<9) | (MW_OUTPUTXBAR3_DEL10_TRIP_SEL<<10) | (MW_OUTPUTXBAR3_DEL11_TRIP_SEL<<11) | (MW_OUTPUTXBAR3_DEL12_TRIP_SEL<<12) | (MW_OUTPUTXBAR3_DEL13_TRIP_SEL<<13) | (MW_OUTPUTXBAR3_DEL14_TRIP_SEL<<14) | (MW_OUTPUTXBAR3_DEL15_TRIP_SEL<<15) | (MW_OUTPUTXBAR3_DEL16_TRIP_SEL<<16) | (MW_OUTPUTXBAR3_DEL17_TRIP_SEL<<17) | (MW_OUTPUTXBAR3_DEL18_TRIP_SEL<<18) | (MW_OUTPUTXBAR3_DEL19_TRIP_SEL<<19) | (MW_OUTPUTXBAR3_DEL20_TRIP_SEL<<20) | (MW_OUTPUTXBAR3_DEL21_TRIP_SEL<<21) | (MW_OUTPUTXBAR3_DEL22_TRIP_SEL<<22) | (MW_OUTPUTXBAR3_DEL23_TRIP_SEL<<23) | (MW_OUTPUTXBAR3_DEL24_TRIP_SEL<<24) | (MW_OUTPUTXBAR3_DEL25_TRIP_SEL<<25) | (MW_OUTPUTXBAR3_DEL26_TRIP_SEL<<26) | (MW_OUTPUTXBAR3_DEL27_TRIP_SEL<<27) | (MW_OUTPUTXBAR3_DEL28_TRIP_SEL<<28) | (MW_OUTPUTXBAR3_DEL29_TRIP_SEL<<29) | (MW_OUTPUTXBAR3_DEL30_TRIP_SEL<<30) | (MW_OUTPUTXBAR3_DEL31_TRIP_SEL<<31);
    group5_outputxbar[3] = (MW_OUTPUTXBAR3_SD0_FILT0_CEVT1_SEL<<0) | (MW_OUTPUTXBAR3_SD0_FILT0_CEVT2_SEL<<1) | (MW_OUTPUTXBAR3_SD0_FILT0_CMPHZ_SEL<<2) | (MW_OUTPUTXBAR3_SD0_FILT1_CEVT1_SEL<<3) | (MW_OUTPUTXBAR3_SD0_FILT1_CEVT2_SEL<<4) | (MW_OUTPUTXBAR3_SD0_FILT1_CMPHZ_SEL<<5) | (MW_OUTPUTXBAR3_SD0_FILT2_CEVT1_SEL<<6) | (MW_OUTPUTXBAR3_SD0_FILT2_CEVT2_SEL<<7) | (MW_OUTPUTXBAR3_SD0_FILT2_CMPHZ_SEL<<8) | (MW_OUTPUTXBAR3_SD0_FILT3_CEVT1_SEL<<9) | (MW_OUTPUTXBAR3_SD0_FILT3_CEVT2_SEL<<10) | (MW_OUTPUTXBAR3_SD0_FILT3_CMPHZ_SEL<<11) | (MW_OUTPUTXBAR3_SD1_FILT0_CEVT1_SEL<<12) | (MW_OUTPUTXBAR3_SD1_FILT0_CEVT2_SEL<<13) | (MW_OUTPUTXBAR3_SD1_FILT0_CMPHZ_SEL<<14) | (MW_OUTPUTXBAR3_SD1_FILT1_CEVT1_SEL<<15) | (MW_OUTPUTXBAR3_SD1_FILT1_CEVT2_SEL<<16) | (MW_OUTPUTXBAR3_SD1_FILT1_CMPHZ_SEL<<17) | (MW_OUTPUTXBAR3_SD1_FILT2_CEVT1_SEL<<18) | (MW_OUTPUTXBAR3_SD1_FILT2_CEVT2_SEL<<19) | (MW_OUTPUTXBAR3_SD1_FILT2_CMPHZ_SEL<<20) | (MW_OUTPUTXBAR3_SD1_FILT3_CEVT1_SEL<<21) | (MW_OUTPUTXBAR3_SD1_FILT3_CEVT2_SEL<<22) | (MW_OUTPUTXBAR3_SD1_FILT3_CMPHZ_SEL<<23);
    group6_outputxbar[3] = (MW_OUTPUTXBAR3_CMPSSA0_CTRIPL_SEL<<0) | (MW_OUTPUTXBAR3_CMPSSA0_CTRIPH_SEL<<1) | (MW_OUTPUTXBAR3_CMPSSA1_CTRIPL_SEL<<2) | (MW_OUTPUTXBAR3_CMPSSA1_CTRIPH_SEL<<3) | (MW_OUTPUTXBAR3_CMPSSA2_CTRIPL_SEL<<4) | (MW_OUTPUTXBAR3_CMPSSA2_CTRIPH_SEL<<5) | (MW_OUTPUTXBAR3_CMPSSA3_CTRIPL_SEL<<6) | (MW_OUTPUTXBAR3_CMPSSA3_CTRIPH_SEL<<7) | (MW_OUTPUTXBAR3_CMPSSA4_CTRIPL_SEL<<8) | (MW_OUTPUTXBAR3_CMPSSA4_CTRIPH_SEL<<9) | (MW_OUTPUTXBAR3_CMPSSA5_CTRIPL_SEL<<10) | (MW_OUTPUTXBAR3_CMPSSA5_CTRIPH_SEL<<11) | (MW_OUTPUTXBAR3_CMPSSA6_CTRIPL_SEL<<12) | (MW_OUTPUTXBAR3_CMPSSA6_CTRIPH_SEL<<13) | (MW_OUTPUTXBAR3_CMPSSA7_CTRIPL_SEL<<14) | (MW_OUTPUTXBAR3_CMPSSA7_CTRIPH_SEL<<15) | (MW_OUTPUTXBAR3_CMPSSA8_CTRIPL_SEL<<16) | (MW_OUTPUTXBAR3_CMPSSA8_CTRIPH_SEL<<17) | (MW_OUTPUTXBAR3_CMPSSA9_CTRIPL_SEL<<18) | (MW_OUTPUTXBAR3_CMPSSA9_CTRIPH_SEL<<19);
