TexasInstruments/am26x-hsp/src/am263px_init.c
    group9_outputxbar[7] = (MW_OUTPUTXBAR7_EPWM0SYNCOUT_INSTANCE_SEL<<0) | ( MW_OUTPUTXBAR7_EPWM1SYNCOUT_INSTANCE_SEL<<1) | ( MW_OUTPUTXBAR7_EPWM2SYNCOUT_INSTANCE_SEL<<2) | ( MW_OUTPUTXBAR7_EPWM3SYNCOUT_INSTANCE_SEL<<3) | (MW_OUTPUTXBAR7_EQEP0_I_OUT_SEL<<4) | (MW_OUTPUTXBAR7_EQEP0_S_OUT_SEL<<5) | (MW_OUTPUTXBAR7_EQEP1_I_OUT_SEL<<6) | (MW_OUTPUTXBAR7_EQEP1_S_OUT_SEL<<7) | (MW_OUTPUTXBAR7_EQEP2_I_OUT_SEL<<8) | (MW_OUTPUTXBAR7_EQEP2_S_OUT_SEL<<9) | (MW_OUTPUTXBAR7_ECAP0_SEL<<10) | (MW_OUTPUTXBAR7_ECAP1_SEL<<11) | (MW_OUTPUTXBAR7_ECAP2_SEL<<12) | (MW_OUTPUTXBAR7_ECAP3_SEL<<13) | (MW_OUTPUTXBAR7_ECAP4_SEL<<14) | (MW_OUTPUTXBAR7_ECAP5_SEL<<15) | (MW_OUTPUTXBAR7_ECAP6_SEL<<16) | (MW_OUTPUTXBAR7_ECAP7_SEL<<17) | (MW_OUTPUTXBAR7_ECAP8_SEL<<18) | (MW_OUTPUTXBAR7_ECAP9_SEL<<19);
    group10_outputxbar[7] =  (MW_OUTPUTXBAR7_FSIRX0_RX_TRIG0_SEL<<0) | (MW_OUTPUTXBAR7_FSIRX0_RX_TRIG1_SEL<<1) | (MW_OUTPUTXBAR7_FSIRX0_RX_TRIG2_SEL<<2) | (MW_OUTPUTXBAR7_FSIRX0_RX_TRIG3_SEL<<3) | (MW_OUTPUTXBAR7_FSIRX1_RX_TRIG0_SEL<<4) | (MW_OUTPUTXBAR7_FSIRX1_RX_TRIG1_SEL<<5) | (MW_OUTPUTXBAR7_FSIRX1_RX_TRIG2_SEL<<6) | (MW_OUTPUTXBAR7_FSIRX1_RX_TRIG3_SEL<<7) | (MW_OUTPUTXBAR7_FSIRX2_RX_TRIG0_SEL<<8) | (MW_OUTPUTXBAR7_FSIRX2_RX_TRIG1_SEL<<9) | (MW_OUTPUTXBAR7_FSIRX2_RX_TRIG2_SEL<<10) | (MW_OUTPUTXBAR7_FSIRX2_RX_TRIG3_SEL<<11) | (MW_OUTPUTXBAR7_FSIRX3_RX_TRIG0_SEL<<12) | (MW_OUTPUTXBAR7_FSIRX3_RX_TRIG1_SEL<<13) | (MW_OUTPUTXBAR7_FSIRX3_RX_TRIG2_SEL<<14) | (MW_OUTPUTXBAR7_FSIRX3_RX_TRIG3_SEL<<15);
    group0_outputxbar[8] = (MW_OUTPUTXBAR8_EPWM0_TRIPOUT_SEL<<0) | (MW_OUTPUTXBAR8_EPWM1_TRIPOUT_SEL<<1) | (MW_OUTPUTXBAR8_EPWM2_TRIPOUT_SEL<<2) | (MW_OUTPUTXBAR8_EPWM3_TRIPOUT_SEL<<3) | (MW_OUTPUTXBAR8_EPWM4_TRIPOUT_SEL<<4) | (MW_OUTPUTXBAR8_EPWM5_TRIPOUT_SEL<<5) | (MW_OUTPUTXBAR8_EPWM6_TRIPOUT_SEL<<6) | (MW_OUTPUTXBAR8_EPWM7_TRIPOUT_SEL<<7) | (MW_OUTPUTXBAR8_EPWM8_TRIPOUT_SEL<<8) | (MW_OUTPUTXBAR8_EPWM9_TRIPOUT_SEL<<9) | (MW_OUTPUTXBAR8_EPWM10_TRIPOUT_SEL<<10) | (MW_OUTPUTXBAR8_EPWM11_TRIPOUT_SEL<<11) | (MW_OUTPUTXBAR8_EPWM12_TRIPOUT_SEL<<12) | (MW_OUTPUTXBAR8_EPWM13_TRIPOUT_SEL<<13) | (MW_OUTPUTXBAR8_EPWM14_TRIPOUT_SEL<<14) | (MW_OUTPUTXBAR8_EPWM15_TRIPOUT_SEL<<15) | (MW_OUTPUTXBAR8_EPWM16_TRIPOUT_SEL<<16) | (MW_OUTPUTXBAR8_EPWM17_TRIPOUT_SEL<<17) | (MW_OUTPUTXBAR8_EPWM18_TRIPOUT_SEL<<18) | (MW_OUTPUTXBAR8_EPWM19_TRIPOUT_SEL<<19) | (MW_OUTPUTXBAR8_EPWM20_TRIPOUT_SEL<<20) | (MW_OUTPUTXBAR8_EPWM21_TRIPOUT_SEL<<21) | (MW_OUTPUTXBAR8_EPWM22_TRIPOUT_SEL<<22) | (MW_OUTPUTXBAR8_EPWM23_TRIPOUT_SEL<<23) | (MW_OUTPUTXBAR8_EPWM24_TRIPOUT_SEL<<24) | (MW_OUTPUTXBAR8_EPWM25_TRIPOUT_SEL<<25) | (MW_OUTPUTXBAR8_EPWM26_TRIPOUT_SEL<<26) | (MW_OUTPUTXBAR8_EPWM27_TRIPOUT_SEL<<27) | (MW_OUTPUTXBAR8_EPWM28_TRIPOUT_SEL<<28) | (MW_OUTPUTXBAR8_EPWM29_TRIPOUT_SEL<<29) | (MW_OUTPUTXBAR8_EPWM30_TRIPOUT_SEL<<30) | (MW_OUTPUTXBAR8_EPWM31_TRIPOUT_SEL<<31);
    group1_outputxbar[8] = (MW_OUTPUTXBAR8_EPWM0_SOCA_SEL<<0) | (MW_OUTPUTXBAR8_EPWM1_SOCA_SEL<<1) | (MW_OUTPUTXBAR8_EPWM2_SOCA_SEL<<2) | (MW_OUTPUTXBAR8_EPWM3_SOCA_SEL<<3) | (MW_OUTPUTXBAR8_EPWM4_SOCA_SEL<<4) | (MW_OUTPUTXBAR8_EPWM5_SOCA_SEL<<5) | (MW_OUTPUTXBAR8_EPWM6_SOCA_SEL<<6) | (MW_OUTPUTXBAR8_EPWM7_SOCA_SEL<<7) | (MW_OUTPUTXBAR8_EPWM8_SOCA_SEL<<8) | (MW_OUTPUTXBAR8_EPWM9_SOCA_SEL<<9) | (MW_OUTPUTXBAR8_EPWM10_SOCA_SEL<<10) | (MW_OUTPUTXBAR8_EPWM11_SOCA_SEL<<11) | (MW_OUTPUTXBAR8_EPWM12_SOCA_SEL<<12) | (MW_OUTPUTXBAR8_EPWM13_SOCA_SEL<<13) | (MW_OUTPUTXBAR8_EPWM14_SOCA_SEL<<14) | (MW_OUTPUTXBAR8_EPWM15_SOCA_SEL<<15) | (MW_OUTPUTXBAR8_EPWM16_SOCA_SEL<<16) | (MW_OUTPUTXBAR8_EPWM17_SOCA_SEL<<17) | (MW_OUTPUTXBAR8_EPWM18_SOCA_SEL<<18) | (MW_OUTPUTXBAR8_EPWM19_SOCA_SEL<<19) | (MW_OUTPUTXBAR8_EPWM20_SOCA_SEL<<20) | (MW_OUTPUTXBAR8_EPWM21_SOCA_SEL<<21) | (MW_OUTPUTXBAR8_EPWM22_SOCA_SEL<<22) | (MW_OUTPUTXBAR8_EPWM23_SOCA_SEL<<23) | (MW_OUTPUTXBAR8_EPWM24_SOCA_SEL<<24) | (MW_OUTPUTXBAR8_EPWM25_SOCA_SEL<<25) | (MW_OUTPUTXBAR8_EPWM26_SOCA_SEL<<26) | (MW_OUTPUTXBAR8_EPWM27_SOCA_SEL<<27) | (MW_OUTPUTXBAR8_EPWM28_SOCA_SEL<<28) | (MW_OUTPUTXBAR8_EPWM29_SOCA_SEL<<29) | (MW_OUTPUTXBAR8_EPWM30_SOCA_SEL<<30) | (MW_OUTPUTXBAR8_EPWM31_SOCA_SEL<<31);
    group2_outputxbar[8] = (MW_OUTPUTXBAR8_EPWM0_SOCB_SEL<<0) | (MW_OUTPUTXBAR8_EPWM1_SOCB_SEL<<1) | (MW_OUTPUTXBAR8_EPWM2_SOCB_SEL<<2) | (MW_OUTPUTXBAR8_EPWM3_SOCB_SEL<<3) | (MW_OUTPUTXBAR8_EPWM4_SOCB_SEL<<4) | (MW_OUTPUTXBAR8_EPWM5_SOCB_SEL<<5) | (MW_OUTPUTXBAR8_EPWM6_SOCB_SEL<<6) | (MW_OUTPUTXBAR8_EPWM7_SOCB_SEL<<7) | (MW_OUTPUTXBAR8_EPWM8_SOCB_SEL<<8) | (MW_OUTPUTXBAR8_EPWM9_SOCB_SEL<<9) | (MW_OUTPUTXBAR8_EPWM10_SOCB_SEL<<10) | (MW_OUTPUTXBAR8_EPWM11_SOCB_SEL<<11) | (MW_OUTPUTXBAR8_EPWM12_SOCB_SEL<<12) | (MW_OUTPUTXBAR8_EPWM13_SOCB_SEL<<13) | (MW_OUTPUTXBAR8_EPWM14_SOCB_SEL<<14) | (MW_OUTPUTXBAR8_EPWM15_SOCB_SEL<<15) | (MW_OUTPUTXBAR8_EPWM16_SOCB_SEL<<16) | (MW_OUTPUTXBAR8_EPWM17_SOCB_SEL<<17) | (MW_OUTPUTXBAR8_EPWM18_SOCB_SEL<<18) | (MW_OUTPUTXBAR8_EPWM19_SOCB_SEL<<19) | (MW_OUTPUTXBAR8_EPWM20_SOCB_SEL<<20) | (MW_OUTPUTXBAR8_EPWM21_SOCB_SEL<<21) | (MW_OUTPUTXBAR8_EPWM22_SOCB_SEL<<22) | (MW_OUTPUTXBAR8_EPWM23_SOCB_SEL<<23) | (MW_OUTPUTXBAR8_EPWM24_SOCB_SEL<<24) | (MW_OUTPUTXBAR8_EPWM25_SOCB_SEL<<25) | (MW_OUTPUTXBAR8_EPWM26_SOCB_SEL<<26) | (MW_OUTPUTXBAR8_EPWM27_SOCB_SEL<<27) | (MW_OUTPUTXBAR8_EPWM28_SOCB_SEL<<28) | (MW_OUTPUTXBAR8_EPWM29_SOCB_SEL<<29) | (MW_OUTPUTXBAR8_EPWM30_SOCB_SEL<<30) | (MW_OUTPUTXBAR8_EPWM31_SOCB_SEL<<31);
    group3_outputxbar[8] = (MW_OUTPUTXBAR8_DEL0_ACTIVE_SEL<<0) | (MW_OUTPUTXBAR8_DEL1_ACTIVE_SEL<<1) | (MW_OUTPUTXBAR8_DEL2_ACTIVE_SEL<<2) | (MW_OUTPUTXBAR8_DEL3_ACTIVE_SEL<<3) | (MW_OUTPUTXBAR8_DEL4_ACTIVE_SEL<<4) | (MW_OUTPUTXBAR8_DEL5_ACTIVE_SEL<<5) | (MW_OUTPUTXBAR8_DEL6_ACTIVE_SEL<<6) | (MW_OUTPUTXBAR8_DEL7_ACTIVE_SEL<<7) | (MW_OUTPUTXBAR8_DEL8_ACTIVE_SEL<<8) | (MW_OUTPUTXBAR8_DEL9_ACTIVE_SEL<<9) | (MW_OUTPUTXBAR8_DEL10_ACTIVE_SEL<<10) | (MW_OUTPUTXBAR8_DEL11_ACTIVE_SEL<<11) | (MW_OUTPUTXBAR8_DEL12_ACTIVE_SEL<<12) | (MW_OUTPUTXBAR8_DEL13_ACTIVE_SEL<<13) | (MW_OUTPUTXBAR8_DEL14_ACTIVE_SEL<<14) | (MW_OUTPUTXBAR8_DEL15_ACTIVE_SEL<<15) | (MW_OUTPUTXBAR8_DEL16_ACTIVE_SEL<<16) | (MW_OUTPUTXBAR8_DEL17_ACTIVE_SEL<<17) | (MW_OUTPUTXBAR8_DEL18_ACTIVE_SEL<<18) | (MW_OUTPUTXBAR8_DEL19_ACTIVE_SEL<<19) | (MW_OUTPUTXBAR8_DEL20_ACTIVE_SEL<<20) | (MW_OUTPUTXBAR8_DEL21_ACTIVE_SEL<<21) | (MW_OUTPUTXBAR8_DEL22_ACTIVE_SEL<<22) | (MW_OUTPUTXBAR8_DEL23_ACTIVE_SEL<<23) | (MW_OUTPUTXBAR8_DEL24_ACTIVE_SEL<<24) | (MW_OUTPUTXBAR8_DEL25_ACTIVE_SEL<<25) | (MW_OUTPUTXBAR8_DEL26_ACTIVE_SEL<<26) | (MW_OUTPUTXBAR8_DEL27_ACTIVE_SEL<<27) | (MW_OUTPUTXBAR8_DEL28_ACTIVE_SEL<<28) | (MW_OUTPUTXBAR8_DEL29_ACTIVE_SEL<<29) | (MW_OUTPUTXBAR8_DEL30_ACTIVE_SEL<<30) | (MW_OUTPUTXBAR8_DEL31_ACTIVE_SEL<<31);
    group4_outputxbar[8] = (MW_OUTPUTXBAR8_DEL0_TRIP_SEL<<0) | (MW_OUTPUTXBAR8_DEL1_TRIP_SEL<<1) | (MW_OUTPUTXBAR8_DEL2_TRIP_SEL<<2) | (MW_OUTPUTXBAR8_DEL3_TRIP_SEL<<3) | (MW_OUTPUTXBAR8_DEL4_TRIP_SEL<<4) | (MW_OUTPUTXBAR8_DEL5_TRIP_SEL<<5) | (MW_OUTPUTXBAR8_DEL6_TRIP_SEL<<6) | (MW_OUTPUTXBAR8_DEL7_TRIP_SEL<<7) | (MW_OUTPUTXBAR8_DEL8_TRIP_SEL<<8) | (MW_OUTPUTXBAR8_DEL9_TRIP_SEL<<9) | (MW_OUTPUTXBAR8_DEL10_TRIP_SEL<<10) | (MW_OUTPUTXBAR8_DEL11_TRIP_SEL<<11) | (MW_OUTPUTXBAR8_DEL12_TRIP_SEL<<12) | (MW_OUTPUTXBAR8_DEL13_TRIP_SEL<<13) | (MW_OUTPUTXBAR8_DEL14_TRIP_SEL<<14) | (MW_OUTPUTXBAR8_DEL15_TRIP_SEL<<15) | (MW_OUTPUTXBAR8_DEL16_TRIP_SEL<<16) | (MW_OUTPUTXBAR8_DEL17_TRIP_SEL<<17) | (MW_OUTPUTXBAR8_DEL18_TRIP_SEL<<18) | (MW_OUTPUTXBAR8_DEL19_TRIP_SEL<<19) | (MW_OUTPUTXBAR8_DEL20_TRIP_SEL<<20) | (MW_OUTPUTXBAR8_DEL21_TRIP_SEL<<21) | (MW_OUTPUTXBAR8_DEL22_TRIP_SEL<<22) | (MW_OUTPUTXBAR8_DEL23_TRIP_SEL<<23) | (MW_OUTPUTXBAR8_DEL24_TRIP_SEL<<24) | (MW_OUTPUTXBAR8_DEL25_TRIP_SEL<<25) | (MW_OUTPUTXBAR8_DEL26_TRIP_SEL<<26) | (MW_OUTPUTXBAR8_DEL27_TRIP_SEL<<27) | (MW_OUTPUTXBAR8_DEL28_TRIP_SEL<<28) | (MW_OUTPUTXBAR8_DEL29_TRIP_SEL<<29) | (MW_OUTPUTXBAR8_DEL30_TRIP_SEL<<30) | (MW_OUTPUTXBAR8_DEL31_TRIP_SEL<<31);
    group5_outputxbar[8] = (MW_OUTPUTXBAR8_SD0_FILT0_CEVT1_SEL<<0) | (MW_OUTPUTXBAR8_SD0_FILT0_CEVT2_SEL<<1) | (MW_OUTPUTXBAR8_SD0_FILT0_CMPHZ_SEL<<2) | (MW_OUTPUTXBAR8_SD0_FILT1_CEVT1_SEL<<3) | (MW_OUTPUTXBAR8_SD0_FILT1_CEVT2_SEL<<4) | (MW_OUTPUTXBAR8_SD0_FILT1_CMPHZ_SEL<<5) | (MW_OUTPUTXBAR8_SD0_FILT2_CEVT1_SEL<<6) | (MW_OUTPUTXBAR8_SD0_FILT2_CEVT2_SEL<<7) | (MW_OUTPUTXBAR8_SD0_FILT2_CMPHZ_SEL<<8) | (MW_OUTPUTXBAR8_SD0_FILT3_CEVT1_SEL<<9) | (MW_OUTPUTXBAR8_SD0_FILT3_CEVT2_SEL<<10) | (MW_OUTPUTXBAR8_SD0_FILT3_CMPHZ_SEL<<11) | (MW_OUTPUTXBAR8_SD1_FILT0_CEVT1_SEL<<12) | (MW_OUTPUTXBAR8_SD1_FILT0_CEVT2_SEL<<13) | (MW_OUTPUTXBAR8_SD1_FILT0_CMPHZ_SEL<<14) | (MW_OUTPUTXBAR8_SD1_FILT1_CEVT1_SEL<<15) | (MW_OUTPUTXBAR8_SD1_FILT1_CEVT2_SEL<<16) | (MW_OUTPUTXBAR8_SD1_FILT1_CMPHZ_SEL<<17) | (MW_OUTPUTXBAR8_SD1_FILT2_CEVT1_SEL<<18) | (MW_OUTPUTXBAR8_SD1_FILT2_CEVT2_SEL<<19) | (MW_OUTPUTXBAR8_SD1_FILT2_CMPHZ_SEL<<20) | (MW_OUTPUTXBAR8_SD1_FILT3_CEVT1_SEL<<21) | (MW_OUTPUTXBAR8_SD1_FILT3_CEVT2_SEL<<22) | (MW_OUTPUTXBAR8_SD1_FILT3_CMPHZ_SEL<<23);
    group6_outputxbar[8] = (MW_OUTPUTXBAR8_CMPSSA0_CTRIPL_SEL<<0) | (MW_OUTPUTXBAR8_CMPSSA0_CTRIPH_SEL<<1) | (MW_OUTPUTXBAR8_CMPSSA1_CTRIPL_SEL<<2) | (MW_OUTPUTXBAR8_CMPSSA1_CTRIPH_SEL<<3) | (MW_OUTPUTXBAR8_CMPSSA2_CTRIPL_SEL<<4) | (MW_OUTPUTXBAR8_CMPSSA2_CTRIPH_SEL<<5) | (MW_OUTPUTXBAR8_CMPSSA3_CTRIPL_SEL<<6) | (MW_OUTPUTXBAR8_CMPSSA3_CTRIPH_SEL<<7) | (MW_OUTPUTXBAR8_CMPSSA4_CTRIPL_SEL<<8) | (MW_OUTPUTXBAR8_CMPSSA4_CTRIPH_SEL<<9) | (MW_OUTPUTXBAR8_CMPSSA5_CTRIPL_SEL<<10) | (MW_OUTPUTXBAR8_CMPSSA5_CTRIPH_SEL<<11) | (MW_OUTPUTXBAR8_CMPSSA6_CTRIPL_SEL<<12) | (MW_OUTPUTXBAR8_CMPSSA6_CTRIPH_SEL<<13) | (MW_OUTPUTXBAR8_CMPSSA7_CTRIPL_SEL<<14) | (MW_OUTPUTXBAR8_CMPSSA7_CTRIPH_SEL<<15) | (MW_OUTPUTXBAR8_CMPSSA8_CTRIPL_SEL<<16) | (MW_OUTPUTXBAR8_CMPSSA8_CTRIPH_SEL<<17) | (MW_OUTPUTXBAR8_CMPSSA9_CTRIPL_SEL<<18) | (MW_OUTPUTXBAR8_CMPSSA9_CTRIPH_SEL<<19);
    group7_outputxbar[8] = (MW_OUTPUTXBAR8_CMPSSB0_CTRIPL_SEL<<0) | (MW_OUTPUTXBAR8_CMPSSB0_CTRIPH_SEL<<1) | (MW_OUTPUTXBAR8_CMPSSB1_CTRIPL_SEL<<2) | (MW_OUTPUTXBAR8_CMPSSB1_CTRIPH_SEL<<3) | (MW_OUTPUTXBAR8_CMPSSB2_CTRIPL_SEL<<4) | (MW_OUTPUTXBAR8_CMPSSB2_CTRIPH_SEL<<5) | (MW_OUTPUTXBAR8_CMPSSB3_CTRIPL_SEL<<6) | (MW_OUTPUTXBAR8_CMPSSB3_CTRIPH_SEL<<7) | (MW_OUTPUTXBAR8_CMPSSB4_CTRIPL_SEL<<8) | (MW_OUTPUTXBAR8_CMPSSB4_CTRIPH_SEL<<9) | (MW_OUTPUTXBAR8_CMPSSB5_CTRIPL_SEL<<10) | (MW_OUTPUTXBAR8_CMPSSB5_CTRIPH_SEL<<11) | (MW_OUTPUTXBAR8_CMPSSB6_CTRIPL_SEL<<12) | (MW_OUTPUTXBAR8_CMPSSB6_CTRIPH_SEL<<13) | (MW_OUTPUTXBAR8_CMPSSB7_CTRIPL_SEL<<14) | (MW_OUTPUTXBAR8_CMPSSB7_CTRIPH_SEL<<15) | (MW_OUTPUTXBAR8_CMPSSB8_CTRIPL_SEL<<16) | (MW_OUTPUTXBAR8_CMPSSB8_CTRIPH_SEL<<17) | (MW_OUTPUTXBAR8_CMPSSB9_CTRIPL_SEL<<18) | (MW_OUTPUTXBAR8_CMPSSB9_CTRIPH_SEL<<19);
    group8_outputxbar[8] = (MW_OUTPUTXBAR8_ADC0_EVT1_SEL<<0) | (MW_OUTPUTXBAR8_ADC0_EVT2_SEL<<1) | (MW_OUTPUTXBAR8_ADC0_EVT3_SEL<<2) | (MW_OUTPUTXBAR8_ADC0_EVT4_SEL<<3) | (MW_OUTPUTXBAR8_ADC1_EVT1_SEL<<4) | (MW_OUTPUTXBAR8_ADC1_EVT2_SEL<<5) | (MW_OUTPUTXBAR8_ADC1_EVT3_SEL<<6) | (MW_OUTPUTXBAR8_ADC1_EVT4_SEL<<7) | (MW_OUTPUTXBAR8_ADC2_EVT1_SEL<<8) | (MW_OUTPUTXBAR8_ADC2_EVT2_SEL<<9) | (MW_OUTPUTXBAR8_ADC2_EVT3_SEL<<10) | (MW_OUTPUTXBAR8_ADC2_EVT4_SEL<<11) | (MW_OUTPUTXBAR8_ADC3_EVT1_SEL<<12) | (MW_OUTPUTXBAR8_ADC3_EVT2_SEL<<13) | (MW_OUTPUTXBAR8_ADC3_EVT3_SEL<<14) | (MW_OUTPUTXBAR8_ADC3_EVT4_SEL<<15) | (MW_OUTPUTXBAR8_ADC4_EVT1_SEL<<16) | (MW_OUTPUTXBAR8_ADC4_EVT2_SEL<<17) | (MW_OUTPUTXBAR8_ADC4_EVT3_SEL<<18) | (MW_OUTPUTXBAR8_ADC4_EVT4_SEL<<19);
    group9_outputxbar[8] = (MW_OUTPUTXBAR8_EPWM0SYNCOUT_INSTANCE_SEL<<0) | ( MW_OUTPUTXBAR8_EPWM1SYNCOUT_INSTANCE_SEL<<1) | ( MW_OUTPUTXBAR8_EPWM2SYNCOUT_INSTANCE_SEL<<2) | ( MW_OUTPUTXBAR8_EPWM3SYNCOUT_INSTANCE_SEL<<3) | (MW_OUTPUTXBAR8_EQEP0_I_OUT_SEL<<4) | (MW_OUTPUTXBAR8_EQEP0_S_OUT_SEL<<5) | (MW_OUTPUTXBAR8_EQEP1_I_OUT_SEL<<6) | (MW_OUTPUTXBAR8_EQEP1_S_OUT_SEL<<7) | (MW_OUTPUTXBAR8_EQEP2_I_OUT_SEL<<8) | (MW_OUTPUTXBAR8_EQEP2_S_OUT_SEL<<9) | (MW_OUTPUTXBAR8_ECAP0_SEL<<10) | (MW_OUTPUTXBAR8_ECAP1_SEL<<11) | (MW_OUTPUTXBAR8_ECAP2_SEL<<12) | (MW_OUTPUTXBAR8_ECAP3_SEL<<13) | (MW_OUTPUTXBAR8_ECAP4_SEL<<14) | (MW_OUTPUTXBAR8_ECAP5_SEL<<15) | (MW_OUTPUTXBAR8_ECAP6_SEL<<16) | (MW_OUTPUTXBAR8_ECAP7_SEL<<17) | (MW_OUTPUTXBAR8_ECAP8_SEL<<18) | (MW_OUTPUTXBAR8_ECAP9_SEL<<19);
    group10_outputxbar[8] =  (MW_OUTPUTXBAR8_FSIRX0_RX_TRIG0_SEL<<0) | (MW_OUTPUTXBAR8_FSIRX0_RX_TRIG1_SEL<<1) | (MW_OUTPUTXBAR8_FSIRX0_RX_TRIG2_SEL<<2) | (MW_OUTPUTXBAR8_FSIRX0_RX_TRIG3_SEL<<3) | (MW_OUTPUTXBAR8_FSIRX1_RX_TRIG0_SEL<<4) | (MW_OUTPUTXBAR8_FSIRX1_RX_TRIG1_SEL<<5) | (MW_OUTPUTXBAR8_FSIRX1_RX_TRIG2_SEL<<6) | (MW_OUTPUTXBAR8_FSIRX1_RX_TRIG3_SEL<<7) | (MW_OUTPUTXBAR8_FSIRX2_RX_TRIG0_SEL<<8) | (MW_OUTPUTXBAR8_FSIRX2_RX_TRIG1_SEL<<9) | (MW_OUTPUTXBAR8_FSIRX2_RX_TRIG2_SEL<<10) | (MW_OUTPUTXBAR8_FSIRX2_RX_TRIG3_SEL<<11) | (MW_OUTPUTXBAR8_FSIRX3_RX_TRIG0_SEL<<12) | (MW_OUTPUTXBAR8_FSIRX3_RX_TRIG1_SEL<<13) | (MW_OUTPUTXBAR8_FSIRX3_RX_TRIG2_SEL<<14) | (MW_OUTPUTXBAR8_FSIRX3_RX_TRIG3_SEL<<15);
    group0_outputxbar[9] = (MW_OUTPUTXBAR9_EPWM0_TRIPOUT_SEL<<0) | (MW_OUTPUTXBAR9_EPWM1_TRIPOUT_SEL<<1) | (MW_OUTPUTXBAR9_EPWM2_TRIPOUT_SEL<<2) | (MW_OUTPUTXBAR9_EPWM3_TRIPOUT_SEL<<3) | (MW_OUTPUTXBAR9_EPWM4_TRIPOUT_SEL<<4) | (MW_OUTPUTXBAR9_EPWM5_TRIPOUT_SEL<<5) | (MW_OUTPUTXBAR9_EPWM6_TRIPOUT_SEL<<6) | (MW_OUTPUTXBAR9_EPWM7_TRIPOUT_SEL<<7) | (MW_OUTPUTXBAR9_EPWM8_TRIPOUT_SEL<<8) | (MW_OUTPUTXBAR9_EPWM9_TRIPOUT_SEL<<9) | (MW_OUTPUTXBAR9_EPWM10_TRIPOUT_SEL<<10) | (MW_OUTPUTXBAR9_EPWM11_TRIPOUT_SEL<<11) | (MW_OUTPUTXBAR9_EPWM12_TRIPOUT_SEL<<12) | (MW_OUTPUTXBAR9_EPWM13_TRIPOUT_SEL<<13) | (MW_OUTPUTXBAR9_EPWM14_TRIPOUT_SEL<<14) | (MW_OUTPUTXBAR9_EPWM15_TRIPOUT_SEL<<15) | (MW_OUTPUTXBAR9_EPWM16_TRIPOUT_SEL<<16) | (MW_OUTPUTXBAR9_EPWM17_TRIPOUT_SEL<<17) | (MW_OUTPUTXBAR9_EPWM18_TRIPOUT_SEL<<18) | (MW_OUTPUTXBAR9_EPWM19_TRIPOUT_SEL<<19) | (MW_OUTPUTXBAR9_EPWM20_TRIPOUT_SEL<<20) | (MW_OUTPUTXBAR9_EPWM21_TRIPOUT_SEL<<21) | (MW_OUTPUTXBAR9_EPWM22_TRIPOUT_SEL<<22) | (MW_OUTPUTXBAR9_EPWM23_TRIPOUT_SEL<<23) | (MW_OUTPUTXBAR9_EPWM24_TRIPOUT_SEL<<24) | (MW_OUTPUTXBAR9_EPWM25_TRIPOUT_SEL<<25) | (MW_OUTPUTXBAR9_EPWM26_TRIPOUT_SEL<<26) | (MW_OUTPUTXBAR9_EPWM27_TRIPOUT_SEL<<27) | (MW_OUTPUTXBAR9_EPWM28_TRIPOUT_SEL<<28) | (MW_OUTPUTXBAR9_EPWM29_TRIPOUT_SEL<<29) | (MW_OUTPUTXBAR9_EPWM30_TRIPOUT_SEL<<30) | (MW_OUTPUTXBAR9_EPWM31_TRIPOUT_SEL<<31);
    group1_outputxbar[9] = (MW_OUTPUTXBAR9_EPWM0_SOCA_SEL<<0) | (MW_OUTPUTXBAR9_EPWM1_SOCA_SEL<<1) | (MW_OUTPUTXBAR9_EPWM2_SOCA_SEL<<2) | (MW_OUTPUTXBAR9_EPWM3_SOCA_SEL<<3) | (MW_OUTPUTXBAR9_EPWM4_SOCA_SEL<<4) | (MW_OUTPUTXBAR9_EPWM5_SOCA_SEL<<5) | (MW_OUTPUTXBAR9_EPWM6_SOCA_SEL<<6) | (MW_OUTPUTXBAR9_EPWM7_SOCA_SEL<<7) | (MW_OUTPUTXBAR9_EPWM8_SOCA_SEL<<8) | (MW_OUTPUTXBAR9_EPWM9_SOCA_SEL<<9) | (MW_OUTPUTXBAR9_EPWM10_SOCA_SEL<<10) | (MW_OUTPUTXBAR9_EPWM11_SOCA_SEL<<11) | (MW_OUTPUTXBAR9_EPWM12_SOCA_SEL<<12) | (MW_OUTPUTXBAR9_EPWM13_SOCA_SEL<<13) | (MW_OUTPUTXBAR9_EPWM14_SOCA_SEL<<14) | (MW_OUTPUTXBAR9_EPWM15_SOCA_SEL<<15) | (MW_OUTPUTXBAR9_EPWM16_SOCA_SEL<<16) | (MW_OUTPUTXBAR9_EPWM17_SOCA_SEL<<17) | (MW_OUTPUTXBAR9_EPWM18_SOCA_SEL<<18) | (MW_OUTPUTXBAR9_EPWM19_SOCA_SEL<<19) | (MW_OUTPUTXBAR9_EPWM20_SOCA_SEL<<20) | (MW_OUTPUTXBAR9_EPWM21_SOCA_SEL<<21) | (MW_OUTPUTXBAR9_EPWM22_SOCA_SEL<<22) | (MW_OUTPUTXBAR9_EPWM23_SOCA_SEL<<23) | (MW_OUTPUTXBAR9_EPWM24_SOCA_SEL<<24) | (MW_OUTPUTXBAR9_EPWM25_SOCA_SEL<<25) | (MW_OUTPUTXBAR9_EPWM26_SOCA_SEL<<26) | (MW_OUTPUTXBAR9_EPWM27_SOCA_SEL<<27) | (MW_OUTPUTXBAR9_EPWM28_SOCA_SEL<<28) | (MW_OUTPUTXBAR9_EPWM29_SOCA_SEL<<29) | (MW_OUTPUTXBAR9_EPWM30_SOCA_SEL<<30) | (MW_OUTPUTXBAR9_EPWM31_SOCA_SEL<<31);
    group2_outputxbar[9] = (MW_OUTPUTXBAR9_EPWM0_SOCB_SEL<<0) | (MW_OUTPUTXBAR9_EPWM1_SOCB_SEL<<1) | (MW_OUTPUTXBAR9_EPWM2_SOCB_SEL<<2) | (MW_OUTPUTXBAR9_EPWM3_SOCB_SEL<<3) | (MW_OUTPUTXBAR9_EPWM4_SOCB_SEL<<4) | (MW_OUTPUTXBAR9_EPWM5_SOCB_SEL<<5) | (MW_OUTPUTXBAR9_EPWM6_SOCB_SEL<<6) | (MW_OUTPUTXBAR9_EPWM7_SOCB_SEL<<7) | (MW_OUTPUTXBAR9_EPWM8_SOCB_SEL<<8) | (MW_OUTPUTXBAR9_EPWM9_SOCB_SEL<<9) | (MW_OUTPUTXBAR9_EPWM10_SOCB_SEL<<10) | (MW_OUTPUTXBAR9_EPWM11_SOCB_SEL<<11) | (MW_OUTPUTXBAR9_EPWM12_SOCB_SEL<<12) | (MW_OUTPUTXBAR9_EPWM13_SOCB_SEL<<13) | (MW_OUTPUTXBAR9_EPWM14_SOCB_SEL<<14) | (MW_OUTPUTXBAR9_EPWM15_SOCB_SEL<<15) | (MW_OUTPUTXBAR9_EPWM16_SOCB_SEL<<16) | (MW_OUTPUTXBAR9_EPWM17_SOCB_SEL<<17) | (MW_OUTPUTXBAR9_EPWM18_SOCB_SEL<<18) | (MW_OUTPUTXBAR9_EPWM19_SOCB_SEL<<19) | (MW_OUTPUTXBAR9_EPWM20_SOCB_SEL<<20) | (MW_OUTPUTXBAR9_EPWM21_SOCB_SEL<<21) | (MW_OUTPUTXBAR9_EPWM22_SOCB_SEL<<22) | (MW_OUTPUTXBAR9_EPWM23_SOCB_SEL<<23) | (MW_OUTPUTXBAR9_EPWM24_SOCB_SEL<<24) | (MW_OUTPUTXBAR9_EPWM25_SOCB_SEL<<25) | (MW_OUTPUTXBAR9_EPWM26_SOCB_SEL<<26) | (MW_OUTPUTXBAR9_EPWM27_SOCB_SEL<<27) | (MW_OUTPUTXBAR9_EPWM28_SOCB_SEL<<28) | (MW_OUTPUTXBAR9_EPWM29_SOCB_SEL<<29) | (MW_OUTPUTXBAR9_EPWM30_SOCB_SEL<<30) | (MW_OUTPUTXBAR9_EPWM31_SOCB_SEL<<31);
    group3_outputxbar[9] = (MW_OUTPUTXBAR9_DEL0_ACTIVE_SEL<<0) | (MW_OUTPUTXBAR9_DEL1_ACTIVE_SEL<<1) | (MW_OUTPUTXBAR9_DEL2_ACTIVE_SEL<<2) | (MW_OUTPUTXBAR9_DEL3_ACTIVE_SEL<<3) | (MW_OUTPUTXBAR9_DEL4_ACTIVE_SEL<<4) | (MW_OUTPUTXBAR9_DEL5_ACTIVE_SEL<<5) | (MW_OUTPUTXBAR9_DEL6_ACTIVE_SEL<<6) | (MW_OUTPUTXBAR9_DEL7_ACTIVE_SEL<<7) | (MW_OUTPUTXBAR9_DEL8_ACTIVE_SEL<<8) | (MW_OUTPUTXBAR9_DEL9_ACTIVE_SEL<<9) | (MW_OUTPUTXBAR9_DEL10_ACTIVE_SEL<<10) | (MW_OUTPUTXBAR9_DEL11_ACTIVE_SEL<<11) | (MW_OUTPUTXBAR9_DEL12_ACTIVE_SEL<<12) | (MW_OUTPUTXBAR9_DEL13_ACTIVE_SEL<<13) | (MW_OUTPUTXBAR9_DEL14_ACTIVE_SEL<<14) | (MW_OUTPUTXBAR9_DEL15_ACTIVE_SEL<<15) | (MW_OUTPUTXBAR9_DEL16_ACTIVE_SEL<<16) | (MW_OUTPUTXBAR9_DEL17_ACTIVE_SEL<<17) | (MW_OUTPUTXBAR9_DEL18_ACTIVE_SEL<<18) | (MW_OUTPUTXBAR9_DEL19_ACTIVE_SEL<<19) | (MW_OUTPUTXBAR9_DEL20_ACTIVE_SEL<<20) | (MW_OUTPUTXBAR9_DEL21_ACTIVE_SEL<<21) | (MW_OUTPUTXBAR9_DEL22_ACTIVE_SEL<<22) | (MW_OUTPUTXBAR9_DEL23_ACTIVE_SEL<<23) | (MW_OUTPUTXBAR9_DEL24_ACTIVE_SEL<<24) | (MW_OUTPUTXBAR9_DEL25_ACTIVE_SEL<<25) | (MW_OUTPUTXBAR9_DEL26_ACTIVE_SEL<<26) | (MW_OUTPUTXBAR9_DEL27_ACTIVE_SEL<<27) | (MW_OUTPUTXBAR9_DEL28_ACTIVE_SEL<<28) | (MW_OUTPUTXBAR9_DEL29_ACTIVE_SEL<<29) | (MW_OUTPUTXBAR9_DEL30_ACTIVE_SEL<<30) | (MW_OUTPUTXBAR9_DEL31_ACTIVE_SEL<<31);
    group4_outputxbar[9] = (MW_OUTPUTXBAR9_DEL0_TRIP_SEL<<0) | (MW_OUTPUTXBAR9_DEL1_TRIP_SEL<<1) | (MW_OUTPUTXBAR9_DEL2_TRIP_SEL<<2) | (MW_OUTPUTXBAR9_DEL3_TRIP_SEL<<3) | (MW_OUTPUTXBAR9_DEL4_TRIP_SEL<<4) | (MW_OUTPUTXBAR9_DEL5_TRIP_SEL<<5) | (MW_OUTPUTXBAR9_DEL6_TRIP_SEL<<6) | (MW_OUTPUTXBAR9_DEL7_TRIP_SEL<<7) | (MW_OUTPUTXBAR9_DEL8_TRIP_SEL<<8) | (MW_OUTPUTXBAR9_DEL9_TRIP_SEL<<9) | (MW_OUTPUTXBAR9_DEL10_TRIP_SEL<<10) | (MW_OUTPUTXBAR9_DEL11_TRIP_SEL<<11) | (MW_OUTPUTXBAR9_DEL12_TRIP_SEL<<12) | (MW_OUTPUTXBAR9_DEL13_TRIP_SEL<<13) | (MW_OUTPUTXBAR9_DEL14_TRIP_SEL<<14) | (MW_OUTPUTXBAR9_DEL15_TRIP_SEL<<15) | (MW_OUTPUTXBAR9_DEL16_TRIP_SEL<<16) | (MW_OUTPUTXBAR9_DEL17_TRIP_SEL<<17) | (MW_OUTPUTXBAR9_DEL18_TRIP_SEL<<18) | (MW_OUTPUTXBAR9_DEL19_TRIP_SEL<<19) | (MW_OUTPUTXBAR9_DEL20_TRIP_SEL<<20) | (MW_OUTPUTXBAR9_DEL21_TRIP_SEL<<21) | (MW_OUTPUTXBAR9_DEL22_TRIP_SEL<<22) | (MW_OUTPUTXBAR9_DEL23_TRIP_SEL<<23) | (MW_OUTPUTXBAR9_DEL24_TRIP_SEL<<24) | (MW_OUTPUTXBAR9_DEL25_TRIP_SEL<<25) | (MW_OUTPUTXBAR9_DEL26_TRIP_SEL<<26) | (MW_OUTPUTXBAR9_DEL27_TRIP_SEL<<27) | (MW_OUTPUTXBAR9_DEL28_TRIP_SEL<<28) | (MW_OUTPUTXBAR9_DEL29_TRIP_SEL<<29) | (MW_OUTPUTXBAR9_DEL30_TRIP_SEL<<30) | (MW_OUTPUTXBAR9_DEL31_TRIP_SEL<<31);
    group5_outputxbar[9] = (MW_OUTPUTXBAR9_SD0_FILT0_CEVT1_SEL<<0) | (MW_OUTPUTXBAR9_SD0_FILT0_CEVT2_SEL<<1) | (MW_OUTPUTXBAR9_SD0_FILT0_CMPHZ_SEL<<2) | (MW_OUTPUTXBAR9_SD0_FILT1_CEVT1_SEL<<3) | (MW_OUTPUTXBAR9_SD0_FILT1_CEVT2_SEL<<4) | (MW_OUTPUTXBAR9_SD0_FILT1_CMPHZ_SEL<<5) | (MW_OUTPUTXBAR9_SD0_FILT2_CEVT1_SEL<<6) | (MW_OUTPUTXBAR9_SD0_FILT2_CEVT2_SEL<<7) | (MW_OUTPUTXBAR9_SD0_FILT2_CMPHZ_SEL<<8) | (MW_OUTPUTXBAR9_SD0_FILT3_CEVT1_SEL<<9) | (MW_OUTPUTXBAR9_SD0_FILT3_CEVT2_SEL<<10) | (MW_OUTPUTXBAR9_SD0_FILT3_CMPHZ_SEL<<11) | (MW_OUTPUTXBAR9_SD1_FILT0_CEVT1_SEL<<12) | (MW_OUTPUTXBAR9_SD1_FILT0_CEVT2_SEL<<13) | (MW_OUTPUTXBAR9_SD1_FILT0_CMPHZ_SEL<<14) | (MW_OUTPUTXBAR9_SD1_FILT1_CEVT1_SEL<<15) | (MW_OUTPUTXBAR9_SD1_FILT1_CEVT2_SEL<<16) | (MW_OUTPUTXBAR9_SD1_FILT1_CMPHZ_SEL<<17) | (MW_OUTPUTXBAR9_SD1_FILT2_CEVT1_SEL<<18) | (MW_OUTPUTXBAR9_SD1_FILT2_CEVT2_SEL<<19) | (MW_OUTPUTXBAR9_SD1_FILT2_CMPHZ_SEL<<20) | (MW_OUTPUTXBAR9_SD1_FILT3_CEVT1_SEL<<21) | (MW_OUTPUTXBAR9_SD1_FILT3_CEVT2_SEL<<22) | (MW_OUTPUTXBAR9_SD1_FILT3_CMPHZ_SEL<<23);
    group6_outputxbar[9] = (MW_OUTPUTXBAR9_CMPSSA0_CTRIPL_SEL<<0) | (MW_OUTPUTXBAR9_CMPSSA0_CTRIPH_SEL<<1) | (MW_OUTPUTXBAR9_CMPSSA1_CTRIPL_SEL<<2) | (MW_OUTPUTXBAR9_CMPSSA1_CTRIPH_SEL<<3) | (MW_OUTPUTXBAR9_CMPSSA2_CTRIPL_SEL<<4) | (MW_OUTPUTXBAR9_CMPSSA2_CTRIPH_SEL<<5) | (MW_OUTPUTXBAR9_CMPSSA3_CTRIPL_SEL<<6) | (MW_OUTPUTXBAR9_CMPSSA3_CTRIPH_SEL<<7) | (MW_OUTPUTXBAR9_CMPSSA4_CTRIPL_SEL<<8) | (MW_OUTPUTXBAR9_CMPSSA4_CTRIPH_SEL<<9) | (MW_OUTPUTXBAR9_CMPSSA5_CTRIPL_SEL<<10) | (MW_OUTPUTXBAR9_CMPSSA5_CTRIPH_SEL<<11) | (MW_OUTPUTXBAR9_CMPSSA6_CTRIPL_SEL<<12) | (MW_OUTPUTXBAR9_CMPSSA6_CTRIPH_SEL<<13) | (MW_OUTPUTXBAR9_CMPSSA7_CTRIPL_SEL<<14) | (MW_OUTPUTXBAR9_CMPSSA7_CTRIPH_SEL<<15) | (MW_OUTPUTXBAR9_CMPSSA8_CTRIPL_SEL<<16) | (MW_OUTPUTXBAR9_CMPSSA8_CTRIPH_SEL<<17) | (MW_OUTPUTXBAR9_CMPSSA9_CTRIPL_SEL<<18) | (MW_OUTPUTXBAR9_CMPSSA9_CTRIPH_SEL<<19);
    group7_outputxbar[9] = (MW_OUTPUTXBAR9_CMPSSB0_CTRIPL_SEL<<0) | (MW_OUTPUTXBAR9_CMPSSB0_CTRIPH_SEL<<1) | (MW_OUTPUTXBAR9_CMPSSB1_CTRIPL_SEL<<2) | (MW_OUTPUTXBAR9_CMPSSB1_CTRIPH_SEL<<3) | (MW_OUTPUTXBAR9_CMPSSB2_CTRIPL_SEL<<4) | (MW_OUTPUTXBAR9_CMPSSB2_CTRIPH_SEL<<5) | (MW_OUTPUTXBAR9_CMPSSB3_CTRIPL_SEL<<6) | (MW_OUTPUTXBAR9_CMPSSB3_CTRIPH_SEL<<7) | (MW_OUTPUTXBAR9_CMPSSB4_CTRIPL_SEL<<8) | (MW_OUTPUTXBAR9_CMPSSB4_CTRIPH_SEL<<9) | (MW_OUTPUTXBAR9_CMPSSB5_CTRIPL_SEL<<10) | (MW_OUTPUTXBAR9_CMPSSB5_CTRIPH_SEL<<11) | (MW_OUTPUTXBAR9_CMPSSB6_CTRIPL_SEL<<12) | (MW_OUTPUTXBAR9_CMPSSB6_CTRIPH_SEL<<13) | (MW_OUTPUTXBAR9_CMPSSB7_CTRIPL_SEL<<14) | (MW_OUTPUTXBAR9_CMPSSB7_CTRIPH_SEL<<15) | (MW_OUTPUTXBAR9_CMPSSB8_CTRIPL_SEL<<16) | (MW_OUTPUTXBAR9_CMPSSB8_CTRIPH_SEL<<17) | (MW_OUTPUTXBAR9_CMPSSB9_CTRIPL_SEL<<18) | (MW_OUTPUTXBAR9_CMPSSB9_CTRIPH_SEL<<19);
    group8_outputxbar[9] = (MW_OUTPUTXBAR9_ADC0_EVT1_SEL<<0) | (MW_OUTPUTXBAR9_ADC0_EVT2_SEL<<1) | (MW_OUTPUTXBAR9_ADC0_EVT3_SEL<<2) | (MW_OUTPUTXBAR9_ADC0_EVT4_SEL<<3) | (MW_OUTPUTXBAR9_ADC1_EVT1_SEL<<4) | (MW_OUTPUTXBAR9_ADC1_EVT2_SEL<<5) | (MW_OUTPUTXBAR9_ADC1_EVT3_SEL<<6) | (MW_OUTPUTXBAR9_ADC1_EVT4_SEL<<7) | (MW_OUTPUTXBAR9_ADC2_EVT1_SEL<<8) | (MW_OUTPUTXBAR9_ADC2_EVT2_SEL<<9) | (MW_OUTPUTXBAR9_ADC2_EVT3_SEL<<10) | (MW_OUTPUTXBAR9_ADC2_EVT4_SEL<<11) | (MW_OUTPUTXBAR9_ADC3_EVT1_SEL<<12) | (MW_OUTPUTXBAR9_ADC3_EVT2_SEL<<13) | (MW_OUTPUTXBAR9_ADC3_EVT3_SEL<<14) | (MW_OUTPUTXBAR9_ADC3_EVT4_SEL<<15) | (MW_OUTPUTXBAR9_ADC4_EVT1_SEL<<16) | (MW_OUTPUTXBAR9_ADC4_EVT2_SEL<<17) | (MW_OUTPUTXBAR9_ADC4_EVT3_SEL<<18) | (MW_OUTPUTXBAR9_ADC4_EVT4_SEL<<19);
    group9_outputxbar[9] = (MW_OUTPUTXBAR9_EPWM0SYNCOUT_INSTANCE_SEL<<0) | ( MW_OUTPUTXBAR9_EPWM1SYNCOUT_INSTANCE_SEL<<1) | ( MW_OUTPUTXBAR9_EPWM2SYNCOUT_INSTANCE_SEL<<2) | ( MW_OUTPUTXBAR9_EPWM3SYNCOUT_INSTANCE_SEL<<3) | (MW_OUTPUTXBAR9_EQEP0_I_OUT_SEL<<4) | (MW_OUTPUTXBAR9_EQEP0_S_OUT_SEL<<5) | (MW_OUTPUTXBAR9_EQEP1_I_OUT_SEL<<6) | (MW_OUTPUTXBAR9_EQEP1_S_OUT_SEL<<7) | (MW_OUTPUTXBAR9_EQEP2_I_OUT_SEL<<8) | (MW_OUTPUTXBAR9_EQEP2_S_OUT_SEL<<9) | (MW_OUTPUTXBAR9_ECAP0_SEL<<10) | (MW_OUTPUTXBAR9_ECAP1_SEL<<11) | (MW_OUTPUTXBAR9_ECAP2_SEL<<12) | (MW_OUTPUTXBAR9_ECAP3_SEL<<13) | (MW_OUTPUTXBAR9_ECAP4_SEL<<14) | (MW_OUTPUTXBAR9_ECAP5_SEL<<15) | (MW_OUTPUTXBAR9_ECAP6_SEL<<16) | (MW_OUTPUTXBAR9_ECAP7_SEL<<17) | (MW_OUTPUTXBAR9_ECAP8_SEL<<18) | (MW_OUTPUTXBAR9_ECAP9_SEL<<19);
