TexasInstruments/am26x-hsp/src/am263px_init.c
    }

    Drivers_EPWMSyncOutputXBAR();


}
void Drivers_EPWMSyncOutputXBAR()
{
    uint32_t groupEPWMSyncOutputXbar[16];
    for(int i=0;i<=15;i++)
    {
        if((i==0 && (MW_OUTPUTXBAR0_EPWM0_SYNCOUT_SEL | MW_OUTPUTXBAR0_EPWM1_SYNCOUT_SEL | MW_OUTPUTXBAR0_EPWM2_SYNCOUT_SEL | MW_OUTPUTXBAR0_EPWM3_SYNCOUT_SEL | MW_OUTPUTXBAR0_EPWM4_SYNCOUT_SEL | MW_OUTPUTXBAR0_EPWM5_SYNCOUT_SEL | MW_OUTPUTXBAR0_EPWM6_SYNCOUT_SEL | MW_OUTPUTXBAR0_EPWM7_SYNCOUT_SEL | MW_OUTPUTXBAR0_EPWM8_SYNCOUT_SEL | MW_OUTPUTXBAR0_EPWM9_SYNCOUT_SEL | MW_OUTPUTXBAR0_EPWM10_SYNCOUT_SEL | MW_OUTPUTXBAR0_EPWM11_SYNCOUT_SEL | MW_OUTPUTXBAR0_EPWM12_SYNCOUT_SEL | MW_OUTPUTXBAR0_EPWM13_SYNCOUT_SEL | MW_OUTPUTXBAR0_EPWM14_SYNCOUT_SEL | MW_OUTPUTXBAR0_EPWM15_SYNCOUT_SEL | MW_OUTPUTXBAR0_EPWM16_SYNCOUT_SEL | MW_OUTPUTXBAR0_EPWM17_SYNCOUT_SEL | MW_OUTPUTXBAR0_EPWM18_SYNCOUT_SEL | MW_OUTPUTXBAR0_EPWM19_SYNCOUT_SEL | MW_OUTPUTXBAR0_EPWM20_SYNCOUT_SEL | MW_OUTPUTXBAR0_EPWM21_SYNCOUT_SEL | MW_OUTPUTXBAR0_EPWM22_SYNCOUT_SEL | MW_OUTPUTXBAR0_EPWM23_SYNCOUT_SEL | MW_OUTPUTXBAR0_EPWM24_SYNCOUT_SEL | MW_OUTPUTXBAR0_EPWM25_SYNCOUT_SEL | MW_OUTPUTXBAR0_EPWM26_SYNCOUT_SEL | MW_OUTPUTXBAR0_EPWM27_SYNCOUT_SEL | MW_OUTPUTXBAR0_EPWM28_SYNCOUT_SEL | MW_OUTPUTXBAR0_EPWM29_SYNCOUT_SEL | MW_OUTPUTXBAR0_EPWM30_SYNCOUT_SEL | MW_OUTPUTXBAR0_EPWM31_SYNCOUT_SEL)))
        {
            groupEPWMSyncOutputXbar[0] = (MW_OUTPUTXBAR0_EPWM0_SYNCOUT_SEL << 0) | (MW_OUTPUTXBAR0_EPWM1_SYNCOUT_SEL << 1) | (MW_OUTPUTXBAR0_EPWM2_SYNCOUT_SEL << 2) | (MW_OUTPUTXBAR0_EPWM3_SYNCOUT_SEL << 3) | (MW_OUTPUTXBAR0_EPWM4_SYNCOUT_SEL << 4) | (MW_OUTPUTXBAR0_EPWM5_SYNCOUT_SEL << 5) | (MW_OUTPUTXBAR0_EPWM6_SYNCOUT_SEL << 6) | (MW_OUTPUTXBAR0_EPWM7_SYNCOUT_SEL << 7) | (MW_OUTPUTXBAR0_EPWM8_SYNCOUT_SEL << 8) | (MW_OUTPUTXBAR0_EPWM9_SYNCOUT_SEL << 9) | (MW_OUTPUTXBAR0_EPWM10_SYNCOUT_SEL << 10) | (MW_OUTPUTXBAR0_EPWM11_SYNCOUT_SEL << 11) | (MW_OUTPUTXBAR0_EPWM12_SYNCOUT_SEL << 12) | (MW_OUTPUTXBAR0_EPWM13_SYNCOUT_SEL << 13) | (MW_OUTPUTXBAR0_EPWM14_SYNCOUT_SEL << 14) | (MW_OUTPUTXBAR0_EPWM15_SYNCOUT_SEL << 15) | (MW_OUTPUTXBAR0_EPWM16_SYNCOUT_SEL << 16) | (MW_OUTPUTXBAR0_EPWM17_SYNCOUT_SEL << 17) | (MW_OUTPUTXBAR0_EPWM18_SYNCOUT_SEL << 18) | (MW_OUTPUTXBAR0_EPWM19_SYNCOUT_SEL << 19) | (MW_OUTPUTXBAR0_EPWM20_SYNCOUT_SEL << 20) | (MW_OUTPUTXBAR0_EPWM21_SYNCOUT_SEL << 21) | (MW_OUTPUTXBAR0_EPWM22_SYNCOUT_SEL << 22) | (MW_OUTPUTXBAR0_EPWM23_SYNCOUT_SEL << 23) | (MW_OUTPUTXBAR0_EPWM24_SYNCOUT_SEL << 24) | (MW_OUTPUTXBAR0_EPWM25_SYNCOUT_SEL << 25) | (MW_OUTPUTXBAR0_EPWM26_SYNCOUT_SEL << 26) | (MW_OUTPUTXBAR0_EPWM27_SYNCOUT_SEL << 27) | (MW_OUTPUTXBAR0_EPWM28_SYNCOUT_SEL << 28) | (MW_OUTPUTXBAR0_EPWM29_SYNCOUT_SEL << 29) | (MW_OUTPUTXBAR0_EPWM30_SYNCOUT_SEL << 30) | (MW_OUTPUTXBAR0_EPWM31_SYNCOUT_SEL << 31);
           
            if(MW_OUTPUTXBAR0_EPWM0SYNCOUT_INSTANCE_SEL == 1)
                SOC_xbarSelectPWMSyncOutXBarInput(CSL_CONTROLSS_PWMSYNCOUTXBAR_U_BASE, 0, groupEPWMSyncOutputXbar[0]);
            else if(MW_OUTPUTXBAR0_EPWM1SYNCOUT_INSTANCE_SEL == 1)
                SOC_xbarSelectPWMSyncOutXBarInput(CSL_CONTROLSS_PWMSYNCOUTXBAR_U_BASE, 1, groupEPWMSyncOutputXbar[0]); 
            else if(MW_OUTPUTXBAR0_EPWM2SYNCOUT_INSTANCE_SEL == 1)
                SOC_xbarSelectPWMSyncOutXBarInput(CSL_CONTROLSS_PWMSYNCOUTXBAR_U_BASE, 2, groupEPWMSyncOutputXbar[0]);  
            else if(MW_OUTPUTXBAR0_EPWM3SYNCOUT_INSTANCE_SEL == 1)
                SOC_xbarSelectPWMSyncOutXBarInput(CSL_CONTROLSS_PWMSYNCOUTXBAR_U_BASE, 3, groupEPWMSyncOutputXbar[0]);  
        }
        else if((i==1 && (MW_OUTPUTXBAR1_EPWM0_SYNCOUT_SEL | MW_OUTPUTXBAR1_EPWM1_SYNCOUT_SEL | MW_OUTPUTXBAR1_EPWM2_SYNCOUT_SEL | MW_OUTPUTXBAR1_EPWM3_SYNCOUT_SEL | MW_OUTPUTXBAR1_EPWM4_SYNCOUT_SEL | MW_OUTPUTXBAR1_EPWM5_SYNCOUT_SEL | MW_OUTPUTXBAR1_EPWM6_SYNCOUT_SEL | MW_OUTPUTXBAR1_EPWM7_SYNCOUT_SEL | MW_OUTPUTXBAR1_EPWM8_SYNCOUT_SEL | MW_OUTPUTXBAR1_EPWM9_SYNCOUT_SEL | MW_OUTPUTXBAR1_EPWM10_SYNCOUT_SEL | MW_OUTPUTXBAR1_EPWM11_SYNCOUT_SEL | MW_OUTPUTXBAR1_EPWM12_SYNCOUT_SEL | MW_OUTPUTXBAR1_EPWM13_SYNCOUT_SEL | MW_OUTPUTXBAR1_EPWM14_SYNCOUT_SEL | MW_OUTPUTXBAR1_EPWM15_SYNCOUT_SEL | MW_OUTPUTXBAR1_EPWM16_SYNCOUT_SEL | MW_OUTPUTXBAR1_EPWM17_SYNCOUT_SEL | MW_OUTPUTXBAR1_EPWM18_SYNCOUT_SEL | MW_OUTPUTXBAR1_EPWM19_SYNCOUT_SEL | MW_OUTPUTXBAR1_EPWM20_SYNCOUT_SEL | MW_OUTPUTXBAR1_EPWM21_SYNCOUT_SEL | MW_OUTPUTXBAR1_EPWM22_SYNCOUT_SEL | MW_OUTPUTXBAR1_EPWM23_SYNCOUT_SEL | MW_OUTPUTXBAR1_EPWM24_SYNCOUT_SEL | MW_OUTPUTXBAR1_EPWM25_SYNCOUT_SEL | MW_OUTPUTXBAR1_EPWM26_SYNCOUT_SEL | MW_OUTPUTXBAR1_EPWM27_SYNCOUT_SEL | MW_OUTPUTXBAR1_EPWM28_SYNCOUT_SEL | MW_OUTPUTXBAR1_EPWM29_SYNCOUT_SEL | MW_OUTPUTXBAR1_EPWM30_SYNCOUT_SEL | MW_OUTPUTXBAR1_EPWM31_SYNCOUT_SEL)))
        {
            groupEPWMSyncOutputXbar[1] = (MW_OUTPUTXBAR1_EPWM0_SYNCOUT_SEL << 0) | (MW_OUTPUTXBAR1_EPWM1_SYNCOUT_SEL << 1) | (MW_OUTPUTXBAR1_EPWM2_SYNCOUT_SEL << 2) | (MW_OUTPUTXBAR1_EPWM3_SYNCOUT_SEL << 3) | (MW_OUTPUTXBAR1_EPWM4_SYNCOUT_SEL << 4) | (MW_OUTPUTXBAR1_EPWM5_SYNCOUT_SEL << 5) | (MW_OUTPUTXBAR1_EPWM6_SYNCOUT_SEL << 6) | (MW_OUTPUTXBAR1_EPWM7_SYNCOUT_SEL << 7) | (MW_OUTPUTXBAR1_EPWM8_SYNCOUT_SEL << 8) | (MW_OUTPUTXBAR1_EPWM9_SYNCOUT_SEL << 9) | (MW_OUTPUTXBAR1_EPWM10_SYNCOUT_SEL << 10) | (MW_OUTPUTXBAR1_EPWM11_SYNCOUT_SEL << 11) | (MW_OUTPUTXBAR1_EPWM12_SYNCOUT_SEL << 12) | (MW_OUTPUTXBAR1_EPWM13_SYNCOUT_SEL << 13) | (MW_OUTPUTXBAR1_EPWM14_SYNCOUT_SEL << 14) | (MW_OUTPUTXBAR1_EPWM15_SYNCOUT_SEL << 15) | (MW_OUTPUTXBAR1_EPWM16_SYNCOUT_SEL << 16) | (MW_OUTPUTXBAR1_EPWM17_SYNCOUT_SEL << 17) | (MW_OUTPUTXBAR1_EPWM18_SYNCOUT_SEL << 18) | (MW_OUTPUTXBAR1_EPWM19_SYNCOUT_SEL << 19) | (MW_OUTPUTXBAR1_EPWM20_SYNCOUT_SEL << 20) | (MW_OUTPUTXBAR1_EPWM21_SYNCOUT_SEL << 21) | (MW_OUTPUTXBAR1_EPWM22_SYNCOUT_SEL << 22) | (MW_OUTPUTXBAR1_EPWM23_SYNCOUT_SEL << 23) | (MW_OUTPUTXBAR1_EPWM24_SYNCOUT_SEL << 24) | (MW_OUTPUTXBAR1_EPWM25_SYNCOUT_SEL << 25) | (MW_OUTPUTXBAR1_EPWM26_SYNCOUT_SEL << 26) | (MW_OUTPUTXBAR1_EPWM27_SYNCOUT_SEL << 27) | (MW_OUTPUTXBAR1_EPWM28_SYNCOUT_SEL << 28) | (MW_OUTPUTXBAR1_EPWM29_SYNCOUT_SEL << 29) | (MW_OUTPUTXBAR1_EPWM30_SYNCOUT_SEL << 30) | (MW_OUTPUTXBAR1_EPWM31_SYNCOUT_SEL << 31);

            if(MW_OUTPUTXBAR1_EPWM0SYNCOUT_INSTANCE_SEL == 1)
                SOC_xbarSelectPWMSyncOutXBarInput(CSL_CONTROLSS_PWMSYNCOUTXBAR_U_BASE, 0, groupEPWMSyncOutputXbar[1]);
            else if(MW_OUTPUTXBAR1_EPWM1SYNCOUT_INSTANCE_SEL == 1)
                SOC_xbarSelectPWMSyncOutXBarInput(CSL_CONTROLSS_PWMSYNCOUTXBAR_U_BASE, 1, groupEPWMSyncOutputXbar[1]); 
            else if(MW_OUTPUTXBAR1_EPWM2SYNCOUT_INSTANCE_SEL == 1)
                SOC_xbarSelectPWMSyncOutXBarInput(CSL_CONTROLSS_PWMSYNCOUTXBAR_U_BASE, 2, groupEPWMSyncOutputXbar[1]);  
            else if(MW_OUTPUTXBAR1_EPWM3SYNCOUT_INSTANCE_SEL == 1)
                SOC_xbarSelectPWMSyncOutXBarInput(CSL_CONTROLSS_PWMSYNCOUTXBAR_U_BASE, 3, groupEPWMSyncOutputXbar[1]);
        }
        else if((i==2 && (MW_OUTPUTXBAR2_EPWM0_SYNCOUT_SEL | MW_OUTPUTXBAR2_EPWM1_SYNCOUT_SEL | MW_OUTPUTXBAR2_EPWM2_SYNCOUT_SEL | MW_OUTPUTXBAR2_EPWM3_SYNCOUT_SEL | MW_OUTPUTXBAR2_EPWM4_SYNCOUT_SEL | MW_OUTPUTXBAR2_EPWM5_SYNCOUT_SEL | MW_OUTPUTXBAR2_EPWM6_SYNCOUT_SEL | MW_OUTPUTXBAR2_EPWM7_SYNCOUT_SEL | MW_OUTPUTXBAR2_EPWM8_SYNCOUT_SEL | MW_OUTPUTXBAR2_EPWM9_SYNCOUT_SEL | MW_OUTPUTXBAR2_EPWM10_SYNCOUT_SEL | MW_OUTPUTXBAR2_EPWM11_SYNCOUT_SEL | MW_OUTPUTXBAR2_EPWM12_SYNCOUT_SEL | MW_OUTPUTXBAR2_EPWM13_SYNCOUT_SEL | MW_OUTPUTXBAR2_EPWM14_SYNCOUT_SEL | MW_OUTPUTXBAR2_EPWM15_SYNCOUT_SEL | MW_OUTPUTXBAR2_EPWM16_SYNCOUT_SEL | MW_OUTPUTXBAR2_EPWM17_SYNCOUT_SEL | MW_OUTPUTXBAR2_EPWM18_SYNCOUT_SEL | MW_OUTPUTXBAR2_EPWM19_SYNCOUT_SEL | MW_OUTPUTXBAR2_EPWM20_SYNCOUT_SEL | MW_OUTPUTXBAR2_EPWM21_SYNCOUT_SEL | MW_OUTPUTXBAR2_EPWM22_SYNCOUT_SEL | MW_OUTPUTXBAR2_EPWM23_SYNCOUT_SEL | MW_OUTPUTXBAR2_EPWM24_SYNCOUT_SEL | MW_OUTPUTXBAR2_EPWM25_SYNCOUT_SEL | MW_OUTPUTXBAR2_EPWM26_SYNCOUT_SEL | MW_OUTPUTXBAR2_EPWM27_SYNCOUT_SEL | MW_OUTPUTXBAR2_EPWM28_SYNCOUT_SEL | MW_OUTPUTXBAR2_EPWM29_SYNCOUT_SEL | MW_OUTPUTXBAR2_EPWM30_SYNCOUT_SEL | MW_OUTPUTXBAR2_EPWM31_SYNCOUT_SEL)))
        {
            groupEPWMSyncOutputXbar[2] = (MW_OUTPUTXBAR2_EPWM0_SYNCOUT_SEL << 0) | (MW_OUTPUTXBAR2_EPWM1_SYNCOUT_SEL << 1) | (MW_OUTPUTXBAR2_EPWM2_SYNCOUT_SEL << 2) | (MW_OUTPUTXBAR2_EPWM3_SYNCOUT_SEL << 3) | (MW_OUTPUTXBAR2_EPWM4_SYNCOUT_SEL << 4) | (MW_OUTPUTXBAR2_EPWM5_SYNCOUT_SEL << 5) | (MW_OUTPUTXBAR2_EPWM6_SYNCOUT_SEL << 6) | (MW_OUTPUTXBAR2_EPWM7_SYNCOUT_SEL << 7) | (MW_OUTPUTXBAR2_EPWM8_SYNCOUT_SEL << 8) | (MW_OUTPUTXBAR2_EPWM9_SYNCOUT_SEL << 9) | (MW_OUTPUTXBAR2_EPWM10_SYNCOUT_SEL << 10) | (MW_OUTPUTXBAR2_EPWM11_SYNCOUT_SEL << 11) | (MW_OUTPUTXBAR2_EPWM12_SYNCOUT_SEL << 12) | (MW_OUTPUTXBAR2_EPWM13_SYNCOUT_SEL << 13) | (MW_OUTPUTXBAR2_EPWM14_SYNCOUT_SEL << 14) | (MW_OUTPUTXBAR2_EPWM15_SYNCOUT_SEL << 15) | (MW_OUTPUTXBAR2_EPWM16_SYNCOUT_SEL << 16) | (MW_OUTPUTXBAR2_EPWM17_SYNCOUT_SEL << 17) | (MW_OUTPUTXBAR2_EPWM18_SYNCOUT_SEL << 18) | (MW_OUTPUTXBAR2_EPWM19_SYNCOUT_SEL << 19) | (MW_OUTPUTXBAR2_EPWM20_SYNCOUT_SEL << 20) | (MW_OUTPUTXBAR2_EPWM21_SYNCOUT_SEL << 21) | (MW_OUTPUTXBAR2_EPWM22_SYNCOUT_SEL << 22) | (MW_OUTPUTXBAR2_EPWM23_SYNCOUT_SEL << 23) | (MW_OUTPUTXBAR2_EPWM24_SYNCOUT_SEL << 24) | (MW_OUTPUTXBAR2_EPWM25_SYNCOUT_SEL << 25) | (MW_OUTPUTXBAR2_EPWM26_SYNCOUT_SEL << 26) | (MW_OUTPUTXBAR2_EPWM27_SYNCOUT_SEL << 27) | (MW_OUTPUTXBAR2_EPWM28_SYNCOUT_SEL << 28) | (MW_OUTPUTXBAR2_EPWM29_SYNCOUT_SEL << 29) | (MW_OUTPUTXBAR2_EPWM30_SYNCOUT_SEL << 30) | (MW_OUTPUTXBAR2_EPWM31_SYNCOUT_SEL << 31);

