TexasInstruments/am26x-hsp/src/am263px_init.c
            if(MW_OUTPUTXBAR2_EPWM0SYNCOUT_INSTANCE_SEL == 1)
                SOC_xbarSelectPWMSyncOutXBarInput(CSL_CONTROLSS_PWMSYNCOUTXBAR_U_BASE, 0, groupEPWMSyncOutputXbar[2]);
            else if(MW_OUTPUTXBAR2_EPWM1SYNCOUT_INSTANCE_SEL == 1)
                SOC_xbarSelectPWMSyncOutXBarInput(CSL_CONTROLSS_PWMSYNCOUTXBAR_U_BASE, 1, groupEPWMSyncOutputXbar[2]); 
            else if(MW_OUTPUTXBAR2_EPWM2SYNCOUT_INSTANCE_SEL == 1)
                SOC_xbarSelectPWMSyncOutXBarInput(CSL_CONTROLSS_PWMSYNCOUTXBAR_U_BASE, 2, groupEPWMSyncOutputXbar[2]);  
            else if(MW_OUTPUTXBAR2_EPWM3SYNCOUT_INSTANCE_SEL == 1)
                SOC_xbarSelectPWMSyncOutXBarInput(CSL_CONTROLSS_PWMSYNCOUTXBAR_U_BASE, 3, groupEPWMSyncOutputXbar[2]); 
        }
        else if((i==3 && (MW_OUTPUTXBAR3_EPWM0_SYNCOUT_SEL | MW_OUTPUTXBAR3_EPWM1_SYNCOUT_SEL | MW_OUTPUTXBAR3_EPWM2_SYNCOUT_SEL | MW_OUTPUTXBAR3_EPWM3_SYNCOUT_SEL | MW_OUTPUTXBAR3_EPWM4_SYNCOUT_SEL | MW_OUTPUTXBAR3_EPWM5_SYNCOUT_SEL | MW_OUTPUTXBAR3_EPWM6_SYNCOUT_SEL | MW_OUTPUTXBAR3_EPWM7_SYNCOUT_SEL | MW_OUTPUTXBAR3_EPWM8_SYNCOUT_SEL | MW_OUTPUTXBAR3_EPWM9_SYNCOUT_SEL | MW_OUTPUTXBAR3_EPWM10_SYNCOUT_SEL | MW_OUTPUTXBAR3_EPWM11_SYNCOUT_SEL | MW_OUTPUTXBAR3_EPWM12_SYNCOUT_SEL | MW_OUTPUTXBAR3_EPWM13_SYNCOUT_SEL | MW_OUTPUTXBAR3_EPWM14_SYNCOUT_SEL | MW_OUTPUTXBAR3_EPWM15_SYNCOUT_SEL | MW_OUTPUTXBAR3_EPWM16_SYNCOUT_SEL | MW_OUTPUTXBAR3_EPWM17_SYNCOUT_SEL | MW_OUTPUTXBAR3_EPWM18_SYNCOUT_SEL | MW_OUTPUTXBAR3_EPWM19_SYNCOUT_SEL | MW_OUTPUTXBAR3_EPWM20_SYNCOUT_SEL | MW_OUTPUTXBAR3_EPWM21_SYNCOUT_SEL | MW_OUTPUTXBAR3_EPWM22_SYNCOUT_SEL | MW_OUTPUTXBAR3_EPWM23_SYNCOUT_SEL | MW_OUTPUTXBAR3_EPWM24_SYNCOUT_SEL | MW_OUTPUTXBAR3_EPWM25_SYNCOUT_SEL | MW_OUTPUTXBAR3_EPWM26_SYNCOUT_SEL | MW_OUTPUTXBAR3_EPWM27_SYNCOUT_SEL | MW_OUTPUTXBAR3_EPWM28_SYNCOUT_SEL | MW_OUTPUTXBAR3_EPWM29_SYNCOUT_SEL | MW_OUTPUTXBAR3_EPWM30_SYNCOUT_SEL | MW_OUTPUTXBAR3_EPWM31_SYNCOUT_SEL)))
        {
            groupEPWMSyncOutputXbar[3] = (MW_OUTPUTXBAR3_EPWM0_SYNCOUT_SEL << 0) | (MW_OUTPUTXBAR3_EPWM1_SYNCOUT_SEL << 1) | (MW_OUTPUTXBAR3_EPWM2_SYNCOUT_SEL << 2) | (MW_OUTPUTXBAR3_EPWM3_SYNCOUT_SEL << 3) | (MW_OUTPUTXBAR3_EPWM4_SYNCOUT_SEL << 4) | (MW_OUTPUTXBAR3_EPWM5_SYNCOUT_SEL << 5) | (MW_OUTPUTXBAR3_EPWM6_SYNCOUT_SEL << 6) | (MW_OUTPUTXBAR3_EPWM7_SYNCOUT_SEL << 7) | (MW_OUTPUTXBAR3_EPWM8_SYNCOUT_SEL << 8) | (MW_OUTPUTXBAR3_EPWM9_SYNCOUT_SEL << 9) | (MW_OUTPUTXBAR3_EPWM10_SYNCOUT_SEL << 10) | (MW_OUTPUTXBAR3_EPWM11_SYNCOUT_SEL << 11) | (MW_OUTPUTXBAR3_EPWM12_SYNCOUT_SEL << 12) | (MW_OUTPUTXBAR3_EPWM13_SYNCOUT_SEL << 13) | (MW_OUTPUTXBAR3_EPWM14_SYNCOUT_SEL << 14) | (MW_OUTPUTXBAR3_EPWM15_SYNCOUT_SEL << 15) | (MW_OUTPUTXBAR3_EPWM16_SYNCOUT_SEL << 16) | (MW_OUTPUTXBAR3_EPWM17_SYNCOUT_SEL << 17) | (MW_OUTPUTXBAR3_EPWM18_SYNCOUT_SEL << 18) | (MW_OUTPUTXBAR3_EPWM19_SYNCOUT_SEL << 19) | (MW_OUTPUTXBAR3_EPWM20_SYNCOUT_SEL << 20) | (MW_OUTPUTXBAR3_EPWM21_SYNCOUT_SEL << 21) | (MW_OUTPUTXBAR3_EPWM22_SYNCOUT_SEL << 22) | (MW_OUTPUTXBAR3_EPWM23_SYNCOUT_SEL << 23) | (MW_OUTPUTXBAR3_EPWM24_SYNCOUT_SEL << 24) | (MW_OUTPUTXBAR3_EPWM25_SYNCOUT_SEL << 25) | (MW_OUTPUTXBAR3_EPWM26_SYNCOUT_SEL << 26) | (MW_OUTPUTXBAR3_EPWM27_SYNCOUT_SEL << 27) | (MW_OUTPUTXBAR3_EPWM28_SYNCOUT_SEL << 28) | (MW_OUTPUTXBAR3_EPWM29_SYNCOUT_SEL << 29) | (MW_OUTPUTXBAR3_EPWM30_SYNCOUT_SEL << 30) | (MW_OUTPUTXBAR3_EPWM31_SYNCOUT_SEL << 31);
        
            if(MW_OUTPUTXBAR3_EPWM0SYNCOUT_INSTANCE_SEL == 1)
                SOC_xbarSelectPWMSyncOutXBarInput(CSL_CONTROLSS_PWMSYNCOUTXBAR_U_BASE, 0, groupEPWMSyncOutputXbar[3]);
            else if(MW_OUTPUTXBAR3_EPWM1SYNCOUT_INSTANCE_SEL == 1)
                SOC_xbarSelectPWMSyncOutXBarInput(CSL_CONTROLSS_PWMSYNCOUTXBAR_U_BASE, 1, groupEPWMSyncOutputXbar[3]); 
            else if(MW_OUTPUTXBAR3_EPWM2SYNCOUT_INSTANCE_SEL == 1)
                SOC_xbarSelectPWMSyncOutXBarInput(CSL_CONTROLSS_PWMSYNCOUTXBAR_U_BASE, 2, groupEPWMSyncOutputXbar[3]);  
            else if(MW_OUTPUTXBAR3_EPWM3SYNCOUT_INSTANCE_SEL == 1)
                SOC_xbarSelectPWMSyncOutXBarInput(CSL_CONTROLSS_PWMSYNCOUTXBAR_U_BASE, 3, groupEPWMSyncOutputXbar[3]); 
        }
        else if((i==4 && (MW_OUTPUTXBAR4_EPWM0_SYNCOUT_SEL | MW_OUTPUTXBAR4_EPWM1_SYNCOUT_SEL | MW_OUTPUTXBAR4_EPWM2_SYNCOUT_SEL | MW_OUTPUTXBAR4_EPWM3_SYNCOUT_SEL | MW_OUTPUTXBAR4_EPWM4_SYNCOUT_SEL | MW_OUTPUTXBAR4_EPWM5_SYNCOUT_SEL | MW_OUTPUTXBAR4_EPWM6_SYNCOUT_SEL | MW_OUTPUTXBAR4_EPWM7_SYNCOUT_SEL | MW_OUTPUTXBAR4_EPWM8_SYNCOUT_SEL | MW_OUTPUTXBAR4_EPWM9_SYNCOUT_SEL | MW_OUTPUTXBAR4_EPWM10_SYNCOUT_SEL | MW_OUTPUTXBAR4_EPWM11_SYNCOUT_SEL | MW_OUTPUTXBAR4_EPWM12_SYNCOUT_SEL | MW_OUTPUTXBAR4_EPWM13_SYNCOUT_SEL | MW_OUTPUTXBAR4_EPWM14_SYNCOUT_SEL | MW_OUTPUTXBAR4_EPWM15_SYNCOUT_SEL | MW_OUTPUTXBAR4_EPWM16_SYNCOUT_SEL | MW_OUTPUTXBAR4_EPWM17_SYNCOUT_SEL | MW_OUTPUTXBAR4_EPWM18_SYNCOUT_SEL | MW_OUTPUTXBAR4_EPWM19_SYNCOUT_SEL | MW_OUTPUTXBAR4_EPWM20_SYNCOUT_SEL | MW_OUTPUTXBAR4_EPWM21_SYNCOUT_SEL | MW_OUTPUTXBAR4_EPWM22_SYNCOUT_SEL | MW_OUTPUTXBAR4_EPWM23_SYNCOUT_SEL | MW_OUTPUTXBAR4_EPWM24_SYNCOUT_SEL | MW_OUTPUTXBAR4_EPWM25_SYNCOUT_SEL | MW_OUTPUTXBAR4_EPWM26_SYNCOUT_SEL | MW_OUTPUTXBAR4_EPWM27_SYNCOUT_SEL | MW_OUTPUTXBAR4_EPWM28_SYNCOUT_SEL | MW_OUTPUTXBAR4_EPWM29_SYNCOUT_SEL | MW_OUTPUTXBAR4_EPWM30_SYNCOUT_SEL | MW_OUTPUTXBAR4_EPWM31_SYNCOUT_SEL)))
        {
            groupEPWMSyncOutputXbar[4] = (MW_OUTPUTXBAR4_EPWM0_SYNCOUT_SEL << 0) | (MW_OUTPUTXBAR4_EPWM1_SYNCOUT_SEL << 1) | (MW_OUTPUTXBAR4_EPWM2_SYNCOUT_SEL << 2) | (MW_OUTPUTXBAR4_EPWM3_SYNCOUT_SEL << 3) | (MW_OUTPUTXBAR4_EPWM4_SYNCOUT_SEL << 4) | (MW_OUTPUTXBAR4_EPWM5_SYNCOUT_SEL << 5) | (MW_OUTPUTXBAR4_EPWM6_SYNCOUT_SEL << 6) | (MW_OUTPUTXBAR4_EPWM7_SYNCOUT_SEL << 7) | (MW_OUTPUTXBAR4_EPWM8_SYNCOUT_SEL << 8) | (MW_OUTPUTXBAR4_EPWM9_SYNCOUT_SEL << 9) | (MW_OUTPUTXBAR4_EPWM10_SYNCOUT_SEL << 10) | (MW_OUTPUTXBAR4_EPWM11_SYNCOUT_SEL << 11) | (MW_OUTPUTXBAR4_EPWM12_SYNCOUT_SEL << 12) | (MW_OUTPUTXBAR4_EPWM13_SYNCOUT_SEL << 13) | (MW_OUTPUTXBAR4_EPWM14_SYNCOUT_SEL << 14) | (MW_OUTPUTXBAR4_EPWM15_SYNCOUT_SEL << 15) | (MW_OUTPUTXBAR4_EPWM16_SYNCOUT_SEL << 16) | (MW_OUTPUTXBAR4_EPWM17_SYNCOUT_SEL << 17) | (MW_OUTPUTXBAR4_EPWM18_SYNCOUT_SEL << 18) | (MW_OUTPUTXBAR4_EPWM19_SYNCOUT_SEL << 19) | (MW_OUTPUTXBAR4_EPWM20_SYNCOUT_SEL << 20) | (MW_OUTPUTXBAR4_EPWM21_SYNCOUT_SEL << 21) | (MW_OUTPUTXBAR4_EPWM22_SYNCOUT_SEL << 22) | (MW_OUTPUTXBAR4_EPWM23_SYNCOUT_SEL << 23) | (MW_OUTPUTXBAR4_EPWM24_SYNCOUT_SEL << 24) | (MW_OUTPUTXBAR4_EPWM25_SYNCOUT_SEL << 25) | (MW_OUTPUTXBAR4_EPWM26_SYNCOUT_SEL << 26) | (MW_OUTPUTXBAR4_EPWM27_SYNCOUT_SEL << 27) | (MW_OUTPUTXBAR4_EPWM28_SYNCOUT_SEL << 28) | (MW_OUTPUTXBAR4_EPWM29_SYNCOUT_SEL << 29) | (MW_OUTPUTXBAR4_EPWM30_SYNCOUT_SEL << 30) | (MW_OUTPUTXBAR4_EPWM31_SYNCOUT_SEL << 31);
        
            if(MW_OUTPUTXBAR4_EPWM0SYNCOUT_INSTANCE_SEL == 1)
                SOC_xbarSelectPWMSyncOutXBarInput(CSL_CONTROLSS_PWMSYNCOUTXBAR_U_BASE, 0, groupEPWMSyncOutputXbar[4]);
            else if(MW_OUTPUTXBAR4_EPWM1SYNCOUT_INSTANCE_SEL == 1)
                SOC_xbarSelectPWMSyncOutXBarInput(CSL_CONTROLSS_PWMSYNCOUTXBAR_U_BASE, 1, groupEPWMSyncOutputXbar[4]); 
            else if(MW_OUTPUTXBAR4_EPWM2SYNCOUT_INSTANCE_SEL == 1)
                SOC_xbarSelectPWMSyncOutXBarInput(CSL_CONTROLSS_PWMSYNCOUTXBAR_U_BASE, 2, groupEPWMSyncOutputXbar[4]);  
            else if(MW_OUTPUTXBAR4_EPWM3SYNCOUT_INSTANCE_SEL == 1)
                SOC_xbarSelectPWMSyncOutXBarInput(CSL_CONTROLSS_PWMSYNCOUTXBAR_U_BASE, 3, groupEPWMSyncOutputXbar[4]); 
        }
        else if((i==5 && (MW_OUTPUTXBAR5_EPWM0_SYNCOUT_SEL | MW_OUTPUTXBAR5_EPWM1_SYNCOUT_SEL | MW_OUTPUTXBAR5_EPWM2_SYNCOUT_SEL | MW_OUTPUTXBAR5_EPWM3_SYNCOUT_SEL | MW_OUTPUTXBAR5_EPWM4_SYNCOUT_SEL | MW_OUTPUTXBAR5_EPWM5_SYNCOUT_SEL | MW_OUTPUTXBAR5_EPWM6_SYNCOUT_SEL | MW_OUTPUTXBAR5_EPWM7_SYNCOUT_SEL | MW_OUTPUTXBAR5_EPWM8_SYNCOUT_SEL | MW_OUTPUTXBAR5_EPWM9_SYNCOUT_SEL | MW_OUTPUTXBAR5_EPWM10_SYNCOUT_SEL | MW_OUTPUTXBAR5_EPWM11_SYNCOUT_SEL | MW_OUTPUTXBAR5_EPWM12_SYNCOUT_SEL | MW_OUTPUTXBAR5_EPWM13_SYNCOUT_SEL | MW_OUTPUTXBAR5_EPWM14_SYNCOUT_SEL | MW_OUTPUTXBAR5_EPWM15_SYNCOUT_SEL | MW_OUTPUTXBAR5_EPWM16_SYNCOUT_SEL | MW_OUTPUTXBAR5_EPWM17_SYNCOUT_SEL | MW_OUTPUTXBAR5_EPWM18_SYNCOUT_SEL | MW_OUTPUTXBAR5_EPWM19_SYNCOUT_SEL | MW_OUTPUTXBAR5_EPWM20_SYNCOUT_SEL | MW_OUTPUTXBAR5_EPWM21_SYNCOUT_SEL | MW_OUTPUTXBAR5_EPWM22_SYNCOUT_SEL | MW_OUTPUTXBAR5_EPWM23_SYNCOUT_SEL | MW_OUTPUTXBAR5_EPWM24_SYNCOUT_SEL | MW_OUTPUTXBAR5_EPWM25_SYNCOUT_SEL | MW_OUTPUTXBAR5_EPWM26_SYNCOUT_SEL | MW_OUTPUTXBAR5_EPWM27_SYNCOUT_SEL | MW_OUTPUTXBAR5_EPWM28_SYNCOUT_SEL | MW_OUTPUTXBAR5_EPWM29_SYNCOUT_SEL | MW_OUTPUTXBAR5_EPWM30_SYNCOUT_SEL | MW_OUTPUTXBAR5_EPWM31_SYNCOUT_SEL)))
        {
            groupEPWMSyncOutputXbar[5] = (MW_OUTPUTXBAR5_EPWM0_SYNCOUT_SEL << 0) | (MW_OUTPUTXBAR5_EPWM1_SYNCOUT_SEL << 1) | (MW_OUTPUTXBAR5_EPWM2_SYNCOUT_SEL << 2) | (MW_OUTPUTXBAR5_EPWM3_SYNCOUT_SEL << 3) | (MW_OUTPUTXBAR5_EPWM4_SYNCOUT_SEL << 4) | (MW_OUTPUTXBAR5_EPWM5_SYNCOUT_SEL << 5) | (MW_OUTPUTXBAR5_EPWM6_SYNCOUT_SEL << 6) | (MW_OUTPUTXBAR5_EPWM7_SYNCOUT_SEL << 7) | (MW_OUTPUTXBAR5_EPWM8_SYNCOUT_SEL << 8) | (MW_OUTPUTXBAR5_EPWM9_SYNCOUT_SEL << 9) | (MW_OUTPUTXBAR5_EPWM10_SYNCOUT_SEL << 10) | (MW_OUTPUTXBAR5_EPWM11_SYNCOUT_SEL << 11) | (MW_OUTPUTXBAR5_EPWM12_SYNCOUT_SEL << 12) | (MW_OUTPUTXBAR5_EPWM13_SYNCOUT_SEL << 13) | (MW_OUTPUTXBAR5_EPWM14_SYNCOUT_SEL << 14) | (MW_OUTPUTXBAR5_EPWM15_SYNCOUT_SEL << 15) | (MW_OUTPUTXBAR5_EPWM16_SYNCOUT_SEL << 16) | (MW_OUTPUTXBAR5_EPWM17_SYNCOUT_SEL << 17) | (MW_OUTPUTXBAR5_EPWM18_SYNCOUT_SEL << 18) | (MW_OUTPUTXBAR5_EPWM19_SYNCOUT_SEL << 19) | (MW_OUTPUTXBAR5_EPWM20_SYNCOUT_SEL << 20) | (MW_OUTPUTXBAR5_EPWM21_SYNCOUT_SEL << 21) | (MW_OUTPUTXBAR5_EPWM22_SYNCOUT_SEL << 22) | (MW_OUTPUTXBAR5_EPWM23_SYNCOUT_SEL << 23) | (MW_OUTPUTXBAR5_EPWM24_SYNCOUT_SEL << 24) | (MW_OUTPUTXBAR5_EPWM25_SYNCOUT_SEL << 25) | (MW_OUTPUTXBAR5_EPWM26_SYNCOUT_SEL << 26) | (MW_OUTPUTXBAR5_EPWM27_SYNCOUT_SEL << 27) | (MW_OUTPUTXBAR5_EPWM28_SYNCOUT_SEL << 28) | (MW_OUTPUTXBAR5_EPWM29_SYNCOUT_SEL << 29) | (MW_OUTPUTXBAR5_EPWM30_SYNCOUT_SEL << 30) | (MW_OUTPUTXBAR5_EPWM31_SYNCOUT_SEL << 31);
        
            if(MW_OUTPUTXBAR5_EPWM0SYNCOUT_INSTANCE_SEL == 1)
                SOC_xbarSelectPWMSyncOutXBarInput(CSL_CONTROLSS_PWMSYNCOUTXBAR_U_BASE, 0, groupEPWMSyncOutputXbar[5]);
            else if(MW_OUTPUTXBAR5_EPWM1SYNCOUT_INSTANCE_SEL == 1)
                SOC_xbarSelectPWMSyncOutXBarInput(CSL_CONTROLSS_PWMSYNCOUTXBAR_U_BASE, 1, groupEPWMSyncOutputXbar[5]); 
            else if(MW_OUTPUTXBAR5_EPWM2SYNCOUT_INSTANCE_SEL == 1)
                SOC_xbarSelectPWMSyncOutXBarInput(CSL_CONTROLSS_PWMSYNCOUTXBAR_U_BASE, 2, groupEPWMSyncOutputXbar[5]);  
            else if(MW_OUTPUTXBAR5_EPWM3SYNCOUT_INSTANCE_SEL == 1)
                SOC_xbarSelectPWMSyncOutXBarInput(CSL_CONTROLSS_PWMSYNCOUTXBAR_U_BASE, 3, groupEPWMSyncOutputXbar[5]);    
        }
        else if((i==6 && (MW_OUTPUTXBAR6_EPWM0_SYNCOUT_SEL | MW_OUTPUTXBAR6_EPWM1_SYNCOUT_SEL | MW_OUTPUTXBAR6_EPWM2_SYNCOUT_SEL | MW_OUTPUTXBAR6_EPWM3_SYNCOUT_SEL | MW_OUTPUTXBAR6_EPWM4_SYNCOUT_SEL | MW_OUTPUTXBAR6_EPWM5_SYNCOUT_SEL | MW_OUTPUTXBAR6_EPWM6_SYNCOUT_SEL | MW_OUTPUTXBAR6_EPWM7_SYNCOUT_SEL | MW_OUTPUTXBAR6_EPWM8_SYNCOUT_SEL | MW_OUTPUTXBAR6_EPWM9_SYNCOUT_SEL | MW_OUTPUTXBAR6_EPWM10_SYNCOUT_SEL | MW_OUTPUTXBAR6_EPWM11_SYNCOUT_SEL | MW_OUTPUTXBAR6_EPWM12_SYNCOUT_SEL | MW_OUTPUTXBAR6_EPWM13_SYNCOUT_SEL | MW_OUTPUTXBAR6_EPWM14_SYNCOUT_SEL | MW_OUTPUTXBAR6_EPWM15_SYNCOUT_SEL | MW_OUTPUTXBAR6_EPWM16_SYNCOUT_SEL | MW_OUTPUTXBAR6_EPWM17_SYNCOUT_SEL | MW_OUTPUTXBAR6_EPWM18_SYNCOUT_SEL | MW_OUTPUTXBAR6_EPWM19_SYNCOUT_SEL | MW_OUTPUTXBAR6_EPWM20_SYNCOUT_SEL | MW_OUTPUTXBAR6_EPWM21_SYNCOUT_SEL | MW_OUTPUTXBAR6_EPWM22_SYNCOUT_SEL | MW_OUTPUTXBAR6_EPWM23_SYNCOUT_SEL | MW_OUTPUTXBAR6_EPWM24_SYNCOUT_SEL | MW_OUTPUTXBAR6_EPWM25_SYNCOUT_SEL | MW_OUTPUTXBAR6_EPWM26_SYNCOUT_SEL | MW_OUTPUTXBAR6_EPWM27_SYNCOUT_SEL | MW_OUTPUTXBAR6_EPWM28_SYNCOUT_SEL | MW_OUTPUTXBAR6_EPWM29_SYNCOUT_SEL | MW_OUTPUTXBAR6_EPWM30_SYNCOUT_SEL | MW_OUTPUTXBAR6_EPWM31_SYNCOUT_SEL)))
        {
            groupEPWMSyncOutputXbar[6] = (MW_OUTPUTXBAR6_EPWM0_SYNCOUT_SEL << 0) | (MW_OUTPUTXBAR6_EPWM1_SYNCOUT_SEL << 1) | (MW_OUTPUTXBAR6_EPWM2_SYNCOUT_SEL << 2) | (MW_OUTPUTXBAR6_EPWM3_SYNCOUT_SEL << 3) | (MW_OUTPUTXBAR6_EPWM4_SYNCOUT_SEL << 4) | (MW_OUTPUTXBAR6_EPWM5_SYNCOUT_SEL << 5) | (MW_OUTPUTXBAR6_EPWM6_SYNCOUT_SEL << 6) | (MW_OUTPUTXBAR6_EPWM7_SYNCOUT_SEL << 7) | (MW_OUTPUTXBAR6_EPWM8_SYNCOUT_SEL << 8) | (MW_OUTPUTXBAR6_EPWM9_SYNCOUT_SEL << 9) | (MW_OUTPUTXBAR6_EPWM10_SYNCOUT_SEL << 10) | (MW_OUTPUTXBAR6_EPWM11_SYNCOUT_SEL << 11) | (MW_OUTPUTXBAR6_EPWM12_SYNCOUT_SEL << 12) | (MW_OUTPUTXBAR6_EPWM13_SYNCOUT_SEL << 13) | (MW_OUTPUTXBAR6_EPWM14_SYNCOUT_SEL << 14) | (MW_OUTPUTXBAR6_EPWM15_SYNCOUT_SEL << 15) | (MW_OUTPUTXBAR6_EPWM16_SYNCOUT_SEL << 16) | (MW_OUTPUTXBAR6_EPWM17_SYNCOUT_SEL << 17) | (MW_OUTPUTXBAR6_EPWM18_SYNCOUT_SEL << 18) | (MW_OUTPUTXBAR6_EPWM19_SYNCOUT_SEL << 19) | (MW_OUTPUTXBAR6_EPWM20_SYNCOUT_SEL << 20) | (MW_OUTPUTXBAR6_EPWM21_SYNCOUT_SEL << 21) | (MW_OUTPUTXBAR6_EPWM22_SYNCOUT_SEL << 22) | (MW_OUTPUTXBAR6_EPWM23_SYNCOUT_SEL << 23) | (MW_OUTPUTXBAR6_EPWM24_SYNCOUT_SEL << 24) | (MW_OUTPUTXBAR6_EPWM25_SYNCOUT_SEL << 25) | (MW_OUTPUTXBAR6_EPWM26_SYNCOUT_SEL << 26) | (MW_OUTPUTXBAR6_EPWM27_SYNCOUT_SEL << 27) | (MW_OUTPUTXBAR6_EPWM28_SYNCOUT_SEL << 28) | (MW_OUTPUTXBAR6_EPWM29_SYNCOUT_SEL << 29) | (MW_OUTPUTXBAR6_EPWM30_SYNCOUT_SEL << 30) | (MW_OUTPUTXBAR6_EPWM31_SYNCOUT_SEL << 31);
        
