TexasInstruments/am26x-hsp/src/am263px_init.c
            if(MW_OUTPUTXBAR6_EPWM0SYNCOUT_INSTANCE_SEL == 1)
                SOC_xbarSelectPWMSyncOutXBarInput(CSL_CONTROLSS_PWMSYNCOUTXBAR_U_BASE, 0, groupEPWMSyncOutputXbar[6]);
            else if(MW_OUTPUTXBAR6_EPWM1SYNCOUT_INSTANCE_SEL == 1)
                SOC_xbarSelectPWMSyncOutXBarInput(CSL_CONTROLSS_PWMSYNCOUTXBAR_U_BASE, 1, groupEPWMSyncOutputXbar[6]); 
            else if(MW_OUTPUTXBAR6_EPWM2SYNCOUT_INSTANCE_SEL == 1)
                SOC_xbarSelectPWMSyncOutXBarInput(CSL_CONTROLSS_PWMSYNCOUTXBAR_U_BASE, 2, groupEPWMSyncOutputXbar[6]);  
            else if(MW_OUTPUTXBAR6_EPWM3SYNCOUT_INSTANCE_SEL == 1)
                SOC_xbarSelectPWMSyncOutXBarInput(CSL_CONTROLSS_PWMSYNCOUTXBAR_U_BASE, 3, groupEPWMSyncOutputXbar[6]);
        }
        else if((i==7 && (MW_OUTPUTXBAR7_EPWM0_SYNCOUT_SEL | MW_OUTPUTXBAR7_EPWM1_SYNCOUT_SEL | MW_OUTPUTXBAR7_EPWM2_SYNCOUT_SEL | MW_OUTPUTXBAR7_EPWM3_SYNCOUT_SEL | MW_OUTPUTXBAR7_EPWM4_SYNCOUT_SEL | MW_OUTPUTXBAR7_EPWM5_SYNCOUT_SEL | MW_OUTPUTXBAR7_EPWM6_SYNCOUT_SEL | MW_OUTPUTXBAR7_EPWM7_SYNCOUT_SEL | MW_OUTPUTXBAR7_EPWM8_SYNCOUT_SEL | MW_OUTPUTXBAR7_EPWM9_SYNCOUT_SEL | MW_OUTPUTXBAR7_EPWM10_SYNCOUT_SEL | MW_OUTPUTXBAR7_EPWM11_SYNCOUT_SEL | MW_OUTPUTXBAR7_EPWM12_SYNCOUT_SEL | MW_OUTPUTXBAR7_EPWM13_SYNCOUT_SEL | MW_OUTPUTXBAR7_EPWM14_SYNCOUT_SEL | MW_OUTPUTXBAR7_EPWM15_SYNCOUT_SEL | MW_OUTPUTXBAR7_EPWM16_SYNCOUT_SEL | MW_OUTPUTXBAR7_EPWM17_SYNCOUT_SEL | MW_OUTPUTXBAR7_EPWM18_SYNCOUT_SEL | MW_OUTPUTXBAR7_EPWM19_SYNCOUT_SEL | MW_OUTPUTXBAR7_EPWM20_SYNCOUT_SEL | MW_OUTPUTXBAR7_EPWM21_SYNCOUT_SEL | MW_OUTPUTXBAR7_EPWM22_SYNCOUT_SEL | MW_OUTPUTXBAR7_EPWM23_SYNCOUT_SEL | MW_OUTPUTXBAR7_EPWM24_SYNCOUT_SEL | MW_OUTPUTXBAR7_EPWM25_SYNCOUT_SEL | MW_OUTPUTXBAR7_EPWM26_SYNCOUT_SEL | MW_OUTPUTXBAR7_EPWM27_SYNCOUT_SEL | MW_OUTPUTXBAR7_EPWM28_SYNCOUT_SEL | MW_OUTPUTXBAR7_EPWM29_SYNCOUT_SEL | MW_OUTPUTXBAR7_EPWM30_SYNCOUT_SEL | MW_OUTPUTXBAR7_EPWM31_SYNCOUT_SEL)))
        {
            groupEPWMSyncOutputXbar[7] = (MW_OUTPUTXBAR7_EPWM0_SYNCOUT_SEL << 0) | (MW_OUTPUTXBAR7_EPWM1_SYNCOUT_SEL << 1) | (MW_OUTPUTXBAR7_EPWM2_SYNCOUT_SEL << 2) | (MW_OUTPUTXBAR7_EPWM3_SYNCOUT_SEL << 3) | (MW_OUTPUTXBAR7_EPWM4_SYNCOUT_SEL << 4) | (MW_OUTPUTXBAR7_EPWM5_SYNCOUT_SEL << 5) | (MW_OUTPUTXBAR7_EPWM6_SYNCOUT_SEL << 6) | (MW_OUTPUTXBAR7_EPWM7_SYNCOUT_SEL << 7) | (MW_OUTPUTXBAR7_EPWM8_SYNCOUT_SEL << 8) | (MW_OUTPUTXBAR7_EPWM9_SYNCOUT_SEL << 9) | (MW_OUTPUTXBAR7_EPWM10_SYNCOUT_SEL << 10) | (MW_OUTPUTXBAR7_EPWM11_SYNCOUT_SEL << 11) | (MW_OUTPUTXBAR7_EPWM12_SYNCOUT_SEL << 12) | (MW_OUTPUTXBAR7_EPWM13_SYNCOUT_SEL << 13) | (MW_OUTPUTXBAR7_EPWM14_SYNCOUT_SEL << 14) | (MW_OUTPUTXBAR7_EPWM15_SYNCOUT_SEL << 15) | (MW_OUTPUTXBAR7_EPWM16_SYNCOUT_SEL << 16) | (MW_OUTPUTXBAR7_EPWM17_SYNCOUT_SEL << 17) | (MW_OUTPUTXBAR7_EPWM18_SYNCOUT_SEL << 18) | (MW_OUTPUTXBAR7_EPWM19_SYNCOUT_SEL << 19) | (MW_OUTPUTXBAR7_EPWM20_SYNCOUT_SEL << 20) | (MW_OUTPUTXBAR7_EPWM21_SYNCOUT_SEL << 21) | (MW_OUTPUTXBAR7_EPWM22_SYNCOUT_SEL << 22) | (MW_OUTPUTXBAR7_EPWM23_SYNCOUT_SEL << 23) | (MW_OUTPUTXBAR7_EPWM24_SYNCOUT_SEL << 24) | (MW_OUTPUTXBAR7_EPWM25_SYNCOUT_SEL << 25) | (MW_OUTPUTXBAR7_EPWM26_SYNCOUT_SEL << 26) | (MW_OUTPUTXBAR7_EPWM27_SYNCOUT_SEL << 27) | (MW_OUTPUTXBAR7_EPWM28_SYNCOUT_SEL << 28) | (MW_OUTPUTXBAR7_EPWM29_SYNCOUT_SEL << 29) | (MW_OUTPUTXBAR7_EPWM30_SYNCOUT_SEL << 30) | (MW_OUTPUTXBAR7_EPWM31_SYNCOUT_SEL << 31);
        
            if(MW_OUTPUTXBAR7_EPWM0SYNCOUT_INSTANCE_SEL == 1)
                SOC_xbarSelectPWMSyncOutXBarInput(CSL_CONTROLSS_PWMSYNCOUTXBAR_U_BASE, 0, groupEPWMSyncOutputXbar[7]);
            else if(MW_OUTPUTXBAR7_EPWM1SYNCOUT_INSTANCE_SEL == 1)
                SOC_xbarSelectPWMSyncOutXBarInput(CSL_CONTROLSS_PWMSYNCOUTXBAR_U_BASE, 1, groupEPWMSyncOutputXbar[7]); 
            else if(MW_OUTPUTXBAR7_EPWM2SYNCOUT_INSTANCE_SEL == 1)
                SOC_xbarSelectPWMSyncOutXBarInput(CSL_CONTROLSS_PWMSYNCOUTXBAR_U_BASE, 2, groupEPWMSyncOutputXbar[7]);  
            else if(MW_OUTPUTXBAR7_EPWM3SYNCOUT_INSTANCE_SEL == 1)
                SOC_xbarSelectPWMSyncOutXBarInput(CSL_CONTROLSS_PWMSYNCOUTXBAR_U_BASE, 3, groupEPWMSyncOutputXbar[7]); 
        }
        else if((i==8 && (MW_OUTPUTXBAR8_EPWM0_SYNCOUT_SEL | MW_OUTPUTXBAR8_EPWM1_SYNCOUT_SEL | MW_OUTPUTXBAR8_EPWM2_SYNCOUT_SEL | MW_OUTPUTXBAR8_EPWM3_SYNCOUT_SEL | MW_OUTPUTXBAR8_EPWM4_SYNCOUT_SEL | MW_OUTPUTXBAR8_EPWM5_SYNCOUT_SEL | MW_OUTPUTXBAR8_EPWM6_SYNCOUT_SEL | MW_OUTPUTXBAR8_EPWM7_SYNCOUT_SEL | MW_OUTPUTXBAR8_EPWM8_SYNCOUT_SEL | MW_OUTPUTXBAR8_EPWM9_SYNCOUT_SEL | MW_OUTPUTXBAR8_EPWM10_SYNCOUT_SEL | MW_OUTPUTXBAR8_EPWM11_SYNCOUT_SEL | MW_OUTPUTXBAR8_EPWM12_SYNCOUT_SEL | MW_OUTPUTXBAR8_EPWM13_SYNCOUT_SEL | MW_OUTPUTXBAR8_EPWM14_SYNCOUT_SEL | MW_OUTPUTXBAR8_EPWM15_SYNCOUT_SEL | MW_OUTPUTXBAR8_EPWM16_SYNCOUT_SEL | MW_OUTPUTXBAR8_EPWM17_SYNCOUT_SEL | MW_OUTPUTXBAR8_EPWM18_SYNCOUT_SEL | MW_OUTPUTXBAR8_EPWM19_SYNCOUT_SEL | MW_OUTPUTXBAR8_EPWM20_SYNCOUT_SEL | MW_OUTPUTXBAR8_EPWM21_SYNCOUT_SEL | MW_OUTPUTXBAR8_EPWM22_SYNCOUT_SEL | MW_OUTPUTXBAR8_EPWM23_SYNCOUT_SEL | MW_OUTPUTXBAR8_EPWM24_SYNCOUT_SEL | MW_OUTPUTXBAR8_EPWM25_SYNCOUT_SEL | MW_OUTPUTXBAR8_EPWM26_SYNCOUT_SEL | MW_OUTPUTXBAR8_EPWM27_SYNCOUT_SEL | MW_OUTPUTXBAR8_EPWM28_SYNCOUT_SEL | MW_OUTPUTXBAR8_EPWM29_SYNCOUT_SEL | MW_OUTPUTXBAR8_EPWM30_SYNCOUT_SEL | MW_OUTPUTXBAR8_EPWM31_SYNCOUT_SEL)))
        {
            groupEPWMSyncOutputXbar[8] = (MW_OUTPUTXBAR8_EPWM0_SYNCOUT_SEL << 0) | (MW_OUTPUTXBAR8_EPWM1_SYNCOUT_SEL << 1) | (MW_OUTPUTXBAR8_EPWM2_SYNCOUT_SEL << 2) | (MW_OUTPUTXBAR8_EPWM3_SYNCOUT_SEL << 3) | (MW_OUTPUTXBAR8_EPWM4_SYNCOUT_SEL << 4) | (MW_OUTPUTXBAR8_EPWM5_SYNCOUT_SEL << 5) | (MW_OUTPUTXBAR8_EPWM6_SYNCOUT_SEL << 6) | (MW_OUTPUTXBAR8_EPWM7_SYNCOUT_SEL << 7) | (MW_OUTPUTXBAR8_EPWM8_SYNCOUT_SEL << 8) | (MW_OUTPUTXBAR8_EPWM9_SYNCOUT_SEL << 9) | (MW_OUTPUTXBAR8_EPWM10_SYNCOUT_SEL << 10) | (MW_OUTPUTXBAR8_EPWM11_SYNCOUT_SEL << 11) | (MW_OUTPUTXBAR8_EPWM12_SYNCOUT_SEL << 12) | (MW_OUTPUTXBAR8_EPWM13_SYNCOUT_SEL << 13) | (MW_OUTPUTXBAR8_EPWM14_SYNCOUT_SEL << 14) | (MW_OUTPUTXBAR8_EPWM15_SYNCOUT_SEL << 15) | (MW_OUTPUTXBAR8_EPWM16_SYNCOUT_SEL << 16) | (MW_OUTPUTXBAR8_EPWM17_SYNCOUT_SEL << 17) | (MW_OUTPUTXBAR8_EPWM18_SYNCOUT_SEL << 18) | (MW_OUTPUTXBAR8_EPWM19_SYNCOUT_SEL << 19) | (MW_OUTPUTXBAR8_EPWM20_SYNCOUT_SEL << 20) | (MW_OUTPUTXBAR8_EPWM21_SYNCOUT_SEL << 21) | (MW_OUTPUTXBAR8_EPWM22_SYNCOUT_SEL << 22) | (MW_OUTPUTXBAR8_EPWM23_SYNCOUT_SEL << 23) | (MW_OUTPUTXBAR8_EPWM24_SYNCOUT_SEL << 24) | (MW_OUTPUTXBAR8_EPWM25_SYNCOUT_SEL << 25) | (MW_OUTPUTXBAR8_EPWM26_SYNCOUT_SEL << 26) | (MW_OUTPUTXBAR8_EPWM27_SYNCOUT_SEL << 27) | (MW_OUTPUTXBAR8_EPWM28_SYNCOUT_SEL << 28) | (MW_OUTPUTXBAR8_EPWM29_SYNCOUT_SEL << 29) | (MW_OUTPUTXBAR8_EPWM30_SYNCOUT_SEL << 30) | (MW_OUTPUTXBAR8_EPWM31_SYNCOUT_SEL << 31);
        
            if(MW_OUTPUTXBAR8_EPWM0SYNCOUT_INSTANCE_SEL == 1)
                SOC_xbarSelectPWMSyncOutXBarInput(CSL_CONTROLSS_PWMSYNCOUTXBAR_U_BASE, 0, groupEPWMSyncOutputXbar[8]);
            else if(MW_OUTPUTXBAR8_EPWM1SYNCOUT_INSTANCE_SEL == 1)
                SOC_xbarSelectPWMSyncOutXBarInput(CSL_CONTROLSS_PWMSYNCOUTXBAR_U_BASE, 1, groupEPWMSyncOutputXbar[8]); 
            else if(MW_OUTPUTXBAR8_EPWM2SYNCOUT_INSTANCE_SEL == 1)
                SOC_xbarSelectPWMSyncOutXBarInput(CSL_CONTROLSS_PWMSYNCOUTXBAR_U_BASE, 2, groupEPWMSyncOutputXbar[8]);  
            else if(MW_OUTPUTXBAR8_EPWM3SYNCOUT_INSTANCE_SEL == 1)
                SOC_xbarSelectPWMSyncOutXBarInput(CSL_CONTROLSS_PWMSYNCOUTXBAR_U_BASE, 3, groupEPWMSyncOutputXbar[8]); 
        }
        else if((i==9 && (MW_OUTPUTXBAR9_EPWM0_SYNCOUT_SEL | MW_OUTPUTXBAR9_EPWM1_SYNCOUT_SEL | MW_OUTPUTXBAR9_EPWM2_SYNCOUT_SEL | MW_OUTPUTXBAR9_EPWM3_SYNCOUT_SEL | MW_OUTPUTXBAR9_EPWM4_SYNCOUT_SEL | MW_OUTPUTXBAR9_EPWM5_SYNCOUT_SEL | MW_OUTPUTXBAR9_EPWM6_SYNCOUT_SEL | MW_OUTPUTXBAR9_EPWM7_SYNCOUT_SEL | MW_OUTPUTXBAR9_EPWM8_SYNCOUT_SEL | MW_OUTPUTXBAR9_EPWM9_SYNCOUT_SEL | MW_OUTPUTXBAR9_EPWM10_SYNCOUT_SEL | MW_OUTPUTXBAR9_EPWM11_SYNCOUT_SEL | MW_OUTPUTXBAR9_EPWM12_SYNCOUT_SEL | MW_OUTPUTXBAR9_EPWM13_SYNCOUT_SEL | MW_OUTPUTXBAR9_EPWM14_SYNCOUT_SEL | MW_OUTPUTXBAR9_EPWM15_SYNCOUT_SEL | MW_OUTPUTXBAR9_EPWM16_SYNCOUT_SEL | MW_OUTPUTXBAR9_EPWM17_SYNCOUT_SEL | MW_OUTPUTXBAR9_EPWM18_SYNCOUT_SEL | MW_OUTPUTXBAR9_EPWM19_SYNCOUT_SEL | MW_OUTPUTXBAR9_EPWM20_SYNCOUT_SEL | MW_OUTPUTXBAR9_EPWM21_SYNCOUT_SEL | MW_OUTPUTXBAR9_EPWM22_SYNCOUT_SEL | MW_OUTPUTXBAR9_EPWM23_SYNCOUT_SEL | MW_OUTPUTXBAR9_EPWM24_SYNCOUT_SEL | MW_OUTPUTXBAR9_EPWM25_SYNCOUT_SEL | MW_OUTPUTXBAR9_EPWM26_SYNCOUT_SEL | MW_OUTPUTXBAR9_EPWM27_SYNCOUT_SEL | MW_OUTPUTXBAR9_EPWM28_SYNCOUT_SEL | MW_OUTPUTXBAR9_EPWM29_SYNCOUT_SEL | MW_OUTPUTXBAR9_EPWM30_SYNCOUT_SEL | MW_OUTPUTXBAR9_EPWM31_SYNCOUT_SEL)))
        {
            groupEPWMSyncOutputXbar[9] = (MW_OUTPUTXBAR9_EPWM0_SYNCOUT_SEL << 0) | (MW_OUTPUTXBAR9_EPWM1_SYNCOUT_SEL << 1) | (MW_OUTPUTXBAR9_EPWM2_SYNCOUT_SEL << 2) | (MW_OUTPUTXBAR9_EPWM3_SYNCOUT_SEL << 3) | (MW_OUTPUTXBAR9_EPWM4_SYNCOUT_SEL << 4) | (MW_OUTPUTXBAR9_EPWM5_SYNCOUT_SEL << 5) | (MW_OUTPUTXBAR9_EPWM6_SYNCOUT_SEL << 6) | (MW_OUTPUTXBAR9_EPWM7_SYNCOUT_SEL << 7) | (MW_OUTPUTXBAR9_EPWM8_SYNCOUT_SEL << 8) | (MW_OUTPUTXBAR9_EPWM9_SYNCOUT_SEL << 9) | (MW_OUTPUTXBAR9_EPWM10_SYNCOUT_SEL << 10) | (MW_OUTPUTXBAR9_EPWM11_SYNCOUT_SEL << 11) | (MW_OUTPUTXBAR9_EPWM12_SYNCOUT_SEL << 12) | (MW_OUTPUTXBAR9_EPWM13_SYNCOUT_SEL << 13) | (MW_OUTPUTXBAR9_EPWM14_SYNCOUT_SEL << 14) | (MW_OUTPUTXBAR9_EPWM15_SYNCOUT_SEL << 15) | (MW_OUTPUTXBAR9_EPWM16_SYNCOUT_SEL << 16) | (MW_OUTPUTXBAR9_EPWM17_SYNCOUT_SEL << 17) | (MW_OUTPUTXBAR9_EPWM18_SYNCOUT_SEL << 18) | (MW_OUTPUTXBAR9_EPWM19_SYNCOUT_SEL << 19) | (MW_OUTPUTXBAR9_EPWM20_SYNCOUT_SEL << 20) | (MW_OUTPUTXBAR9_EPWM21_SYNCOUT_SEL << 21) | (MW_OUTPUTXBAR9_EPWM22_SYNCOUT_SEL << 22) | (MW_OUTPUTXBAR9_EPWM23_SYNCOUT_SEL << 23) | (MW_OUTPUTXBAR9_EPWM24_SYNCOUT_SEL << 24) | (MW_OUTPUTXBAR9_EPWM25_SYNCOUT_SEL << 25) | (MW_OUTPUTXBAR9_EPWM26_SYNCOUT_SEL << 26) | (MW_OUTPUTXBAR9_EPWM27_SYNCOUT_SEL << 27) | (MW_OUTPUTXBAR9_EPWM28_SYNCOUT_SEL << 28) | (MW_OUTPUTXBAR9_EPWM29_SYNCOUT_SEL << 29) | (MW_OUTPUTXBAR9_EPWM30_SYNCOUT_SEL << 30) | (MW_OUTPUTXBAR9_EPWM31_SYNCOUT_SEL << 31);
        
