TexasInstruments/am26x-hsp/src/am263px_init.c
            if(MW_OUTPUTXBAR9_EPWM0SYNCOUT_INSTANCE_SEL == 1)
                SOC_xbarSelectPWMSyncOutXBarInput(CSL_CONTROLSS_PWMSYNCOUTXBAR_U_BASE, 0, groupEPWMSyncOutputXbar[9]);
            else if(MW_OUTPUTXBAR9_EPWM1SYNCOUT_INSTANCE_SEL == 1)
                SOC_xbarSelectPWMSyncOutXBarInput(CSL_CONTROLSS_PWMSYNCOUTXBAR_U_BASE, 1, groupEPWMSyncOutputXbar[9]); 
            else if(MW_OUTPUTXBAR9_EPWM2SYNCOUT_INSTANCE_SEL == 1)
                SOC_xbarSelectPWMSyncOutXBarInput(CSL_CONTROLSS_PWMSYNCOUTXBAR_U_BASE, 2, groupEPWMSyncOutputXbar[9]);  
            else if(MW_OUTPUTXBAR9_EPWM3SYNCOUT_INSTANCE_SEL == 1)
                SOC_xbarSelectPWMSyncOutXBarInput(CSL_CONTROLSS_PWMSYNCOUTXBAR_U_BASE, 3, groupEPWMSyncOutputXbar[9]); 
        }
        else if((i==10 && (MW_OUTPUTXBAR10_EPWM0_SYNCOUT_SEL | MW_OUTPUTXBAR10_EPWM1_SYNCOUT_SEL | MW_OUTPUTXBAR10_EPWM2_SYNCOUT_SEL | MW_OUTPUTXBAR10_EPWM3_SYNCOUT_SEL | MW_OUTPUTXBAR10_EPWM4_SYNCOUT_SEL | MW_OUTPUTXBAR10_EPWM5_SYNCOUT_SEL | MW_OUTPUTXBAR10_EPWM6_SYNCOUT_SEL | MW_OUTPUTXBAR10_EPWM7_SYNCOUT_SEL | MW_OUTPUTXBAR10_EPWM8_SYNCOUT_SEL | MW_OUTPUTXBAR10_EPWM9_SYNCOUT_SEL | MW_OUTPUTXBAR10_EPWM10_SYNCOUT_SEL | MW_OUTPUTXBAR10_EPWM11_SYNCOUT_SEL | MW_OUTPUTXBAR10_EPWM12_SYNCOUT_SEL | MW_OUTPUTXBAR10_EPWM13_SYNCOUT_SEL | MW_OUTPUTXBAR10_EPWM14_SYNCOUT_SEL | MW_OUTPUTXBAR10_EPWM15_SYNCOUT_SEL | MW_OUTPUTXBAR10_EPWM16_SYNCOUT_SEL | MW_OUTPUTXBAR10_EPWM17_SYNCOUT_SEL | MW_OUTPUTXBAR10_EPWM18_SYNCOUT_SEL | MW_OUTPUTXBAR10_EPWM19_SYNCOUT_SEL | MW_OUTPUTXBAR10_EPWM20_SYNCOUT_SEL | MW_OUTPUTXBAR10_EPWM21_SYNCOUT_SEL | MW_OUTPUTXBAR10_EPWM22_SYNCOUT_SEL | MW_OUTPUTXBAR10_EPWM23_SYNCOUT_SEL | MW_OUTPUTXBAR10_EPWM24_SYNCOUT_SEL | MW_OUTPUTXBAR10_EPWM25_SYNCOUT_SEL | MW_OUTPUTXBAR10_EPWM26_SYNCOUT_SEL | MW_OUTPUTXBAR10_EPWM27_SYNCOUT_SEL | MW_OUTPUTXBAR10_EPWM28_SYNCOUT_SEL | MW_OUTPUTXBAR10_EPWM29_SYNCOUT_SEL | MW_OUTPUTXBAR10_EPWM30_SYNCOUT_SEL | MW_OUTPUTXBAR10_EPWM31_SYNCOUT_SEL)))
        {
            groupEPWMSyncOutputXbar[10] = (MW_OUTPUTXBAR10_EPWM0_SYNCOUT_SEL << 0) | (MW_OUTPUTXBAR10_EPWM1_SYNCOUT_SEL << 1) | (MW_OUTPUTXBAR10_EPWM2_SYNCOUT_SEL << 2) | (MW_OUTPUTXBAR10_EPWM3_SYNCOUT_SEL << 3) | (MW_OUTPUTXBAR10_EPWM4_SYNCOUT_SEL << 4) | (MW_OUTPUTXBAR10_EPWM5_SYNCOUT_SEL << 5) | (MW_OUTPUTXBAR10_EPWM6_SYNCOUT_SEL << 6) | (MW_OUTPUTXBAR10_EPWM7_SYNCOUT_SEL << 7) | (MW_OUTPUTXBAR10_EPWM8_SYNCOUT_SEL << 8) | (MW_OUTPUTXBAR10_EPWM9_SYNCOUT_SEL << 9) | (MW_OUTPUTXBAR10_EPWM10_SYNCOUT_SEL << 10) | (MW_OUTPUTXBAR10_EPWM11_SYNCOUT_SEL << 11) | (MW_OUTPUTXBAR10_EPWM12_SYNCOUT_SEL << 12) | (MW_OUTPUTXBAR10_EPWM13_SYNCOUT_SEL << 13) | (MW_OUTPUTXBAR10_EPWM14_SYNCOUT_SEL << 14) | (MW_OUTPUTXBAR10_EPWM15_SYNCOUT_SEL << 15) | (MW_OUTPUTXBAR10_EPWM16_SYNCOUT_SEL << 16) | (MW_OUTPUTXBAR10_EPWM17_SYNCOUT_SEL << 17) | (MW_OUTPUTXBAR10_EPWM18_SYNCOUT_SEL << 18) | (MW_OUTPUTXBAR10_EPWM19_SYNCOUT_SEL << 19) | (MW_OUTPUTXBAR10_EPWM20_SYNCOUT_SEL << 20) | (MW_OUTPUTXBAR10_EPWM21_SYNCOUT_SEL << 21) | (MW_OUTPUTXBAR10_EPWM22_SYNCOUT_SEL << 22) | (MW_OUTPUTXBAR10_EPWM23_SYNCOUT_SEL << 23) | (MW_OUTPUTXBAR10_EPWM24_SYNCOUT_SEL << 24) | (MW_OUTPUTXBAR10_EPWM25_SYNCOUT_SEL << 25) | (MW_OUTPUTXBAR10_EPWM26_SYNCOUT_SEL << 26) | (MW_OUTPUTXBAR10_EPWM27_SYNCOUT_SEL << 27) | (MW_OUTPUTXBAR10_EPWM28_SYNCOUT_SEL << 28) | (MW_OUTPUTXBAR10_EPWM29_SYNCOUT_SEL << 29) | (MW_OUTPUTXBAR10_EPWM30_SYNCOUT_SEL << 30) | (MW_OUTPUTXBAR10_EPWM31_SYNCOUT_SEL << 31);
        
            if(MW_OUTPUTXBAR10_EPWM0SYNCOUT_INSTANCE_SEL == 1)
                SOC_xbarSelectPWMSyncOutXBarInput(CSL_CONTROLSS_PWMSYNCOUTXBAR_U_BASE, 0, groupEPWMSyncOutputXbar[10]);
            else if(MW_OUTPUTXBAR10_EPWM1SYNCOUT_INSTANCE_SEL == 1)
                SOC_xbarSelectPWMSyncOutXBarInput(CSL_CONTROLSS_PWMSYNCOUTXBAR_U_BASE, 1, groupEPWMSyncOutputXbar[10]); 
            else if(MW_OUTPUTXBAR10_EPWM2SYNCOUT_INSTANCE_SEL == 1)
                SOC_xbarSelectPWMSyncOutXBarInput(CSL_CONTROLSS_PWMSYNCOUTXBAR_U_BASE, 2, groupEPWMSyncOutputXbar[10]);  
            else if(MW_OUTPUTXBAR10_EPWM3SYNCOUT_INSTANCE_SEL == 1)
                SOC_xbarSelectPWMSyncOutXBarInput(CSL_CONTROLSS_PWMSYNCOUTXBAR_U_BASE, 3, groupEPWMSyncOutputXbar[10]); 
        }
        else if((i==11 && (MW_OUTPUTXBAR11_EPWM0_SYNCOUT_SEL | MW_OUTPUTXBAR11_EPWM1_SYNCOUT_SEL | MW_OUTPUTXBAR11_EPWM2_SYNCOUT_SEL | MW_OUTPUTXBAR11_EPWM3_SYNCOUT_SEL | MW_OUTPUTXBAR11_EPWM4_SYNCOUT_SEL | MW_OUTPUTXBAR11_EPWM5_SYNCOUT_SEL | MW_OUTPUTXBAR11_EPWM6_SYNCOUT_SEL | MW_OUTPUTXBAR11_EPWM7_SYNCOUT_SEL | MW_OUTPUTXBAR11_EPWM8_SYNCOUT_SEL | MW_OUTPUTXBAR11_EPWM9_SYNCOUT_SEL | MW_OUTPUTXBAR11_EPWM10_SYNCOUT_SEL | MW_OUTPUTXBAR11_EPWM11_SYNCOUT_SEL | MW_OUTPUTXBAR11_EPWM12_SYNCOUT_SEL | MW_OUTPUTXBAR11_EPWM13_SYNCOUT_SEL | MW_OUTPUTXBAR11_EPWM14_SYNCOUT_SEL | MW_OUTPUTXBAR11_EPWM15_SYNCOUT_SEL | MW_OUTPUTXBAR11_EPWM16_SYNCOUT_SEL | MW_OUTPUTXBAR11_EPWM17_SYNCOUT_SEL | MW_OUTPUTXBAR11_EPWM18_SYNCOUT_SEL | MW_OUTPUTXBAR11_EPWM19_SYNCOUT_SEL | MW_OUTPUTXBAR11_EPWM20_SYNCOUT_SEL | MW_OUTPUTXBAR11_EPWM21_SYNCOUT_SEL | MW_OUTPUTXBAR11_EPWM22_SYNCOUT_SEL | MW_OUTPUTXBAR11_EPWM23_SYNCOUT_SEL | MW_OUTPUTXBAR11_EPWM24_SYNCOUT_SEL | MW_OUTPUTXBAR11_EPWM25_SYNCOUT_SEL | MW_OUTPUTXBAR11_EPWM26_SYNCOUT_SEL | MW_OUTPUTXBAR11_EPWM27_SYNCOUT_SEL | MW_OUTPUTXBAR11_EPWM28_SYNCOUT_SEL | MW_OUTPUTXBAR11_EPWM29_SYNCOUT_SEL | MW_OUTPUTXBAR11_EPWM30_SYNCOUT_SEL | MW_OUTPUTXBAR11_EPWM31_SYNCOUT_SEL)))
        {
            groupEPWMSyncOutputXbar[11] = (MW_OUTPUTXBAR11_EPWM0_SYNCOUT_SEL << 0) | (MW_OUTPUTXBAR11_EPWM1_SYNCOUT_SEL << 1) | (MW_OUTPUTXBAR11_EPWM2_SYNCOUT_SEL << 2) | (MW_OUTPUTXBAR11_EPWM3_SYNCOUT_SEL << 3) | (MW_OUTPUTXBAR11_EPWM4_SYNCOUT_SEL << 4) | (MW_OUTPUTXBAR11_EPWM5_SYNCOUT_SEL << 5) | (MW_OUTPUTXBAR11_EPWM6_SYNCOUT_SEL << 6) | (MW_OUTPUTXBAR11_EPWM7_SYNCOUT_SEL << 7) | (MW_OUTPUTXBAR11_EPWM8_SYNCOUT_SEL << 8) | (MW_OUTPUTXBAR11_EPWM9_SYNCOUT_SEL << 9) | (MW_OUTPUTXBAR11_EPWM10_SYNCOUT_SEL << 10) | (MW_OUTPUTXBAR11_EPWM11_SYNCOUT_SEL << 11) | (MW_OUTPUTXBAR11_EPWM12_SYNCOUT_SEL << 12) | (MW_OUTPUTXBAR11_EPWM13_SYNCOUT_SEL << 13) | (MW_OUTPUTXBAR11_EPWM14_SYNCOUT_SEL << 14) | (MW_OUTPUTXBAR11_EPWM15_SYNCOUT_SEL << 15) | (MW_OUTPUTXBAR11_EPWM16_SYNCOUT_SEL << 16) | (MW_OUTPUTXBAR11_EPWM17_SYNCOUT_SEL << 17) | (MW_OUTPUTXBAR11_EPWM18_SYNCOUT_SEL << 18) | (MW_OUTPUTXBAR11_EPWM19_SYNCOUT_SEL << 19) | (MW_OUTPUTXBAR11_EPWM20_SYNCOUT_SEL << 20) | (MW_OUTPUTXBAR11_EPWM21_SYNCOUT_SEL << 21) | (MW_OUTPUTXBAR11_EPWM22_SYNCOUT_SEL << 22) | (MW_OUTPUTXBAR11_EPWM23_SYNCOUT_SEL << 23) | (MW_OUTPUTXBAR11_EPWM24_SYNCOUT_SEL << 24) | (MW_OUTPUTXBAR11_EPWM25_SYNCOUT_SEL << 25) | (MW_OUTPUTXBAR11_EPWM26_SYNCOUT_SEL << 26) | (MW_OUTPUTXBAR11_EPWM27_SYNCOUT_SEL << 27) | (MW_OUTPUTXBAR11_EPWM28_SYNCOUT_SEL << 28) | (MW_OUTPUTXBAR11_EPWM29_SYNCOUT_SEL << 29) | (MW_OUTPUTXBAR11_EPWM30_SYNCOUT_SEL << 30) | (MW_OUTPUTXBAR11_EPWM31_SYNCOUT_SEL << 31);
        
            if(MW_OUTPUTXBAR11_EPWM0SYNCOUT_INSTANCE_SEL == 1)
                SOC_xbarSelectPWMSyncOutXBarInput(CSL_CONTROLSS_PWMSYNCOUTXBAR_U_BASE, 0, groupEPWMSyncOutputXbar[11]);
            else if(MW_OUTPUTXBAR11_EPWM1SYNCOUT_INSTANCE_SEL == 1)
                SOC_xbarSelectPWMSyncOutXBarInput(CSL_CONTROLSS_PWMSYNCOUTXBAR_U_BASE, 1, groupEPWMSyncOutputXbar[11]); 
            else if(MW_OUTPUTXBAR11_EPWM2SYNCOUT_INSTANCE_SEL == 1)
                SOC_xbarSelectPWMSyncOutXBarInput(CSL_CONTROLSS_PWMSYNCOUTXBAR_U_BASE, 2, groupEPWMSyncOutputXbar[11]);  
            else if(MW_OUTPUTXBAR11_EPWM3SYNCOUT_INSTANCE_SEL == 1)
                SOC_xbarSelectPWMSyncOutXBarInput(CSL_CONTROLSS_PWMSYNCOUTXBAR_U_BASE, 3, groupEPWMSyncOutputXbar[11]);
        }
        else if((i==12 && (MW_OUTPUTXBAR12_EPWM0_SYNCOUT_SEL | MW_OUTPUTXBAR12_EPWM1_SYNCOUT_SEL | MW_OUTPUTXBAR12_EPWM2_SYNCOUT_SEL | MW_OUTPUTXBAR12_EPWM3_SYNCOUT_SEL | MW_OUTPUTXBAR12_EPWM4_SYNCOUT_SEL | MW_OUTPUTXBAR12_EPWM5_SYNCOUT_SEL | MW_OUTPUTXBAR12_EPWM6_SYNCOUT_SEL | MW_OUTPUTXBAR12_EPWM7_SYNCOUT_SEL | MW_OUTPUTXBAR12_EPWM8_SYNCOUT_SEL | MW_OUTPUTXBAR12_EPWM9_SYNCOUT_SEL | MW_OUTPUTXBAR12_EPWM10_SYNCOUT_SEL | MW_OUTPUTXBAR12_EPWM11_SYNCOUT_SEL | MW_OUTPUTXBAR12_EPWM12_SYNCOUT_SEL | MW_OUTPUTXBAR12_EPWM13_SYNCOUT_SEL | MW_OUTPUTXBAR12_EPWM14_SYNCOUT_SEL | MW_OUTPUTXBAR12_EPWM15_SYNCOUT_SEL | MW_OUTPUTXBAR12_EPWM16_SYNCOUT_SEL | MW_OUTPUTXBAR12_EPWM17_SYNCOUT_SEL | MW_OUTPUTXBAR12_EPWM18_SYNCOUT_SEL | MW_OUTPUTXBAR12_EPWM19_SYNCOUT_SEL | MW_OUTPUTXBAR12_EPWM20_SYNCOUT_SEL | MW_OUTPUTXBAR12_EPWM21_SYNCOUT_SEL | MW_OUTPUTXBAR12_EPWM22_SYNCOUT_SEL | MW_OUTPUTXBAR12_EPWM23_SYNCOUT_SEL | MW_OUTPUTXBAR12_EPWM24_SYNCOUT_SEL | MW_OUTPUTXBAR12_EPWM25_SYNCOUT_SEL | MW_OUTPUTXBAR12_EPWM26_SYNCOUT_SEL | MW_OUTPUTXBAR12_EPWM27_SYNCOUT_SEL | MW_OUTPUTXBAR12_EPWM28_SYNCOUT_SEL | MW_OUTPUTXBAR12_EPWM29_SYNCOUT_SEL | MW_OUTPUTXBAR12_EPWM30_SYNCOUT_SEL | MW_OUTPUTXBAR12_EPWM31_SYNCOUT_SEL)))
        {
            groupEPWMSyncOutputXbar[12] = (MW_OUTPUTXBAR12_EPWM0_SYNCOUT_SEL << 0) | (MW_OUTPUTXBAR12_EPWM1_SYNCOUT_SEL << 1) | (MW_OUTPUTXBAR12_EPWM2_SYNCOUT_SEL << 2) | (MW_OUTPUTXBAR12_EPWM3_SYNCOUT_SEL << 3) | (MW_OUTPUTXBAR12_EPWM4_SYNCOUT_SEL << 4) | (MW_OUTPUTXBAR12_EPWM5_SYNCOUT_SEL << 5) | (MW_OUTPUTXBAR12_EPWM6_SYNCOUT_SEL << 6) | (MW_OUTPUTXBAR12_EPWM7_SYNCOUT_SEL << 7) | (MW_OUTPUTXBAR12_EPWM8_SYNCOUT_SEL << 8) | (MW_OUTPUTXBAR12_EPWM9_SYNCOUT_SEL << 9) | (MW_OUTPUTXBAR12_EPWM10_SYNCOUT_SEL << 10) | (MW_OUTPUTXBAR12_EPWM11_SYNCOUT_SEL << 11) | (MW_OUTPUTXBAR12_EPWM12_SYNCOUT_SEL << 12) | (MW_OUTPUTXBAR12_EPWM13_SYNCOUT_SEL << 13) | (MW_OUTPUTXBAR12_EPWM14_SYNCOUT_SEL << 14) | (MW_OUTPUTXBAR12_EPWM15_SYNCOUT_SEL << 15) | (MW_OUTPUTXBAR12_EPWM16_SYNCOUT_SEL << 16) | (MW_OUTPUTXBAR12_EPWM17_SYNCOUT_SEL << 17) | (MW_OUTPUTXBAR12_EPWM18_SYNCOUT_SEL << 18) | (MW_OUTPUTXBAR12_EPWM19_SYNCOUT_SEL << 19) | (MW_OUTPUTXBAR12_EPWM20_SYNCOUT_SEL << 20) | (MW_OUTPUTXBAR12_EPWM21_SYNCOUT_SEL << 21) | (MW_OUTPUTXBAR12_EPWM22_SYNCOUT_SEL << 22) | (MW_OUTPUTXBAR12_EPWM23_SYNCOUT_SEL << 23) | (MW_OUTPUTXBAR12_EPWM24_SYNCOUT_SEL << 24) | (MW_OUTPUTXBAR12_EPWM25_SYNCOUT_SEL << 25) | (MW_OUTPUTXBAR12_EPWM26_SYNCOUT_SEL << 26) | (MW_OUTPUTXBAR12_EPWM27_SYNCOUT_SEL << 27) | (MW_OUTPUTXBAR12_EPWM28_SYNCOUT_SEL << 28) | (MW_OUTPUTXBAR12_EPWM29_SYNCOUT_SEL << 29) | (MW_OUTPUTXBAR12_EPWM30_SYNCOUT_SEL << 30) | (MW_OUTPUTXBAR12_EPWM31_SYNCOUT_SEL << 31);
        
            if(MW_OUTPUTXBAR12_EPWM0SYNCOUT_INSTANCE_SEL == 1)
                SOC_xbarSelectPWMSyncOutXBarInput(CSL_CONTROLSS_PWMSYNCOUTXBAR_U_BASE, 0, groupEPWMSyncOutputXbar[12]);
            else if(MW_OUTPUTXBAR12_EPWM1SYNCOUT_INSTANCE_SEL == 1)
                SOC_xbarSelectPWMSyncOutXBarInput(CSL_CONTROLSS_PWMSYNCOUTXBAR_U_BASE, 1, groupEPWMSyncOutputXbar[12]); 
            else if(MW_OUTPUTXBAR12_EPWM2SYNCOUT_INSTANCE_SEL == 1)
                SOC_xbarSelectPWMSyncOutXBarInput(CSL_CONTROLSS_PWMSYNCOUTXBAR_U_BASE, 2, groupEPWMSyncOutputXbar[12]);  
            else if(MW_OUTPUTXBAR12_EPWM3SYNCOUT_INSTANCE_SEL == 1)
                SOC_xbarSelectPWMSyncOutXBarInput(CSL_CONTROLSS_PWMSYNCOUTXBAR_U_BASE, 3, groupEPWMSyncOutputXbar[12]); 
        }
        else if((i==13 && (MW_OUTPUTXBAR13_EPWM0_SYNCOUT_SEL | MW_OUTPUTXBAR13_EPWM1_SYNCOUT_SEL | MW_OUTPUTXBAR13_EPWM2_SYNCOUT_SEL | MW_OUTPUTXBAR13_EPWM3_SYNCOUT_SEL | MW_OUTPUTXBAR13_EPWM4_SYNCOUT_SEL | MW_OUTPUTXBAR13_EPWM5_SYNCOUT_SEL | MW_OUTPUTXBAR13_EPWM6_SYNCOUT_SEL | MW_OUTPUTXBAR13_EPWM7_SYNCOUT_SEL | MW_OUTPUTXBAR13_EPWM8_SYNCOUT_SEL | MW_OUTPUTXBAR13_EPWM9_SYNCOUT_SEL | MW_OUTPUTXBAR13_EPWM10_SYNCOUT_SEL | MW_OUTPUTXBAR13_EPWM11_SYNCOUT_SEL | MW_OUTPUTXBAR13_EPWM12_SYNCOUT_SEL | MW_OUTPUTXBAR13_EPWM13_SYNCOUT_SEL | MW_OUTPUTXBAR13_EPWM14_SYNCOUT_SEL | MW_OUTPUTXBAR13_EPWM15_SYNCOUT_SEL | MW_OUTPUTXBAR13_EPWM16_SYNCOUT_SEL | MW_OUTPUTXBAR13_EPWM17_SYNCOUT_SEL | MW_OUTPUTXBAR13_EPWM18_SYNCOUT_SEL | MW_OUTPUTXBAR13_EPWM19_SYNCOUT_SEL | MW_OUTPUTXBAR13_EPWM20_SYNCOUT_SEL | MW_OUTPUTXBAR13_EPWM21_SYNCOUT_SEL | MW_OUTPUTXBAR13_EPWM22_SYNCOUT_SEL | MW_OUTPUTXBAR13_EPWM23_SYNCOUT_SEL | MW_OUTPUTXBAR13_EPWM24_SYNCOUT_SEL | MW_OUTPUTXBAR13_EPWM25_SYNCOUT_SEL | MW_OUTPUTXBAR13_EPWM26_SYNCOUT_SEL | MW_OUTPUTXBAR13_EPWM27_SYNCOUT_SEL | MW_OUTPUTXBAR13_EPWM28_SYNCOUT_SEL | MW_OUTPUTXBAR13_EPWM29_SYNCOUT_SEL | MW_OUTPUTXBAR13_EPWM30_SYNCOUT_SEL | MW_OUTPUTXBAR13_EPWM31_SYNCOUT_SEL)))
        {
            groupEPWMSyncOutputXbar[13] = (MW_OUTPUTXBAR13_EPWM0_SYNCOUT_SEL << 0) | (MW_OUTPUTXBAR13_EPWM1_SYNCOUT_SEL << 1) | (MW_OUTPUTXBAR13_EPWM2_SYNCOUT_SEL << 2) | (MW_OUTPUTXBAR13_EPWM3_SYNCOUT_SEL << 3) | (MW_OUTPUTXBAR13_EPWM4_SYNCOUT_SEL << 4) | (MW_OUTPUTXBAR13_EPWM5_SYNCOUT_SEL << 5) | (MW_OUTPUTXBAR13_EPWM6_SYNCOUT_SEL << 6) | (MW_OUTPUTXBAR13_EPWM7_SYNCOUT_SEL << 7) | (MW_OUTPUTXBAR13_EPWM8_SYNCOUT_SEL << 8) | (MW_OUTPUTXBAR13_EPWM9_SYNCOUT_SEL << 9) | (MW_OUTPUTXBAR13_EPWM10_SYNCOUT_SEL << 10) | (MW_OUTPUTXBAR13_EPWM11_SYNCOUT_SEL << 11) | (MW_OUTPUTXBAR13_EPWM12_SYNCOUT_SEL << 12) | (MW_OUTPUTXBAR13_EPWM13_SYNCOUT_SEL << 13) | (MW_OUTPUTXBAR13_EPWM14_SYNCOUT_SEL << 14) | (MW_OUTPUTXBAR13_EPWM15_SYNCOUT_SEL << 15) | (MW_OUTPUTXBAR13_EPWM16_SYNCOUT_SEL << 16) | (MW_OUTPUTXBAR13_EPWM17_SYNCOUT_SEL << 17) | (MW_OUTPUTXBAR13_EPWM18_SYNCOUT_SEL << 18) | (MW_OUTPUTXBAR13_EPWM19_SYNCOUT_SEL << 19) | (MW_OUTPUTXBAR13_EPWM20_SYNCOUT_SEL << 20) | (MW_OUTPUTXBAR13_EPWM21_SYNCOUT_SEL << 21) | (MW_OUTPUTXBAR13_EPWM22_SYNCOUT_SEL << 22) | (MW_OUTPUTXBAR13_EPWM23_SYNCOUT_SEL << 23) | (MW_OUTPUTXBAR13_EPWM24_SYNCOUT_SEL << 24) | (MW_OUTPUTXBAR13_EPWM25_SYNCOUT_SEL << 25) | (MW_OUTPUTXBAR13_EPWM26_SYNCOUT_SEL << 26) | (MW_OUTPUTXBAR13_EPWM27_SYNCOUT_SEL << 27) | (MW_OUTPUTXBAR13_EPWM28_SYNCOUT_SEL << 28) | (MW_OUTPUTXBAR13_EPWM29_SYNCOUT_SEL << 29) | (MW_OUTPUTXBAR13_EPWM30_SYNCOUT_SEL << 30) | (MW_OUTPUTXBAR13_EPWM31_SYNCOUT_SEL << 31);
        
            if(MW_OUTPUTXBAR13_EPWM0SYNCOUT_INSTANCE_SEL == 1)
                SOC_xbarSelectPWMSyncOutXBarInput(CSL_CONTROLSS_PWMSYNCOUTXBAR_U_BASE, 0, groupEPWMSyncOutputXbar[13]);
            else if(MW_OUTPUTXBAR13_EPWM1SYNCOUT_INSTANCE_SEL == 1)
                SOC_xbarSelectPWMSyncOutXBarInput(CSL_CONTROLSS_PWMSYNCOUTXBAR_U_BASE, 1, groupEPWMSyncOutputXbar[13]); 
            else if(MW_OUTPUTXBAR13_EPWM2SYNCOUT_INSTANCE_SEL == 1)
                SOC_xbarSelectPWMSyncOutXBarInput(CSL_CONTROLSS_PWMSYNCOUTXBAR_U_BASE, 2, groupEPWMSyncOutputXbar[13]);  
            else if(MW_OUTPUTXBAR13_EPWM3SYNCOUT_INSTANCE_SEL == 1)
                SOC_xbarSelectPWMSyncOutXBarInput(CSL_CONTROLSS_PWMSYNCOUTXBAR_U_BASE, 3, groupEPWMSyncOutputXbar[13]); 
        }
        else if((i==14 && (MW_OUTPUTXBAR14_EPWM0_SYNCOUT_SEL | MW_OUTPUTXBAR14_EPWM1_SYNCOUT_SEL | MW_OUTPUTXBAR14_EPWM2_SYNCOUT_SEL | MW_OUTPUTXBAR14_EPWM3_SYNCOUT_SEL | MW_OUTPUTXBAR14_EPWM4_SYNCOUT_SEL | MW_OUTPUTXBAR14_EPWM5_SYNCOUT_SEL | MW_OUTPUTXBAR14_EPWM6_SYNCOUT_SEL | MW_OUTPUTXBAR14_EPWM7_SYNCOUT_SEL | MW_OUTPUTXBAR14_EPWM8_SYNCOUT_SEL | MW_OUTPUTXBAR14_EPWM9_SYNCOUT_SEL | MW_OUTPUTXBAR14_EPWM10_SYNCOUT_SEL | MW_OUTPUTXBAR14_EPWM11_SYNCOUT_SEL | MW_OUTPUTXBAR14_EPWM12_SYNCOUT_SEL | MW_OUTPUTXBAR14_EPWM13_SYNCOUT_SEL | MW_OUTPUTXBAR14_EPWM14_SYNCOUT_SEL | MW_OUTPUTXBAR14_EPWM15_SYNCOUT_SEL | MW_OUTPUTXBAR14_EPWM16_SYNCOUT_SEL | MW_OUTPUTXBAR14_EPWM17_SYNCOUT_SEL | MW_OUTPUTXBAR14_EPWM18_SYNCOUT_SEL | MW_OUTPUTXBAR14_EPWM19_SYNCOUT_SEL | MW_OUTPUTXBAR14_EPWM20_SYNCOUT_SEL | MW_OUTPUTXBAR14_EPWM21_SYNCOUT_SEL | MW_OUTPUTXBAR14_EPWM22_SYNCOUT_SEL | MW_OUTPUTXBAR14_EPWM23_SYNCOUT_SEL | MW_OUTPUTXBAR14_EPWM24_SYNCOUT_SEL | MW_OUTPUTXBAR14_EPWM25_SYNCOUT_SEL | MW_OUTPUTXBAR14_EPWM26_SYNCOUT_SEL | MW_OUTPUTXBAR14_EPWM27_SYNCOUT_SEL | MW_OUTPUTXBAR14_EPWM28_SYNCOUT_SEL | MW_OUTPUTXBAR14_EPWM29_SYNCOUT_SEL | MW_OUTPUTXBAR14_EPWM30_SYNCOUT_SEL | MW_OUTPUTXBAR14_EPWM31_SYNCOUT_SEL)))
        {
            groupEPWMSyncOutputXbar[14] = (MW_OUTPUTXBAR14_EPWM0_SYNCOUT_SEL << 0) | (MW_OUTPUTXBAR14_EPWM1_SYNCOUT_SEL << 1) | (MW_OUTPUTXBAR14_EPWM2_SYNCOUT_SEL << 2) | (MW_OUTPUTXBAR14_EPWM3_SYNCOUT_SEL << 3) | (MW_OUTPUTXBAR14_EPWM4_SYNCOUT_SEL << 4) | (MW_OUTPUTXBAR14_EPWM5_SYNCOUT_SEL << 5) | (MW_OUTPUTXBAR14_EPWM6_SYNCOUT_SEL << 6) | (MW_OUTPUTXBAR14_EPWM7_SYNCOUT_SEL << 7) | (MW_OUTPUTXBAR14_EPWM8_SYNCOUT_SEL << 8) | (MW_OUTPUTXBAR14_EPWM9_SYNCOUT_SEL << 9) | (MW_OUTPUTXBAR14_EPWM10_SYNCOUT_SEL << 10) | (MW_OUTPUTXBAR14_EPWM11_SYNCOUT_SEL << 11) | (MW_OUTPUTXBAR14_EPWM12_SYNCOUT_SEL << 12) | (MW_OUTPUTXBAR14_EPWM13_SYNCOUT_SEL << 13) | (MW_OUTPUTXBAR14_EPWM14_SYNCOUT_SEL << 14) | (MW_OUTPUTXBAR14_EPWM15_SYNCOUT_SEL << 15) | (MW_OUTPUTXBAR14_EPWM16_SYNCOUT_SEL << 16) | (MW_OUTPUTXBAR14_EPWM17_SYNCOUT_SEL << 17) | (MW_OUTPUTXBAR14_EPWM18_SYNCOUT_SEL << 18) | (MW_OUTPUTXBAR14_EPWM19_SYNCOUT_SEL << 19) | (MW_OUTPUTXBAR14_EPWM20_SYNCOUT_SEL << 20) | (MW_OUTPUTXBAR14_EPWM21_SYNCOUT_SEL << 21) | (MW_OUTPUTXBAR14_EPWM22_SYNCOUT_SEL << 22) | (MW_OUTPUTXBAR14_EPWM23_SYNCOUT_SEL << 23) | (MW_OUTPUTXBAR14_EPWM24_SYNCOUT_SEL << 24) | (MW_OUTPUTXBAR14_EPWM25_SYNCOUT_SEL << 25) | (MW_OUTPUTXBAR14_EPWM26_SYNCOUT_SEL << 26) | (MW_OUTPUTXBAR14_EPWM27_SYNCOUT_SEL << 27) | (MW_OUTPUTXBAR14_EPWM28_SYNCOUT_SEL << 28) | (MW_OUTPUTXBAR14_EPWM29_SYNCOUT_SEL << 29) | (MW_OUTPUTXBAR14_EPWM30_SYNCOUT_SEL << 30) | (MW_OUTPUTXBAR14_EPWM31_SYNCOUT_SEL << 31);
        
