TexasInstruments/am26x-hsp/src/am263px_init.c
            if(MW_OUTPUTXBAR14_EPWM0SYNCOUT_INSTANCE_SEL == 1)
                SOC_xbarSelectPWMSyncOutXBarInput(CSL_CONTROLSS_PWMSYNCOUTXBAR_U_BASE, 0, groupEPWMSyncOutputXbar[14]);
            else if(MW_OUTPUTXBAR14_EPWM1SYNCOUT_INSTANCE_SEL == 1)
                SOC_xbarSelectPWMSyncOutXBarInput(CSL_CONTROLSS_PWMSYNCOUTXBAR_U_BASE, 1, groupEPWMSyncOutputXbar[14]); 
            else if(MW_OUTPUTXBAR14_EPWM2SYNCOUT_INSTANCE_SEL == 1)
                SOC_xbarSelectPWMSyncOutXBarInput(CSL_CONTROLSS_PWMSYNCOUTXBAR_U_BASE, 2, groupEPWMSyncOutputXbar[14]);  
            else if(MW_OUTPUTXBAR14_EPWM3SYNCOUT_INSTANCE_SEL == 1)
                SOC_xbarSelectPWMSyncOutXBarInput(CSL_CONTROLSS_PWMSYNCOUTXBAR_U_BASE, 3, groupEPWMSyncOutputXbar[14]); 
        }
        else if((i==15 && (MW_OUTPUTXBAR15_EPWM0_SYNCOUT_SEL | MW_OUTPUTXBAR15_EPWM1_SYNCOUT_SEL | MW_OUTPUTXBAR15_EPWM2_SYNCOUT_SEL | MW_OUTPUTXBAR15_EPWM3_SYNCOUT_SEL | MW_OUTPUTXBAR15_EPWM4_SYNCOUT_SEL | MW_OUTPUTXBAR15_EPWM5_SYNCOUT_SEL | MW_OUTPUTXBAR15_EPWM6_SYNCOUT_SEL | MW_OUTPUTXBAR15_EPWM7_SYNCOUT_SEL | MW_OUTPUTXBAR15_EPWM8_SYNCOUT_SEL | MW_OUTPUTXBAR15_EPWM9_SYNCOUT_SEL | MW_OUTPUTXBAR15_EPWM10_SYNCOUT_SEL | MW_OUTPUTXBAR15_EPWM11_SYNCOUT_SEL | MW_OUTPUTXBAR15_EPWM12_SYNCOUT_SEL | MW_OUTPUTXBAR15_EPWM13_SYNCOUT_SEL | MW_OUTPUTXBAR15_EPWM14_SYNCOUT_SEL | MW_OUTPUTXBAR15_EPWM15_SYNCOUT_SEL | MW_OUTPUTXBAR15_EPWM16_SYNCOUT_SEL | MW_OUTPUTXBAR15_EPWM17_SYNCOUT_SEL | MW_OUTPUTXBAR15_EPWM18_SYNCOUT_SEL | MW_OUTPUTXBAR15_EPWM19_SYNCOUT_SEL | MW_OUTPUTXBAR15_EPWM20_SYNCOUT_SEL | MW_OUTPUTXBAR15_EPWM21_SYNCOUT_SEL | MW_OUTPUTXBAR15_EPWM22_SYNCOUT_SEL | MW_OUTPUTXBAR15_EPWM23_SYNCOUT_SEL | MW_OUTPUTXBAR15_EPWM24_SYNCOUT_SEL | MW_OUTPUTXBAR15_EPWM25_SYNCOUT_SEL | MW_OUTPUTXBAR15_EPWM26_SYNCOUT_SEL | MW_OUTPUTXBAR15_EPWM27_SYNCOUT_SEL | MW_OUTPUTXBAR15_EPWM28_SYNCOUT_SEL | MW_OUTPUTXBAR15_EPWM29_SYNCOUT_SEL | MW_OUTPUTXBAR15_EPWM30_SYNCOUT_SEL | MW_OUTPUTXBAR15_EPWM31_SYNCOUT_SEL)))
        {
            groupEPWMSyncOutputXbar[15] = (MW_OUTPUTXBAR15_EPWM0_SYNCOUT_SEL << 0) | (MW_OUTPUTXBAR15_EPWM1_SYNCOUT_SEL << 1) | (MW_OUTPUTXBAR15_EPWM2_SYNCOUT_SEL << 2) | (MW_OUTPUTXBAR15_EPWM3_SYNCOUT_SEL << 3) | (MW_OUTPUTXBAR15_EPWM4_SYNCOUT_SEL << 4) | (MW_OUTPUTXBAR15_EPWM5_SYNCOUT_SEL << 5) | (MW_OUTPUTXBAR15_EPWM6_SYNCOUT_SEL << 6) | (MW_OUTPUTXBAR15_EPWM7_SYNCOUT_SEL << 7) | (MW_OUTPUTXBAR15_EPWM8_SYNCOUT_SEL << 8) | (MW_OUTPUTXBAR15_EPWM9_SYNCOUT_SEL << 9) | (MW_OUTPUTXBAR15_EPWM10_SYNCOUT_SEL << 10) | (MW_OUTPUTXBAR15_EPWM11_SYNCOUT_SEL << 11) | (MW_OUTPUTXBAR15_EPWM12_SYNCOUT_SEL << 12) | (MW_OUTPUTXBAR15_EPWM13_SYNCOUT_SEL << 13) | (MW_OUTPUTXBAR15_EPWM14_SYNCOUT_SEL << 14) | (MW_OUTPUTXBAR15_EPWM15_SYNCOUT_SEL << 15) | (MW_OUTPUTXBAR15_EPWM16_SYNCOUT_SEL << 16) | (MW_OUTPUTXBAR15_EPWM17_SYNCOUT_SEL << 17) | (MW_OUTPUTXBAR15_EPWM18_SYNCOUT_SEL << 18) | (MW_OUTPUTXBAR15_EPWM19_SYNCOUT_SEL << 19) | (MW_OUTPUTXBAR15_EPWM20_SYNCOUT_SEL << 20) | (MW_OUTPUTXBAR15_EPWM21_SYNCOUT_SEL << 21) | (MW_OUTPUTXBAR15_EPWM22_SYNCOUT_SEL << 22) | (MW_OUTPUTXBAR15_EPWM23_SYNCOUT_SEL << 23) | (MW_OUTPUTXBAR15_EPWM24_SYNCOUT_SEL << 24) | (MW_OUTPUTXBAR15_EPWM25_SYNCOUT_SEL << 25) | (MW_OUTPUTXBAR15_EPWM26_SYNCOUT_SEL << 26) | (MW_OUTPUTXBAR15_EPWM27_SYNCOUT_SEL << 27) | (MW_OUTPUTXBAR15_EPWM28_SYNCOUT_SEL << 28) | (MW_OUTPUTXBAR15_EPWM29_SYNCOUT_SEL << 29) | (MW_OUTPUTXBAR15_EPWM30_SYNCOUT_SEL << 30) | (MW_OUTPUTXBAR15_EPWM31_SYNCOUT_SEL << 31);
        
            if(MW_OUTPUTXBAR15_EPWM0SYNCOUT_INSTANCE_SEL == 1)
                SOC_xbarSelectPWMSyncOutXBarInput(CSL_CONTROLSS_PWMSYNCOUTXBAR_U_BASE, 0, groupEPWMSyncOutputXbar[15]);
            else if(MW_OUTPUTXBAR15_EPWM1SYNCOUT_INSTANCE_SEL == 1)
                SOC_xbarSelectPWMSyncOutXBarInput(CSL_CONTROLSS_PWMSYNCOUTXBAR_U_BASE, 1, groupEPWMSyncOutputXbar[15]); 
            else if(MW_OUTPUTXBAR15_EPWM2SYNCOUT_INSTANCE_SEL == 1)
                SOC_xbarSelectPWMSyncOutXBarInput(CSL_CONTROLSS_PWMSYNCOUTXBAR_U_BASE, 2, groupEPWMSyncOutputXbar[15]);  
            else if(MW_OUTPUTXBAR15_EPWM3SYNCOUT_INSTANCE_SEL == 1)
                SOC_xbarSelectPWMSyncOutXBarInput(CSL_CONTROLSS_PWMSYNCOUTXBAR_U_BASE, 3, groupEPWMSyncOutputXbar[15]); 
        }
    }
}

void Drivers_epwmSyncoutXbarOpen()
{
    uint32_t groupEpwmSyncoutXbar[4];

    groupEpwmSyncoutXbar[0] = (MW_EPWMSYNCOUTXBAR0_EPWM0_SYNCOUT_SEL << 0) | (MW_EPWMSYNCOUTXBAR0_EPWM1_SYNCOUT_SEL << 1) | (MW_EPWMSYNCOUTXBAR0_EPWM2_SYNCOUT_SEL << 2) | (MW_EPWMSYNCOUTXBAR0_EPWM3_SYNCOUT_SEL << 3) | (MW_EPWMSYNCOUTXBAR0_EPWM4_SYNCOUT_SEL << 4) | (MW_EPWMSYNCOUTXBAR0_EPWM5_SYNCOUT_SEL << 5) | (MW_EPWMSYNCOUTXBAR0_EPWM6_SYNCOUT_SEL << 6) | (MW_EPWMSYNCOUTXBAR0_EPWM7_SYNCOUT_SEL << 7) | (MW_EPWMSYNCOUTXBAR0_EPWM8_SYNCOUT_SEL << 8) | (MW_EPWMSYNCOUTXBAR0_EPWM9_SYNCOUT_SEL << 9) | (MW_EPWMSYNCOUTXBAR0_EPWM10_SYNCOUT_SEL << 10) | (MW_EPWMSYNCOUTXBAR0_EPWM11_SYNCOUT_SEL << 11) | (MW_EPWMSYNCOUTXBAR0_EPWM12_SYNCOUT_SEL << 12) | (MW_EPWMSYNCOUTXBAR0_EPWM13_SYNCOUT_SEL << 13) | (MW_EPWMSYNCOUTXBAR0_EPWM14_SYNCOUT_SEL << 14) | (MW_EPWMSYNCOUTXBAR0_EPWM15_SYNCOUT_SEL << 15) | (MW_EPWMSYNCOUTXBAR0_EPWM16_SYNCOUT_SEL << 16) | (MW_EPWMSYNCOUTXBAR0_EPWM17_SYNCOUT_SEL << 17) | (MW_EPWMSYNCOUTXBAR0_EPWM18_SYNCOUT_SEL << 18) | (MW_EPWMSYNCOUTXBAR0_EPWM19_SYNCOUT_SEL << 19) | (MW_EPWMSYNCOUTXBAR0_EPWM20_SYNCOUT_SEL << 20) | (MW_EPWMSYNCOUTXBAR0_EPWM21_SYNCOUT_SEL << 21) | (MW_EPWMSYNCOUTXBAR0_EPWM22_SYNCOUT_SEL << 22) | (MW_EPWMSYNCOUTXBAR0_EPWM23_SYNCOUT_SEL << 23) | (MW_EPWMSYNCOUTXBAR0_EPWM24_SYNCOUT_SEL << 24) | (MW_EPWMSYNCOUTXBAR0_EPWM25_SYNCOUT_SEL << 25) | (MW_EPWMSYNCOUTXBAR0_EPWM26_SYNCOUT_SEL << 26) | (MW_EPWMSYNCOUTXBAR0_EPWM27_SYNCOUT_SEL << 27) | (MW_EPWMSYNCOUTXBAR0_EPWM28_SYNCOUT_SEL << 28) | (MW_EPWMSYNCOUTXBAR0_EPWM29_SYNCOUT_SEL << 29) | (MW_EPWMSYNCOUTXBAR0_EPWM30_SYNCOUT_SEL << 30) | (MW_EPWMSYNCOUTXBAR0_EPWM31_SYNCOUT_SEL << 31);
    groupEpwmSyncoutXbar[1] = (MW_EPWMSYNCOUTXBAR1_EPWM0_SYNCOUT_SEL << 0) | (MW_EPWMSYNCOUTXBAR1_EPWM1_SYNCOUT_SEL << 1) | (MW_EPWMSYNCOUTXBAR1_EPWM2_SYNCOUT_SEL << 2) | (MW_EPWMSYNCOUTXBAR1_EPWM3_SYNCOUT_SEL << 3) | (MW_EPWMSYNCOUTXBAR1_EPWM4_SYNCOUT_SEL << 4) | (MW_EPWMSYNCOUTXBAR1_EPWM5_SYNCOUT_SEL << 5) | (MW_EPWMSYNCOUTXBAR1_EPWM6_SYNCOUT_SEL << 6) | (MW_EPWMSYNCOUTXBAR1_EPWM7_SYNCOUT_SEL << 7) | (MW_EPWMSYNCOUTXBAR1_EPWM8_SYNCOUT_SEL << 8) | (MW_EPWMSYNCOUTXBAR1_EPWM9_SYNCOUT_SEL << 9) | (MW_EPWMSYNCOUTXBAR1_EPWM10_SYNCOUT_SEL << 10) | (MW_EPWMSYNCOUTXBAR1_EPWM11_SYNCOUT_SEL << 11) | (MW_EPWMSYNCOUTXBAR1_EPWM12_SYNCOUT_SEL << 12) | (MW_EPWMSYNCOUTXBAR1_EPWM13_SYNCOUT_SEL << 13) | (MW_EPWMSYNCOUTXBAR1_EPWM14_SYNCOUT_SEL << 14) | (MW_EPWMSYNCOUTXBAR1_EPWM15_SYNCOUT_SEL << 15) | (MW_EPWMSYNCOUTXBAR1_EPWM16_SYNCOUT_SEL << 16) | (MW_EPWMSYNCOUTXBAR1_EPWM17_SYNCOUT_SEL << 17) | (MW_EPWMSYNCOUTXBAR1_EPWM18_SYNCOUT_SEL << 18) | (MW_EPWMSYNCOUTXBAR1_EPWM19_SYNCOUT_SEL << 19) | (MW_EPWMSYNCOUTXBAR1_EPWM20_SYNCOUT_SEL << 20) | (MW_EPWMSYNCOUTXBAR1_EPWM21_SYNCOUT_SEL << 21) | (MW_EPWMSYNCOUTXBAR1_EPWM22_SYNCOUT_SEL << 22) | (MW_EPWMSYNCOUTXBAR1_EPWM23_SYNCOUT_SEL << 23) | (MW_EPWMSYNCOUTXBAR1_EPWM24_SYNCOUT_SEL << 24) | (MW_EPWMSYNCOUTXBAR1_EPWM25_SYNCOUT_SEL << 25) | (MW_EPWMSYNCOUTXBAR1_EPWM26_SYNCOUT_SEL << 26) | (MW_EPWMSYNCOUTXBAR1_EPWM27_SYNCOUT_SEL << 27) | (MW_EPWMSYNCOUTXBAR1_EPWM28_SYNCOUT_SEL << 28) | (MW_EPWMSYNCOUTXBAR1_EPWM29_SYNCOUT_SEL << 29) | (MW_EPWMSYNCOUTXBAR1_EPWM30_SYNCOUT_SEL << 30) | (MW_EPWMSYNCOUTXBAR1_EPWM31_SYNCOUT_SEL << 31);
    groupEpwmSyncoutXbar[2] = (MW_EPWMSYNCOUTXBAR2_EPWM0_SYNCOUT_SEL << 0) | (MW_EPWMSYNCOUTXBAR2_EPWM1_SYNCOUT_SEL << 1) | (MW_EPWMSYNCOUTXBAR2_EPWM2_SYNCOUT_SEL << 2) | (MW_EPWMSYNCOUTXBAR2_EPWM3_SYNCOUT_SEL << 3) | (MW_EPWMSYNCOUTXBAR2_EPWM4_SYNCOUT_SEL << 4) | (MW_EPWMSYNCOUTXBAR2_EPWM5_SYNCOUT_SEL << 5) | (MW_EPWMSYNCOUTXBAR2_EPWM6_SYNCOUT_SEL << 6) | (MW_EPWMSYNCOUTXBAR2_EPWM7_SYNCOUT_SEL << 7) | (MW_EPWMSYNCOUTXBAR2_EPWM8_SYNCOUT_SEL << 8) | (MW_EPWMSYNCOUTXBAR2_EPWM9_SYNCOUT_SEL << 9) | (MW_EPWMSYNCOUTXBAR2_EPWM10_SYNCOUT_SEL << 10) | (MW_EPWMSYNCOUTXBAR2_EPWM11_SYNCOUT_SEL << 11) | (MW_EPWMSYNCOUTXBAR2_EPWM12_SYNCOUT_SEL << 12) | (MW_EPWMSYNCOUTXBAR2_EPWM13_SYNCOUT_SEL << 13) | (MW_EPWMSYNCOUTXBAR2_EPWM14_SYNCOUT_SEL << 14) | (MW_EPWMSYNCOUTXBAR2_EPWM15_SYNCOUT_SEL << 15) | (MW_EPWMSYNCOUTXBAR2_EPWM16_SYNCOUT_SEL << 16) | (MW_EPWMSYNCOUTXBAR2_EPWM17_SYNCOUT_SEL << 17) | (MW_EPWMSYNCOUTXBAR2_EPWM18_SYNCOUT_SEL << 18) | (MW_EPWMSYNCOUTXBAR2_EPWM19_SYNCOUT_SEL << 19) | (MW_EPWMSYNCOUTXBAR2_EPWM20_SYNCOUT_SEL << 20) | (MW_EPWMSYNCOUTXBAR2_EPWM21_SYNCOUT_SEL << 21) | (MW_EPWMSYNCOUTXBAR2_EPWM22_SYNCOUT_SEL << 22) | (MW_EPWMSYNCOUTXBAR2_EPWM23_SYNCOUT_SEL << 23) | (MW_EPWMSYNCOUTXBAR2_EPWM24_SYNCOUT_SEL << 24) | (MW_EPWMSYNCOUTXBAR2_EPWM25_SYNCOUT_SEL << 25) | (MW_EPWMSYNCOUTXBAR2_EPWM26_SYNCOUT_SEL << 26) | (MW_EPWMSYNCOUTXBAR2_EPWM27_SYNCOUT_SEL << 27) | (MW_EPWMSYNCOUTXBAR2_EPWM28_SYNCOUT_SEL << 28) | (MW_EPWMSYNCOUTXBAR2_EPWM29_SYNCOUT_SEL << 29) | (MW_EPWMSYNCOUTXBAR2_EPWM30_SYNCOUT_SEL << 30) | (MW_EPWMSYNCOUTXBAR2_EPWM31_SYNCOUT_SEL << 31);
    groupEpwmSyncoutXbar[3] = (MW_EPWMSYNCOUTXBAR3_EPWM0_SYNCOUT_SEL << 0) | (MW_EPWMSYNCOUTXBAR3_EPWM1_SYNCOUT_SEL << 1) | (MW_EPWMSYNCOUTXBAR3_EPWM2_SYNCOUT_SEL << 2) | (MW_EPWMSYNCOUTXBAR3_EPWM3_SYNCOUT_SEL << 3) | (MW_EPWMSYNCOUTXBAR3_EPWM4_SYNCOUT_SEL << 4) | (MW_EPWMSYNCOUTXBAR3_EPWM5_SYNCOUT_SEL << 5) | (MW_EPWMSYNCOUTXBAR3_EPWM6_SYNCOUT_SEL << 6) | (MW_EPWMSYNCOUTXBAR3_EPWM7_SYNCOUT_SEL << 7) | (MW_EPWMSYNCOUTXBAR3_EPWM8_SYNCOUT_SEL << 8) | (MW_EPWMSYNCOUTXBAR3_EPWM9_SYNCOUT_SEL << 9) | (MW_EPWMSYNCOUTXBAR3_EPWM10_SYNCOUT_SEL << 10) | (MW_EPWMSYNCOUTXBAR3_EPWM11_SYNCOUT_SEL << 11) | (MW_EPWMSYNCOUTXBAR3_EPWM12_SYNCOUT_SEL << 12) | (MW_EPWMSYNCOUTXBAR3_EPWM13_SYNCOUT_SEL << 13) | (MW_EPWMSYNCOUTXBAR3_EPWM14_SYNCOUT_SEL << 14) | (MW_EPWMSYNCOUTXBAR3_EPWM15_SYNCOUT_SEL << 15) | (MW_EPWMSYNCOUTXBAR3_EPWM16_SYNCOUT_SEL << 16) | (MW_EPWMSYNCOUTXBAR3_EPWM17_SYNCOUT_SEL << 17) | (MW_EPWMSYNCOUTXBAR3_EPWM18_SYNCOUT_SEL << 18) | (MW_EPWMSYNCOUTXBAR3_EPWM19_SYNCOUT_SEL << 19) | (MW_EPWMSYNCOUTXBAR3_EPWM20_SYNCOUT_SEL << 20) | (MW_EPWMSYNCOUTXBAR3_EPWM21_SYNCOUT_SEL << 21) | (MW_EPWMSYNCOUTXBAR3_EPWM22_SYNCOUT_SEL << 22) | (MW_EPWMSYNCOUTXBAR3_EPWM23_SYNCOUT_SEL << 23) | (MW_EPWMSYNCOUTXBAR3_EPWM24_SYNCOUT_SEL << 24) | (MW_EPWMSYNCOUTXBAR3_EPWM25_SYNCOUT_SEL << 25) | (MW_EPWMSYNCOUTXBAR3_EPWM26_SYNCOUT_SEL << 26) | (MW_EPWMSYNCOUTXBAR3_EPWM27_SYNCOUT_SEL << 27) | (MW_EPWMSYNCOUTXBAR3_EPWM28_SYNCOUT_SEL << 28) | (MW_EPWMSYNCOUTXBAR3_EPWM29_SYNCOUT_SEL << 29) | (MW_EPWMSYNCOUTXBAR3_EPWM30_SYNCOUT_SEL << 30) | (MW_EPWMSYNCOUTXBAR3_EPWM31_SYNCOUT_SEL << 31);

