TexasInstruments/am26x-hsp/src/am263px_init.c
MCSPI_ChConfig *gConfigMcspiChCfg[1] =
{
    gConfigMcspi0ChCfg,
};



MCSPI_DmaChConfig gMcspiDmaChConfig[1] =
{
    NULL,
};

EDMA_Handle gEdmaHandle[CONFIG_EDMA_NUM_INSTANCES];

/* EDMA Driver Open Parameters */
EDMA_Params gEdmaParams[CONFIG_EDMA_NUM_INSTANCES] =
{
    {
        .intrEnable = TRUE,
    },
};

void Drivers_edmaOpen(void);
void Drivers_edmaClose(void);
void Drivers_i2cOpen(void);
void Drivers_i2cClose(void);
void Drivers_pmicOpen();
void Drivers_mcspiOpenCC(void);
void Drivers_mcspiClose(void);
void I2C_ParamsMCAN_init(void);



int32_t Board_driversOpen(void)
{
    int32_t status = SystemP_SUCCESS;
    if(status==SystemP_SUCCESS)
    {
        status = Board_eepromOpen();
    }

    return status;
}

void Board_driversClose(void)
{
    Board_eepromClose();

    Board_pmicClose();

}

int32_t Board_eepromOpen()
{
    uint32_t instCnt;
    int32_t  status = SystemP_SUCCESS;

    for(instCnt = 0U; instCnt < CONFIG_EEPROM_NUM_INSTANCES; instCnt++)
    {
        gEepromHandle[instCnt] = NULL;   /* Init to NULL so that we can exit gracefully */
    }

    /* Open all instances */
    for(instCnt = 0U; instCnt < CONFIG_EEPROM_NUM_INSTANCES; instCnt++)
    {
        gEepromHandle[instCnt] = EEPROM_open(instCnt, &gEepromParams[instCnt]);
        if(NULL == gEepromHandle[instCnt])
        {
            DebugP_logError("EEPROM open failed for instance %d !!!\r\n", instCnt);
            status = SystemP_FAILURE;
            break;
        }
    }

    if(SystemP_FAILURE == status)
    {
        Board_eepromClose();   /* Exit gracefully */
    }

    return status;
}

void Board_eepromClose(void)
{
    uint32_t instCnt;

    /* Close all instances that are open */
    for(instCnt = 0U; instCnt < CONFIG_EEPROM_NUM_INSTANCES; instCnt++)
    {
        if(gEepromHandle[instCnt] != NULL)
        {
            EEPROM_close(gEepromHandle[instCnt]);
            gEepromHandle[instCnt] = NULL;
        }
    }

    return;
}

int32_t Board_pmicOpen()
{
    uint32_t instCnt;
    int32_t  status = SystemP_SUCCESS;

    for(instCnt = 0U; instCnt < CONFIG_PMIC_NUM_INSTANCES; instCnt++)
    {
        gPmicHandle[instCnt] = NULL;   /* Init to NULL so that we can exit gracefully */
    }

    /* Open all instances */
    for(instCnt = 0U; instCnt < CONFIG_PMIC_NUM_INSTANCES; instCnt++)
    {
        gPmicHandle[instCnt] = PMIC_open(instCnt, &gPmicParams[instCnt]);
        if(NULL == gPmicHandle[instCnt])
        {
            DebugP_logError("PMIC open failed for instance %d !!!\r\n", instCnt);
            status = SystemP_FAILURE;
            break;
        }
    }

    if(SystemP_FAILURE == status)
    {
        Board_pmicClose();   /* Exit gracefully */
    }

    return status;
}

void Board_pmicClose(void)
{
    uint32_t instCnt;

    /* Close all instances that are open */
    for(instCnt = 0U; instCnt < CONFIG_PMIC_NUM_INSTANCES; instCnt++)
    {
        if(gPmicHandle[instCnt] != NULL)
        {
            PMIC_close(gPmicHandle[instCnt]);
            gPmicHandle[instCnt] = NULL;
        }
    }

    return;
}

void Drivers_pmicOpen()
{
    PMIC_Handle pmicHandle = NULL;

    Drivers_mcspiOpenCC();
    Board_pmicOpen();
    pmicHandle = gPmicHandle[CONFIG_PMIC0];
    PMIC_configure(pmicHandle);
    Drivers_mcspiClose();
    /*Wait 5ms for LDO rail to get initilized*/
    ClockP_usleep(5000);
}


I2C_HwAttrs gI2cHwAttrs[CONFIG_I2C_NUM_INSTANCES];
/* I2C objects - initialized by the driver */
I2C_Object gI2cObjects[CONFIG_I2C_NUM_INSTANCES];
/* I2C driver configuration */
I2C_Config gI2cConfig[CONFIG_I2C_NUM_INSTANCES];

uint32_t gI2cConfigNum = CONFIG_I2C_NUM_INSTANCES;

I2C_Handle gI2cHandle[CONFIG_I2C_NUM_INSTANCES];

/* I2C Driver Parameters */
I2C_Params gI2cParams[CONFIG_I2C_NUM_INSTANCES];

void I2C_ParamsMCAN_init(void)
{
    uint8_t indx = 0;

    #ifdef MW_EXTMODE_RUNNING
    String board = STR(MW_TARGETHARDWARE);
    String XCPInterface = STR(MW_EXTMODE_CONFIGURATION);
    String ExtRunning = STR(MW_EXTMODE_RUNNING);

    if(((strcmp(ExtRunning, "on") == 0) && (strcmp(XCPInterface, "CAN") == 0) && (strcmp(board, "AM263PX ControlCard") == 0)))
    {
        gI2cHwAttrs[indx].baseAddr              = CSL_I2C2_U_BASE;
        gI2cHwAttrs[indx].intNum                = 46;
        gI2cHwAttrs[indx].eventId               = 0;
        gI2cHwAttrs[indx].funcClk               = 96000000U;
        gI2cHwAttrs[indx].enableIntr            = 1;
        gI2cHwAttrs[indx].ownTargetAddr         = 0x1C;

        gI2cConfig[indx].object                 = &gI2cObjects[indx];
        gI2cConfig[indx].hwAttrs                = &gI2cHwAttrs[indx];

        gI2cParams[indx].transferMode           = I2C_MODE_BLOCKING;
        gI2cParams[indx].transferCallbackFxn    = NULL;
        gI2cParams[indx].bitRate                = I2C_400KHZ;

        indx++;

        gI2cHwAttrs[indx].baseAddr              = CSL_I2C0_U_BASE;
        gI2cHwAttrs[indx].intNum                = 44;
        gI2cHwAttrs[indx].eventId               = 0;
        gI2cHwAttrs[indx].funcClk               = 96000000U;
        gI2cHwAttrs[indx].enableIntr            = 1;
        gI2cHwAttrs[indx].ownTargetAddr         = 0x1C;

        gI2cConfig[indx].object                 = &gI2cObjects[indx];
        gI2cConfig[indx].hwAttrs                = &gI2cHwAttrs[indx];

        gI2cParams[indx].transferMode           = I2C_MODE_BLOCKING;
        gI2cParams[indx].transferCallbackFxn    = NULL;
        gI2cParams[indx].bitRate                = I2C_400KHZ; 

        indx++;

    }

    if((((strcmp(ExtRunning, "on") == 0) && (strcmp(XCPInterface, "CAN") == 0) && (strcmp(board, "AM263PX LP") == 0))))
    {
        gI2cHwAttrs[indx].baseAddr              = CSL_I2C1_U_BASE;
        gI2cHwAttrs[indx].intNum                = 45;
        gI2cHwAttrs[indx].eventId               = 0;
        gI2cHwAttrs[indx].funcClk               = 96000000U;
        gI2cHwAttrs[indx].enableIntr            = 1;
        gI2cHwAttrs[indx].ownTargetAddr         = 0x1C;

        gI2cConfig[indx].object                 = &gI2cObjects[indx];
        gI2cConfig[indx].hwAttrs                = &gI2cHwAttrs[indx];

        gI2cParams[indx].transferMode           = I2C_MODE_BLOCKING;
        gI2cParams[indx].transferCallbackFxn    = NULL;
        gI2cParams[indx].bitRate                = I2C_400KHZ;    
    }
    #else
    if((MW_ENABLE_I2C_TCV_MCAN0_SEL == 1) | (MW_ENABLE_I2C_TCV_MCAN1_SEL == 1) | (MW_ENABLE_I2C_TCV_MCAN2_SEL == 1) | (MW_ENABLE_I2C_TCV_MCAN3_SEL == 1) | (MW_ENABLE_I2C_TCV_MCAN4_SEL == 1) | (MW_ENABLE_I2C_TCV_MCAN5_SEL == 1) | (MW_ENABLE_I2C_TCV_MCAN6_SEL == 1) | (MW_ENABLE_I2C_TCV_MCAN7_SEL == 1))
    {
        gI2cHwAttrs[indx].baseAddr              = CSL_I2C2_U_BASE;
        gI2cHwAttrs[indx].intNum                = 46;
        gI2cHwAttrs[indx].eventId               = 0;
        gI2cHwAttrs[indx].funcClk               = 96000000U;
        gI2cHwAttrs[indx].enableIntr            = 1;
        gI2cHwAttrs[indx].ownTargetAddr         = 0x1C;

        gI2cConfig[indx].object                 = &gI2cObjects[indx];
        gI2cConfig[indx].hwAttrs                = &gI2cHwAttrs[indx];

        gI2cParams[indx].transferMode           = I2C_MODE_BLOCKING;
        gI2cParams[indx].transferCallbackFxn    = NULL;
        gI2cParams[indx].bitRate                = I2C_400KHZ;

