TexasInstruments/am26x-hsp/src/am263px_init.c
        indx++;

        gI2cHwAttrs[indx].baseAddr              = CSL_I2C0_U_BASE;
        gI2cHwAttrs[indx].intNum                = 44;
        gI2cHwAttrs[indx].eventId               = 0;
        gI2cHwAttrs[indx].funcClk               = 96000000U;
        gI2cHwAttrs[indx].enableIntr            = 1;
        gI2cHwAttrs[indx].ownTargetAddr         = 0x1C;

        gI2cConfig[indx].object                 = &gI2cObjects[indx];
        gI2cConfig[indx].hwAttrs                = &gI2cHwAttrs[indx];

        gI2cParams[indx].transferMode           = I2C_MODE_BLOCKING;
        gI2cParams[indx].transferCallbackFxn    = NULL;
        gI2cParams[indx].bitRate                = I2C_400KHZ; 

        indx++;

    }

    if(((MW_ENABLE_GPIO_TCV_MCAN0_SEL == 1) | (MW_ENABLE_GPIO_TCV_MCAN1_SEL == 1) | (MW_ENABLE_GPIO_TCV_MCAN2_SEL == 1) | (MW_ENABLE_GPIO_TCV_MCAN3_SEL == 1) | (MW_ENABLE_GPIO_TCV_MCAN4_SEL == 1) | (MW_ENABLE_GPIO_TCV_MCAN5_SEL == 1) | (MW_ENABLE_GPIO_TCV_MCAN6_SEL == 1) | (MW_ENABLE_GPIO_TCV_MCAN7_SEL == 1)))
    {
            gI2cHwAttrs[indx].baseAddr              = CSL_I2C1_U_BASE;
            gI2cHwAttrs[indx].intNum                = 45;
            gI2cHwAttrs[indx].eventId               = 0;
            gI2cHwAttrs[indx].funcClk               = 96000000U;
            gI2cHwAttrs[indx].enableIntr            = 1;
            gI2cHwAttrs[indx].ownTargetAddr         = 0x1C;

            gI2cConfig[indx].object                 = &gI2cObjects[indx];
            gI2cConfig[indx].hwAttrs                = &gI2cHwAttrs[indx];

            gI2cParams[indx].transferMode           = I2C_MODE_BLOCKING;
            gI2cParams[indx].transferCallbackFxn    = NULL;
            gI2cParams[indx].bitRate                = I2C_400KHZ;    
    }
    #endif




}

void Drivers_i2cOpen(void)
{
    uint32_t instCnt;
    int32_t  status = SystemP_SUCCESS;

    for(instCnt = 0U; instCnt < CONFIG_I2C_NUM_INSTANCES; instCnt++)
    {
        gI2cHandle[instCnt] = NULL;   /* Init to NULL so that we can exit gracefully */
    }

    /* Open all instances */
    for(instCnt = 0U; instCnt < CONFIG_I2C_NUM_INSTANCES; instCnt++)
    {
        // if(((instCnt == 0U) && (MW_ENABLE_I2C0_SEL == 1)) | ((instCnt == 1U) && (MW_ENABLE_I2C1_SEL == 1)) | ((instCnt == 2U) && (MW_ENABLE_I2C2_SEL == 1)))
        // {
            gI2cHandle[instCnt] = I2C_open(instCnt, &gI2cParams[instCnt]);
            if(NULL == gI2cHandle[instCnt])
            {
                DebugP_logError("I2C open failed for instance %d !!!\r\n", instCnt);
                status = SystemP_FAILURE;
                break;
            }
        // }
    
    }

    if(SystemP_FAILURE == status)
    {
        Drivers_i2cClose();   /* Exit gracefully */
    }

    return;
}

void Drivers_i2cClose(void)
{
    uint32_t instCnt;

    /* Close all instances that are open */
    for(instCnt = 0U; instCnt < CONFIG_I2C_NUM_INSTANCES; instCnt++)
    {
        if(gI2cHandle[instCnt] != NULL)
        {
            I2C_close(gI2cHandle[instCnt]);
            gI2cHandle[instCnt] = NULL;
        }
    }

    return;
}

void Drivers_mcspiOpenCC(void)
{
    uint32_t instCnt;
    int32_t  status = SystemP_SUCCESS;

    for(instCnt = 0U; instCnt < CONFIG_MCSPI_NUM_INSTANCES; instCnt++)
    {
        gMcspiHandle[instCnt] = NULL;   /* Init to NULL so that we can exit gracefully */
    }

    /* Open all instances */
    for(instCnt = 0U; instCnt < CONFIG_MCSPI_NUM_INSTANCES; instCnt++)
    {
        gMcspiHandle[instCnt] = MCSPI_open(instCnt, &gMcspiOpenParams[instCnt]);
        if(NULL == gMcspiHandle[instCnt])
        {
            DebugP_logError("MCSPI open failed for instance %d !!!\r\n", instCnt);
            status = SystemP_FAILURE;
            break;
        }
    }

    if(SystemP_FAILURE == status)
    {
        Drivers_mcspiClose();   /* Exit gracefully */
    }

    return;
}

void Drivers_mcspiClose(void)
{
    uint32_t instCnt;
    /* Close all instances that are open */
    for(instCnt = 0U; instCnt < CONFIG_MCSPI_NUM_INSTANCES; instCnt++)
    {
        if(gMcspiHandle[instCnt] != NULL)
        {
            MCSPI_close(gMcspiHandle[instCnt]);
            gMcspiHandle[instCnt] = NULL;
        }
    }
    return;
}


void Drivers_edmaOpen(void)
{
    uint32_t instCnt;
    int32_t  status = SystemP_SUCCESS;

    for(instCnt = 0U; instCnt < CONFIG_EDMA_NUM_INSTANCES; instCnt++)
    {
        gEdmaHandle[instCnt] = NULL;   /* Init to NULL so that we can exit gracefully */
    }

    /* Open all instances */
    for(instCnt = 0U; instCnt < CONFIG_EDMA_NUM_INSTANCES; instCnt++)
    {
        gEdmaHandle[instCnt] = EDMA_open(instCnt, &gEdmaParams[instCnt]);
        if(NULL == gEdmaHandle[instCnt])
        {
            DebugP_logError("EDMA open failed for instance %d !!!\r\n", instCnt);
            status = SystemP_FAILURE;
            break;
        }
    }

    if(SystemP_FAILURE == status)
    {
        Drivers_edmaClose();   /* Exit gracefully */
    }

    return;
}

void Drivers_edmaClose(void)
{
    uint32_t instCnt;

    /* Close all instances that are open */
    for(instCnt = 0U; instCnt < CONFIG_EDMA_NUM_INSTANCES; instCnt++)
    {
        if(gEdmaHandle[instCnt] != NULL)
        {
            EDMA_close(gEdmaHandle[instCnt]);
            gEdmaHandle[instCnt] = NULL;
        }
    }

    return;
}




MCAN_BitTimingParams gMcanBitTimingDefaultParams;
MCAN_InitParams            initParams = {0U};
MCAN_ConfigParams          configParams = {0U};
MCAN_MsgRAMConfigParams    msgRAMConfigParams = {0U};
MCAN_BitTimingParams       bitTimes = {0U};
MCAN_ExtMsgIDFilterElement extFiltElem[MW_ELEMCNT_EXTFILT_MCAN0_SEL] = {0U};
MCAN_StdMsgIDFilterElement stdFiltElem[MW_ELEMCNT_STDFILT_MCAN0_SEL] = {0U};
uint32_t filter_cnt;
#define MCAN_COUNT                               (8)
#define APP_MCAN_EXT_ID_MASK                     (0x1FFFFFFFU)
#define APP_MCAN_STD_ID_MASK                     (0x7FFU)
#define APP_MCAN_STD_ID_SHIFT                    (18U)



#define IO_MUX_MCAN_STB                             (10U)                       /* PORT 1, PIN 2         -> ioIndex : 1*8 + 2 = 10 */
#define TCA6416_IO_MUX_MCAN_STB_PORT_LINE_STATE     (TCA6416_OUT_STATE_LOW)     /* MCAN_STB PIN OUTPUT   -> 0 */

/* ========================================================================== */
/*                            Global Variables                                */
/* ========================================================================== */
static TCA6416_Config  gTCA6416_Config;

void mcanEnableTransceiverLP(void)
{
    int32_t             status = SystemP_SUCCESS;
    TCA6416_Params      tca6416Params;
    TCA6416_Params_init(&tca6416Params);

    status = TCA6416_open(&gTCA6416_Config, &tca6416Params);
    DebugP_assert(SystemP_SUCCESS == status);

