TexasInstruments/am26x-hsp/src/am263px_init.c
                    }
                

                while (FALSE == MCAN_isMemInitDone(CSL_MCAN6_MSG_RAM_U_BASE))
                {}
                MCAN_setOpMode(CSL_MCAN6_MSG_RAM_U_BASE, MCAN_OPERATION_MODE_SW_INIT);
                while (MCAN_OPERATION_MODE_SW_INIT != MCAN_getOpMode(CSL_MCAN6_MSG_RAM_U_BASE))
                {}

                MCAN_init(CSL_MCAN6_MSG_RAM_U_BASE, &initParams);
                MCAN_config(CSL_MCAN6_MSG_RAM_U_BASE, &configParams);
                MCAN_setBitTime(CSL_MCAN6_MSG_RAM_U_BASE, &bitTimes);
                MCAN_msgRAMConfig(CSL_MCAN6_MSG_RAM_U_BASE, &msgRAMConfigParams);
                MCAN_setExtIDAndMask(CSL_MCAN6_MSG_RAM_U_BASE, APP_MCAN_EXT_ID_MASK);

                
                    
                if(MW_ENABLE_STDFILT_MCAN6_SEL == 1)
                {
                    for(j = 0; j < MW_ELEMCNT_STDFILT_MCAN6_SEL; j++)
                    {
                        MCAN_addStdMsgIDFilter(CSL_MCAN6_MSG_RAM_U_BASE, j, &stdFiltElem[j]);
                    }
                }
                        
                if(MW_ENABLE_EXTFILT_MCAN6_SEL == 1)
                {
                    for(j = 0; j < MW_ELEMCNT_EXTFILT_MCAN6_SEL; j++)
                    {
                        MCAN_addExtMsgIDFilter(CSL_MCAN6_MSG_RAM_U_BASE, j, &extFiltElem[j]);
                    }

                }

                if (MW_ENABLE_INTLOOPBACK_MCAN6_SEL == 1)
                {
                    MCAN_lpbkModeEnable(CSL_MCAN6_MSG_RAM_U_BASE, MCAN_LPBK_MODE_INTERNAL, TRUE);
                }

                MCAN_setOpMode(CSL_MCAN6_MSG_RAM_U_BASE, MCAN_OPERATION_MODE_NORMAL);
                while (MCAN_OPERATION_MODE_NORMAL != MCAN_getOpMode(CSL_MCAN6_MSG_RAM_U_BASE))
                {}

            App_mcanEnableIntr(i);

        }
        else if(((i == 7) && (MW_ENABLE_MCAN7_SEL == 1)))
            {
                if((MW_ENABLE_INTLOOPBACK_MCAN7_SEL == 0) && (MW_ENABLE_GPIO_TCV_MCAN7_SEL == 1))
                {
                    mcanEnableTransceiverLP();
                }
                else if((MW_ENABLE_INTLOOPBACK_MCAN7_SEL == 0) && (MW_ENABLE_I2C_TCV_MCAN7_SEL == 1) && !tcvENABLE)
                {
                    mcanEnableTransceiverCC();
                }

                MCAN_initOperModeParams(&initParams);
                if(MW_PROTOCOL_MCAN7_SEL == 0)
                     initParams.fdMode = TRUE;
                else
                     initParams.fdMode = FALSE;    
                
                if(MW_ENABLE_BRS_MCAN7_SEL == 1)
                    initParams.brsEnable = TRUE;
                else
                    initParams.brsEnable = FALSE;

                MCAN_initGlobalFilterConfigParams(&configParams);
                MCAN_initSetBitTimeParams(&bitTimes);
                MCAN_initMsgRamConfigParams(&msgRAMConfigParams);

                msgRAMConfigParams.lss = MW_ELEMCNT_STDFILT_MCAN7_SEL;
                msgRAMConfigParams.lse = MW_ELEMCNT_EXTFILT_MCAN7_SEL;
                msgRAMConfigParams.txBufCnt = MW_ELEMCNT_TXBUF_MCAN7_SEL;
                msgRAMConfigParams.txFIFOCnt = MW_ELEMCNT_TXFIFO_MCAN7_SEL;
                msgRAMConfigParams.txBufMode = MCAN_TX_MEM_TYPE_BUF;
                msgRAMConfigParams.txEventFIFOCnt = MW_ELEMCNT_TXEVENTFIFO_MCAN7_SEL;
                msgRAMConfigParams.rxFIFO0Cnt = MW_ELEMCNT_RXFIFO0_MCAN7_SEL;
                msgRAMConfigParams.rxFIFO1Cnt = MW_ELEMCNT_RXFIFO1_MCAN7_SEL;
               

                if(MW_ENABLE_BLOCKINGFIFO0_MCAN7_SEL == 1)
                    msgRAMConfigParams.rxFIFO0OpMode = MCAN_RX_FIFO_OPERATION_MODE_BLOCKING;

                if(MW_ENABLE_BLOCKINGFIFO1_MCAN7_SEL == 1)
                    msgRAMConfigParams.rxFIFO1OpMode = MCAN_RX_FIFO_OPERATION_MODE_BLOCKING;  

                status = MCAN_calcMsgRamParamsStartAddr(&msgRAMConfigParams);
                DebugP_assert(status == CSL_PASS);

                if(MW_ENABLE_STDFILT_MCAN7_SEL == 1)
                    filter_cnt = (uint32_t)MW_ELEMCNT_STDFILT_MCAN7_SEL;
                else if(MW_ELEMCNT_EXTFILT_MCAN7_SEL == 1)
                    filter_cnt = (uint32_t)MW_ELEMCNT_EXTFILT_MCAN7_SEL;

                
                    if(MW_ENABLE_STDFILT_MCAN7_SEL == 1)
                    {
                        for(j = 0; j < MW_ELEMCNT_STDFILT_MCAN7_SEL; j++)
                        {
                            stdFiltElem[j].sfid1 = (uint32_t)(MW_STDFILT_ID1_MCAN7_SEL) + j;
                            if(MW_STDFILT_CONFIG_MCAN7_SEL != 7)
                                stdFiltElem[j].sfid2 = (uint32_t)(MW_STDFILT_ID2_MCAN7_SEL);
                            else
                                stdFiltElem[j].sfid2 = (uint32_t)(MW_STDFILT_ID2_MCAN7_SEL) + j;
                            if(MW_STDFILT_CONFIG_MCAN7_SEL == 7)
                                stdFiltElem[j].sfec = MCAN_STD_FILT_ELEM_BUFFER;
                            else if(MW_STDFILT_CONFIG_MCAN7_SEL == 1 | MW_STDFILT_CONFIG_MCAN7_SEL == 5)
                                stdFiltElem[j].sfec = MCAN_STD_FILT_ELEM_FIFO0;
                            else if(MW_STDFILT_CONFIG_MCAN7_SEL == 2 | MW_STDFILT_CONFIG_MCAN7_SEL == 6)  
                                stdFiltElem[j].sfec = MCAN_STD_FILT_ELEM_FIFO1;
                            stdFiltElem[j].sft = MW_STDFILT_TYPE_MCAN7_SEL;
                        }
                    }

                    if(MW_ENABLE_EXTFILT_MCAN7_SEL == 1)
                    {
                        for(j = 0; j < MW_ELEMCNT_EXTFILT_MCAN7_SEL; j++)
                        {
                            extFiltElem[j].efid1 = (uint32_t)(MW_EXTFILT_ID1_MCAN7_SEL) + j;
                            if(MW_EXTFILT_CONFIG_MCAN7_SEL != 7)
                                extFiltElem[j].efid2 = (uint32_t)(MW_EXTFILT_ID2_MCAN7_SEL);
                            else
                                extFiltElem[j].efid2 = (uint32_t)(MW_EXTFILT_ID2_MCAN7_SEL) + j;
                            if(MW_EXTFILT_CONFIG_MCAN7_SEL  == 7)
                                extFiltElem[j].efec = MCAN_EXT_FILT_ELEM_BUFFER;
                            else if(MW_EXTFILT_CONFIG_MCAN7_SEL == 1 | MW_EXTFILT_CONFIG_MCAN7_SEL == 5)
                                extFiltElem[j].efec = MCAN_EXT_FILT_ELEM_FIFO0;
                            else if(MW_EXTFILT_CONFIG_MCAN7_SEL == 2 | MW_EXTFILT_CONFIG_MCAN7_SEL == 6)    
                                extFiltElem[j].efec = MCAN_EXT_FILT_ELEM_FIFO1;
                            extFiltElem[j].eft = MW_EXTFILT_TYPE_MCAN7_SEL;
                        }

