TexasInstruments/am26x-hsp/src/am263px_init.c
                    }
                

                while (FALSE == MCAN_isMemInitDone(CSL_MCAN7_MSG_RAM_U_BASE))
                {}
                MCAN_setOpMode(CSL_MCAN7_MSG_RAM_U_BASE, MCAN_OPERATION_MODE_SW_INIT);
                while (MCAN_OPERATION_MODE_SW_INIT != MCAN_getOpMode(CSL_MCAN7_MSG_RAM_U_BASE))
                {}

                MCAN_init(CSL_MCAN7_MSG_RAM_U_BASE, &initParams);
                MCAN_config(CSL_MCAN7_MSG_RAM_U_BASE, &configParams);
                MCAN_setBitTime(CSL_MCAN7_MSG_RAM_U_BASE, &bitTimes);
                MCAN_msgRAMConfig(CSL_MCAN7_MSG_RAM_U_BASE, &msgRAMConfigParams);
                MCAN_setExtIDAndMask(CSL_MCAN7_MSG_RAM_U_BASE, APP_MCAN_EXT_ID_MASK);

                
                    
                if(MW_ENABLE_STDFILT_MCAN7_SEL == 1)
                {
                    for(j = 0; j < MW_ELEMCNT_STDFILT_MCAN7_SEL; j++)
                    {
                        MCAN_addStdMsgIDFilter(CSL_MCAN7_MSG_RAM_U_BASE, j, &stdFiltElem[j]);
                    }
                }
                        
                if(MW_ENABLE_EXTFILT_MCAN7_SEL == 1)
                {
                    for(j = 0; j < MW_ELEMCNT_EXTFILT_MCAN7_SEL; j++)
                    {
                        MCAN_addExtMsgIDFilter(CSL_MCAN7_MSG_RAM_U_BASE, j, &extFiltElem[j]);
                    }

                }

                if (MW_ENABLE_INTLOOPBACK_MCAN7_SEL == 1)
                {
                    MCAN_lpbkModeEnable(CSL_MCAN7_MSG_RAM_U_BASE, MCAN_LPBK_MODE_INTERNAL, TRUE);
                }

                MCAN_setOpMode(CSL_MCAN7_MSG_RAM_U_BASE, MCAN_OPERATION_MODE_NORMAL);
                while (MCAN_OPERATION_MODE_NORMAL != MCAN_getOpMode(CSL_MCAN7_MSG_RAM_U_BASE))
                {}

            App_mcanEnableIntr(i);

        }

    }
}
}

#define MCSPI_BLOCK_NUM_INSTANCES (8U)
#define MCSPI_BLOCK_CHANNEL_NUM (2U)
MCSPI_ChConfig gConfigBlockMcspi0ChCfg[2U];
MCSPI_ChConfig gConfigBlockMcspi1ChCfg[2U];
MCSPI_ChConfig gConfigBlockMcspi2ChCfg[2U];
MCSPI_ChConfig gConfigBlockMcspi3ChCfg[2U];
MCSPI_ChConfig gConfigBlockMcspi4ChCfg[2U];
MCSPI_ChConfig gConfigBlockMcspi5ChCfg[2U];
MCSPI_ChConfig gConfigBlockMcspi6ChCfg[2U];
MCSPI_ChConfig gConfigBlockMcspi7ChCfg[2U];
MCSPILLD_InitObject gMcspiInitObject[MCSPI_BLOCK_NUM_INSTANCES];
// MCSPI_ChConfig *gConfigMcspiChCfg;

void MCSPI_channel_init(void)
{
    for(uint8_t i=0; i<MCSPI_BLOCK_NUM_INSTANCES; i++)
    {
        for(uint8_t j = 0; j<MCSPI_BLOCK_CHANNEL_NUM; j++)
        {
            if((i == 0) && (j == 0) && (MW_MCSPI0_ENABLE_CH0_SEL == TRUE))
            {
                gConfigBlockMcspi0ChCfg[j].chNum =  MCSPI_CHANNEL_0;
                gConfigBlockMcspi0ChCfg[j].frameFormat = MW_MCSPI0_CH0_FRAME_FORMAT_SEL;
                gConfigBlockMcspi0ChCfg[j].bitRate = MW_MCSPI0_CH0_CLK_FREQ_SEL;
                if(MW_MCSPI0_CH0_CHIP_SELECT_POLARITY_SEL == 0)
                gConfigBlockMcspi0ChCfg[j].csPolarity = MCSPI_CS_POL_LOW;
                else if(MW_MCSPI0_CH0_CHIP_SELECT_POLARITY_SEL == 1)
                    gConfigBlockMcspi0ChCfg[j].csPolarity = MCSPI_CS_POL_HIGH;
                if(MW_MCSPI0_TR_MODE_SEL == 0)
                    gConfigBlockMcspi0ChCfg[j].trMode = MCSPI_TR_MODE_TX_RX;
                else if(MW_MCSPI0_TR_MODE_SEL == 1)
                    gConfigBlockMcspi0ChCfg[j].trMode = MCSPI_TR_MODE_TX_ONLY;
                else if(MW_MCSPI0_TR_MODE_SEL == 2)
                    gConfigBlockMcspi0ChCfg[j].trMode = MCSPI_TR_MODE_RX_ONLY;
                if(MW_MCSPI0_INPUT_SELECT_SEL == 0)
                    gConfigBlockMcspi0ChCfg[j].inputSelect = MCSPI_IS_D0;
                else if(MW_MCSPI0_INPUT_SELECT_SEL == 1)
                    gConfigBlockMcspi0ChCfg[j].inputSelect = MCSPI_IS_D1;
                if(MW_MCSPI0_ENABLE_D0TX_SEL == 0)
                    gConfigBlockMcspi0ChCfg[j].dpe0 =  MCSPI_DPE_DISABLE;
                else if(MW_MCSPI0_ENABLE_D0TX_SEL == 1)
                    gConfigBlockMcspi0ChCfg[j].dpe0 =  MCSPI_DPE_ENABLE;   
                if(MW_MCSPI0_ENABLE_D1TX_SEL == 0)
                gConfigBlockMcspi0ChCfg[j].dpe1 =  MCSPI_DPE_DISABLE;
                else if(MW_MCSPI0_ENABLE_D1TX_SEL == 1)
                    gConfigBlockMcspi0ChCfg[j].dpe1 =  MCSPI_DPE_ENABLE;   
                if(MW_MCSPI0_TR_MODE_SEL == 0)
                {
                    gConfigBlockMcspi0ChCfg[j].txFifoTrigLvl = MW_MCSPI0_FIFO_TRIGLVLTX_SEL;
                    gConfigBlockMcspi0ChCfg[j].rxFifoTrigLvl = MW_MCSPI0_FIFO_TRIGLVLRX_SEL;   
                }
                else if(MW_MCSPI0_TR_MODE_SEL == 1)
                {
                    gConfigBlockMcspi0ChCfg[j].txFifoTrigLvl = MW_MCSPI0_FIFO_TRIGLVLTX_SEL;    
                }
                else if(MW_MCSPI0_TR_MODE_SEL == 1)
                {
                gConfigBlockMcspi0ChCfg[j].rxFifoTrigLvl = MW_MCSPI0_FIFO_TRIGLVLRX_SEL; 
                }
                gConfigBlockMcspi0ChCfg[j].slvCsSelect = MCSPI_SLV_CS_SELECT_0;
                gConfigBlockMcspi0ChCfg[j].startBitEnable = MW_MCSPI0_CH0_ENABLE_START_BIT_SEL;
                if(MW_MCSPI0_CH0_START_BIT_POLARITY_SEL == 0)
                    gConfigBlockMcspi0ChCfg[j].startBitPolarity = MCSPI_SB_POL_LOW;
                else if(MW_MCSPI0_CH0_START_BIT_POLARITY_SEL == 1)  
                    gConfigBlockMcspi0ChCfg[j].startBitPolarity = MCSPI_SB_POL_HIGH; 
                gConfigBlockMcspi0ChCfg[j].turboEnable = MW_MCSPI0_CH0_ENABLE_TURBO_MODE_SEL;
                gConfigBlockMcspi0ChCfg[j].csIdleTime = MCSPI_TCS0_0_CLK;
                gConfigBlockMcspi0ChCfg[j].defaultTxData = (uint32_t)(MW_MCSPI0_CH0_DEFAULT_TX_DATA_SEL);

                

            }
            else if((i == 0) && (j == 1) && (MW_MCSPI0_ENABLE_CH1_SEL == TRUE))
            {

                gConfigBlockMcspi0ChCfg[j].chNum =  MCSPI_CHANNEL_1;
                gConfigBlockMcspi0ChCfg[j].frameFormat = MW_MCSPI0_CH1_FRAME_FORMAT_SEL;
                gConfigBlockMcspi0ChCfg[j].bitRate = MW_MCSPI0_CH1_CLK_FREQ_SEL;
                if(MW_MCSPI0_CH1_CHIP_SELECT_POLARITY_SEL == 0)
                gConfigBlockMcspi0ChCfg[j].csPolarity = MCSPI_CS_POL_LOW;
                else if(MW_MCSPI0_CH1_CHIP_SELECT_POLARITY_SEL == 1)
                    gConfigBlockMcspi0ChCfg[j].csPolarity = MCSPI_CS_POL_HIGH;
                if(MW_MCSPI0_TR_MODE_SEL == 0)
                    gConfigBlockMcspi0ChCfg[j].trMode = MCSPI_TR_MODE_TX_RX;
                else if(MW_MCSPI0_TR_MODE_SEL == 1)
                    gConfigBlockMcspi0ChCfg[j].trMode = MCSPI_TR_MODE_TX_ONLY;
                else if(MW_MCSPI0_TR_MODE_SEL == 2)
                    gConfigBlockMcspi0ChCfg[j].trMode = MCSPI_TR_MODE_RX_ONLY;
                if(MW_MCSPI0_INPUT_SELECT_SEL == 0)
                gConfigBlockMcspi0ChCfg[j].inputSelect = MCSPI_IS_D0;
                else if(MW_MCSPI0_INPUT_SELECT_SEL == 1)
                    gConfigBlockMcspi0ChCfg[j].inputSelect = MCSPI_IS_D1;
                if(MW_MCSPI0_ENABLE_D0TX_SEL == 0)
                    gConfigBlockMcspi0ChCfg[j].dpe0 =  MCSPI_DPE_DISABLE;
                else if(MW_MCSPI0_ENABLE_D0TX_SEL == 1)
                gConfigBlockMcspi0ChCfg[j].dpe0 =  MCSPI_DPE_ENABLE;   
                if(MW_MCSPI0_ENABLE_D1TX_SEL == 0)
                gConfigBlockMcspi0ChCfg[j].dpe1 =  MCSPI_DPE_DISABLE;
                else if(MW_MCSPI0_ENABLE_D1TX_SEL == 1)
                    gConfigBlockMcspi0ChCfg[j].dpe1 =  MCSPI_DPE_ENABLE;   
                if(MW_MCSPI0_TR_MODE_SEL == 0)
                {
                    gConfigBlockMcspi0ChCfg[j].txFifoTrigLvl = MW_MCSPI0_FIFO_TRIGLVLTX_SEL;
                    gConfigBlockMcspi0ChCfg[j].rxFifoTrigLvl = MW_MCSPI0_FIFO_TRIGLVLRX_SEL;   
                }
                else if(MW_MCSPI0_TR_MODE_SEL == 1)
                {
                    gConfigBlockMcspi0ChCfg[j].txFifoTrigLvl = MW_MCSPI0_FIFO_TRIGLVLTX_SEL;    
                }
                else if(MW_MCSPI0_TR_MODE_SEL == 1)
                {
                gConfigBlockMcspi0ChCfg[j].rxFifoTrigLvl = MW_MCSPI0_FIFO_TRIGLVLRX_SEL; 
                }
                gConfigBlockMcspi0ChCfg[j].slvCsSelect = MCSPI_SLV_CS_SELECT_0;
                gConfigBlockMcspi0ChCfg[j].startBitEnable = MW_MCSPI0_CH1_ENABLE_START_BIT_SEL;
                if(MW_MCSPI0_CH1_START_BIT_POLARITY_SEL == 0)
                    gConfigBlockMcspi0ChCfg[j].startBitPolarity = MCSPI_SB_POL_LOW;
                else if(MW_MCSPI0_CH1_START_BIT_POLARITY_SEL == 1)  
                    gConfigBlockMcspi0ChCfg[j].startBitPolarity = MCSPI_SB_POL_HIGH; 
                gConfigBlockMcspi0ChCfg[j].turboEnable = MW_MCSPI0_CH1_ENABLE_TURBO_MODE_SEL;
                gConfigBlockMcspi0ChCfg[j].csIdleTime = MCSPI_TCS0_0_CLK;
                gConfigBlockMcspi0ChCfg[j].defaultTxData = (uint32_t)(MW_MCSPI0_CH1_DEFAULT_TX_DATA_SEL);

