TexasInstruments/am26x-hsp/src/am263px_init.c
            } 

            gMcspiInitObject[i].chEnabled[0] = channel0_enable; 
            gMcspiInitObject[i].chEnabled[1] = channel1_enable;
            gMcspiInitObject[i].chEnabled[2] = false;
            gMcspiInitObject[i].chEnabled[3] = false;

        }
        else if(i==6)
        {

            gMcspiInitObject[i].intrNum = CSLR_R5FSS0_CORE0_INTR_MCSPI6_INTR;
            if((MW_MCSPI6_MODE_OPERATION_SEL == 0) | (MW_MCSPI6_MODE_OPERATION_SEL == 2))
                gMcspiInitObject[i].chMode = MCSPI_CH_MODE_SINGLE;
            else if(MW_MCSPI6_MODE_OPERATION_SEL == 1)  
                gMcspiInitObject[i].chMode = MCSPI_CH_MODE_MULTI;
            if(MW_MCSPI6_PIN_MODE_SEL == 0)
                gMcspiInitObject[i].pinMode = MCSPI_PINMODE_3PIN;
            else if(MW_MCSPI6_PIN_MODE_SEL == 1)
                gMcspiInitObject[i].pinMode = MCSPI_PINMODE_4PIN; 
            if(MW_MCSPI6_INIT_DELAY_SEL == 0)
                gMcspiInitObject[i].initDelay = MCSPI_INITDLY_0;
            else if(MW_MCSPI6_INIT_DELAY_SEL == 1)
                gMcspiInitObject[i].initDelay = MCSPI_INITDLY_4;
            else if(MW_MCSPI6_INIT_DELAY_SEL == 2)
                gMcspiInitObject[i].initDelay = MCSPI_INITDLY_8;
            else if(MW_MCSPI6_INIT_DELAY_SEL == 3)
                gMcspiInitObject[i].initDelay = MCSPI_INITDLY_16;
            else if(MW_MCSPI6_INIT_DELAY_SEL == 4)
                gMcspiInitObject[i].initDelay = MCSPI_INITDLY_32;
            gMcspiInitObject[i].multiWordAccess = MW_MCSPI6_ENABLE_MULTIWORD_ACCESS_SEL;
            if((MW_MCSPI6_MODE_OPERATION_SEL == 0) | (MW_MCSPI6_MODE_OPERATION_SEL == 1))
                gMcspiInitObject[i].msMode = MCSPI_MS_MODE_CONTROLLER;
            else if(MW_MCSPI6_MODE_OPERATION_SEL == 2)
                gMcspiInitObject[i].msMode = MCSPI_MS_MODE_PERIPHERAL;
            if(MW_MCSPI6_ENABLE_CH0_SEL == TRUE)
                channel0_enable = true;
            if(MW_MCSPI6_ENABLE_CH1_SEL == 1)
            {
                channel1_enable = true;
                gMcspiInitObject[i].chObj[1].chCfg = &gConfigBlockMcspi6ChCfg[0];
                gMcspiInitObject[i].chObj[1].dmaChCfg = NULL;
                gMcspiInitObject[i].chObj[1].dmaChConfigNum = 0;
                gMcspiInitObject[i].chObj[0].chCfg = &gConfigBlockMcspi6ChCfg[1];
                gMcspiInitObject[i].chObj[0].dmaChCfg = NULL;
                gMcspiInitObject[i].chObj[0].dmaChConfigNum = 0;
            }
            else
            {
                channel1_enable = false;
                gMcspiInitObject[i].chObj[0].chCfg = &gConfigBlockMcspi6ChCfg[0];
                gMcspiInitObject[i].chObj[0].dmaChCfg = NULL;
                gMcspiInitObject[i].chObj[0].dmaChConfigNum = 0;

            } 

            gMcspiInitObject[i].chEnabled[0] = channel0_enable; 
            gMcspiInitObject[i].chEnabled[1] = channel1_enable;
            gMcspiInitObject[i].chEnabled[2] = false;
            gMcspiInitObject[i].chEnabled[3] = false;

        }
    }
}

MCSPILLD_Object gMcspiObject[MCSPI_BLOCK_NUM_INSTANCES];
MCSPILLD_Handle gMcspiBlockHandle[MCSPI_BLOCK_NUM_INSTANCES];

void Drivers_mcspiOpen()
{
    uint8_t i = 0;
    int32_t status = MCSPI_STATUS_SUCCESS;
    for(i=0; i<MCSPI_BLOCK_NUM_INSTANCES; i++)
    {
        gMcspiBlockHandle[i] = &gMcspiObject[i];
        gMcspiBlockHandle[i]->state = MCSPI_STATE_RESET;
        if(i==0)
            gMcspiBlockHandle[i]->baseAddr = CSL_MCSPI0_U_BASE;
        else if(i==1)
            gMcspiBlockHandle[i]->baseAddr = CSL_MCSPI1_U_BASE;
        else if(i==2)
            gMcspiBlockHandle[i]->baseAddr = CSL_MCSPI2_U_BASE;
        else if(i==3)
            gMcspiBlockHandle[i]->baseAddr = CSL_MCSPI3_U_BASE;
        else if(i==4)
            gMcspiBlockHandle[i]->baseAddr = CSL_MCSPI4_U_BASE;
        else if(i==5)
            gMcspiBlockHandle[i]->baseAddr = CSL_MCSPI5_U_BASE;
        else if(i==6)
            gMcspiBlockHandle[i]->baseAddr = CSL_MCSPI6_U_BASE;
        else
           gMcspiBlockHandle[i]->baseAddr = CSL_MCSPI0_U_BASE; 

        gMcspiBlockHandle[i]->hMcspiInit = &gMcspiInitObject[i];

        if((i==0) && (MW_ENABLE_MCSPI0_SEL == 1))
            status = MCSPI_lld_init(gMcspiBlockHandle[0]);
        else if((i==1) && (MW_ENABLE_MCSPI1_SEL == 1))
            status = MCSPI_lld_init(gMcspiBlockHandle[1]);
        else if((i==2) && (MW_ENABLE_MCSPI2_SEL == 1))
            status = MCSPI_lld_init(gMcspiBlockHandle[2]);
        else if((i==3) && (MW_ENABLE_MCSPI3_SEL == 1))
            status = MCSPI_lld_init(gMcspiBlockHandle[3]);
        else if((i==4) && (MW_ENABLE_MCSPI4_SEL == 1))
            status = MCSPI_lld_init(gMcspiBlockHandle[4]);
        else if((i==5) && (MW_ENABLE_MCSPI5_SEL == 1))
            status = MCSPI_lld_init(gMcspiBlockHandle[5]);
        else if((i==6) && (MW_ENABLE_MCSPI6_SEL == 1))
            status = MCSPI_lld_init(gMcspiBlockHandle[6]);


        DebugP_assert(status == MCSPI_STATUS_SUCCESS);   
    }

    return;
}  




void System_init(void)
{
    /* DPL init sets up address transalation unit, on some CPUs this is needed
     * to access SCICLIENT services, hence this needs to happen first
     */
    Dpl_init();

    
    /* initialize PMU */
    CycleCounterP_init(SOC_getSelfCpuClk());


    PowerClock_init();
    /* Now we can do pinmux */
    Pinmux_init();
    if(MW_ENABLE_MCAN_SEL == 1)
    {
        I2C_init();
    }
   
    String str1 = STR(MW_TARGETHARDWARE);
    if((MW_ENABLE_MCAN_SEL == 1) && (strcmp(str1, "AM263PX ControlCard") == 0))
    {
        MCSPI_init();
        EDMA_init();
    }
   
    
   

}

void Drivers_open(void)
{
    
    
    String str2 = STR(MW_TARGETHARDWARE);
    if((MW_ENABLE_MCAN_SEL == 1) && (strcmp(str2, "AM263PX ControlCard") == 0))
    {
        Drivers_pmicOpen();
        Drivers_edmaOpen();
        Drivers_mcspiOpenCC();
    }

    if(MW_ENABLE_MCAN_SEL == 1)
    {
        I2C_ParamsMCAN_init();
        Drivers_i2cOpen(); 
    }
                    
    Driver_mcanOpen();
    MCAN_initialization();
    Drivers_inputXbarOpen();
    Drivers_intXbarOpen();
    Drivers_outputXbarOpen();
    Drivers_epwmSyncoutXbarOpen();
    Drivers_gpioIntXbarOpen();
    Drivers_EPWMXbarOpen();
    Drivers_uartOpen();
    if((MW_ENABLE_MCSPI0_SEL == 1) | (MW_ENABLE_MCSPI1_SEL == 1) | (MW_ENABLE_MCSPI2_SEL == 1) | (MW_ENABLE_MCSPI3_SEL == 1) | (MW_ENABLE_MCSPI4_SEL == 1) | (MW_ENABLE_MCSPI5_SEL == 1) | (MW_ENABLE_MCSPI6_SEL == 1) | (MW_ENABLE_MCSPI7_SEL == 1))
    {
        MCSPI_channel_init();
        MCSPI_object_init();
        Drivers_mcspiOpen();
    }
 
    
}


void am263px_My_HardwareInit_Fcn(void)
{

    System_init();
    //Board_init(); //UNUSED
    Drivers_open();
    //Board_driversOpen(); //UNUSED

	return;
}

